{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/apple",
    "home_page_url": "https://jonathanlaniado.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/apple.json",
    "items": [
        {
            "id": "onz7f8",
            "url": "https://www.macrumors.com/2021/07/20/apple-uk-digital-competition-rules/amp/",
            "title": "Apple Could Be Forced to Follow New Digital Competition Rules or Face Fines, Under UK Proposal",
            "content_text": "",
            "authors": [
                "benh999"
            ]
        },
        {
            "id": "onz1yu",
            "url": "https://www.reddit.com/r/apple/comments/onz1yu/daily_advice_thread/",
            "title": "Daily Advice Thread",
            "content_text": "Welcome to the Daily Advice Thread for /r/Apple. This thread can be used to ask for technical advice regarding Apple software and hardware, to ask questions regarding the buying or selling of Apple products or to post other short questions.\n\nHave a question you need answered? Ask away! Please remember to adhere to our rules, which can be found in the sidebar. On mobile? [Here is a screenshot with our rules](https://i.imgur.com/yekEMCO).\n\nJoin our Discord and IRC chat rooms for support:\n\n* [Discord](https://discord.gg/apple)\n* [IRC](https://kiwiirc.com/client/irc.snoonet.org/apple?nick=CHANGE_ME)\n\nNote: Comments are sorted by /new for your convenience.\n\n[Here is an archive](https://www.reddit.com/r/apple/search?q=author%3A%22AutoModerator%22+title%3A%22Daily+Advice+Thread%22+or+title%3A%22Daily+Tech+Support+Thread%22&sort=new&t=all) of all previous Daily Advice Threads. This is best viewed on a browser. If on mobile, type in the search bar \\[author:\"AutoModerator\" title:\"Daily Advice Thread\" or title:\"Daily Tech Support Thread\"\\] (without the brackets, and including the quotation marks around the titles and author.)\n\n**The Daily Advice Thread is posted each day at 06:00 AM EST (**[Click HERE for other timezones](https://www.wolframalpha.com/input/?i=6+AM+USA+EST)**) and then the old one is archived.** It is advised to wait for the new thread to post your question if this time is nearing.",
            "authors": [
                "AutoModerator"
            ]
        },
        {
            "id": "onypsb",
            "url": "https://youtu.be/jxHgAr0gYC8",
            "title": "MagSafe battery Shake Test",
            "content_text": "",
            "authors": [
                "ivoryisbadmkay"
            ]
        },
        {
            "id": "onyfci",
            "url": "https://youtu.be/8w46ZdKhSNU",
            "title": "MagSafe Battery Unboxing",
            "content_text": "",
            "authors": [
                "ivoryisbadmkay"
            ]
        },
        {
            "id": "onwugv",
            "url": "https://finance.yahoo.com/news/apple-postpone-return-office-covid-033432565.html",
            "title": "Apple Delays Office Return by At Least a Month as Covid Spikes",
            "content_text": "",
            "authors": [
                "Aggressive_Project"
            ]
        },
        {
            "id": "onwpwz",
            "url": "https://www.zdnet.com/article/ifixit-ceo-names-and-shames-tech-giants-for-right-to-repair-obstruction/#ftag=RSSbaffb68",
            "title": "iFixit CEO names and shames tech giants for right to repair obstruction - iFixit chief Kyle Wiens claims Apple, Samsung, and Microsoft are monopolising the supply chain and designing products to prevent users from being able to easily repair them.",
            "content_text": "",
            "authors": [
                "LisaMck041"
            ]
        },
        {
            "id": "onvzhe",
            "url": "https://m.weibo.cn/detail/4661008804876280",
            "title": "MagSafe battery pack only wirelessly charges at 5W; takes half an hour to charge an iPhone 12 Pro Max for 4%. (Chinese Weibo link)",
            "content_text": "",
            "authors": [
                "eggimage"
            ]
        },
        {
            "id": "onvxx1",
            "url": "https://www.amnesty.org/en/latest/news/2021/07/pegasus-project-apple-iphones-compromised-by-nso-spyware/",
            "title": "Pegasus Project: Apple iPhones compromised by NSO spyware",
            "content_text": "",
            "authors": [
                "LisaMck041"
            ]
        },
        {
            "id": "onuo0h",
            "url": "https://www.macrumors.com/2021/07/20/apple-delays-return-to-offices/",
            "title": "Apple Will Delay Bringing Employees Back to Offices Until at Least October",
            "content_text": "",
            "authors": [
                "BeautyInTheNegitive"
            ]
        },
        {
            "id": "onu0o0",
            "url": "https://twitter.com/markgurman/status/1417324211853422592",
            "title": "Apple postpones employee return to offices from early September to October at the earliest due to COVID.",
            "content_text": "",
            "authors": [
                "minimaxir"
            ]
        },
        {
            "id": "ontoks",
            "url": "https://www.realmicentral.com/2021/07/20/apple-employees-re-issued-an-internal-letter-requesting-that-they-continue-to-work-remotely/",
            "title": "Apple employees re-issued an internal letter requesting that they continue to work remotely",
            "content_text": "",
            "authors": [
                "Ok-Okra3917"
            ]
        },
        {
            "id": "onnf20",
            "url": "https://www.reddit.com/r/apple/comments/onnf20/research_kit_competitors/",
            "title": "Research Kit Competitors",
            "content_text": "Hi does anyone know of any research kit competitors out there?",
            "authors": [
                "the_sammich_man"
            ]
        },
        {
            "id": "onmwsw",
            "url": "https://9to5mac.com/2021/07/19/how-to-make-custom-apple-watch-complications-health-data/",
            "title": "How to show live health data on Apple Watch",
            "content_text": "",
            "authors": [
                "n0skeuomorphism"
            ]
        },
        {
            "id": "onlbjs",
            "url": "https://www.reddit.com/r/apple/comments/onlbjs/the_other_side_of_righttorepair_why_not_getting/",
            "title": "The other side of “right-to-repair” Why not getting your batteries replaced is serving you?",
            "content_text": " I read Consumer Reports while living in the States in my early twenties. And I have been applying the learned knowledge to my day-to-day life. For example, I have never purchased any expensive fancy skincare products. Instead, I always go with a store or basic brands that fit with my taste. As test results suggested by the magazine, these skincare products are more or less perform the same. The only difference between over-priced and reasonably-priced ones is the phycology on the consumer’s end. Because you are paying a higher price, you think it works better. Nope. \n\nYou get the idea - I am the type of consumer who never wants to pay more than I should. However, that does not mean I don’t appreciate finer things in life and am willing to consume them. One of the problems of dating exotic boys in China is sometimes he may crave food from his homeland, to be specific, a good piece of steak that usually needs to be imported. My shopping record speaks that I have been a consumer of that on numerous occasions. It is worth it to spend a bit more and knowing the quality I’m getting will make the boy happy. \n\nBut the question is, how do you know if you are being ripped off or getting what you paid for? Appreciation for the product and understanding its process of making helps. \n\nI have been working in headphone manufacturing for the past seven years. The movement of “right-to-repair” for wireless headphones caught my attention. Here’s a link to the article I read [Apple AirPod battery life problem shows need for right-to-repair laws (cnbc.com)](https://www.cnbc.com/2021/07/10/apple-airpod-battery-life-problem-shows-need-for-right-to-repair-laws.html) It’s a very satisfying idea to think, the same way many imagine having a nice bubble bath at the end of a long day. Until you realize you have to clean the bathtub afterwards.\n\nLet me try to explain what I mean.\n\nAs the article suggests, it’s almost impossible to replace the batteries given barely any tolerances among the assembled parts. But assuming that manufacturers and all of them did so merely to push the sale of their next product is not quite right. They did so to sell the one you’re owing. The trade-off for allowing batteries and other critical components to be replaceable is ending up with a bulky, heavier, and costly product. And no consumer wants that.\n\n1) Replacing parts requires reservation of space in the product so parts can be taken out and in again. In other words, a product needs to be designed with a larger size and consequently weighs more. One leading British consumer electronics company I worked with had to learn this inconvenient truth the hard way. Making headphones is new territory for them. Nevertheless, they marched in with a list of replaceable accessories. The battery was one of them. They believe that’s something consumers would appreciate and sets them apart from other headphone makers. To their dismay, the product remains bulky and weighs more than 450g (It’s an over-the-ear headphone) after months of design meetings, to the extent it seriously compromised its comfort and fashionable look they aimed for.\n\nAs of today, this product is still in development for the 4th year and might be launched next year. \n\n2) The making of wireless headphones is quite a technically demanding process. It not only requires the ability to restore every piece to its place without any damage in a crowded space but testing it each step of the way so any errors could be caught and correct in time. Many of the testing machines on the production line are not only heavy but also expansive and most of all, require weeks or even months of tuning by experienced engineers to get their testing profile right. In other words, unless you are prepared to fly two or more engineers from our production line and set up the same testing line to every one of your replacement service chains, the matter of replacing batteries or other critical components of the product is merely is a wish. \n\nIt is financially unimaginable, technically impossible to do even for a company like Apple. If you fail to catch it, the article mentioned all of the earbuds that were meant to be repaired were all being replaced with brand new ones. And that precisely proves the point repairing it costs a lot more than simply sending a new one. \n\nNow let’s go back to the movement of “right-to-repair”. Given my explanation, would you still choose a heavy, bulky, expansive, and possibly uncomfortable product for the “right-to-repair”? Or a neatly designed, light, smart, and reasonably priced one? Most of the manufacturers thought through it in your shoe and decided for you. \n\nLastly, as a consumer, I hate the term “timed-product-life”. It makes me feel I am a victim of a business’s pursuit of maximum profit. My career in manufacturing has allowed me to see the situation from other perspectives:\n\na) The cost and quality of the product are closely tied together. For example, a longer battery life requires a larger and more expansive battery. In that sense, you’re getting what you paid for.\n\nb) Regardless of cost, sometimes a better (larger or more expansive) material still won’t be considered. Because it might be too big to fit in the design (battery example) or does not help with creating a better user experience. Imagine having a bulky and heavy product due to a larger piece of battery.\n\nc) To win in the market in the long run, businesses genuinely have to think about how to best serve their customers. In the case of headphone making or other consumer electronics, it meant carefully selecting a range of components that would allow the company to put together a product that’s attractive considering its cost, performance, and user experiences. \n\nNext time, maybe replace the term “timed-product-life” with “best-possible-product” in your mind.\n\n [www.farmgirlinthecity.net/blog/the-other-side-of-right-to-repair-why-not-getting-your-batteries-replaced-is-serving-you](https://www.farmgirlinthecity.net/blog/the-other-side-of-right-to-repair-why-not-getting-your-batteries-replaced-is-serving-you)",
            "authors": [
                "Xuemeipk"
            ]
        },
        {
            "id": "onkqt3",
            "url": "https://www.macrumors.com/2021/07/19/apple-music-spatial-audio-lossless-india-launch/",
            "title": "Apple Music Spatial Audio and Lossless Quality Rolling Out in India",
            "content_text": "",
            "authors": [
                "spearson0"
            ]
        },
        {
            "id": "onko80",
            "url": "https://appleinsider.com/articles/21/07/19/apple-releases-tvos-147-to-the-public-with-minor-fixes-and-improvements",
            "title": "Apple releases tvOS 14.7 to the public with minor fixes and improvements",
            "content_text": "",
            "authors": [
                "spearson0"
            ]
        },
        {
            "id": "onkkvs",
            "url": "https://www.macrumors.com/2021/07/19/apple-seeds-macos-big-sur-11-5-rc-2/",
            "title": "Apple Seeds Second Release Candidate Version of macOS Big Sur 11.5 to Developers",
            "content_text": "",
            "authors": [
                "spearson0"
            ]
        },
        {
            "id": "onkiot",
            "url": "https://www.macrumors.com/2021/07/19/apple-releases-homepod-14-7-software/",
            "title": "Apple Releases HomePod 14.7 Software With Support for Managing Timers From the Home App",
            "content_text": "",
            "authors": [
                "spearson0"
            ]
        },
        {
            "id": "onj3xm",
            "url": "https://www.reddit.com/r/apple/comments/onj3xm/why_i_cant_switch_to_apple_music_from_spotify/",
            "title": "Why I can't switch to Apple Music from Spotify",
            "content_text": "I have used Spotify for at least the last 5 years and love it. But I also love the idea of using Apple Music to stay in the \"Apple Ecosystem\", so I've tried the free trial to see what I thought. \n\nI know there are people on here that eco similar thoughts of the UI and overall usability of Apple Music lacking compared to Spotify, but I haven't seen anyone list out all the small things that make it hard to make the switch. There are obvious missing huge features like Spotify Connect. But there are so many small gripes I have with their desktop player that make it really hard for me to justify switching over:\n\n \n\n* Not clear what is album vs a playlist in AM. Spotify is better at making playlist artwork that stands apart\n* AM is slow. Whenever a new page is loading it takes a good second to load the information on the page. I'm not sure why this is. \n* Annoying to switch between mini player and big player in AM\n* Cant click artist name or song name in mini player\n* AM search results are lacking in depth and ease of navigation after something is searched.\n* When AM is quit, and opened again, it does not remember what you were last listening to\n* CMD + S does not enable shuffle\n* Artists top songs do not show number of plays\n* When an album has music videos at the end, it automatically plays them when the album reaches that point and plays them in full screen\n* Cant find public playlists, only apple generated ones\n* Clicking song name on a song in a playlist does not take you to the album\n* Playlists you create don’t have the artists name or album clickable, need to right click and “show on Apple Music”\n* Cant preview a stations songs by clicking on the album art, have to click play to start playing the station and get a list of songs",
            "authors": [
                "blurtz"
            ]
        },
        {
            "id": "onix2n",
            "url": "https://www.amnesty.org/en/latest/news/2021/07/pegasus-project-apple-iphones-compromised-by-nso-spyware/",
            "title": "Pegasus Project: Apple iPhones compromised by NSO spyware",
            "content_text": "",
            "authors": [
                "bhodrolok"
            ]
        },
        {
            "id": "onilxm",
            "url": "https://9to5mac.com/2021/07/19/airpods-magsafe-battery-pack-iphone-12/",
            "title": "MagSafe Battery Pack charges the AirPods too",
            "content_text": "",
            "authors": [
                "mvrketing"
            ]
        },
        {
            "id": "onig0u",
            "url": "https://twitter.com/appleswupdates/status/1417169765433499651?s=21",
            "title": "AppleSWUpdates: iOS 14.7 (18G68) has been released. #iOS #iOS147",
            "content_text": "",
            "authors": [
                "youcantseeshawn30"
            ]
        },
        {
            "id": "onidgz",
            "url": "https://www.reddit.com/r/apple/comments/onidgz/apple_releases_iosipad_os_147_and_watchos_76/",
            "title": "Apple releases iOS/iPad OS 14.7, and watchOS 7.6",
            "content_text": "",
            "authors": [
                "exjr_"
            ]
        },
        {
            "id": "onhm4g",
            "url": "https://www.macrumors.com/2021/07/19/apple-online-store-whats-new-july-2021/",
            "title": "Apple Adds New Products to Online Store, Including Linksys Velop Wi-Fi 6 Mesh Routers With HomeKit Support",
            "content_text": "",
            "authors": [
                "KingFML"
            ]
        },
        {
            "id": "onhk2a",
            "url": "https://blogs.nvidia.com/blog/2021/07/19/geforce-rtx-arm-gdc/",
            "title": "Arm Is RTX ON! World’s Most Widely Used CPU Architecture Meets Real-Time Ray Tracing, DLSS",
            "content_text": "",
            "authors": [
                "aotdsyndrome"
            ]
        },
        {
            "id": "onhjb1",
            "url": "https://blogs.nvidia.com/blog/2021/07/19/geforce-rtx-arm-gdc/",
            "title": "Nvidia announces RTX, DLSS available for ARM. Future potential for Macs?",
            "content_text": "",
            "authors": [
                "aotdsyndrome"
            ]
        },
        {
            "id": "ong53f",
            "url": "https://www.macrumors.com/2021/07/19/apple-warns-against-hydrogen-peroxide-cleaners/",
            "title": "Apple Warns Against Using Hydrogen Peroxide Disinfectants on Products",
            "content_text": "",
            "authors": [
                "Bandyliuk"
            ]
        },
        {
            "id": "ongfvy",
            "url": "https://liuwill.notion.site/The-story-of-how-I-lost-my-wallet-on-the-subway-at-5am-and-got-it-back-the-next-day-f62fdcee6dd94605a4f9ef9736a72f03",
            "title": "The story of how I lost my wallet on the subway at 5am and got it back the next day with Airtags",
            "content_text": "",
            "authors": [
                "katsuthunder"
            ]
        }
    ]
}