{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/apple",
    "home_page_url": "https://jonathanlaniado.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/apple.json",
    "items": [
        {
            "id": "onj3xm",
            "url": "https://www.reddit.com/r/apple/comments/onj3xm/why_i_cant_switch_to_apple_music_from_spotify/",
            "title": "Why I can't switch to Apple Music from Spotify",
            "content_text": "I have used Spotify for at least the last 5 years and love it. But I also love the idea of using Apple Music to stay in the \"Apple Ecosystem\", so I've tried the free trial to see what I thought. \n\nI know there are people on here that eco similar thoughts of the UI and overall usability of Apple Music lacking compared to Spotify, but I haven't seen anyone list out all the small things that make it hard to make the switch. There are obvious missing huge features like Spotify Connect. But there are so many small gripes I have with their desktop player that make it really hard for me to justify switching over:\n\n \n\n* Not clear what is album vs a playlist in AM. Spotify is better at making playlist artwork that stands apart\n* AM is slow. Whenever a new page is loading it takes a good second to load the information on the page. I'm not sure why this is. \n* Annoying to switch between mini player and big player in AM\n* Cant click artist name or song name in mini player\n* AM search results are lacking in depth and ease of navigation after something is searched.\n* When AM is quit, and opened again, it does not remember what you were last listening to\n* CMD + S does not enable shuffle\n* Artists top songs do not show number of plays\n* When an album has music videos at the end, it automatically plays them when the album reaches that point and plays them in full screen\n* Cant find public playlists, only apple generated ones\n* Clicking song name on a song in a playlist does not take you to the album\n* Playlists you create don’t have the artists name or album clickable, need to right click and “show on Apple Music”\n* Cant preview a stations songs by clicking on the album art, have to click play to start playing the station and get a list of songs",
            "authors": [
                "blurtz"
            ]
        },
        {
            "id": "onix2n",
            "url": "https://www.amnesty.org/en/latest/news/2021/07/pegasus-project-apple-iphones-compromised-by-nso-spyware/",
            "title": "Pegasus Project: Apple iPhones compromised by NSO spyware",
            "content_text": "",
            "authors": [
                "bhodrolok"
            ]
        },
        {
            "id": "onilxm",
            "url": "https://9to5mac.com/2021/07/19/airpods-magsafe-battery-pack-iphone-12/",
            "title": "MagSafe Battery Pack charges the AirPods too",
            "content_text": "",
            "authors": [
                "mvrketing"
            ]
        },
        {
            "id": "onig0u",
            "url": "https://twitter.com/appleswupdates/status/1417169765433499651?s=21",
            "title": "AppleSWUpdates: iOS 14.7 (18G68) has been released. #iOS #iOS147",
            "content_text": "",
            "authors": [
                "youcantseeshawn30"
            ]
        },
        {
            "id": "onidgz",
            "url": "https://www.reddit.com/r/apple/comments/onidgz/apple_releases_iosipad_os_147_and_watchos_76/",
            "title": "Apple releases iOS/iPad OS 14.7, and watchOS 7.6",
            "content_text": "",
            "authors": [
                "exjr_"
            ]
        },
        {
            "id": "onhm4g",
            "url": "https://www.macrumors.com/2021/07/19/apple-online-store-whats-new-july-2021/",
            "title": "Apple Adds New Products to Online Store, Including Linksys Velop Wi-Fi 6 Mesh Routers With HomeKit Support",
            "content_text": "",
            "authors": [
                "KingFML"
            ]
        },
        {
            "id": "onhk2a",
            "url": "https://blogs.nvidia.com/blog/2021/07/19/geforce-rtx-arm-gdc/",
            "title": "Arm Is RTX ON! World’s Most Widely Used CPU Architecture Meets Real-Time Ray Tracing, DLSS",
            "content_text": "",
            "authors": [
                "aotdsyndrome"
            ]
        },
        {
            "id": "onhjb1",
            "url": "https://blogs.nvidia.com/blog/2021/07/19/geforce-rtx-arm-gdc/",
            "title": "Nvidia announces RTX, DLSS available for ARM. Future potential for Macs?",
            "content_text": "",
            "authors": [
                "aotdsyndrome"
            ]
        },
        {
            "id": "ong53f",
            "url": "https://www.macrumors.com/2021/07/19/apple-warns-against-hydrogen-peroxide-cleaners/",
            "title": "Apple Warns Against Using Hydrogen Peroxide Disinfectants on Products",
            "content_text": "",
            "authors": [
                "Bandyliuk"
            ]
        },
        {
            "id": "ongfvy",
            "url": "https://liuwill.notion.site/The-story-of-how-I-lost-my-wallet-on-the-subway-at-5am-and-got-it-back-the-next-day-f62fdcee6dd94605a4f9ef9736a72f03",
            "title": "The story of how I lost my wallet on the subway at 5am and got it back the next day with Airtags",
            "content_text": "",
            "authors": [
                "katsuthunder"
            ]
        }
    ]
}