{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/apple",
    "description": "An unofficial community to discuss Apple devices and software, including news, rumors, opinions and analysis pertaining to the company located at One Apple Park Way.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/apple.json",
    "icon": "https://styles.redditmedia.com/t5_2qh1f/styles/communityIcon_omsxpmvxkyx11.jpg",
    "favicon": "https://styles.redditmedia.com/t5_2qh1f/styles/communityIcon_omsxpmvxkyx11.jpg",
    "items": [
        {
            "id": "ondx5j",
            "url": "/r/apple/comments/ondx5j/a_case_for_touch_id_in_2021/",
            "external_url": "https://www.reddit.com/r/apple/comments/ondx5j/a_case_for_touch_id_in_2021/",
            "title": "A Case for Touch ID in 2021",
            "content_html": "<p>It's 2021 but I'm still craning my neck, entering my passcode multiple times a day, staring at a notch, and the Apple Pay experience is worse than it used to be.  Check out my admittedly whiney reasons as to why Touch ID still has merit!</p>\n<p>TLDR - Face ID is superior for in phone usage like passwords, autofill, and app authentication, but for unlocking the phone and apple pay, Touch ID is superior.</p>\n<ol>\n<li>\n<p><strong>The Long Neck</strong>.  The number one reason (personally) against Face ID and for Touch ID is when your phone is lying flat on a surface next to or in front of you and you want to use it without holding it.  I can't imagine I am the only person who has their phone in front of them on a desk or table and you want to wake and authenticate the phone without picking it up.  So, in order to do that, you tap the screen and then awkwardly hover over your phone and/or stick your neck out to get to the home screen and then continue to use your phone.  Touch ID, wake <em>and</em> authenticate with one move, awesome.  I miss that.  </p>\n</li>\n<li>\n<p><strong>Rest Finger to Open.</strong>  This was such an underrated feature, as it meant that in the process of waking the phone (with either a click or raising) you were also authenticating to actually blow by the notification screen right to the home screen.  This may seem small, but this would allow you to wake and authenticate the phone straight from your pocket.  This also lines up with a ridiculous comment I see all the time against Touch ID - \"Touch ID was terrible because if you were wearing gloves or your finger was wet, it wouldn't work!\"  BUT... Face ID still requires the swipe up, can't have your finger wet or be wearing gloves for that either!  As a modern uptake of Rest Finger to Open, I've always argued that Face ID should have a similar <em>option</em>.  Wake &gt; Authenticate &gt; Home, no swiping.  Just blow by the notifications.  Just a personal preference there.</p>\n</li>\n<li>\n<p><strong>The Notch</strong>.  Let's be honest, we have dealt with it, we have gotten used to it, but it is unsightly.  This isn't a required problem of Face ID, Apple could just go straight across and never allow for the notch to interfere, but still, here we are.</p>\n</li>\n<li>\n<p><strong>Apple Pay</strong>.  This is nit picky but bear with me.  When Apple Pay was first rolling out, if you held your phone near the POS terminal, the phone would wake asking for authentication to pay, then you could just rest your finger on Touch ID and the transaction was done.  No need to shift your finger to the awkward double click of apple pay now which might very well trigger a screen shot as the ergonomics of the phone requires some workaround to avoid the volume buttons when squeezing the power button twice.  The wake screen still works when holding it near the POS terminal now, but then once woken, you have to double click and authenticate with face id which requires you to move the phone away from the terminal unless the terminal is somewhat near head level, which it never is.  So, the best way with Face ID, is to double click the power button prior to getting the phone near the terminal and authenticating, then putting the phone at the terminal to pay.  It is an awkward order of events compared to Touch ID which was just hold near terminal and rest finger on the touch id... that was it.  So nice.  Granted, I think the Apple Watch would be king of Apple Pay if it didn't require the double click but at least authentication isn't necessary since it is already on your wrist and unlocked.  But the best apple pay experience was easily Touch ID with the terminal waking the phone and authentication occurring while your finger was resting on Touch ID.  So seamless.   </p>\n</li>\n<li>\n<p><strong>Sun Glasses</strong>.  Polarized sun glasses don't work with Face ID if you have the setting on that requires attention (eyes open).  I like my sun glasses polarized as I hate glare and spend a decent bit of time on the water.  But I also like the stronger privacy setting of requiring attention.  Ugh.</p>\n</li>\n<li>\n<p><strong>Unintentional Wake and Lock</strong>.  What happens pretty often is I will wake my phone and be looking at it while it is on a flat surface just to look at a notification or even just the time.  Face ID attempts to authenticate because my head is somewhat in view but due to the off angle, the authentication fails.  I don't notice this because I am just looking at a notification, but what ends up happening is I do this several times in a row then Face ID shuts down and I have to enter my passcode when I finally end up wanting to go to my home screen.  The crazy thing is, this is what happened when Face ID was first debuted to the public at whichever Keynote it was introduced.  Other presenters had stood in front of the new Face ID phone and the phone tried to authenticate the wrong person enough times that when Federighi got up there, it required the passcode again after several \"failed\" attempts which were really just the phone trying to authenticate at the wrong time (just like when my phone is on a flat surface).  This last one happens several times daily to me and I find it insanely frustrating.  </p>\n</li>\n</ol>\n<p>&#x200B;</p>\n<p>The best would be a combination of both, and I think most would agree.  Double up that security for unlocking with either both or one.  Unlocking with touch id I still think is superior but then for in phone usage such as passwords, apps, auto-fill, etc. Face ID is better.  </p>\n<p>Lastly, I understand there are varying levels of care for such a small thing when arguably my issues above are small and whiny, but we all unlock our iPhones probably 100s of times a day and the above mentioned processes can diminish the experience.  Just my two cents as to why Touch ID still has strong merits in 2021.</p>\n<p>Fire back your thoughts!</p>",
            "date_published": "2021-07-19T13:20:32+00:00",
            "authors": [
                {
                    "name": "Derekeys",
                    "url": "https://www.reddit.com/user/Derekeys",
                    "avatar": "https://styles.redditmedia.com/t5_ckjrc/styles/profileIcon_snoo5306183a-4e36-4346-8c40-532cc27d6e18-headshot.png"
                }
            ]
        },
        {
            "id": "onhm4g",
            "url": "/r/apple/comments/onhm4g/apple_adds_new_products_to_online_store_including/",
            "external_url": "https://www.macrumors.com/2021/07/19/apple-online-store-whats-new-july-2021/",
            "title": "Apple Adds New Products to Online Store, Including Linksys Velop Wi-Fi 6 Mesh Routers With HomeKit Support",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/19/apple-online-store-whats-new-july-2021/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-19T16:32:04+00:00",
            "authors": [
                {
                    "name": "KingFML",
                    "url": "https://www.reddit.com/user/KingFML",
                    "avatar": "https://styles.redditmedia.com/t5_19l3b4/styles/profileIcon_snoo2f6a3ecb-8a64-4505-b527-ad397bd953ce-headshot.png"
                }
            ]
        },
        {
            "id": "ongwfx",
            "url": "/r/apple/comments/ongwfx/the_story_of_how_i_lost_my_wallet_on_the_subway/",
            "external_url": "https://www.reddit.com/r/apple/comments/ongwfx/the_story_of_how_i_lost_my_wallet_on_the_subway/",
            "title": "The story of how I lost my wallet on the subway at 5am and got it back the next day with Airtags",
            "content_html": "<p>I'm generally prone to losing things, but I actually hadn't lost my wallet in a couple of years. I was overdue. I was on my way back from my first concert since the pandemic started, it ended in Bushwick around 4am and then I had to walk 30 minutes to the Metropolitan G (there weren't any Ubers out at that time). By then, I was barely alive, and my wallet must have slipped out of my pocket into the train sometime between 4:30-5:30am. Most of the time if you lose your wallet on the subway, your chances of getting it back are so slim you don't even try, but I had luck, a kind stranger, and airtags on my side.</p>\n<p>I got up the next day around 1pm, so quite some time had passed since the wallet slipped out. I wasn't actually aware until I was about to leave the apartment with my girlfriend (her name is Ashley) to go to a friend's BBQ. I pulled up the Find My app and saw that it was all the way at Church ave. Suspicions confirmed, Church ave is the last stop on the G. I was worried that the wallet was still on a moving subway and I’d have to track it down en route, but I saw it was at Church ave 15 min ago, and 10 minute later there was another update that showed it was still there.</p>\n<p><a href=\"https://willliu.com/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fc75d6999-904c-4b7c-817b-bf2ec772c446%2FIMG_9551.png?table=block&amp;id=c0af4a3c-515f-4eec-86cc-ee80d77a1be6&amp;spaceId=d7c01436-0d32-43ee-b215-3b2e9c2492a6&amp;width=580&amp;userId=&amp;cache=v2\">A screenshot of the Find My app telling me my wallet was at the last stop on the G train</a></p>\n<p>We run out and get on the Church bound G right away. We get all the way to the station and immediately go to the booth. The lady at the booth says she hasn’t gotten a wallet. We re-surface to try to get another reading, and see that it's closer to the entrance at the end of the block. We head over and down, but there’s no booth at this side of the station. However, there were some cops nearby and a door that leads to some of the MTA employee spaces. I asked them if I could get in there to ask around, and luckily an MTA guy showed up right then and they brought me in. They took me into a staff breakroom and asked around. No one had seen the wallet, and precision find wasn’t activating even though we were right where the app said it was. One of the guy tells me that it’s probably down in the dispatchers office, which was right underneath us.</p>\n<p><a href=\"https://s3.us-west-2.amazonaws.com/secure.notion-static.com/66b04325-0ce4-4815-b111-aa5ea409be59/ezgif-3-aa4196d25407.gif?X-Amz-Algorithm=AWS4-HMAC-SHA256&amp;X-Amz-Credential=AKIAT73L2G45O3KS52Y5%2F20210719%2Fus-west-2%2Fs3%2Faws4_request&amp;X-Amz-Date=20210719T155330Z&amp;X-Amz-Expires=86400&amp;X-Amz-Signature=ba9f4793895a7d3122814eaa21ca72da068bf84fc0c4ebef9789eaa95f9f92fe&amp;X-Amz-SignedHeaders=host\">My girlfriend recorded me coming out of the MTA office with the cop and MTA guy lol</a></p>\n<p>We head down the stairs and precision find activates! It starts pointing us right to the booth. I’m getting really excited at this point, I really needed my wallet because we were traveling at the end of the week. <a href=\"https://willliu.com/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2Fa91b3942-3b24-4762-ad66-441b424e1b62%2F588FED4B-241F-4111-AB02-525CC49793D3_1_105_c.jpeg?table=block&amp;id=c282457b-85bf-472b-8e18-de2462666e0d&amp;spaceId=d7c01436-0d32-43ee-b215-3b2e9c2492a6&amp;width=2050&amp;userId=&amp;cache=v2\">We knock on the door and ask the lady inside about a wallet</a>. She says she hasn’t seen or heard about no wallet and shrugs us off. She really didn't want to deal with us and she seemed pretty sure that a wallet did not get turned in.</p>\n<p>But we’re SO close, I know the wallet is somewhere around so I keep pushing. I show her the arrow on my phone and tell her that the arrow would lead to the phone. She takes my phone, and goes back inside the office. We can see precision finding guiding her around the office, until it takes her to a drawer, which she opens. To her disbelief, my wallet is there!</p>\n<p>The best part about this was the surprise and excitement that lady had. She kept asking me, “How did you do that??” “What is that thing?”. “That was so cool!!!”. I was really happy to get it back of course, but seeing her in awe of this tech really made me feel proud to live that Apple ecosystem life.</p>\n<p><a href=\"https://willliu.com/image/https%3A%2F%2Fs3-us-west-2.amazonaws.com%2Fsecure.notion-static.com%2F7ab259ad-d7bd-44f8-86fa-4c74216e0ee9%2F60908632-3212-4CB3-AE74-3946823F331F_1_105_c.jpeg?table=block&amp;id=ec25f3d1-f57d-40c0-9c11-483bd0f3390e&amp;spaceId=d7c01436-0d32-43ee-b215-3b2e9c2492a6&amp;width=2050&amp;userId=&amp;cache=v2\">Got my wallet back!</a></p>\n<p>I’m so thankful I tagged my wallet, and really impressed with how the tech worked out for me in a real life situation. If I didn’t have the tag, there’s no way I would have gotten that wallet back. I could have wandered down to the dispatchers office, talked to the same lady, and definitely would not have gotten the wallet back even if I was 20 feet away from it. Lately, tech has been moving so fast that I have built in expectations around improvements. It's been some time since I've used some tech that has really wowed me and given me that holy-shit-this-is-the-future feeling. What's really impressive is how a simple and cheap device can tie into the existing ecosystem and integrate with the other devices to create a practical and powerful experience for users.</p>\n<p>This post is dedicated to the kind stranger who turned my wallet in without taking anything inside of it!</p>",
            "date_published": "2021-07-19T15:56:45+00:00",
            "authors": [
                {
                    "name": "katsuthunder",
                    "url": "https://www.reddit.com/user/katsuthunder",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_08_D4E815.png"
                }
            ]
        },
        {
            "id": "onidgz",
            "url": "/r/apple/comments/onidgz/apple_releases_iosipad_os_147_and_watchos_76/",
            "external_url": "https://www.reddit.com/r/apple/comments/onidgz/apple_releases_iosipad_os_147_and_watchos_76/",
            "title": "Apple releases iOS/iPad OS 14.7, and watchOS 7.6",
            "content_html": "<p>iOS/iPadOS:</p>\n<blockquote>\n<p>iOS 14.7 includes the following improvements and bug fixes for your ‌iPhone‌:</p>\n</blockquote>\n<ul>\n<li>MagSafe Battery Pack support for iPhone 12, iPhone 12 mini, iPhone 12 Pro and iPhone 12 Pro Max</li>\n<li>Apple Card Family adds the option to combine credit limits and share one co-owned account with an existing Apple Card user</li>\n<li>Air quality information is now available in Weather and Maps for Canada, France, Italy, Netherlands, South Korea, and Spain</li>\n<li>Podcasts library allows you to choose to see all shows or only followed shows</li>\n<li>Share playlist menu option missing in Apple Music</li>\n<li>Dolby Atmos and Apple Music lossless audio playback may unexpectedly stop</li>\n<li>Battery service message that may have disappeared after reboot on some iPhone 11 models is restored</li>\n<li>Braille displays could show invalid information while composing Mail messages</li>\n</ul>\n<p>__</p>\n<p>watchOS:</p>\n<p>watchOS 7.6 brings ECG and Irregular Heart Rhythm Notifications to <a href=\"https://www.apple.com/watchos/feature-availability/#branded-ecg\">30 New Regions</a></p>",
            "date_published": "2021-07-19T17:07:40+00:00",
            "authors": [
                {
                    "name": "exjr_",
                    "url": "https://www.reddit.com/user/exjr_",
                    "avatar": "https://styles.redditmedia.com/t5_3kjan/styles/profileIcon_e9udqz6vezq01.jpg"
                }
            ]
        },
        {
            "id": "onilxm",
            "url": "/r/apple/comments/onilxm/magsafe_battery_pack_charges_the_airpods_too/",
            "external_url": "https://9to5mac.com/2021/07/19/airpods-magsafe-battery-pack-iphone-12/",
            "title": "MagSafe Battery Pack charges the AirPods too",
            "content_html": "<p>See the linked content on <a href='https://9to5mac.com/2021/07/19/airpods-magsafe-battery-pack-iphone-12/'>9to5mac.com</a>.</p>",
            "date_published": "2021-07-19T17:18:44+00:00",
            "authors": [
                {
                    "name": "mvrketing",
                    "url": "https://www.reddit.com/user/mvrketing",
                    "avatar": "https://styles.redditmedia.com/t5_1ejvum/styles/profileIcon_vinbubcj15551.jpg"
                }
            ]
        },
        {
            "id": "onj3xm",
            "url": "/r/apple/comments/onj3xm/why_i_cant_switch_to_apple_music_from_spotify/",
            "external_url": "https://www.reddit.com/r/apple/comments/onj3xm/why_i_cant_switch_to_apple_music_from_spotify/",
            "title": "Why I can't switch to Apple Music from Spotify",
            "content_html": "<p>I have used Spotify for at least the last 5 years and love it. But I also love the idea of using Apple Music to stay in the \"Apple Ecosystem\", so I've tried the free trial to see what I thought. </p>\n<p>I know there are people on here that eco similar thoughts of the UI and overall usability of Apple Music lacking compared to Spotify, but I haven't seen anyone list out all the small things that make it hard to make the switch. There are obvious missing huge features like Spotify Connect. But there are so many small gripes I have with their desktop player that make it really hard for me to justify switching over:</p>\n<ul>\n<li>Not clear what is album vs a playlist in AM. Spotify is better at making playlist artwork that stands apart</li>\n<li>AM is slow. Whenever a new page is loading it takes a good second to load the information on the page. I'm not sure why this is. </li>\n<li>Annoying to switch between mini player and big player in AM</li>\n<li>Cant click artist name or song name in mini player</li>\n<li>AM search results are lacking in depth and ease of navigation after something is searched.</li>\n<li>When AM is quit, and opened again, it does not remember what you were last listening to</li>\n<li>CMD + S does not enable shuffle</li>\n<li>Artists top songs do not show number of plays</li>\n<li>When an album has music videos at the end, it automatically plays them when the album reaches that point and plays them in full screen</li>\n<li>Cant find public playlists, only apple generated ones</li>\n<li>Clicking song name on a song in a playlist does not take you to the album</li>\n<li>Playlists you create don’t have the artists name or album clickable, need to right click and “show on Apple Music”</li>\n<li>Cant preview a stations songs by clicking on the album art, have to click play to start playing the station and get a list of songs</li>\n</ul>",
            "date_published": "2021-07-19T17:43:06+00:00",
            "authors": [
                {
                    "name": "blurtz",
                    "url": "https://www.reddit.com/user/blurtz",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_16_0DD3BB.png"
                }
            ]
        },
        {
            "id": "onkiot",
            "url": "/r/apple/comments/onkiot/apple_releases_homepod_147_software_with_support/",
            "external_url": "https://www.macrumors.com/2021/07/19/apple-releases-homepod-14-7-software/",
            "title": "Apple Releases HomePod 14.7 Software With Support for Managing Timers From the Home App",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/19/apple-releases-homepod-14-7-software/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-19T18:51:08+00:00",
            "authors": [
                {
                    "name": "spearson0",
                    "url": "https://www.reddit.com/user/spearson0",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_01_FFB000.png"
                }
            ]
        },
        {
            "id": "onkkvs",
            "url": "/r/apple/comments/onkkvs/apple_seeds_second_release_candidate_version_of/",
            "external_url": "https://www.macrumors.com/2021/07/19/apple-seeds-macos-big-sur-11-5-rc-2/",
            "title": "Apple Seeds Second Release Candidate Version of macOS Big Sur 11.5 to Developers",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/19/apple-seeds-macos-big-sur-11-5-rc-2/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-19T18:54:08+00:00",
            "authors": [
                {
                    "name": "spearson0",
                    "url": "https://www.reddit.com/user/spearson0",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_01_FFB000.png"
                }
            ]
        },
        {
            "id": "onko80",
            "url": "/r/apple/comments/onko80/apple_releases_tvos_147_to_the_public_with_minor/",
            "external_url": "https://appleinsider.com/articles/21/07/19/apple-releases-tvos-147-to-the-public-with-minor-fixes-and-improvements",
            "title": "Apple releases tvOS 14.7 to the public with minor fixes and improvements",
            "content_html": "<p>See the linked content on <a href='https://appleinsider.com/articles/21/07/19/apple-releases-tvos-147-to-the-public-with-minor-fixes-and-improvements'>appleinsider.com</a>.</p>",
            "date_published": "2021-07-19T18:58:41+00:00",
            "authors": [
                {
                    "name": "spearson0",
                    "url": "https://www.reddit.com/user/spearson0",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_01_FFB000.png"
                }
            ]
        },
        {
            "id": "onkqt3",
            "url": "/r/apple/comments/onkqt3/apple_music_spatial_audio_and_lossless_quality/",
            "external_url": "https://www.macrumors.com/2021/07/19/apple-music-spatial-audio-lossless-india-launch/",
            "title": "Apple Music Spatial Audio and Lossless Quality Rolling Out in India",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/19/apple-music-spatial-audio-lossless-india-launch/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-19T19:01:54+00:00",
            "authors": [
                {
                    "name": "spearson0",
                    "url": "https://www.reddit.com/user/spearson0",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_01_FFB000.png"
                }
            ]
        },
        {
            "id": "onsdop",
            "url": "/r/apple/comments/onsdop/battery_pack_arrived/",
            "external_url": "https://www.reddit.com/r/apple/comments/onsdop/battery_pack_arrived/",
            "title": "Battery Pack Arrived",
            "content_html": "<p>Not sure if it’s early, but I wasn’t expecting this for another week. https://imgur.com/a/iVYlXAS/</p>",
            "date_published": "2021-07-20T01:51:04+00:00",
            "authors": [
                {
                    "name": "bigkev640",
                    "url": "https://www.reddit.com/user/bigkev640",
                    "avatar": "https://styles.redditmedia.com/t5_etd5h/styles/profileIcon_d5ykhv15mar41.jpg"
                }
            ]
        },
        {
            "id": "onu0o0",
            "url": "/r/apple/comments/onu0o0/apple_postpones_employee_return_to_offices_from/",
            "external_url": "https://twitter.com/markgurman/status/1417324211853422592",
            "title": "Apple postpones employee return to offices from early September to October at the earliest due to COVID.",
            "content_html": "<p>See the linked content on <a href='https://twitter.com/markgurman/status/1417324211853422592'>twitter.com</a>.</p>",
            "date_published": "2021-07-20T03:32:19+00:00",
            "authors": [
                {
                    "name": "minimaxir",
                    "url": "https://www.reddit.com/user/minimaxir",
                    "avatar": "https://styles.redditmedia.com/t5_3khar/styles/profileIcon_id23v56405w61.png"
                }
            ]
        },
        {
            "id": "onvzhe",
            "url": "/r/apple/comments/onvzhe/magsafe_battery_pack_only_wirelessly_charges_at/",
            "external_url": "https://m.weibo.cn/detail/4661008804876280",
            "title": "MagSafe battery pack only wirelessly charges at 5W; takes half an hour to charge an iPhone 12 Pro Max for 4%. (Chinese Weibo link)",
            "content_html": "<p>See the linked content on <a href='https://m.weibo.cn/detail/4661008804876280'>m.weibo.cn</a>.</p>",
            "date_published": "2021-07-20T05:48:31+00:00",
            "authors": [
                {
                    "name": "eggimage",
                    "url": "https://www.reddit.com/user/eggimage",
                    "avatar": "https://styles.redditmedia.com/t5_1xw1yo/styles/profileIcon_snoo358bf560-4bcb-4019-8dd2-1f88402a621b-headshot.png"
                }
            ]
        },
        {
            "id": "onwpwz",
            "url": "/r/apple/comments/onwpwz/ifixit_ceo_names_and_shames_tech_giants_for_right/",
            "external_url": "https://www.zdnet.com/article/ifixit-ceo-names-and-shames-tech-giants-for-right-to-repair-obstruction/#ftag=RSSbaffb68",
            "title": "iFixit CEO names and shames tech giants for right to repair obstruction - iFixit chief Kyle Wiens claims Apple, Samsung, and Microsoft are monopolising the supply chain and designing products to prevent users from being able to easily repair them.",
            "content_html": "<p>See the linked content on <a href='https://www.zdnet.com/article/ifixit-ceo-names-and-shames-tech-giants-for-right-to-repair-obstruction/#ftag=RSSbaffb68'>www.zdnet.com</a>.</p>",
            "date_published": "2021-07-20T06:44:05+00:00",
            "authors": [
                {
                    "name": "LisaMck041",
                    "url": "https://www.reddit.com/user/LisaMck041",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_03_EA0027.png"
                }
            ]
        },
        {
            "id": "onz7f8",
            "url": "/r/apple/comments/onz7f8/apple_could_be_forced_to_follow_new_digital/",
            "external_url": "https://www.macrumors.com/2021/07/20/apple-uk-digital-competition-rules/amp/",
            "title": "Apple Could Be Forced to Follow New Digital Competition Rules or Face Fines, Under UK Proposal",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/20/apple-uk-digital-competition-rules/amp/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-20T10:12:06+00:00",
            "authors": [
                {
                    "name": "benh999",
                    "url": "https://www.reddit.com/user/benh999",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_15_FFD635.png"
                }
            ]
        },
        {
            "id": "onzq8x",
            "url": "/r/apple/comments/onzq8x/your_iphone_left_behind_feature_coming_to_the/",
            "external_url": "https://gadgetsandwearables.com/2021/07/20/your-iphone-left-behind-apple-watch/",
            "title": "\"Your iPhone left behind\" feature coming to the Apple Watch",
            "content_html": "<p>See the linked content on <a href='https://gadgetsandwearables.com/2021/07/20/your-iphone-left-behind-apple-watch/'>gadgetsandwearables.com</a>.</p>",
            "date_published": "2021-07-20T10:54:30+00:00",
            "authors": [
                {
                    "name": "Maslakovic",
                    "url": "https://www.reddit.com/user/Maslakovic",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_11_EA0027.png"
                }
            ]
        },
        {
            "id": "oo0v06",
            "url": "/r/apple/comments/oo0v06/apple_plans_underscreen_sensors_to_include_both/",
            "external_url": "https://appleinsider.com/articles/21/07/20/apple-plans-under-screen-sensors-to-include-both-touch-id-and-face-id",
            "title": "Apple plans under-screen sensors to include both Touch ID and Face ID",
            "content_html": "<p>See the linked content on <a href='https://appleinsider.com/articles/21/07/20/apple-plans-under-screen-sensors-to-include-both-touch-id-and-face-id'>appleinsider.com</a>.</p>",
            "date_published": "2021-07-20T12:14:13+00:00",
            "authors": [
                {
                    "name": "benh999",
                    "url": "https://www.reddit.com/user/benh999",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_15_FFD635.png"
                }
            ]
        },
        {
            "id": "oo1jog",
            "url": "/r/apple/comments/oo1jog/exclusive_apple_planning_redesigned_ipad_mini/",
            "external_url": "https://9to5mac.com/2021/07/20/new-ipad-mini-exclusive-a15-processor-usb-c/",
            "title": "Exclusive: Apple planning redesigned iPad mini with A15 processor, USB-C port, more",
            "content_html": "<p>See the linked content on <a href='https://9to5mac.com/2021/07/20/new-ipad-mini-exclusive-a15-processor-usb-c/'>9to5mac.com</a>.</p>",
            "date_published": "2021-07-20T12:59:02+00:00",
            "authors": [
                {
                    "name": "drgnslyr91",
                    "url": "https://www.reddit.com/user/drgnslyr91",
                    "avatar": "https://styles.redditmedia.com/t5_e2mia/styles/profileIcon_hxbx6wxmjqa11.png"
                }
            ]
        },
        {
            "id": "oo1o4z",
            "url": "/r/apple/comments/oo1o4z/iphone_doesnt_unlock_your_apple_watch_after/",
            "external_url": "https://9to5mac.com/2021/07/20/iphone-doesnt-unlock-your-apple-watch/",
            "title": "iPhone doesn’t unlock your Apple Watch after updating to iOS 14.7? It’s not just you…",
            "content_html": "<p>See the linked content on <a href='https://9to5mac.com/2021/07/20/iphone-doesnt-unlock-your-apple-watch/'>9to5mac.com</a>.</p>",
            "date_published": "2021-07-20T13:06:09+00:00",
            "authors": [
                {
                    "name": "Bandyliuk",
                    "url": "https://www.reddit.com/user/Bandyliuk",
                    "avatar": "https://styles.redditmedia.com/t5_28u092/styles/profileIcon_snoo499441d2-7f3b-4278-8b51-7d01a7503e05-headshot.png"
                }
            ]
        },
        {
            "id": "oo3hhc",
            "url": "/r/apple/comments/oo3hhc/adobe_updates_premiere_pro_to_run_natively_on_m1/",
            "external_url": "https://www.macrumors.com/2021/07/20/premiere-pro-native-apple-silicon-support/",
            "title": "Adobe Updates Premiere Pro to Run Natively on M1 Macs",
            "content_html": "<p>See the linked content on <a href='https://www.macrumors.com/2021/07/20/premiere-pro-native-apple-silicon-support/'>www.macrumors.com</a>.</p>",
            "date_published": "2021-07-20T14:47:42+00:00",
            "authors": [
                {
                    "name": "TheJadedSF",
                    "url": "https://www.reddit.com/user/TheJadedSF",
                    "avatar": "https://styles.redditmedia.com/t5_cedlu/styles/profileIcon_j72yhmrvm4y51.jpg"
                }
            ]
        },
        {
            "id": "oo3yc7",
            "url": "/r/apple/comments/oo3yc7/iphone_13_pro_to_come_in_new_colors_including/",
            "external_url": "https://appleinsider.com/articles/21/07/20/iphone-13-pro-to-come-in-new-colors-including-bronze-like-sunset-gold",
            "title": "'iPhone 13 Pro' to come in new colors, including bronze-like 'Sunset Gold'",
            "content_html": "<p>See the linked content on <a href='https://appleinsider.com/articles/21/07/20/iphone-13-pro-to-come-in-new-colors-including-bronze-like-sunset-gold'>appleinsider.com</a>.</p>",
            "date_published": "2021-07-20T15:11:27+00:00",
            "authors": [
                {
                    "name": "spearson0",
                    "url": "https://www.reddit.com/user/spearson0",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_01_FFB000.png"
                }
            ]
        }
    ]
}