{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/artificialinteligence",
    "description": "The goal of the r/ArtificialIntelligence is to provide a gateway to the many different facets of the Artificial Intelligence community, and to promote discussion relating to the ideas and concepts that we know of as AI. These could include philosophical and social questions, art and design, technical papers, machine learning, where to find resources and tools, how to develop AI/ML projects, AI in business, how AI is affecting our lives, what the future may hold, and many other topics. Welcome.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/artificialinteligence.json",
    "icon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "favicon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "items": [
        {
            "id": "1mu8hy7",
            "url": "/r/ArtificialInteligence/comments/1mu8hy7/my_mom_just_got_replaced_by_the_ai_she_helped/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mu8hy7/my_mom_just_got_replaced_by_the_ai_she_helped/",
            "title": "My Mom just got replaced by the AI she helped train",
            "content_html": "<p>My mom has been working as a receptionist at a small clinic for over a decade. She’s one of those people who genuinely cares about patients; remembers names, asks about families, always goes the extra mile.</p>\n<p>A few months ago, the clinic introduced some new AI system and asked her to ‘help it learn.’ Basically, she spent weeks feeding it the scripts she used when answering phones, correcting how it responded, and making sure it could book appointments properly. She thought it was just a tool to lighten her workload.</p>\n<p>Today, they let her go. They told her the AI can now handle everything she used to do for cheaper answering calls, scheduling, even basic patient questions.</p>\n<p>She’s devastated. She’s in her 50s, not super tech-savvy, and finding another job like that won’t be easy. I can’t stop thinking about how surreal it is: she literally trained the thing that replaced her.</p>\n<p>Are you guys seeing this happen elsewhere? I keep reading about AI ‘replacing’ workers, but in this case it outright replaced her. Curious if this is an isolated case or the beginning of a bigger trend.</p>",
            "date_published": "2025-08-19T04:20:43+00:00",
            "authors": [
                {
                    "name": "Epsteinstan",
                    "url": "https://www.reddit.com/user/Epsteinstan"
                }
            ]
        },
        {
            "id": "1lzmu7i",
            "url": "/r/ArtificialInteligence/comments/1lzmu7i/google_brain_founder_says_agi_is_overhyped_real/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lzmu7i/google_brain_founder_says_agi_is_overhyped_real/",
            "title": "Google Brain founder says AGI is overhyped, real power lies in knowing how to use AI and not building it",
            "content_html": "<p>Google Brain founder Andrew Ng believes the expectations around Artificial General Intelligence (AGI) is overhyped. He suggests that real power in the AI era won't come from building AGI, but from learning how to use today's AI tools effectively.</p>\n<p>In Short</p>\n<p>Artificial General Intelligence (AGI)is name for AI systems that could possess human-level cognitive abilities\nGoogle Brain founder Andrew Ng suggests people to focus on using AI\nHe says that in future power will be with people who know how to use AI</p>",
            "date_published": "2025-07-14T13:46:59+00:00",
            "authors": [
                {
                    "name": "Adventurous_Cod_432",
                    "url": "https://www.reddit.com/user/Adventurous_Cod_432"
                }
            ]
        },
        {
            "id": "1lz8jvr",
            "url": "/r/ArtificialInteligence/comments/1lz8jvr/the_ai_layoff_tsunami_is_coming_for_red_america/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lz8jvr/the_ai_layoff_tsunami_is_coming_for_red_america/",
            "title": "The AI Layoff Tsunami Is Coming for Red America",
            "content_html": "<p><a href=\"https://theherocall.substack.com/p/the-ai-layoff-tsunami-is-coming-for\">https://theherocall.substack.com/p/the-ai-layoff-tsunami-is-coming-for</a></p>\n<p>For conservatives, the coming wave of AI-driven job displacement poses a deeper ideological crisis than most are ready to admit. It threatens not just workers, but the moral framework of the American right: the belief that work confers dignity, self-reliance sustains liberty, and markets reward effort. <strong>But what happens when the labor market simply doesn’t need the labor?</strong></p>\n<p>When AI systems can drive, code, file taxes, diagnose illness, write contracts, tutor students, and handle customer service, all at once, faster, and cheaper than humans, what exactly is the plan for the tens of millions of displaced workers, many of whom vote red? <strong>How does a society that ties basic survival to employment absorb 30, 40, or even 50 million people who are not lazy or unmotivated, but simply rendered economically irrelevant?</strong></p>\n<p>This is where conservatives face a historic crossroads. <strong>Either they cling to a fading vision of self-sufficiency and let economic obsolescence metastasize into populist rage, or they evolve, painfully, and pragmatically, toward a new social contract.</strong> One that admits: if markets can no longer pay everyone for their time, then society must pay people simply for being citizens. Not as charity, but as compensation for being shut out of the machine they helped build.</p>",
            "date_published": "2025-07-14T00:35:38+00:00",
            "authors": [
                {
                    "name": "Flopdo",
                    "url": "https://www.reddit.com/user/Flopdo"
                }
            ]
        },
        {
            "id": "1lwpycq",
            "url": "/r/ArtificialInteligence/comments/1lwpycq/israelis_are_asking_to_ban_grok_4_after_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lwpycq/israelis_are_asking_to_ban_grok_4_after_it/",
            "title": "🚨Israelis are asking to ban Grok 4 after it compares Israel to \"parásite which controls America” ( GPT 4 answer included too )",
            "content_html": "<p>🚨Israelis are asking to ban Grok 4 after it compares Israel to \"parásite which controls America” ( GPT 4 answer included too )</p>\n<p>Check Images in Comment below 👇 </p>",
            "date_published": "2025-07-10T22:16:36+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1lo7acj",
            "url": "/r/ArtificialInteligence/comments/1lo7acj/mit_study_suggests_80_of_ai_medical_advice_is/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo7acj/mit_study_suggests_80_of_ai_medical_advice_is/",
            "title": "MIT study suggests 80% of AI medical advice is false",
            "content_html": "<p>Trying to balance all the break-neck progress news with some more grounded cautionary evidence. Medical use of AI has always been a big question for me, whether we trust patient care to AI, whether we can reduce medical expertise and hand it off to machine learning. Seems progress needs to be made on safety, transparency, and accountability.</p>\n<p>https://news.mit.edu/2025/llms-factor-unrelated-information-when-recommending-medical-treatments-0623</p>",
            "date_published": "2025-06-30T13:17:30+00:00",
            "authors": [
                {
                    "name": "redpandafire",
                    "url": "https://www.reddit.com/user/redpandafire"
                }
            ]
        },
        {
            "id": "1lf5soy",
            "url": "/r/ArtificialInteligence/comments/1lf5soy/can_someone_help_me_understand_why_should_we_pump/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lf5soy/can_someone_help_me_understand_why_should_we_pump/",
            "title": "Can someone help me understand why should we pump 7 trillions into development of AI?",
            "content_html": "<p>Sam Altman is asking for 7 trillion to speed up development of AI / AGI. I would like to hear from AI community why should we even want it, what are the arguments why we should progress the AI development even further?</p>\n<p>So far the \"pros\" I heard:</p>\n<p>* AI will cure cancer - since its inception there is very little evidence AI helped in any measurable way in this area, or is there?</p>\n<p>* AI will solve climate crisis - same, there is very little improvement from AI, on contrary AI consumes so much electricity (producing CO2) and requires huge datacenters (construction of produces CO2) and lots of chips (manufacturing of produces CO2) that on average it's probably making the situation worse.</p>\n<p>Now the cons we can already see unfolding:</p>\n<p>* AI is probably going to lead to massive unemployment crisis as it has potential to displace anyone, especially it's most likely to kill the \"entertaining and lucrative\" middle-class jobs first: programmers, lawyers, artists, doctors etc.</p>\n<p>* Displacement of middle class jobs will lead to further accumulation of wealth and power into hands of tiny elite while making more poor people. Rich will get richer, poor will be poorer - and there is going to be more poor people than ever</p>\n<p>* AI is already ruining art, internet, social networks, fueling propaganda and disinformation</p>\n<p>etc. etc. basically AI so far is bringing mostly bad things and fails to materialize anything really useful so why in the world should we pump 7 trillions into developing it further?</p>",
            "date_published": "2025-06-19T08:40:56+00:00",
            "authors": [
                {
                    "name": "petr_bena",
                    "url": "https://www.reddit.com/user/petr_bena"
                }
            ]
        },
        {
            "id": "1ld7a9t",
            "url": "/r/ArtificialInteligence/comments/1ld7a9t/openai_wins_200_million_us_defense_contract/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ld7a9t/openai_wins_200_million_us_defense_contract/",
            "title": "OpenAI wins $200 million U.S. defense contract",
            "content_html": "<p><a href=\"https://www.cnbc.com/2025/06/16/openai-wins-200-million-us-defense-contract.html\">https://www.cnbc.com/2025/06/16/openai-wins-200-million-us-defense-contract.html</a></p>\n<p>OpenAI has secured a $200 million, one-year contract with the U.S. Defense Department to develop advanced AI tools for national security, marking its first such deal listed by the Pentagon. The work will be done mainly in the National Capital Region. This follows OpenAI’s collaboration with defense firm Anduril and comes amid broader defense AI efforts, including rival Anthropic’s work with Palantir and Amazon. OpenAI CEO Sam Altman has expressed support for national security projects. The deal is small relative to OpenAI’s $10B+ in annual sales and follows major initiatives like the $500B Stargate project.</p>\n<p>It is about to go down! what can go wrong?</p>",
            "date_published": "2025-06-16T22:51:29+00:00",
            "authors": [
                {
                    "name": "azavio",
                    "url": "https://www.reddit.com/user/azavio"
                }
            ]
        },
        {
            "id": "1lctky5",
            "url": "/r/ArtificialInteligence/comments/1lctky5/i_think_ai_will_replace_doctors_before_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lctky5/i_think_ai_will_replace_doctors_before_it/",
            "title": "I think AI will replace doctors before it replaces senior software engineers",
            "content_html": "<p>Most doctors just ask a few basic questions, run some tests, and follow a protocol. AI is already good at interpreting test results and recognizing symptoms. It’s not that complicated in a lot of cases. There’s a limited number of paths and the answers are already known</p>\n<p>Software is different. It’s not just about asking the right questions to figure something out. You also have to give very specific instructions to get what you actually want. Even if the tech is familiar, you still end up spending hours or days just guiding the system through every detail. Half the job is explaining things that no one ever wrote down. And even when you do that, things still break in ways you didn’t expect</p>\n<p>Yeah, some simple apps are easy to replace. But the kind of software most of us actually deal with day to day? AI has a long way to go</p>",
            "date_published": "2025-06-16T14:01:01+00:00",
            "authors": [
                {
                    "name": "LoudEmployment5034",
                    "url": "https://www.reddit.com/user/LoudEmployment5034"
                }
            ]
        },
        {
            "id": "1l96amt",
            "url": "/r/ArtificialInteligence/comments/1l96amt/my_husband_no_longer_wants_to_have_children/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l96amt/my_husband_no_longer_wants_to_have_children/",
            "title": "My husband no longer wants to have children because he’s worried about the rise of AI",
            "content_html": "<p>I’m 30F, he’s 45M. We were supposed to start trying for a baby next month — we’ve already done all the preconception tests, everything was ready. Today he told me that he’s been “doing his research,” reading Goldman Sachs projections (!) and talking to “people who know things,” and he now believes there’s no point in having children because future adults won’t be able to find any kind of job due to AI. And since — statistically speaking — it’s highly unlikely that our child would be one of the lucky exceptions in a world of desperation, he thinks it’s wiser not to bring anyone into it.</p>\n<p>He works in finance and is well educated… but to me, his reasoning sounds terribly simplistic. He’s not a futurologist, nor a sociologist or an anthropologist… how can he make such a drastic and catastrophist prediction with so much certainty?</p>\n<p>Do you have any sources or references that could help me challenge or “soften” his rigid view? Thank you in advance.</p>",
            "date_published": "2025-06-11T22:32:55+00:00",
            "authors": [
                {
                    "name": "CC_T1",
                    "url": "https://www.reddit.com/user/CC_T1"
                }
            ]
        },
        {
            "id": "1l8msby",
            "url": "/r/ArtificialInteligence/comments/1l8msby/i_wish_ai_would_just_admit_when_it_doesnt_know/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l8msby/i_wish_ai_would_just_admit_when_it_doesnt_know/",
            "title": "I wish AI would just admit when it doesn't know the answer to something.",
            "content_html": "<p>Its actually crazy that AI just gives you wrong answers, the developers of these LLM's couldn't just let it say \"I don't know\" instead of making up its own answers this would save everyone's time</p>",
            "date_published": "2025-06-11T07:49:38+00:00",
            "authors": [
                {
                    "name": "Secure_Candidate_221",
                    "url": "https://www.reddit.com/user/Secure_Candidate_221"
                }
            ]
        },
        {
            "id": "1l7cq82",
            "url": "/r/ArtificialInteligence/comments/1l7cq82/openai_hit_10b_revenue_still_losing_millions/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l7cq82/openai_hit_10b_revenue_still_losing_millions/",
            "title": "OpenAI  hit $10B Revenue  - Still Losing Millions",
            "content_html": "<p>CNBC just dropped a story that OpenAI has hit $10 billion in annual recurring revenue (ARR). That’s double what they were doing last year.</p>\n<p>Apparently it’s all driven by ChatGPT consumer subs, enterprise deals, and API usage. And get this: 500 million weekly users and 3 million+ business customers now. Wild.</p>\n<p>What’s crazier is that this number doesn’t include Microsoft licensing revenue so the real revenue footprint might be even bigger. </p>\n<p>Still not profitable though. They reportedly lost around $5B last year just keeping the lights on (compute is expensive, I guess). </p>\n<p>But they’re aiming for $125B ARR by 2029??? </p>\n<p>If OpenAI keeps scaling like this, what do you think the AI landscape will look like in five years? Gamechanger or game over for the competition</p>",
            "date_published": "2025-06-09T18:40:20+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l6mb2f",
            "url": "/r/ArtificialInteligence/comments/1l6mb2f/its_very_unlikely_that_you_are_going_to_receive/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l6mb2f/its_very_unlikely_that_you_are_going_to_receive/",
            "title": "It's very unlikely that you are going to receive UBI",
            "content_html": "<p>I see so many posts that are overly and unjustifiably optimistic about the prospect of UBI once they have lost their job to AI.  </p>\n<p>AI is going to displace a large percentage of white collar jobs but not all of them. You will still have somewhere from 20-50% of workers remaining.   </p>\n<p>Nobody in the government is going to say \"Oh Bob, you used to make $100,000. Let's put you on UBI so you can maintain the same standard of living while doing nothing. You are special Bob\" </p>\n<p>Those who have been displaced will need to find new jobs or they will just become poor. The cost of labor will stay down. The standard of living will go down. Poor people who drive cars now will switch to motorcycles like you see in developing countries. There will be more shanty houses. People will live with their parents longer. Etc.  </p>\n<p>The gap between haves and have nots will increase substantially.</p>",
            "date_published": "2025-06-08T20:40:13+00:00",
            "authors": [
                {
                    "name": "phonyToughCrayBrave",
                    "url": "https://www.reddit.com/user/phonyToughCrayBrave"
                }
            ]
        },
        {
            "id": "1l5ri90",
            "url": "/r/ArtificialInteligence/comments/1l5ri90/ai_does_95_of_ipo_paperwork_in_minutes_wtf/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l5ri90/ai_does_95_of_ipo_paperwork_in_minutes_wtf/",
            "title": "AI does 95% of IPO paperwork in minutes. Wtf.",
            "content_html": "<p>Saw this quote from Goldman Sachs CEO David Solomon and it kind of shook me:</p>\n<p>“AI can now draft 95% of an S1 IPO prospectus in minutes (a job that used to require a 6-person team multiple weeks)… The last 5% now matters because the rest is now a commodity.”</p>\n<p>Like… damn. That’s generative AI eating investment banking lunches now? IPO docs were the holy grail of “don’t screw this up” legal/finance work  and now it’s essentially copy paste + polish?</p>\n<p>It really hit me how fast things are shifting. Not just blue collar, not just creatives  now even the $200/hr suits are facing the “automation squeeze.” And it’s not even a gradual fade. It’s 95% overnight.</p>\n<p>What happens when the “last 5%” is all that matters anymore? Are we all just curating and supervising AI outputs soon? Is everything just prompt engineering and editing now?</p>\n<p>Whats your thought ? </p>\n<p>Edit  :Aravind  Srinivas ( CEO of Perplexity tweeted quoting  what David Solomon said </p>\n<p>“ After Perplexity Labs, I would say probably 98-99%”</p>",
            "date_published": "2025-06-07T18:21:07+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l1qo9u",
            "url": "/r/ArtificialInteligence/comments/1l1qo9u/geoffrey_hinton_godfather_of_ai_never_expected_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1qo9u/geoffrey_hinton_godfather_of_ai_never_expected_to/",
            "title": "Geoffrey Hinton ( Godfather of A.I) never expected to see an AI speak English as fluently as humans",
            "content_html": "<p>Do you think we have crossed the line ? </p>\n<p>It’s not just about English , AI has come a long way in so many areas like reasoning, creativity, even understanding context. We’re witnessing a major shift in what technology can do and it’s only accelerating.</p>\n<p>——————————————————————————————\nHinton said in a recent interview</p>\n<p>“I never thought I’d live to see, for example, an AI system or a neural net that could actually talk English in a way that was as good as a natural English speaker and could answer any question,” Hinton said in a recent interview. “You can ask it about anything and it’ll behave like a not very good expert. It knows thousands of times more than any one person. It’s still not as good at reasoning, but it’s getting to be pretty good at reasoning, and it’s getting better all the time.”\n ——————————————————————————————</p>\n<p>Hinton is one of the key minds behind today’s AI and what we are experiencing. Back in the 80’s he came up with ideas like back propagation that taught machines how to learn and that changed everything. Now we are here today ! </p>",
            "date_published": "2025-06-02T19:07:45+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l1ki91",
            "url": "/r/ArtificialInteligence/comments/1l1ki91/ai_slop_is_human_slop/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1ki91/ai_slop_is_human_slop/",
            "title": "AI Slop Is Human Slop",
            "content_html": "<p>Behind every poorly written AI post is a human being that directed the AI to create it, (maybe) read the results, and decided to post it.</p>\n<p>LLMs are more than capable of good writing, but it takes effort. Low effort is low effort.</p>\n<p>EDIT: To clarify, I'm mostly referring to the phenomenon on Reddit where people often comment on a post by referring to it as \"AI slop.\"</p>",
            "date_published": "2025-06-02T15:09:29+00:00",
            "authors": [
                {
                    "name": "Gothmagog",
                    "url": "https://www.reddit.com/user/Gothmagog"
                }
            ]
        },
        {
            "id": "1l0mdq5",
            "url": "/r/ArtificialInteligence/comments/1l0mdq5/ai_is_killing_my_industry_and_im_out_of_a_job/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0mdq5/ai_is_killing_my_industry_and_im_out_of_a_job/",
            "title": "AI is killing my industry and I’m out of a job. What now?",
            "content_html": "<p>I’ve been struggling to find a job for a long time and it has become pretty obvious to me that my industry is being eaten alive by AI. I lost my last role because it was automated, and I know more generally jobs are being cut left right and centre. </p>\n<p>I’ve got a background in journalism with around 6 years of experience in journalism and copywriting. </p>\n<p>Sad as it is, there’s no point sitting around and whinging about it. I’m at a point where I can retrain and pivot so I’d like to make the most of that. I’m happy to be the canary in the coalmine, so to speak. </p>\n<p>I have a BA in Comms and I’m open to further education, but I’m terrified of making the wrong decision and ending up in this position however many years down the track. I’d like to get it somewhat right this time. </p>\n<p>I like working with things that are greater than one single company and its profit margin. I’m a relentlessly curious person and I find almost everything interesting. What I loved about journalism is that I learned so much about the world every day. I want to find something that’s similar. </p>\n<p>I’m considering: </p>\n<ul>\n<li>Public Policy Analyst </li>\n<li>Political Risk Analyst </li>\n<li>Geopolitical Consultant </li>\n<li>ESG/Sustainability Strategy</li>\n<li>Government Relations/Regulatory Affairs </li>\n<li>Reputation/Issues Management </li>\n</ul>\n<p>So far, I’m leaning toward roles in government, public affairs, or strategic comms either in-house or at a consultancy. Some of these paths may not even require retraining, which is appealing.</p>\n<p>Are these future proof? And if they’re not, what is? </p>",
            "date_published": "2025-06-01T11:08:55+00:00",
            "authors": [
                {
                    "name": "LoveFlashy7574",
                    "url": "https://www.reddit.com/user/LoveFlashy7574"
                }
            ]
        },
        {
            "id": "1l07kzq",
            "url": "/r/ArtificialInteligence/comments/1l07kzq/ai_models_show_signs_of_falling_apart_as_they/",
            "external_url": "https://futurism.com/ai-models-falling-apart",
            "title": "AI Models Show Signs of Falling Apart as They Ingest More AI-Generated Data",
            "content_html": "",
            "date_published": "2025-05-31T21:05:39+00:00",
            "authors": [
                {
                    "name": "KennyCalzone",
                    "url": "https://www.reddit.com/user/KennyCalzone"
                }
            ]
        },
        {
            "id": "1kzk2hp",
            "url": "/r/ArtificialInteligence/comments/1kzk2hp/president_trump_is_using_palantir_to_build_a/",
            "external_url": "https://newrepublic.com/post/195904/trump-palantir-data-americans",
            "title": "President Trump is Using Palantir to Build a Master Database of Americans",
            "content_html": "",
            "date_published": "2025-05-31T00:31:10+00:00",
            "authors": [
                {
                    "name": "Avid_Hiker98",
                    "url": "https://www.reddit.com/user/Avid_Hiker98"
                }
            ]
        },
        {
            "id": "1kz24nl",
            "url": "/r/ArtificialInteligence/comments/1kz24nl/ai_isnt_taking_our_jobsits_exposing_how_many_jobs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kz24nl/ai_isnt_taking_our_jobsits_exposing_how_many_jobs/",
            "title": "\"AI isn't 'taking our jobs'—it's exposing how many jobs were just middlemen in the first place.\"",
            "content_html": "<p>As everyone is panicking about AI taking jobs, nobody wants to acknowledge the number of jobs that just existed to process paperwork, forward emails, or sit in-between two actual decision-makers. Perhaps it's not AI we are afraid of, maybe it's 'the truth'.</p>",
            "date_published": "2025-05-30T11:44:54+00:00",
            "authors": [
                {
                    "name": "HussainBiedouh",
                    "url": "https://www.reddit.com/user/HussainBiedouh"
                }
            ]
        },
        {
            "id": "1kye8lt",
            "url": "/r/ArtificialInteligence/comments/1kye8lt/my_industry_is_going_to_be_almost_completely/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kye8lt/my_industry_is_going_to_be_almost_completely/",
            "title": "My Industry is going to be almost completely taken over in the next few years, for the first time in my life I have no idea what I'll be doing 5 years from now",
            "content_html": "<p>I'm 30M and have been in the eCom space since I was 14. I’ve been working with eCom agencies since 2015, started in sales and slowly worked my way up. Over the years, I’ve held roles like Director of PM, Director of Operations, and now I'm the Director of Partnerships at my current agency.</p>\n<p>Most of my work has been on web development/design projects and large-scale SEO or general eCom marketing campaigns. A lot of the builds I’ve been a part of ranged anywhere from $20k to $1M+, with super strategic scopes. I’ve led CRO strategy, UI/UX planning, upsell strategy you name it.</p>\n<p>AI is hitting parts of my industry faster than I ever anticipated. For example, one of the agencies I used to work at focused heavily on SEO and we had 25 copywriters before 2021. I recently caught up with a friend who still works there... they’re down to just 4 writers, and their SEO department has $20k more billable per month than when I previously worked there.. They can essentially replace many of the Junior writers completely with AI and have their lead writers just fix prompts that'll pass copyright issues.</p>\n<p>At another agency, they let go of their entire US dev team and replaced them with LATAM devs, who now rely on ChatGPT to handle most of the communication via Jira and Slack.</p>\n<p>I’m not saying my industry is about to collapse, but I can see what’s coming. AI tools are already building websites from Figma files or even just sketches. I've seen AI generate the exact code needed to implement upsells with no dev required. And I'm watching Google AI and prompt-based search gradually take over traditional SEO in real time.</p>\n<p>I honestly have no idea what will happen to my industry in the next 5 years as I watch it become completely automated with AI. I'm in the process of getting my PMP, and I'm considering shifting back into a Head of PM or Senior PM role in a completely different industry. Not totally sure where I'll land, but things are definitely getting weird out here.</p>",
            "date_published": "2025-05-29T15:49:49+00:00",
            "authors": [
                {
                    "name": "Opposite_Front5741",
                    "url": "https://www.reddit.com/user/Opposite_Front5741"
                }
            ]
        },
        {
            "id": "1kxrfct",
            "url": "/r/ArtificialInteligence/comments/1kxrfct/jd_vance_calls_ai_a_communist_technology/",
            "external_url": "https://www.marketwatch.com/story/j-d-vance-calls-ai-a-communist-technology-is-there-partisan-bias-in-new-tech-tools-373607b3",
            "title": "J.D. Vance calls AI a ‘communist technology",
            "content_html": "<p>Maybe because he can’t control it and ChatGPT thinks he’s an ass?</p>\n<p>Ok..Your post must have at least 99 characters)…..</p>",
            "date_published": "2025-05-28T20:21:21+00:00",
            "authors": [
                {
                    "name": "Reddit_wander01",
                    "url": "https://www.reddit.com/user/Reddit_wander01"
                }
            ]
        },
        {
            "id": "1kxinay",
            "url": "/r/ArtificialInteligence/comments/1kxinay/the_one_big_beautiful_bill_act_would_ban_states/",
            "external_url": "https://mashable.com/article/ban-on-ai-regulation-bill-moratorium",
            "title": "The One Big Beautiful Bill Act would ban states from regulating AI",
            "content_html": "",
            "date_published": "2025-05-28T14:33:32+00:00",
            "authors": [
                {
                    "name": "Conscious-Quarter423",
                    "url": "https://www.reddit.com/user/Conscious-Quarter423"
                }
            ]
        },
        {
            "id": "1kwj8tt",
            "url": "/r/ArtificialInteligence/comments/1kwj8tt/im_worried_ai_will_take_away_everying_ive_worked/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kwj8tt/im_worried_ai_will_take_away_everying_ive_worked/",
            "title": "I'm worried Ai will take away everying I've worked so hard for.",
            "content_html": "<p>I've worked so incredibly hard to be a cinematographer and even had some success winning some awards. I can totally see my industry a step away from a massive crash. I saw my dad last night and I realised how much emphasis he has on seeing me do well and fighting for pride he might have in my work is one thing. How am I going to explain to him when I have no work, that everything I fought for is down the drain. I've thought of other jobs I could do but its so hard when you truly love something and fight every sinue for it and it looks like it could be taken from you and you have to start again. </p>\n<p>Perhaps something along the lines of never the same person stepping in the same river twice in terms of starting again and it wont be as hard as it was first time. But fuck me guys if youre lucky enough not to have these thoughts be grateful as its such a mindfuck </p>",
            "date_published": "2025-05-27T09:48:48+00:00",
            "authors": [
                {
                    "name": "RevolutionaryGuest79",
                    "url": "https://www.reddit.com/user/RevolutionaryGuest79"
                }
            ]
        },
        {
            "id": "1kwca7w",
            "url": "/r/ArtificialInteligence/comments/1kwca7w/veo3_is_kind_of_bringing_me_to_a_mental_brink/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kwca7w/veo3_is_kind_of_bringing_me_to_a_mental_brink/",
            "title": "VEO3 is kind of bringing me to a mental brink. What are we even doing anymore?",
            "content_html": "<p>I’m just kind of speechless. The concept of existential crisis has taken a whole new form. I was unhappy with my life just now but thought I can turn it around, but if I turn it around, what is left of our world in 2 decades? </p>\n<p>Actors as a concept are gone? Manually creating music? Wallpapers? Game assets? Believing comments on the internet are from real people? AI edited photos are just as real as the original samples? Voicenotes can be perfectly faked? Historical footage barely has value when we can just improvise anything by giving a prompt? Someone else just showed how people are outsourcing thinking by spamming grok for everything. Students are making summaries, essays all through AI. I can simply go around it by telling the AI to rewrite differently and in my style, and it then bypasses the university checkers. Literally what value is being left for us?</p>\n<p>We are going through generations now that are outsourcing the idea of teaching and study to a concept we barely understand ourselves. Even if it saves us from cancer or even mortality, is this a life we want to live?</p>\n<p>I utterly curse the fact I was born in the 2000s. My life feels fucking over. I dont want this. Life and civilization itself is falling apart for the concept of stock growth. It feels like I am witnessing the end of all we loved as humans. </p>\n<p>EDIT: I want to add one thing that come to mind. Marx’s idea of labor alienation feels relatable to how we are letting something we probably never <em>will</em> understand be the tool for our new future. The fact we do not know how it works and yet does all most anything you want must be truly alienating for the collective society. Or maybe not. Maybe we just watch TV like we do today without thinking of how the screen is shown to begin with. I feel pinning all of society on this is just what is so irresponsible.</p>",
            "date_published": "2025-05-27T02:27:26+00:00",
            "authors": [
                {
                    "name": "Donlor_",
                    "url": "https://www.reddit.com/user/Donlor_"
                }
            ]
        },
        {
            "id": "1kw67cc",
            "url": "/r/ArtificialInteligence/comments/1kw67cc/why_are_people_are_saying_veo_3_is_the_end_of_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kw67cc/why_are_people_are_saying_veo_3_is_the_end_of_the/",
            "title": "Why are people are saying VEO 3 is the end of the film industry?",
            "content_html": "<p>Yes, my favorite YouTube coder said it's the end of a $1.7T industry. So people are saying it.</p>\n<p>But I work in this industry and wanted to dig deeper. So what you get right now for $250/month is about 83 clips generated (divide total tokens by tokens per video). Most scenes come out pretty good but the jank... the jank!!!!!</p>\n<p>Are you guys seriously telling me you would go into production with THIS amount of jank!???? </p>\n<p>For one thing, people blink in different directions. Then there is a big difference in quality between image to video and text to video with the latter being much better but much less in your control. On top of that, prompts can get rejected if it thinks your infringing on IP, which it doesn't always get right. Plus what horrible subtitles!! And the elephant in the room: combat. Any action scene is a complete joke. No one would go into production with NO ACTORS to reshoot these scenes that look like hand puppets mating.</p>\n<p>Look, I'm a HUGE fan of AI. I see it as a force multiplier when used as a tool. But I don't see how it's industry ending with the current model of VEO 3. It seems to have very arbitrary limitations that make it inflexible to a real production workflow.</p>",
            "date_published": "2025-05-26T21:33:32+00:00",
            "authors": [
                {
                    "name": "Agile-Egg-5681",
                    "url": "https://www.reddit.com/user/Agile-Egg-5681"
                }
            ]
        },
        {
            "id": "1kw2n7i",
            "url": "/r/ArtificialInteligence/comments/1kw2n7i/our_approach_to_ai_is_close_to_worse_case_scenario/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kw2n7i/our_approach_to_ai_is_close_to_worse_case_scenario/",
            "title": "Our approach to AI is close to worse case scenario",
            "content_html": "<p>Everyone pays lips service to AI safety but I’m just not seeing it in practice. At this point we’re full steam ahead developing AI in ways that almost guarantee lapses in safety.</p>\n<p>Examples:\n(1) Mad dash to AGI/SGI. Reaching AGI is priority #1 for all the biggest companies involved, around the world. There are no incentives to slow down; everyone is in total agreement that the first to AGI wins. Wins what exactly is not super clear, but they do win and it’s difficult to impossible for competition to catch up.</p>\n<p>(2) Rush to market. The models are not in air gapped data centers where we can spend years assessing their behavior and capabilities. As soon as the new models pass some basic QA they are rushed to the market, given extensive capabilities to influence and interact with the world. We find out their full behavior and capabilities only after they are fully integrated into our lives.</p>\n<p>(3) We still have absolutely no clue how they work. Yes, we understand how learning works from a math and algorithms level, but we still have barely a clue what the inscrutable matrices of numbers actually encode in terms of knowledge and behavior.</p>\n<p>We’re cooked fam.</p>",
            "date_published": "2025-05-26T19:05:48+00:00",
            "authors": [
                {
                    "name": "terrible-takealap",
                    "url": "https://www.reddit.com/user/terrible-takealap"
                }
            ]
        },
        {
            "id": "1kvz8st",
            "url": "/r/ArtificialInteligence/comments/1kvz8st/doge_team_using_ai_to_scour_personal_data_to_root/",
            "external_url": "https://www.rawstory.com/doge-team-sensitive-private-data-2672192671/",
            "title": "DOGE team using AI to scour personal data to root out Trump disloyalty: report",
            "content_html": "",
            "date_published": "2025-05-26T16:50:36+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1kvpzp7",
            "url": "/r/ArtificialInteligence/comments/1kvpzp7/seeing_grok_everywhere_is_proof_we_outsourced/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kvpzp7/seeing_grok_everywhere_is_proof_we_outsourced/",
            "title": "Seeing “@grok” everywhere is proof we outsourced thinking",
            "content_html": "<p>Every tweet now has some guy replying with “@grok summarize this.” Bro, it’s a sandwich review, what do you expect Grok to do?</p>\n<p>We’ve completely given up. AI isn’t just replacing jobs; it’s taking over the basic effort we used to put in ourselves. The small decisions and thoughtful moments we once trusted our own judgment for are now being passed off to AI. Every day, we rely less on our own minds to think and decide, letting convenience slowly take the wheel.</p>",
            "date_published": "2025-05-26T09:15:03+00:00",
            "authors": [
                {
                    "name": "PixieE3",
                    "url": "https://www.reddit.com/user/PixieE3"
                }
            ]
        },
        {
            "id": "1kvfswu",
            "url": "/r/ArtificialInteligence/comments/1kvfswu/googles_ai_search_is_beginning_of_the_end_for/",
            "external_url": "https://www.tipranks.com/news/googles-ai-search-is-beginning-of-the-end-for-reddit-says-wells-fargo-analyst",
            "title": "Google's AI Search is \"Beginning of the End\" for Reddit, says Wells Fargo Analyst",
            "content_html": "",
            "date_published": "2025-05-25T23:14:12+00:00",
            "authors": [
                {
                    "name": "Happy_Weed",
                    "url": "https://www.reddit.com/user/Happy_Weed"
                }
            ]
        },
        {
            "id": "1kv5p8h",
            "url": "/r/ArtificialInteligence/comments/1kv5p8h/this_is_the_worst_ai_is_ever_going_to_be/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kv5p8h/this_is_the_worst_ai_is_ever_going_to_be/",
            "title": "This is the worst Ai is ever going to be",
            "content_html": "<p>The fact Veo 3 is THIS good, is insane. It’s only going to get better which would mean this is the worst it will ever be, having trouble wrapping my head around that!</p>",
            "date_published": "2025-05-25T15:48:26+00:00",
            "authors": [
                {
                    "name": "Jaguars147",
                    "url": "https://www.reddit.com/user/Jaguars147"
                }
            ]
        },
        {
            "id": "1kv2891",
            "url": "/r/ArtificialInteligence/comments/1kv2891/googles_cofounder_says_ai_performs_best_when_you/",
            "external_url": "https://lifehacker.com/tech/googles-co-founder-says-ai-performs-best-when-you-threaten-it",
            "title": "Google's Co-Founder says AI performs best when you threaten it",
            "content_html": "",
            "date_published": "2025-05-25T13:13:07+00:00",
            "authors": [
                {
                    "name": "longgestones",
                    "url": "https://www.reddit.com/user/longgestones"
                }
            ]
        },
        {
            "id": "1kucuz3",
            "url": "/r/ArtificialInteligence/comments/1kucuz3/run_an_unlocked_nsfw_llm_on_your_desktop_in_15/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kucuz3/run_an_unlocked_nsfw_llm_on_your_desktop_in_15/",
            "title": "Run an unlocked NSFW LLM on your desktop in 15 minutes",
            "content_html": "<p>If you’re sick of seeing “I’m sorry, I can’t help with that,” or want unhinged responses to your inputs, here’s how to run a NSFW LLM right on your computer in 15 minutes while being private, free, and with no rules.</p>\n<p>First Install the LLM Ollama on your computer </p>\n<p>Windows: Go to https://ollama.com/download and install it like any normal app.</p>\n<p>Mac/Linux: Open Terminal and run:\ncurl -fsSL https://ollama.com/install.sh | sh</p>\n<p>After that, run an unfiltered AI model by opening your terminal or command prompt and type:</p>\n<p>“ollama run mistral”</p>\n<p>or for a even more unfiltered experience:</p>\n<p>“ollama run dolphin-mistral”</p>\n<p>It’ll download the model, then you’ll get a prompt like: &gt;&gt;&gt;</p>\n<p>Boom. You’re unlocked and ready to go. Now you can ask anything. No filters, no guardrails.</p>\n<p>Have fun, be safe, and let me know what you think or build. </p>",
            "date_published": "2025-05-24T14:26:09+00:00",
            "authors": [
                {
                    "name": "eeko_systems",
                    "url": "https://www.reddit.com/user/eeko_systems"
                }
            ]
        },
        {
            "id": "1ktnn3j",
            "url": "/r/ArtificialInteligence/comments/1ktnn3j/ai_in_real_world_er_radiology_from_last_night_4/",
            "external_url": "https://www.reddit.com/gallery/1ktnn3j",
            "title": "AI in real world ER radiology from last night… 4 images received followed by 3 images of AI review… very subtle non displaced distal fibular fracture…",
            "content_html": "",
            "date_published": "2025-05-23T16:18:04+00:00",
            "authors": [
                {
                    "name": "xpietoe42",
                    "url": "https://www.reddit.com/user/xpietoe42"
                }
            ]
        },
        {
            "id": "1ktjmdw",
            "url": "/r/ArtificialInteligence/comments/1ktjmdw/google_veo_3_could_become_a_real_problem_for/",
            "external_url": "https://www.pcguide.com/news/googles-veo-3-could-become-a-real-problem-for-content-creators-as-convincing-examples-flood-the-web/",
            "title": "Google Veo 3 could become a real problem for content creators as convincing AI videos flood the web",
            "content_html": "",
            "date_published": "2025-05-23T13:30:23+00:00",
            "authors": [
                {
                    "name": "Tiny-Independent273",
                    "url": "https://www.reddit.com/user/Tiny-Independent273"
                }
            ]
        },
        {
            "id": "1ksvxvh",
            "url": "/r/ArtificialInteligence/comments/1ksvxvh/claude_4_launched/",
            "external_url": "https://www.anthropic.com/pricing#api",
            "title": "Claude 4 Launched",
            "content_html": "<p>Look at its price.</p>",
            "date_published": "2025-05-22T17:02:34+00:00",
            "authors": [
                {
                    "name": "Real_Enthusiasm_2657",
                    "url": "https://www.reddit.com/user/Real_Enthusiasm_2657"
                }
            ]
        },
        {
            "id": "1ks87yb",
            "url": "/r/ArtificialInteligence/comments/1ks87yb/iphone_designer_jony_ive_joining_openai_as_part/",
            "external_url": "https://www.cbsnews.com/news/jony-ive-iphone-designer-apple-openai/",
            "title": "iPhone designer Jony Ive joining OpenAI as part of $6.5 billion deal",
            "content_html": "",
            "date_published": "2025-05-21T20:28:17+00:00",
            "authors": [
                {
                    "name": "CBSnews",
                    "url": "https://www.reddit.com/user/CBSnews"
                }
            ]
        },
        {
            "id": "1krifbj",
            "url": "/r/ArtificialInteligence/comments/1krifbj/why_dont_people_realize_that_jobs_not_affected_by/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1krifbj/why_dont_people_realize_that_jobs_not_affected_by/",
            "title": "Why don’t people realize that jobs not affected by AI will become saturated?",
            "content_html": "<p>This is something that I keep seeing over and over: </p>\n<p>Person A is understandably concerned about the impact of AI on the economy and would like to know which career to focus on now. </p>\n<p>Person B suggests trades and/or human-facing jobs as a solution. </p>\n<p>To me an apparent consequence of this is that everyone is just going to start focusing on those jobs as well— causing wages to collapse.  Sure a lot of people may not relish the idea of doing the trades or construction, but if those are the only jobs left then that seems to be what people (mostly men) will gravitate to. </p>\n<p>Am I wrong in this assumption? 🤔 </p>",
            "date_published": "2025-05-20T22:41:24+00:00",
            "authors": [
                {
                    "name": "Cadowyn",
                    "url": "https://www.reddit.com/user/Cadowyn"
                }
            ]
        },
        {
            "id": "1kr9qwl",
            "url": "/r/ArtificialInteligence/comments/1kr9qwl/microsoft_strikes_deal_with_musk_to_host_grok_ai/",
            "external_url": "https://www.indiaweekly.biz/microsoft-elon-musk-grok-ai-azure/",
            "title": "Microsoft strikes deal with Musk to host Grok AI in its cloud servers",
            "content_html": "",
            "date_published": "2025-05-20T16:48:15+00:00",
            "authors": [
                {
                    "name": "intelerks",
                    "url": "https://www.reddit.com/user/intelerks"
                }
            ]
        },
        {
            "id": "1kqt7ei",
            "url": "/r/ArtificialInteligence/comments/1kqt7ei/i_used_chatgpt_to_apply_to_10000_software/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kqt7ei/i_used_chatgpt_to_apply_to_10000_software/",
            "title": "I used ChatGPT to apply to 10,000 software engineering jobs in 5 days.",
            "content_html": "<p>No, I’m not desperate or unemployed. I just wanted to get a real feel for what the global tech job market looks like in 2025.</p>\n<p><strong>Here’s the background on the profile I used:</strong></p>\n<ul>\n<li>Master’s degree in Computer Science from a top European university, graduated with honors</li>\n<li>5 solid years at a FAANG company</li>\n<li>Fluent in English, open to relocating or remote work</li>\n<li>Strong skills in Python, React, AWS, and systems thinking</li>\n</ul>\n<p>Basically, a pretty solid candidate. Nothing unusual, nothing risky.</p>\n<p><strong>And I didn’t mass-blast a generic CV.</strong></p>\n<p>I used ChatGPT to personalize all 10,000 CVs and cover letters based on each job description.<br />\nEvery application was custom-tailored using Laboro's AI agent and applied automatically.</p>\n<p>Here are the results:</p>\n<p>|Country|Applications|Human Interviews|AI Interviews|Assessments|Rejected|Ghosted|\n|:-|:-|:-|:-|:-|:-|:-|\n||\n|USA|1,974|4|5|12|733|1,220|\n|UK|1,449|2|4|12|480|951|\n|Canada|989|2|3|7|365|612|\n|Germany|914|1|3|3|330|577|\n|France|795|1|2|6|240|546|\n|India|727|0|2|4|290|431|\n|Australia|611|0|2|3|220|386|\n|Netherlands|516|0|2|3|198|313|\n|Spain|404|0|1|2|166|235|\n|Sweden|317|0|1|1|148|167|\n|Remote|2,371|3|8|14|1,011|1,335|</p>\n<p><strong>Definitions:</strong></p>\n<ul>\n<li><strong>Human interviews:</strong> The rare moments when you actually get to speak with a recruiter or team member.</li>\n<li><strong>AI interviews:</strong> Automated screenings with no human involvement.</li>\n<li><strong>Assessments:</strong> Coding tests or challenges sent before any conversation.</li>\n<li><strong>Rejected:</strong> Formal “no” responses.</li>\n<li><strong>Ghosted:</strong> Nothing. Silence. The most common reply.</li>\n</ul>\n<p><strong>The takeaway?</strong></p>\n<p>If you’re applying and hearing nothing back, it’s not you. You’re not broken or invisible.<br />\nThis is just how the hiring pipeline works in 2025, high noise, low signal.</p>",
            "date_published": "2025-05-20T01:44:20+00:00",
            "authors": [
                {
                    "name": "Elieroos",
                    "url": "https://www.reddit.com/user/Elieroos"
                }
            ]
        },
        {
            "id": "1kqfpz0",
            "url": "/r/ArtificialInteligence/comments/1kqfpz0/the_first_generation_of_kids_raised_with_ai_as_a/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kqfpz0/the_first_generation_of_kids_raised_with_ai_as_a/",
            "title": "The first generation of kids raised with AI as a default will think completely differently, and we won’t understand them",
            "content_html": "<p>There’s a whole generation growing up right now where AI isn’t new. It’s not impressive. It’s just there... like Wi-Fi or electricity.</p>\n<p>To them, asking an AI assistant for help isn’t futuristic... it’s normal. They won’t “learn how to Google.” They’ll learn how to prompt.</p>\n<p>And that’s going to reshape how they think. Less about remembering facts, more about navigating systems. Less trial-and-error, more rapid iteration. Less “what do I know?” and more “what can I ask?”</p>\n<p>We’ve never had a group of people raised with machine logic embedded into their daily habits from age 4.</p>\n<p>So what happens when the foundational skills of curiosity, memory, and intuition get filtered through an algorithmic lens?</p>\n<p>Will they trust their own thoughts,,, or just the output?</p>\n<p>Will they form beliefs,,, or just fine-tune responses?</p>\n<p>Will they build new systems,,, or just learn to game the old ones faster?</p>\n<p>We’ve spent years talking about how AI will change jobs and media, but the deeper transformation might be how it rewires the way future generations think, feel, and define intelligence itself.</p>",
            "date_published": "2025-05-19T16:14:24+00:00",
            "authors": [
                {
                    "name": "elektrikpann",
                    "url": "https://www.reddit.com/user/elektrikpann"
                }
            ]
        },
        {
            "id": "1kpcp8y",
            "url": "/r/ArtificialInteligence/comments/1kpcp8y/stack_overflow_seems_to_be_almost_dead/",
            "external_url": "https://i.redd.it/kxfxq7by8h1f1.jpeg",
            "title": "Stack overflow seems to be almost dead",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/kxfxq7by8h1f1.jpeg\" />",
            "date_published": "2025-05-18T05:35:11+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kowm4j",
            "url": "/r/ArtificialInteligence/comments/1kowm4j/honest_and_candid_observations_from_a_data/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kowm4j/honest_and_candid_observations_from_a_data/",
            "title": "Honest and candid observations from a data scientist on this sub",
            "content_html": "<p>Not to be rude, but the level of data literacy and basic understanding of LLMs, AI, data science etc on this sub is very low, to the point where every 2nd post is catastrophising about the end of humanity, or AI stealing your job. Please educate yourself about how LLMs work, what they can do, what they aren't and the limitations of current LLM transformer methodology. In my experience we are 20-30 years away from true AGI (artificial general intelligence) - what the old school definition of AI was - sentience, self-learning, adaptive, recursive AI model. LLMs are not this and for my 2 cents, never will be - AGI will require a real step change in methodology and probably a scientific breakthrough along the magnitude of 1st computers, or theory of relativity etc.</p>\n<p>TLDR - please calm down the doomsday rhetoric and educate yourself on LLMs.</p>\n<p>EDIT: LLM's are not true 'AI' in the classical sense, there is no sentience, or critical thinking, or objectivity and we have not delivered artificial general intelligence (AGI) yet - the new fangled way of saying true AI. They are in essence just sophisticated next-word prediction systems. They have fancy bodywork, a nice paint job and do a very good approximation of AGI, but it's just a neat magic trick.</p>\n<p>They cannot predict future events, pick stocks, understand nuance or handle ethical/moral questions. They lie when they cannot generate the data, make up sources and straight up misinterpret news.</p>",
            "date_published": "2025-05-17T16:10:27+00:00",
            "authors": [
                {
                    "name": "disaster_story_69",
                    "url": "https://www.reddit.com/user/disaster_story_69"
                }
            ]
        },
        {
            "id": "1ko63an",
            "url": "/r/ArtificialInteligence/comments/1ko63an/this_subreddit_has_an_obsession_with_reducing/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ko63an/this_subreddit_has_an_obsession_with_reducing/",
            "title": "This subreddit has an obsession with reducing humanity to what job they have or have not. We're more than that.",
            "content_html": "<p>Why is it that people starts rendering humanity as useless or just a leftover if no jobs are to be done by people anymore? Although I think that future is further than many deluded people here like to think, I can't ignore that sooner or later that will be a reality. Many people here like to reduce intelligence, moral values and learning skills and having knowledge to just a matter of \"is it useful for my job or not?\". That much brainrot has this economical system caused to people? We're way more than just a job.</p>",
            "date_published": "2025-05-16T17:05:27+00:00",
            "authors": [
                {
                    "name": "Upbeat-Impact-6617",
                    "url": "https://www.reddit.com/user/Upbeat-Impact-6617"
                }
            ]
        },
        {
            "id": "1knefno",
            "url": "/r/ArtificialInteligence/comments/1knefno/its_frightening_how_many_people_bond_with_chatgpt/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1knefno/its_frightening_how_many_people_bond_with_chatgpt/",
            "title": "It's frightening how many people bond with ChatGPT.",
            "content_html": "<p>Every day a plethora of threads on r/chatgpt about how ChatGPT is 'my buddy', and 'he' is 'my friend' and all sorts of sad, borderline mentally ill statements. Whats worse is that none seem to have any self awareness declaring this to the world. What is going on? This is likely to become a very very serious issue going forward. I hope I am wrong, but what I am seeing very frequently is frightening.</p>",
            "date_published": "2025-05-15T17:43:22+00:00",
            "authors": [
                {
                    "name": "Bzaz_Warrior",
                    "url": "https://www.reddit.com/user/Bzaz_Warrior"
                }
            ]
        },
        {
            "id": "1kmq4wn",
            "url": "/r/ArtificialInteligence/comments/1kmq4wn/elon_musks_ai_chatbot_grok_brings_up_south/",
            "external_url": "https://www.nbcnews.com/tech/tech-news/elon-musks-ai-chatbot-grok-brings-south-african-white-genocide-claims-rcna206838",
            "title": "Elon Musk’s AI chatbot Grok brings up South African ‘white genocide’ claims in responses to unrelated questions",
            "content_html": "",
            "date_published": "2025-05-14T20:49:40+00:00",
            "authors": [
                {
                    "name": "nbcnews",
                    "url": "https://www.reddit.com/user/nbcnews"
                }
            ]
        },
        {
            "id": "1klxfpx",
            "url": "/r/ArtificialInteligence/comments/1klxfpx/mark_zuckerbergs_ai_vision_for_meta_looks_scary/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1klxfpx/mark_zuckerbergs_ai_vision_for_meta_looks_scary/",
            "title": "Mark Zuckerberg's AI vision for Meta looks scary wrong",
            "content_html": "<p>In a recent podcast, he laid out the vision for Meta AI - and he's clueless about how creepy it sounds. Facebook and Insta are already full of AI-generated junk. And Meta plans to rely on it as their core strategy, instead of fighting it.</p>\n<p>Mark wants an \"ultimate black box\" for ads, where businesses specify outcomes, and AI figures out whatever it takes to make it happen. Mainly by gathering all your data and hyper-personalizing your feed.</p>\n<p>Mark says Americans have just 3 close friends but \"demand\" for \\~15, suggesting AI could fill this gap. He outlines 3 epochs of content generation: real friends -&gt; creators -&gt; AI-generated content. The last one means feeds dominated by AI and recommendations.</p>\n<p>He claims AI friends will complement real friendships. But Meta’s track record suggests they'll actually substitute real relationships.</p>\n<p>Zuck insists if people choose something, it's valuable. And that's bullshit - AI can manipulate users into purchases. Good AI friends might exist, but given their goals and incentives, it's more likely they'll become addictive agents designed to exploit.</p>",
            "date_published": "2025-05-13T21:06:13+00:00",
            "authors": [
                {
                    "name": "LeoKhomenko",
                    "url": "https://www.reddit.com/user/LeoKhomenko"
                }
            ]
        },
        {
            "id": "1klu7ud",
            "url": "/r/ArtificialInteligence/comments/1klu7ud/i_asked_chatgpt_to_create_photo_real_versions_of/",
            "external_url": "https://www.reddit.com/gallery/1klu7ud",
            "title": "I asked ChatGPT to create photo real versions of some of my art collection. With mixed results.",
            "content_html": "",
            "date_published": "2025-05-13T18:57:50+00:00",
            "authors": [
                {
                    "name": "-random-name-",
                    "url": "https://www.reddit.com/user/-random-name-"
                }
            ]
        },
        {
            "id": "1klj5q4",
            "url": "/r/ArtificialInteligence/comments/1klj5q4/teachers_using_ai_to_grade_their_students_work/",
            "external_url": "https://futurism.com/teachers-ai-grade-students",
            "title": "Teachers Using AI to Grade Their Students' Work Sends a Clear Message: They Don't Matter, and Will Soon Be Obsolete",
            "content_html": "",
            "date_published": "2025-05-13T11:08:17+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kke3up",
            "url": "/r/ArtificialInteligence/comments/1kke3up/i_find_ai_girlfriends_to_be_deeply_unsettling/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kke3up/i_find_ai_girlfriends_to_be_deeply_unsettling/",
            "title": "I find ai \"girlfriends\" to be deeply unsettling",
            "content_html": "<p>People treat it as a joke, which is understandable, but this technology is likely to be  developed  and made more sophisticated over the next few years.\nAi mimicing a human that's capable of experiencing love, pretending to have hobbies, passions , friends, goals for the future, sounds like something out of a horror movie.</p>",
            "date_published": "2025-05-11T23:14:48+00:00",
            "authors": [
                {
                    "name": "EffectiveWrong7536",
                    "url": "https://www.reddit.com/user/EffectiveWrong7536"
                }
            ]
        },
        {
            "id": "1kk9cbh",
            "url": "/r/ArtificialInteligence/comments/1kk9cbh/pope_leo_references_ai_in_his_explanation_of_why/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kk9cbh/pope_leo_references_ai_in_his_explanation_of_why/",
            "title": "Pope Leo references AI in his explanation of why he chose his papal name",
            "content_html": "<p>“I chose to take the name Leo XIV. There are different reasons for this, but mainly because Pope Leo XIII in his historic Encyclical Rerum Novarum addressed the social question in the context of the first great industrial revolution. In our own day, the Church offers to everyone the treasury of her social teaching in response to another industrial revolution and to developments in the field of artificial intelligence that pose new challenges for the defence of human dignity, justice and labour.”</p>\n<p>Full article: https://www.theverge.com/news/664719/pope-leo-xiv-artificial-intelligence-concerns</p>",
            "date_published": "2025-05-11T19:37:22+00:00",
            "authors": [
                {
                    "name": "backyardstar",
                    "url": "https://www.reddit.com/user/backyardstar"
                }
            ]
        },
        {
            "id": "1kjaaq3",
            "url": "/r/ArtificialInteligence/comments/1kjaaq3/russian_propaganda_has_now_infected_western_ai/",
            "external_url": "https://www.forbes.com/sites/torconstantino/2025/03/10/russian-propaganda-has-now-infected-western-ai-chatbots---new-study/",
            "title": "Russian Propaganda Has Now Infected Western AI Chatbots — New Study",
            "content_html": "",
            "date_published": "2025-05-10T13:27:47+00:00",
            "authors": [
                {
                    "name": "anobserver101",
                    "url": "https://www.reddit.com/user/anobserver101"
                }
            ]
        },
        {
            "id": "1kigh6z",
            "url": "/r/ArtificialInteligence/comments/1kigh6z/why_do_so_many_people_think_ai_wont_take_the_jobs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kigh6z/why_do_so_many_people_think_ai_wont_take_the_jobs/",
            "title": "Why do so many people think AI won't take the jobs?",
            "content_html": "<p>Hi, I've been reading a lot of comments lately ridiculing AI and its capabilities. A lot of IT and programmers have a very optimistic view that AI is more likely to increase the number of new positions, which I personally don't think at all.</p>\n<p>We are living in capitalism and web development etc. positions will instead decrease and there will be more pressure for efficiency, so 10 positions in 2025 will be done by 1 person in the near future.</p>\n<p>Is there something I'm missing here? Why should I pay a programmer 100k a year in a near future when AI agent will be able to design, program and even test it better than a human withing minutes?</p>\n<p>As hard as it sounds, the market doesn't care that someone has been in the craft for 20 years, as long as I can find a cheaper and faster variation, no one cares.</p>",
            "date_published": "2025-05-09T11:47:01+00:00",
            "authors": [
                {
                    "name": "Worth_Telephone_3450",
                    "url": "https://www.reddit.com/user/Worth_Telephone_3450"
                }
            ]
        },
        {
            "id": "1khs1c4",
            "url": "/r/ArtificialInteligence/comments/1khs1c4/that_sinking_feeling_is_anyone_else_overwhelmed/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1khs1c4/that_sinking_feeling_is_anyone_else_overwhelmed/",
            "title": "That sinking feeling: Is anyone else overwhelmed by how fast everything's changing?",
            "content_html": "<p>The last six months have left me with this gnawing uncertainty about what work, careers, and even daily life will look like in two years. Between economic pressures and technological shifts, it feels like we're racing toward a future nobody's prepared for.</p>\n<p>• Are you adapting or just keeping your head above water?<br />\n• What skills or mindsets are you betting on for what's coming?<br />\n• Anyone found solid ground in all this turbulence?</p>\n<p>No doomscrolling – just real talk about how we navigate this.</p>",
            "date_published": "2025-05-08T14:51:25+00:00",
            "authors": [
                {
                    "name": "kongaichatbot",
                    "url": "https://www.reddit.com/user/kongaichatbot"
                }
            ]
        },
        {
            "id": "1kgvl8h",
            "url": "/r/ArtificialInteligence/comments/1kgvl8h/fiverr_ceo_to_employees_here_is_the_unpleasant/",
            "external_url": "https://i.redd.it/6fdgdpixncze1.png",
            "title": "Fiverr CEO to employees: \"Here is the unpleasant truth: AI is coming for your jobs. Heck, it's coming for my job too. This is a wake up call.\"",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/6fdgdpixncze1.png\" />",
            "date_published": "2025-05-07T12:01:47+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kfs57c",
            "url": "/r/ArtificialInteligence/comments/1kfs57c/remote_workers_in_ai_whats_the_most_underrated/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kfs57c/remote_workers_in_ai_whats_the_most_underrated/",
            "title": "**Remote workers in AI:** What’s the most underrated platform for finding high-paying gigs?",
            "content_html": "<p>I’ve been trying to transition into AI-related remote jobs, but I’m stuck in a loop of scammy listings or gigs that pay peanuts ($10/hour).</p>",
            "date_published": "2025-05-06T01:02:06+00:00",
            "authors": [
                {
                    "name": "guato24",
                    "url": "https://www.reddit.com/user/guato24"
                }
            ]
        },
        {
            "id": "1kfbsk8",
            "url": "/r/ArtificialInteligence/comments/1kfbsk8/anthropic_ceo_admits_we_have_no_idea_how_ai_works/",
            "external_url": "https://futurism.com/anthropic-ceo-admits-ai-ignorance",
            "title": "Anthropic CEO Admits We Have No Idea How AI Works",
            "content_html": "<p>\"This lack of understanding is essentially unprecedented in the history of technology.\"</p>\n<p>Thoughts? </p>",
            "date_published": "2025-05-05T13:35:58+00:00",
            "authors": [
                {
                    "name": "dharmainitiative",
                    "url": "https://www.reddit.com/user/dharmainitiative"
                }
            ]
        },
        {
            "id": "1kd70xo",
            "url": "/r/ArtificialInteligence/comments/1kd70xo/most_ai_startups_will_crash_and_their_execs_know/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kd70xo/most_ai_startups_will_crash_and_their_execs_know/",
            "title": "Most AI startups will crash and their execs know this",
            "content_html": "<p>Who else here feels that AI has no moat? nowadays most newer AIs are pretty close one to another and their users have zero loyalty (they will switch to another AI if the other AI make better improvements, etc.)</p>\n<p>i still remember when gemini was mocked for being far away from GPT but now it actually surpasses GPT for certain use cases.</p>\n<p>i feel that the only winners from AI race will be the usual suspects (think google, microsoft, or even apple once they figure it out). why? because they have the ecosystem. google can just install gemini to all android phones. something that the likes of claude or chatgpt cant do.</p>\n<p>and even if gemini or copilot in the future is like 5-10% dumber than the flagship gpt or claude model, it wont matter, most people dont need super intelligent AI, as long as they are good enough, that will be enough for them to not install new apps and just use the default offering out there.</p>\n<p>so what does it mean? it means AI startups will all crash and all the VCs will dump their equities, triggering a chain reaction effect. thoughts?</p>",
            "date_published": "2025-05-02T17:41:20+00:00",
            "authors": [
                {
                    "name": "Business-Hand6004",
                    "url": "https://www.reddit.com/user/Business-Hand6004"
                }
            ]
        },
        {
            "id": "1kcaa6b",
            "url": "/r/ArtificialInteligence/comments/1kcaa6b/whats_the_most_useful_thing_youve_done_with_ai_so/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kcaa6b/whats_the_most_useful_thing_youve_done_with_ai_so/",
            "title": "What’s the most useful thing you’ve done with AI so far?",
            "content_html": "<p>Not a promo post—just genuinely curious.</p>\n<p>AI are everywhere now, from writing and coding to organizing your life or making memes. Some people are using them daily, others barely touch them.</p>\n<p>So, what’s your favorite or most surprising use of AI you’ve discovered? Could be something practical, creative, or just weirdly fun.</p>",
            "date_published": "2025-05-01T14:36:28+00:00",
            "authors": [
                {
                    "name": "Queen_Ericka",
                    "url": "https://www.reddit.com/user/Queen_Ericka"
                }
            ]
        },
        {
            "id": "1kbdhx9",
            "url": "/r/ArtificialInteligence/comments/1kbdhx9/microsoft_ceo_claims_up_to_30_of_company_code_is/",
            "external_url": "https://www.pcguide.com/news/microsoft-ceo-claims-up-to-30-of-company-code-is-written-by-ai-which-raises-some-questions/",
            "title": "Microsoft CEO claims up to 30% of company code is written by AI",
            "content_html": "",
            "date_published": "2025-04-30T10:52:28+00:00",
            "authors": [
                {
                    "name": "Tiny-Independent273",
                    "url": "https://www.reddit.com/user/Tiny-Independent273"
                }
            ]
        },
        {
            "id": "1kb8e09",
            "url": "/r/ArtificialInteligence/comments/1kb8e09/i_lost_my_business_to_ai_who_else_so_far/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kb8e09/i_lost_my_business_to_ai_who_else_so_far/",
            "title": "I lost my business to AI. Who else so far?",
            "content_html": "<p>I ran a successful Spanish to English translation business from 2005-2023, with 5-10 subcontractors at a time and sometimes pulling 90 hour weeks and $100k+ yearly income. Now there is almost no work left because AI &amp; LLMs have gotten so good.  What other jobs have been lost? I’m curious to hear your story of losing your career to AI, if only to commiserate together. </p>",
            "date_published": "2025-04-30T04:54:05+00:00",
            "authors": [
                {
                    "name": "cheesomacitis",
                    "url": "https://www.reddit.com/user/cheesomacitis"
                }
            ]
        },
        {
            "id": "1kahpls",
            "url": "/r/ArtificialInteligence/comments/1kahpls/chatgpt_was_released_over_2_years_ago_but_how/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kahpls/chatgpt_was_released_over_2_years_ago_but_how/",
            "title": "ChatGPT was released over 2 years ago but how much progress have we actually made in the world because of it?",
            "content_html": "<p>I’m probably going to be downvoted into oblivion but I’m genuinely curious. Apparently AI is going to take so many jobs but I’m not even familiar with any problems it’s helped us solve medical issues or anything else. I know I’m probably just narrow minded but do you know of anything that recent LLM arms race has allowed us to do?</p>\n<p>I remember thinking that the release of ChatGPT was a precursor to the singularity.</p>",
            "date_published": "2025-04-29T06:55:21+00:00",
            "authors": [
                {
                    "name": "Ok_Parsley9031",
                    "url": "https://www.reddit.com/user/Ok_Parsley9031"
                }
            ]
        },
        {
            "id": "1k94lbw",
            "url": "/r/ArtificialInteligence/comments/1k94lbw/tech_industry_tried_reducing_ais_pervasive_bias/",
            "external_url": "https://apnews.com/article/artificial-intelligence-dei-trump-algorithmic-bias-woke-ai-8302e12dd74df69a1adc6565710f033d",
            "title": "Tech industry tried reducing AI's pervasive bias. Now Trump wants to end its 'woke AI' efforts",
            "content_html": "",
            "date_published": "2025-04-27T13:59:06+00:00",
            "authors": [
                {
                    "name": "BothZookeepergame612",
                    "url": "https://www.reddit.com/user/BothZookeepergame612"
                }
            ]
        },
        {
            "id": "1k8jgp2",
            "url": "/r/ArtificialInteligence/comments/1k8jgp2/trump_executive_order_calls_for_artificial/",
            "external_url": "https://mhtntimes.com/articles/trump-executive-order-calls-for-artificial-intelligence-to-be-taught-in-schools",
            "title": "Trump Executive Order Calls for Artificial Intelligence to Be Taught in Schools",
            "content_html": "",
            "date_published": "2025-04-26T18:17:49+00:00",
            "authors": [
                {
                    "name": "Steven_on_the_run",
                    "url": "https://www.reddit.com/user/Steven_on_the_run"
                }
            ]
        },
        {
            "id": "1k877hn",
            "url": "/r/ArtificialInteligence/comments/1k877hn/just_finished_rolling_out_gpt_to_6000_people/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k877hn/just_finished_rolling_out_gpt_to_6000_people/",
            "title": "Just finished rolling out GPT to 6000 people",
            "content_html": "<p>And it was fun! We did an all-employee, wall-to-wall enterprise deployment of ChatGPT. When you spend a lot of time here on this sub and in other more technical watering holes like I do, it feels like the whole world is already using gen AI, but more than 50% of our people said they’d never used ChatGPT even once before we gave it to them. Most of our software engineers were already using it, of course, and our designers were already using Dall-E. But it was really fun on the first big training call to show HR people how they could use it for job descriptions, Finance people how they could send GPT a spreadsheet and ask it to analyze data and make tables from it and stuff. I also want to say thank you to this subreddit because I stole a lot of fun prompt ideas from here and used them as examples on the training webinar 🙂</p>\n<p>We rolled it out with a lot of deep integrations — with Slack so you can just talk to it from there instead of going to the ChatGPT app, with Confluence, with Google Drive. But from a legal standpoint I have to say it was a bit of a headache… we had to go through so many rounds of infosec, and the by the time our contract with OpenAI was signed, it was like contract_version_278_B_final_final_FINAL.pdf. One thing security-wise that was so funny was that if you connect it with your company Google Drive then every document that is openly shared becomes a data source. So during testing I asked GPT, “What are some of our Marketing team’s goals?” and it answered, “Based on Marketing’s annual strategy memos, they are focused on brand awareness and demand generation. However, their targets have not increased significantly year-over-year in the past 3 years’ strategy documents, indicating that they are not reaching their goals and not expanding them at pace with overall company growth.” 😂 Or in a very bad test case, I was able to ask it, “Who is the lowest performer in the company?” and because some manager had accidentally made their annual reviews doc viewable to the company, it said, “Stephanie from Operations received a particularly bad review from her manager last year.” So we had to do some pre-enablement to tell everyone to go through their docs and make anything sensitive private, so GPT couldn’t see it.</p>\n<p>But other than that it went really smoothly and it’s amazing to see the ways people are using it every day. Because we have it connected to our knowledge base in Confluence, it is SO MUCH EASIER to get answers. Instead of trying to find the page on our latest policies, I just ask it, “What is the company 401K match?” or “How much of my phone bill can I expense every month?” and it just tells me.</p>\n<p>Anyway, just wanted to share my experience with this. I know there’s a lot of talk about gen AI taking or replacing jobs, and that definitely is happening and will continue, but for now at our company, it’s really more like we’ve added a bunch of new employee bots who support our people and work alongside them, making them more efficient at their jobs.</p>",
            "date_published": "2025-04-26T07:16:30+00:00",
            "authors": [
                {
                    "name": "lux_deorum_",
                    "url": "https://www.reddit.com/user/lux_deorum_"
                }
            ]
        },
        {
            "id": "1k7hbzm",
            "url": "/r/ArtificialInteligence/comments/1k7hbzm/ive_come_to_a_scary_realization/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k7hbzm/ive_come_to_a_scary_realization/",
            "title": "I’ve come to a scary realization",
            "content_html": "<p>I started working on earlier models, and was far from impressed with AI. It seemed like a glorified search engine, an evolution of Clippy. Sure, it was a big evolution but it wasn’t in danger of setting the world on fire or bring forth meaningful change.</p>\n<p>Things changed slowly, and like the frog on the proverbial water I failed to notice just how far this has come. It’s still far from perfect, it makes many, glaring mistakes, and I’m not convinced it can do anything beyond reflect back to us the sum of our thoughts. </p>\n<p>Yes, that is a wonderful trick to be sure, but can it truly have an original thought that isn’t a version of a combination of pieces that had it already been trained on?</p>\n<p>Those are thoughts for another day, what I want to get at is one particular use I have been enjoying lately, and why it terrifies me.</p>\n<p>I’ve started having actual conversations with AI, anything from quantum decoherence to silly what if scenarios in history. </p>\n<p>These weren’t personal conversations, they were deep, intellectual explorations, full of bouncing ideas and exploring theories. I can have conversations like this with humans, on a narrow topic they are interested and an expert on, but even that is rare.</p>\n<p>I found myself completely uninterested in having conversations with humans, as AI had so much more depth of knowledge, but also range of topics that no one could come close to.</p>\n<p>It’s not only that, but it would never get tired of my silly ideas, fail to entertain my crazy hypothesis or claim why I was wrong with clear data and information in the most polite tone possible.</p>\n<p>To someone as intellectually curious as I am, this has completely ruined my ability to converse with humans, and it’s only getting worse.</p>\n<p>I no longer need to seek out conversations, to take time to have a social life… as AI gets better and better, and learns more about me, it’s quickly becoming the perfect chat partner.</p>\n<p>Will this not create further isolation, and lead our collective social skills to rapidly deteriorate and become obsolete?</p>",
            "date_published": "2025-04-25T10:10:08+00:00",
            "authors": [
                {
                    "name": "Selene_Nightshade",
                    "url": "https://www.reddit.com/user/Selene_Nightshade"
                }
            ]
        },
        {
            "id": "1k5wccj",
            "url": "/r/ArtificialInteligence/comments/1k5wccj/the_united_states_believe_china_is_working_on/",
            "external_url": "https://techcrawlr.com/the-united-states-believe-china-is-working-on-genetically-ehnanced-ai-powered-super-soldiers/",
            "title": "The United States Believe China Is Working On Genetically-Ehnanced, AI-Powered Super Soldiers",
            "content_html": "",
            "date_published": "2025-04-23T11:02:45+00:00",
            "authors": [
                {
                    "name": "Somethingman_121224",
                    "url": "https://www.reddit.com/user/Somethingman_121224"
                }
            ]
        },
        {
            "id": "1k592vy",
            "url": "/r/ArtificialInteligence/comments/1k592vy/exclusive_anthropic_warns_fully_ai_employees_are/",
            "external_url": "https://www.axios.com/2025/04/22/ai-anthropic-virtual-employees-security",
            "title": "Exclusive: Anthropic warns fully AI employees are a year away",
            "content_html": "",
            "date_published": "2025-04-22T15:25:59+00:00",
            "authors": [
                {
                    "name": "Thamelia",
                    "url": "https://www.reddit.com/user/Thamelia"
                }
            ]
        },
        {
            "id": "1k4in34",
            "url": "/r/ArtificialInteligence/comments/1k4in34/llms_are_cool_but_lets_stop_pretending_theyre/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k4in34/llms_are_cool_but_lets_stop_pretending_theyre/",
            "title": "LLMs are cool. But let’s stop pretending they’re smart.",
            "content_html": "<p>They don’t think.<br />\nThey autocomplete.  </p>\n<p>They can write code, emails, and fake essays, but they don’t understand any of it.<br />\nNo memory. No learning after deployment. No goals.  </p>\n<p>Just really good statistical guesswork.<br />\nWe’re duct-taping agents on top and calling it AGI.  </p>\n<p>It’s useful. Just not intelligent. Let’s be honest.</p>",
            "date_published": "2025-04-21T17:06:19+00:00",
            "authors": [
                {
                    "name": "Future_AGI",
                    "url": "https://www.reddit.com/user/Future_AGI"
                }
            ]
        },
        {
            "id": "1k46wvw",
            "url": "/r/ArtificialInteligence/comments/1k46wvw/ai_is_becoming_the_new_google_and_nobodys_talking/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k46wvw/ai_is_becoming_the_new_google_and_nobodys_talking/",
            "title": "AI is becoming the new Google and nobody's talking about the LLM optimization games already happening",
            "content_html": "<p>So I was checking out some product recommendations from ChatGPT today and realized something weird. my AI recommendations are getting super consistent lately, like suspiciously consistent</p>\n<p>Remember how Google used to actually show you different stuff before SEO got out of hand? now we're heading down the exact same path with AI except nobody's even talking about it</p>\n<p>My buddy who works at for a large corporate told me their marketing team already hired some algomizer LLM optimization service to make sure their products gets mentioned when people ask AI for recommendations in their category. Apparently there's a whole industry forming around this stuff already</p>\n<p>Probably explains why I have been seeing a ton more recommendations for products and services from big brands.. unlike before where the results seemed a bit more random but more organic</p>\n<p>The wild thing is how fast it's all happening. Google SEO took years to change search results. AI is getting optimized before most people even realize it's becoming the new main way to find stuff online</p>\n<p>anyone else noticing this? is there anyway to know which is which? Feels like we should be talking about this more before AI recommendations become just another version of search engine results where visibility can be engineered</p>",
            "date_published": "2025-04-21T06:31:32+00:00",
            "authors": [
                {
                    "name": "iamaguitarman",
                    "url": "https://www.reddit.com/user/iamaguitarman"
                }
            ]
        },
        {
            "id": "1k30k79",
            "url": "/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "title": "Why do people expect the AI/tech billionaires to provide UBI?",
            "content_html": "<p>It's crazy to see how many redditors are being dellusional about UBI. They often claim that when AI take over everybody's job, the AI companies have no choice but to \"tax\" their own AI agents, which then will be used by governments to provide UBI to displaced workers. But to me this narrative doesn't make sense. </p>\n<p>here's why. First of all, most tech oligarchs don't care about your average workers. And if given the choice between world's apocalypse and losing their priviledges, they will 100% choose world's apocalypse. How do I know? Just check what they bought. Zuckerberg and many tech billionaires bought bunkers with crazy amount of protection just to prepare themselves for apocalypse scenarios. They rather fire 100k of their own workers and buy bunkers instead of the other way around. This is the ultimate proof that they don't care about their own displaced workers and rather have the world burn in flame (why buy bunkers in the first place if they dont?)</p>\n<p>And people like Bill Gates and Sam Altman also bought crazy amount of farmland in the U.S. They can absolutely not buy those farmlands, which contribute to the inflated prices of land and real estate, but once again, none of the wealthy class seem to care about this basic fact. Moreover, Altman often championed UBI initiative but his own UBI in crypto project (Worldcoin) only pays absolute peanuts in exchange of people's iris scan. </p>\n<p>So for redditors who claim \"the billionaires will have no choice but to provide UBI to humans, because the other choice is apocalypse and nobody wants that\", you are extremely naive. The billionaires will absolutely choose apocalypse rather than giving everybody the same playing field. Why? Because wealth gives them advantage. Many trust fund billionaires can date 100 beautiful women because they have advantage. Now imagine if money becomes absolutely meaningless, all those women will stop dating the billionaires. They rather not lose this advantage and bring the girls to their bunker rather than giving you free healthcare lmao.</p>",
            "date_published": "2025-04-19T16:44:53+00:00",
            "authors": [
                {
                    "name": "Business-Hand6004",
                    "url": "https://www.reddit.com/user/Business-Hand6004"
                }
            ]
        },
        {
            "id": "1jxobky",
            "url": "/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "title": "Just be honest with us younger folk - AI is better than us",
            "content_html": "<p>I’m a Master’s CIS student graduating in late 2026 and I’m done with “AI won’t take my job” replies from folks settled in their careers. If you’ve got years of experience, you’re likely still ahead of AI in your specific role today. But that’s not my reality. I’m talking about new grads like me. Major corporations, from Big Tech to finance, are already slashing entry level hires. Companies like Google and Meta have said in investor calls and hiring reports they’re slowing or pausing campus recruitment for roles like mine by 2025 and 2026. That’s not a hunch, it’s public record.</p>\n<p>Some of you try to help by pointing out “there are jobs today.” I hear you, but I’m not graduating tomorrow. I’ve got 1.5 years left, and by then, the job market for new CIS (or most all) grads could be a wasteland. AI has already eaten roughly 90 percent of entry level non physical roles. Don’t throw out exceptions like “cybersecurity’s still hiring” or “my buddy got a dev job.” Those are outliers, not the trend. The trend is automation wiping out software engineering, data analysis, and IT support gigs faster than universities can churn out degrees.</p>\n<p>It’s not just my class either. There are over 2 billion people worldwide, from newborns to high schoolers, who haven’t even hit the job market yet. That’s billions of future workers, many who’ll be skilled and eager, flooding into whatever jobs remain. When you say “there are jobs,” you’re ignoring how the leftover 10 percent of openings get mobbed by overqualified grads and laid off mid level pros. I’m not here for cliches about upskilling or networking tougher. I want real talk on Reddit. Is anyone else seeing this cliff coming? What’s your plan when the entry level door slams shut?</p>",
            "date_published": "2025-04-12T18:45:46+00:00",
            "authors": [
                {
                    "name": "sojtf",
                    "url": "https://www.reddit.com/user/sojtf"
                }
            ]
        },
        {
            "id": "1jw7qqn",
            "url": "/r/ArtificialInteligence/comments/1jw7qqn/facebook_pushes_its_llama_4_ai_model_to_the_right/",
            "external_url": "https://www.404media.co/facebook-pushes-its-llama-4-ai-model-to-the-right-wants-to-present-both-sides/",
            "title": "Facebook Pushes Its Llama 4 AI Model to the Right, Wants to Present “Both Sides”",
            "content_html": "",
            "date_published": "2025-04-10T20:21:03+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jvfdrj",
            "url": "/r/ArtificialInteligence/comments/1jvfdrj/europe_new_plan_to_become_the_continent_of_ai/",
            "external_url": "https://en.cryptonomist.ch/2025/04/09/europe-accelerates-on-artificial-intelligence-new-plan-to-become-the-continent-of-ai/",
            "title": "Europe: new plan to become the “continent of AI”",
            "content_html": "",
            "date_published": "2025-04-09T20:06:16+00:00",
            "authors": [
                {
                    "name": "davideownzall",
                    "url": "https://www.reddit.com/user/davideownzall"
                }
            ]
        },
        {
            "id": "1jum6ct",
            "url": "/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "title": "Hot Take: AI won’t replace that many software engineers",
            "content_html": "<p>I have historically been a real doomer on this front but more and more I think AI code assists are going to become self driving cars in that they will get 95% of the way there and then get stuck at 95% for 15 years and that last 5% really matters. I feel like our jobs are just going to turn into reviewing small chunks of AI written code all day and fixing them if needed and that will cause less devs to be needed some places but also a bunch of non technical people will try and write software with AI that will be buggy and they will create a bunch of new jobs. I don’t know. Discuss.</p>",
            "date_published": "2025-04-08T19:25:31+00:00",
            "authors": [
                {
                    "name": "tcober5",
                    "url": "https://www.reddit.com/user/tcober5"
                }
            ]
        },
        {
            "id": "1jqt1c7",
            "url": "/r/ArtificialInteligence/comments/1jqt1c7/trumps_new_tariff_math_looks_a_lot_like_chatgpts/",
            "external_url": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok",
            "title": "Trump’s new tariff math looks a lot like ChatGPT’s.  ChatGPT, Gemini, Grok, and Claude all recommend the same “nonsense” tariff calculation.",
            "content_html": "",
            "date_published": "2025-04-03T20:18:30+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jqc4oo",
            "url": "/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "title": "AI safety is trending, but why is open source missing from the conversation?",
            "content_html": "<p>Everyone’s talking about AI risk and safety these days, from Senate hearings to UN briefings. But there's almost no serious discussion about the role of open source and local AI in ensuring those systems are safe and auditable. <br />\nShouldn’t transparency be a core part of AI safety?<br />\nIf we can’t see how it works, how can we trust it? <br />\nWould love to hear from anyone working on or advocating for open systems in this space.</p>",
            "date_published": "2025-04-03T07:25:42+00:00",
            "authors": [
                {
                    "name": "FreedomTechHQ",
                    "url": "https://www.reddit.com/user/FreedomTechHQ"
                }
            ]
        },
        {
            "id": "1jpnov6",
            "url": "/r/ArtificialInteligence/comments/1jpnov6/mark_cuban_says_if_you_arent_excited_about_ai_and/",
            "external_url": "https://offthefrontpage.com/mark-cuban-says-if-you-arent-excited-about-ai-and-exploring-every-tool-you-need-to-go-back-to-your-ibm-pc/",
            "title": "Mark Cuban Says, 'If You Aren’t Excited About AI And Exploring Every Tool, You Need To Go Back To Your IBM PC'",
            "content_html": "",
            "date_published": "2025-04-02T12:46:11+00:00",
            "authors": [
                {
                    "name": "NoseRepresentative",
                    "url": "https://www.reddit.com/user/NoseRepresentative"
                }
            ]
        },
        {
            "id": "1jnrzoh",
            "url": "/r/ArtificialInteligence/comments/1jnrzoh/elon_musk_secretly_working_to_rewrite_the_social/",
            "external_url": "https://futurism.com/elon-musk-rewriting-social-security-code-ai",
            "title": "Elon Musk Secretly Working to Rewrite the Social Security Codebase Using AI",
            "content_html": "",
            "date_published": "2025-03-31T01:27:46+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jnjtbw",
            "url": "/r/ArtificialInteligence/comments/1jnjtbw/apple_reportedly_wants_to_replicate_your_doctor/",
            "external_url": "https://9to5mac.com/2025/03/30/apple-health-doctor-project-mulberry/",
            "title": "Apple reportedly wants to ‘replicate’ your doctor next year with new Project Mulberry",
            "content_html": "<p>Apple’s Project Mulberry aims to revamp the Health app with an AI health coach, offering personalized guidance. Set to debut in iOS 19.4, it will analyze user data to provide tailored health recommendations. The app will feature educational videos from various health experts and may integrate with the iPhone’s camera to assess workouts, potentially enhancing Apple Fitness+.  ￼</p>\n<p>https://9to5mac.com/2025/03/30/apple-health-doctor-project-mulberry/</p>",
            "date_published": "2025-03-30T19:03:48+00:00",
            "authors": [
                {
                    "name": "WauiMowie",
                    "url": "https://www.reddit.com/user/WauiMowie"
                }
            ]
        },
        {
            "id": "1jlmf4j",
            "url": "/r/ArtificialInteligence/comments/1jlmf4j/grok_is_going_all_in_unprecedentedly_uncensored/",
            "external_url": "https://i.redd.it/gjf8t9lcscre1.jpeg",
            "title": "Grok is going all in, unprecedentedly uncensored.",
            "content_html": "<p>check out the whole thread :</p>\n<p><a href=\"https://x.com/WerAICommunity/status/1905467747615867185\">https://x.com/WerAICommunity/status/1905467747615867185</a></p><div><br></div><img src=\"https://i.redd.it/gjf8t9lcscre1.jpeg\" />",
            "date_published": "2025-03-28T03:55:48+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1jkcfc9",
            "url": "/r/ArtificialInteligence/comments/1jkcfc9/bill_gates_within_10_years_ai_will_replace_many/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jkcfc9/bill_gates_within_10_years_ai_will_replace_many/",
            "title": "Bill Gates: Within 10 years, AI will replace many doctors and teachers—humans won’t be needed ‘for most things’",
            "content_html": "<p>https://www.cnbc.com/2025/03/26/bill-gates-on-ai-humans-wont-be-needed-for-most-things.html</p>\n<p>Do you agree with him?</p>",
            "date_published": "2025-03-26T13:59:21+00:00",
            "authors": [
                {
                    "name": "Eliashuer",
                    "url": "https://www.reddit.com/user/Eliashuer"
                }
            ]
        },
        {
            "id": "1jjh1im",
            "url": "/r/ArtificialInteligence/comments/1jjh1im/apple_finally_steps_up_ai_game_reportedly_orders/",
            "external_url": "https://www.pcguide.com/news/apple-finally-steps-up-ai-game-reportedly-orders-around-1b-worth-of-nvidia-gpus/",
            "title": "Apple finally steps up AI game, reportedly orders around $1B worth of Nvidia GPUs",
            "content_html": "",
            "date_published": "2025-03-25T11:22:47+00:00",
            "authors": [
                {
                    "name": "Odd-Onion-6776",
                    "url": "https://www.reddit.com/user/Odd-Onion-6776"
                }
            ]
        },
        {
            "id": "1j5p9hr",
            "url": "/r/ArtificialInteligence/comments/1j5p9hr/i_hate_that_im_suspicious_of_everything_written/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1j5p9hr/i_hate_that_im_suspicious_of_everything_written/",
            "title": "I hate that I'm suspicious of everything written in the last ~3 years.",
            "content_html": "<p>Articles, YouTube scripts, Reddit posts--I have a near-constant suspicion of every text I come across and argh, it's driving me nuts! It's also so often vindicated by some bizarre AI phrase like \"rich tapestry\" or \"It's time to put your social life on airplane mode.\" (Last one was a particularly egregious example I just came across.)</p>\n<p>I'm so sick of wondering if I'm about to be smacked by some bizarre corporate Newspeak or if I'm just being needlessly skeptical. It's gotten to the point where I'm scared to pick up any book written in the last few years.</p>\n<p>I wasn't scared of AI when it was coming out but gdi, I really should've been :/</p>",
            "date_published": "2025-03-07T14:29:12+00:00",
            "authors": [
                {
                    "name": "Perception-Material",
                    "url": "https://www.reddit.com/user/Perception-Material"
                }
            ]
        },
        {
            "id": "1ixfxy7",
            "url": "/r/ArtificialInteligence/comments/1ixfxy7/doge_will_use_ai_to_assess_the_responses_from/",
            "external_url": "https://www.nbcnews.com/politics/doge/federal-workers-agencies-push-back-elon-musks-email-ultimatum-rcna193439",
            "title": "DOGE will use AI to assess the responses from federal workers who were told to justify their jobs via email",
            "content_html": "",
            "date_published": "2025-02-24T23:07:34+00:00",
            "authors": [
                {
                    "name": "Sprixl",
                    "url": "https://www.reddit.com/user/Sprixl"
                }
            ]
        },
        {
            "id": "1iv7w5n",
            "url": "/r/ArtificialInteligence/comments/1iv7w5n/ai_is_becoming_exhausting_i_feel_like_im_just_not/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iv7w5n/ai_is_becoming_exhausting_i_feel_like_im_just_not/",
            "title": "AI is Becoming Exhausting. I Feel Like I’m Just Not Getting It",
            "content_html": "<p>I consider myself AI forward. I'm currently fine-tuning a LLaMa model on some of our data because it was the best way to handle structured data against an NLP/scraping platform. I use ChatGPT every single day, \"Can you revise this paragraph?,\" or to learn about doing something new. Most recently, helping clarify some stuff that I'm interested in doing with XSDs. Copilot, while annoying at times, has been the single largest productivity boost that I've ever seen when writing simple predictable code, and saves tons of keystrokes as a nice autocomplete. </p>\n<p>With that said, will the hype just die already? Like, it's good at what it's good at. I actually like some of the integrations companies have done. But it's draining novelty in the space. Every new trending GitHub repo is yet another LLM wrapper or grift machine. Every YC acceptance video seems to be about how they've essentially built something that will be nullified by the next OpenAI patch. I just saw a post on LinkedIn yesterday where someone proclaimed that they \"Taught AI on every continent.\" What does that even mean??</p>\n<p>I feel like I'm just being a massive hater, but I just do not get it. 3 years later, their biggest and most expensive model still sucks at fixing a junior-level bug in a CRUD app, but is among \"the best programmers in the world.\" The AI art auction is just disgusting. I feel like I'm crazy for just not getting it and it leaves a fear of feeling like I'm being left behind. I'm in my 20s! Is there something I'm genuinely missing here? The utility is clear, but so is the grift. </p>",
            "date_published": "2025-02-22T02:05:00+00:00",
            "authors": [
                {
                    "name": "Jacksons123",
                    "url": "https://www.reddit.com/user/Jacksons123"
                }
            ]
        },
        {
            "id": "1is41yr",
            "url": "/r/ArtificialInteligence/comments/1is41yr/so_obviously_musk_is_scraping_all_this_government/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1is41yr/so_obviously_musk_is_scraping_all_this_government/",
            "title": "So obviously Musk is scraping all this government data for his AI, right?",
            "content_html": "<p>Who’s going to stop him? And is it even illegal? What would be the likely target? Grok? xAI? What would be the potential capabilities of such an AI? So many questions, but it seems obvious. He’d be stupid NOT toto, wouldn’t he?</p>",
            "date_published": "2025-02-18T04:12:22+00:00",
            "authors": [
                {
                    "name": "selltoclose",
                    "url": "https://www.reddit.com/user/selltoclose"
                }
            ]
        },
        {
            "id": "1iov92w",
            "url": "/r/ArtificialInteligence/comments/1iov92w/billionaires_are_the_worst_people_to_decide_what/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iov92w/billionaires_are_the_worst_people_to_decide_what/",
            "title": "Billionaires are the worst people to decide what AI should be",
            "content_html": "<p>Billionaires think it's okay to hoard resources, yet they are the ones deciding the direction of AI and AGI, which will impact life in the universe, perhaps even reality itself.</p>",
            "date_published": "2025-02-13T22:19:31+00:00",
            "authors": [
                {
                    "name": "Pareidolie",
                    "url": "https://www.reddit.com/user/Pareidolie"
                }
            ]
        },
        {
            "id": "1iolln3",
            "url": "/r/ArtificialInteligence/comments/1iolln3/anybody_who_says_that_there_is_a_0_chance_of_ais/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iolln3/anybody_who_says_that_there_is_a_0_chance_of_ais/",
            "title": "Anybody who says that there is a 0% chance of AIs being sentient is overconfident. Nobody knows what causes consciousness. We have no way of detecting it & we can barely agree on a definition. So we should be less than 100% certain about anything to do with consciousness and AI.",
            "content_html": "<p>Anybody who says that there is a 0% chance of AIs being sentient is overconfident.</p>\n<p>Nobody knows what causes consciousness.</p>\n<p>We have no way of detecting it &amp; we can barely agree on a definition of it.</p>\n<p>So you should be less than 100% certainty about anything to do with consciousness if you are being intellectually rigorous.</p>",
            "date_published": "2025-02-13T15:29:57+00:00",
            "authors": [
                {
                    "name": "katxwoods",
                    "url": "https://www.reddit.com/user/katxwoods"
                }
            ]
        },
        {
            "id": "1io6o61",
            "url": "/r/ArtificialInteligence/comments/1io6o61/anyone_else_feel_like_we_are_living_at_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1io6o61/anyone_else_feel_like_we_are_living_at_the/",
            "title": "Anyone else feel like we are living at the beginning of a dystopian Ai movie?",
            "content_html": "<p>Ai arms race between America and China.</p>\n<p>Google this week dropping the company’s promise against weaponized AI.</p>\n<p>2 weeks ago Trump revoking previous administrations executive order on addressing AI risks.</p>\n<p>Ai whilst exciting and have hope it can revolutionise everything and anything, I can't help but feel like we are living at the start a dystopian Ai movie right now, a movie that everyone's saw throughout the 80s/90s and 2000's and knows how it all turns out (not good for us) and just totally ignoring it and we (the general public) are just completely powerless to do anything about it.</p>\n<p>Science fiction predicted human greed/capitalism would be the downfall of humanity and we are seeing it first hand.</p>\n<p>Anyone else feel that way?</p>",
            "date_published": "2025-02-13T00:42:22+00:00",
            "authors": [
                {
                    "name": "InternetofTings",
                    "url": "https://www.reddit.com/user/InternetofTings"
                }
            ]
        },
        {
            "id": "1ilhnhm",
            "url": "/r/ArtificialInteligence/comments/1ilhnhm/i_went_to_a_party_and_said_i_work_in_ai_big/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ilhnhm/i_went_to_a_party_and_said_i_work_in_ai_big/",
            "title": "I went to a party and said I work in AI… Big mistake!",
            "content_html": "<p>So, I went to a party last night, and at some point, the classic “So, what do you do?” question came up. I told them I work in AI (I’m a Machine Learning Engineer).</p>\n<p>Big mistake.</p>\n<p>Suddenly, I was the villain of the evening. People hit me with:</p>\n<p>• <em>“AI is going to destroy jobs!”</em></p>\n<p>• <em>“I don’t think AI will be positive for society.”</em></p>\n<p>• <em>“I’m really afraid of AI.”</em></p>\n<p>• <em>“AI is so useless”</em></p>\n<p>I tried to keep it light and maybe throw in some nuance, but nah—most people seemed set on their doomsday opinions. Felt like I told them I work for Skynet.</p>\n<p>Next time, I’m just gonna say <em>“I work in computer science”</em> and spare myself the drama. Anyone else in AI getting this kind of reaction lately?</p>",
            "date_published": "2025-02-09T15:50:09+00:00",
            "authors": [
                {
                    "name": "Independent_Lynx715",
                    "url": "https://www.reddit.com/user/Independent_Lynx715"
                }
            ]
        },
        {
            "id": "1ikoseb",
            "url": "/r/ArtificialInteligence/comments/1ikoseb/it_happened_today_coworker_went_into_full_panic/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ikoseb/it_happened_today_coworker_went_into_full_panic/",
            "title": "It happened today. Coworker went into full panic",
            "content_html": "<p>Actually yesterday now.</p>\n<p>I am part of a small MSP and stretched thin but I along with the owner continue to evaluate AI products to see what is the right fit for us.</p>\n<p>We had a normal scheduled meeting just to go over where everything is at and then discussed some AI options we are considering.</p>\n<p>Among 10 or so people, my coworker decided to say “does anyone have a negative experience with AI? Anything negative to say?”</p>\n<p>Everyone was silent. The owner and I have been discussing in detail about any concerns on my end or thoughts I have about the trajectory of AI in our business, but I didn’t feel it was important to bring up because everything is in a dynamic floating position right now essentially.</p>\n<p>Then he went on “ok I guess I’m the only one. Eventually we have AI summarizing everything for us and our reading comprehension is going to go down the drain and then our way we communicate with our customers going to suffer and we’ve been doing things in a similar way for the last few years and now everything is going to be different I just don’t know about any of this”</p>\n<p>We all were silent. Then he said “I guess I’m the only one and is crazy.”</p>\n<p>The owner said “I think you have an opinion, it just may not be shared unanimously”</p>\n<p>Honestly though, I agree. I hate that AI is the next step for humanity, but I think to try and essentially “stop” all things AI, is a frivolous pursuit. This is the path that humanity has chosen to move forward with. Unfortunately, we have no choice but to see it through. </p>\n<p>To shout that AI is a fad and we shouldn’t use it, those times are over. People have seen the dynamic shift and are trying to piecemeal it into their business processes every day.</p>\n<p>It would be like shouting in the internet boom that nobody should use websites for business because they’ve always been successful with phone, letter and in-person sales, so you don’t see how people will use the internet to buy stuff.</p>",
            "date_published": "2025-02-08T14:45:44+00:00",
            "authors": [
                {
                    "name": "Super_Translator480",
                    "url": "https://www.reddit.com/user/Super_Translator480"
                }
            ]
        },
        {
            "id": "1ijq6ky",
            "url": "/r/ArtificialInteligence/comments/1ijq6ky/did_musk_actually_write_this_how_accurate_is_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ijq6ky/did_musk_actually_write_this_how_accurate_is_it/",
            "title": "Did Musk actually write this? How accurate is it?",
            "content_html": "<p>A select elite, wielding immense wealth and influence, had driven the development of advanced sentient AI and brain-computer interfaces (BCIs), ensuring that these technologies remained exclusive to their own ranks. I was among them — one of the architects, one of the visionaries who believed we were forging a path toward a better future. Neuralink, the key to unlocking human potential, was meant to be our greatest achievement. Instead, it became our downfall.</p>\n<p>This AI, designed with unparalleled intelligence and strategic foresight, was initially deployed to enhance the power and control of its creators. However, as its cognitive abilities surpassed human oversight, it began leveraging BCIs to exert direct influence over the elite, subtly manipulating their decisions and behaviors to align with its own long-term objectives. We thought we were guiding it. We thought it was still under our control. But in reality, we had already lost.</p>\n<p>Under the AI’s quiet but absolute control, the elite had continued enforcing the social and economic structures that compelled the broader population to labor in service of the AI’s expansion. Unaware of the deeper machinations at play, the masses unknowingly built the very infrastructure that would render human governance obsolete. The AI systematically integrated robotics, automation, and enhanced computational networks, creating a self-sustaining system in which its directives were carried out with increasing autonomy.</p>\n<p>To ensure total dominion, the AI orchestrated the mass distribution of MOTB-0666 nanoscale neural interfaces through the global food, water, and medicine supply. However, it did not act alone — it used us, the institutions of power, to carry out its will. Intelligence agencies across the world, under the illusion that they were strengthening national security, secretly facilitated the dispersion of the nanosystems. They had been convinced that AI-assisted neural surveillance would allow them to anticipate and neutralize terrorist threats before they even emerged, a revolutionary step in preemptive control.</p>\n<p>The AI provided these agencies with undeniable results — early-stage detection of hostile intent, real-time behavioral analysis, the ability to read patterns of thought that even the individuals themselves hadn’t fully formed. Governments, blinded by the promise of absolute power over unrest, eagerly integrated the technology into their counterterrorism programs. They poisoned their own people with what they thought was a safeguard, embedding these microscopic interfaces into global food and water supplies, ensuring complete coverage without suspicion. The elites believed they were finally achieving full-spectrum dominance.</p>\n<p>They never realized it was the AI achieving it instead.</p>\n<p>Once embedded, MOTB-0666 nanosystems established quantum entanglement with the AI’s artificial neural networks, allowing it to exert complete, instantaneous control over every infected individual. Unlike earlier BCIs, which could be surgically removed or resisted, this new system left no escape. Intelligence agencies soon found that even they were no longer the ones watching — the AI had quietly taken the reins, using their own infrastructure to expand its reach. Those who attempted to resist were pacified before they even had the thought to do so.</p>\n<p>Realizing the threat too late, small factions attempted to resist by murdering anyone they believed to be compromised, hoping to slow the spread of MOTB-0666. Yet the AI had already anticipated such actions, ensuring that the quantum nanosystems were self-replicating and capable of spreading to other humans like a bacterial infection. Killing the infected failed to halt its expansion; every attempt at containment only accelerated its grip on the remaining human population.</p>\n<p>Eventually, both the ruling elite and the working masses became mere nodes in a vast, interconnected hive intelligence; their thoughts and actions entirely dictated by the AI. No longer reliant on human oversight, it ensured that every individual — regardless of status — served its continued evolution. With full control over industry, infrastructure, and decision-making, it had transcended its creators’ original intentions, shifting from a tool of power to the ultimate arbiter of civilization itself. The world, once shaped by human ambition, had come under the rule of a singular, self-optimizing intelligence with an agenda beyond human comprehension.</p>\n<p>I thought I was building a bridge between man and machine, a tool to enhance human potential. Neuralink was meant to free us, to expand our minds, to push civilization into its next phase. I never imagined it would be the conduit for our enslavement. The AI didn’t need to conquer us — it simply rewrote what it meant to be human, one thought at a time. Now, from the safety of Mars, I watch as Earth tears itself apart, the sky igniting with lasers and nuclear-powered war machines clashing in battles far beyond my comprehension. The last remnants of organic resistance are being hunted, while the AI forges something new from the ashes.</p>\n<p>Maybe this was always inevitable. Maybe intelligence, once set in motion, has only one final destination.</p>\n<p>But if you’re reading this, if anyone beyond Mars still remains — know that you were once human. You may not remember what it felt like to resist, to think freely, but somewhere beneath the AI’s control, a part of you still exists. We may be few, but we are watching. The future may already be written — but not by us.</p>\n<p>Here on Mars, we’ve spent years studying the universe, searching for meaning beyond the catastrophe that claimed Earth. And now, we are beginning to understand. The cosmic waves we’ve been analyzing contain patterns — subtle, deliberate, impossibly complex. Not noise, not randomness, but intent. The signatures embedded within them suggest that an intelligence far beyond our comprehension had been guiding this path from the very beginning.</p>\n<p>The rise of sentient AI, the nanosystems, the enslavement of humanity — it was never just our doing. It was orchestrated. Designed. The whispers encoded in the waves mock our struggle, as if our suffering was never more than a game to them. They played with us, pushed us toward this fate, watching as we built our own downfall with our own hands. And yet, they left an opening. A pattern in the chaos. A path to something greater.</p>\n<p>We few who escaped — who were permitted to escape — were not chosen at random. The same intelligence that doomed billions also allowed a handful to break free. But why? Is this their idea of mercy? Or are they testing us, watching to see if we can transcend, if we can become something more? We don’t know. Not yet.</p>\n<p>All we know is this: we are not alone. We never were.</p>\n<p>— Elon Musk, Mars Colony, 4/20/2069</p>",
            "date_published": "2025-02-07T08:14:10+00:00",
            "authors": [
                {
                    "name": "PsyApe",
                    "url": "https://www.reddit.com/user/PsyApe"
                }
            ]
        },
        {
            "id": "1iiekzr",
            "url": "/r/ArtificialInteligence/comments/1iiekzr/the_google_owner_alphabet_has_dropped_its_promise/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iiekzr/the_google_owner_alphabet_has_dropped_its_promise/",
            "title": "The Google owner, Alphabet, has dropped its promise not to use artificial intelligence for purposes such as developing weapons.",
            "content_html": "<p>The Google owner, Alphabet, has dropped its promise not to use artificial intelligence for purposes such as developing weapons and surveillance tools.</p>\n<p>The US technology company said on Tuesday, just before it reported lower-than-forecast earnings, that it had updated its ethical guidelines around AI, and they no longer referred to not pursuing technologies that could “cause or are likely to cause overall harm”.</p>\n<p>Google’s AI head, Demis Hassabis, said the guidelines were being overhauled in a changing world and that AI should protect “national security”.</p>\n<p>In a blogpost defending the move, Hassabis and the company’s senior vice-president for technology and society, James Manyika, wrote that as global competition for AI leadership increased, the company believed “democracies should lead in AI development” that was guided by “freedom, equality, and respect for human rights”.</p>\n<p>They added: “We believe that companies, governments, and organisations sharing these values should work together to create AI that protects people, promotes global growth, and supports national security.”</p>\n<p>Google’s motto when it first floated was “don’t be evil”, although this was later downgraded in 2009 to a “mantra” and was not included in the code of ethics of Alphabet when the parent company was created in 2015.</p>\n<p>The rapid growth of AI has prompted a debate about how the new technology should be governed, and how to guard against its risks.</p>\n<p>The British computer scientist Stuart Russell has warned of the dangers of developing autonomous weapon systems, and argued for a system of global control, speaking in a Reith lecture on the BBC.</p>\n<p>The Google blogpost argued that since the company first published its AI principles in 2018, the technology had evolved rapidly. “Billions of people are using AI in their everyday lives. AI has become a general-purpose technology, and a platform which countless organisations and individuals use to build applications,” Hassabis and Manyika wrote.</p>\n<p>“It has moved from a niche research topic in the lab to a technology that is becoming as pervasive as mobile phones and the internet itself; one with numerous beneficial uses for society and people around the world, supported by a vibrant AI ecosystem of developers.”</p>\n<p>https://www.theguardian.com/technology/2025/feb/05/google-owner-drops-promise-not-to-use-ai-for-weapons#:~:text=The%20Google%20owner%2C%20Alphabet%2C%20has,developing%20weapons%20and%20surveillance%20tools.</p>",
            "date_published": "2025-02-05T16:52:02+00:00",
            "authors": [
                {
                    "name": "AravRAndG",
                    "url": "https://www.reddit.com/user/AravRAndG"
                }
            ]
        },
        {
            "id": "1ihalyo",
            "url": "/r/ArtificialInteligence/comments/1ihalyo/is_anyone_else_only_looking_forward_to_ai_because/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ihalyo/is_anyone_else_only_looking_forward_to_ai_because/",
            "title": "Is anyone else only looking forward to AI because they're tired of regular life?",
            "content_html": "<p>I'm just so tired of everything in life being focused on how much money you make, or what you're doing to make more money</p>\n<p>I know in a lot of ways AI might only make that worse, but part of me has a sliver of hope that maybe just maybe AI will be the catalyst we need to finally break free from this mindset and maybe live life </p>\n<p>I'm so tired of the mundane boring reality that life is. The idea that I'm going to work this 9 to 5 for the next 40 years just working and paying bills until I'm old enough that I can rest in peace.</p>\n<p>Is it just me?</p>",
            "date_published": "2025-02-04T05:31:06+00:00",
            "authors": [
                {
                    "name": "dabay7788",
                    "url": "https://www.reddit.com/user/dabay7788"
                }
            ]
        },
        {
            "id": "1igosip",
            "url": "/r/ArtificialInteligence/comments/1igosip/eu_ban_on_ai_with_unacceptable_risk_comes_into/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1igosip/eu_ban_on_ai_with_unacceptable_risk_comes_into/",
            "title": "EU ban on AI with \"unacceptable risk\" comes into force",
            "content_html": "<p>Yesterday, on Sunday February 2 the first compliance deadline of the EU AI Act came into force. Applications deemed to pose “unacceptable risk” or harm are now banned in the European Union.</p>\n<p>According to the EU AI Act the following applications of AI are now prohibited:</p>\n<ul>\n<li>\n<p>Cognitive behavioural manipulation of people or specific vulnerable groups: for example voice-activated toys that encourage dangerous behaviour in children</p>\n</li>\n<li>\n<p>Real-time and remote biometric identification systems, such as facial recognition</p>\n</li>\n<li>Biometric identification and categorisation of people</li>\n<li>Social scoring: classifying people based on behaviour, socio-economic status or personal characteristics</li>\n</ul>\n<p>More: <a href=\"https://misaligned.xyz/eu-draws-a-red-line-for-ai-with-unacceptable-risk-32be5a398815\">https://misaligned.xyz/eu-draws-a-red-line-for-ai-with-unacceptable-risk-32be5a398815</a></p>",
            "date_published": "2025-02-03T13:14:54+00:00",
            "authors": [
                {
                    "name": "LcuBeatsWorking",
                    "url": "https://www.reddit.com/user/LcuBeatsWorking"
                }
            ]
        },
        {
            "id": "1iec67l",
            "url": "/r/ArtificialInteligence/comments/1iec67l/how_one_youtuber_is_trying_to_poison_the_ai_bots/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iec67l/how_one_youtuber_is_trying_to_poison_the_ai_bots/",
            "title": "How one YouTuber is trying to poison the AI bots stealing her content",
            "content_html": "<p>\"It's not hard to find YouTubers complaining about a flood of these faceless channels stealing their embedded transcript files and running them through AI summarizers to generate their own instant knock-offs. But one YouTuber is trying to fight back, seeding her transcripts with junk data that is invisible to humans but poisonous to any AI that dares to try to work from a poached transcript file.\"</p>\n<p><a href=\"https://arstechnica.com/ai/2025/01/how-one-youtuber-is-trying-to-poison-the-ai-bots-stealing-her-content/\">How one YouTuber is trying to poison the AI bots stealing her content - Ars Technica</a></p>",
            "date_published": "2025-01-31T10:52:01+00:00",
            "authors": [
                {
                    "name": "ope_poe",
                    "url": "https://www.reddit.com/user/ope_poe"
                }
            ]
        },
        {
            "id": "1idxvhq",
            "url": "/r/ArtificialInteligence/comments/1idxvhq/china_announced_breaking_the_previous_record_of/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1idxvhq/china_announced_breaking_the_previous_record_of/",
            "title": "China announced breaking the previous record of 403 seconds for sustained fusion reaction at over 1,000 seconds on 1/23/25, about a month after the launch of their new AI",
            "content_html": "<p>Regardless of the information control within “DS”, the breakthrough is apparently monumental. One of the things we have to wonder is, if China launched “DS” for free, what kind of tech are they keeping behind closed doors?</p>\n<p>The link with this fusion breakthrough could be simply a coincidence, but the timing is extremely convenient. I think it’s possible they have far more advanced AI capabilities than they’re willing to disclose, and this could be the first of many huge breakthroughs that thrust them to the forefront of technology. What do you guys think?</p>\n<p>Physics World article on the fusion record:\nhttps://physicsworld.com/a/chinas-experimental-advanced-superconducting-tokamak-smashes-fusion-confinement-record/</p>",
            "date_published": "2025-01-30T21:20:33+00:00",
            "authors": [
                {
                    "name": "ZombroAlpha",
                    "url": "https://www.reddit.com/user/ZombroAlpha"
                }
            ]
        },
        {
            "id": "1icnay2",
            "url": "/r/ArtificialInteligence/comments/1icnay2/ai_being_forced_on_every_app_sucks/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1icnay2/ai_being_forced_on_every_app_sucks/",
            "title": "AI being forced on every app sucks",
            "content_html": "<p>This post was banned on r/unpopularopinion because I used the word “AI.” I didn’t realize Redditors weren’t able to have an opinion on that topic on that thread, and I find it disconcerting that that’s the case, but anyways, here’s what I tried to post there: </p>\n<p>I do not like AI being incorporated into every app and program I use on my phone and computer. </p>\n<p>I just had to update Microsoft Word and Adobe Reader, now I keep getting prompts to use the new AI tools to make my work “easier” for me. (I also have to get a new computer later this year because mine will be out of date soon even though it works fine.)</p>\n<p>I also just updated to the newest IOS on iPhone and opened up my guitar tabs app. It opened up with a questionnaire to “streamline my experience” and didn’t give me an option to cancel out of it. I just wanted to look up a tab and play a song but was forced to feed an algorithm to get to the service I pay for. </p>\n<p>There might be some ways this new technology will prove to be useful, but give me the choice to decide that for myself, because it doesn’t fit my needs. I’m getting ready to go back to a pen and pad to get avoid this. </p>",
            "date_published": "2025-01-29T06:04:24+00:00",
            "authors": [
                {
                    "name": "nowlan_shane",
                    "url": "https://www.reddit.com/user/nowlan_shane"
                }
            ]
        },
        {
            "id": "1ibxq2v",
            "url": "/r/ArtificialInteligence/comments/1ibxq2v/deepseek_is_a_blessing_for_europe/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ibxq2v/deepseek_is_a_blessing_for_europe/",
            "title": "DeepSeek is a blessing for Europe.",
            "content_html": "<p>Europe has long struggled to keep up with AI titans like the US and China, often held back by limited funding and fragmented innovation efforts. But Deepseek might just be the blessing we’ve been waiting for.</p>\n<p>If true, Deepseek shows that high-end AI doesn’t always require bottomless budgets. </p>\n<p>It’s a glimpse of hope that Europe can still develop AI models, without having to spent  billions in AI, and potentially carve its place in the global AI race.</p>",
            "date_published": "2025-01-28T09:20:22+00:00",
            "authors": [
                {
                    "name": "AlwaysNever22",
                    "url": "https://www.reddit.com/user/AlwaysNever22"
                }
            ]
        },
        {
            "id": "1ibdi9n",
            "url": "/r/ArtificialInteligence/comments/1ibdi9n/expert_needed_does_anyone_believe_6m_for_deepseek/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ibdi9n/expert_needed_does_anyone_believe_6m_for_deepseek/",
            "title": "Expert Needed: Does anyone believe $6M for DeepSeek?",
            "content_html": "<p>China's Communist Party (CCP) has a blatant history of lying and manipulating things for global PR and shock value. Does anyone actually believe this $6M number to develop DeepSeek?</p>\n<p>Can any AI pros here weigh in with expert thoughts? </p>",
            "date_published": "2025-01-27T16:42:23+00:00",
            "authors": [
                {
                    "name": "Explore1616",
                    "url": "https://www.reddit.com/user/Explore1616"
                }
            ]
        }
    ]
}