{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/artificialinteligence",
    "description": "The goal of the r/ArtificialIntelligence is to provide a gateway to the many different facets of the Artificial Intelligence community, and to promote discussion relating to the ideas and concepts that we know of as AI. These could include philosophical and social questions, art and design, technical papers, machine learning, where to find resources and tools, how to develop AI/ML projects, AI in business, how AI is affecting our lives, what the future may hold, and many other topics. Welcome.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/artificialinteligence.json",
    "icon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "favicon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "items": [
        {
            "id": "1chw1nw",
            "url": "/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/",
            "title": "AI won't take your job, people who know how to use AI will!\n",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/'>Reddit</a></caption><div><br></div><p>Hey People,</p>\n<p>I've seen a lot of anxiety lately about AI taking over our jobs. But let's be real, AI isn't the enemy - it's a tool, and like any tool, it's only as good as the person wielding it.</p>\n<p>Think about it: content writers who know how to use AI-powered research tools and language generators can produce high-quality content faster and more efficiently than ever before. </p>\n<p>Web developers who can harness the power of machine learning can build websites that are more intuitive and user-friendly. And data analysts who can work with AI to identify patterns and trends can make predictions and decisions that were previously impossible.</p>\n<p>The point is, AI isn't here to replace us - it's here to augment us. It's here to make us faster, smarter, and more productive. So, instead of fearing the robots, let's learn how to work with them. Let's upskill and reskill, and become the masters of our own AI-powered destinies.</p>\n<p>Remember, it's not the AI that's going to take your job - it's the person who knows how to use AI to do your job better, faster, and cheaper.</p>",
            "date_published": "2024-05-01T20:15:53+00:00",
            "authors": [
                {
                    "name": "skrt_pls",
                    "url": "https://www.reddit.com/user/skrt_pls"
                }
            ]
        },
        {
            "id": "1chpfjy",
            "url": "/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/",
            "title": "Google urges US to update immigration rules to attract more AI talent",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/'>Reddit</a></caption><div><br></div><p>The US could lose out on valuable AI and tech talent if some of its immigration policies are not modernized, Google says in a <a href=\"https://www.theverge.com/2024/5/1/24146053/google-ai-talent-immigration-schedule-a\">letter sent to the Department of Labor</a>. The company says the government must update Schedule A to include AI and cybersecurity and do so more regularly.</p>\n<p>If you want to stay ahead of the latest AI developments, <a href=\"https://smmry.tech/?utm_source=reddit\">take a look here</a>!</p>\n<p><strong>The Problem:</strong> The US immigration system isn't suited for the fast-paced tech industry, particularly AI.</p>\n<ul>\n<li>Schedule A, a list of pre-approved occupations lacking US workers, is outdated (not updated in 20 years) and doesn't include AI or cybersecurity.</li>\n<li>The PERM process for green cards can be lengthy, causing some talented individuals to leave the US during the wait.</li>\n</ul>\n<p><strong>Google's Recommendations:</strong> The US needs to adapt its policies to compete for global AI talent.</p>\n<ul>\n<li>Update Schedule A to include AI and cybersecurity professions.</li>\n<li>Regularly review and update the list using various data sources, including public feedback.</li>\n<li>Streamline the PERM process or offer alternative pathways for attracting AI specialists.</li>\n</ul>\n<p><strong>The Urgency:</strong> The US risks falling behind in AI development.</p>\n<ul>\n<li>There's a global shortage of AI talent, and other countries are actively attracting them.</li>\n<li>US companies struggle to find qualified AI engineers and researchers domestically.</li>\n<li>Losing this talent pool could hinder US competitiveness in the AI race.</li>\n</ul>\n<p><a href=\"https://www.theverge.com/2024/5/1/24146053/google-ai-talent-immigration-schedule-a\">Source (The Verge)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">AI-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2024-05-01T15:47:47+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1ch89bb",
            "url": "/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/",
            "title": "Why don't we just let AI take over the world so we can sit back and relax? Explain to me like I'm 5.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/'>Reddit</a></caption><div><br></div><p>So I know. This probably sounds like an INCREDIBLY stupid question. But I seriously want to know. Because I would love to just sit around and not have a care in the world for getting things done because AI does absolutely everything for me. Even to the point where I don't have to dress myself and robots dress me. And brush my teeth. And cook breakfast. And do everything in the universe so no human has to work.</p>",
            "date_published": "2024-05-01T00:15:38+00:00",
            "authors": [
                {
                    "name": "caranddogfan",
                    "url": "https://www.reddit.com/user/caranddogfan"
                }
            ]
        },
        {
            "id": "1cgw8vb",
            "url": "/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/",
            "title": "Which jobs won’t be replaced by AI in the next 10 years?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/'>Reddit</a></caption><div><br></div><p>Hey everyone, I’ve been thinking a lot about the future of jobs and AI. </p>\n<p>It seems like AI is taking over more and more, but I'm curious about which jobs you think will still be safe from AI in the next decade. </p>\n<p>Personally, I feel like roles that require deep human empathy, like therapists, social workers, or even teachers might not easily be replaced. </p>\n<p>These jobs depend so much on human connection and understanding nuanced emotions, something AI can't fully replicate yet. </p>\n<p>What do you all think? Are there certain jobs or fields where AI just won't cut it, even with all the advancements we're seeing? </p>",
            "date_published": "2024-04-30T15:53:01+00:00",
            "authors": [
                {
                    "name": "skrt_pls",
                    "url": "https://www.reddit.com/user/skrt_pls"
                }
            ]
        },
        {
            "id": "1cgnb8e",
            "url": "/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/",
            "title": "Cycls - A python framework for AI chatbot deployment",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/'>Reddit</a></caption><div><br></div><p>Hello,</p>\n<p>We are excited to introduce Cycls, our new Python framework designed to streamline and simplify the deployment of AI applications. With Cycls, you can launch your chatbot with just a few lines of code, making it accessible via a public URL complete with a chat UI. This tool is perfect for developers looking to rapidly deploy and iterate on their AI projects, integrating seamlessly with popular Python libraries and APIs such as those provided by OpenAI.</p>\n<p>Having spent considerable time exploring LLMs and chatbots, we believe Cycls offers a transformative solution by significantly lowering the barriers to entry in this space. The framework not only facilitates the development process but also alleviates common headaches associated with continuous deployment and feature integration. </p>\n<p>We are currently inviting users to participate in our private beta. By joining the waitlist, you will gain early access to Cycls and can contribute to refining its features based on your specific needs and experiences. We are eager to hear your thoughts on what makes a framework useful and how Cycls can better serve the developer community.</p>\n<p>For those interested in joining the beta and helping shape the future of AI application deployment, please sign up here: <a href=\"https://cycls.typeform.com/waitlist/\">https://cycls.typeform.com/waitlist/</a> </p>\n<p>Thank you for your interest and enthusiasm. We look forward to your feedback. </p>",
            "date_published": "2024-04-30T07:55:22+00:00",
            "authors": [
                {
                    "name": "moonbunR",
                    "url": "https://www.reddit.com/user/moonbunR"
                }
            ]
        },
        {
            "id": "1ceaftk",
            "url": "/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/",
            "title": "What's the most practical thing you have done with ai?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/'>Reddit</a></caption><div><br></div><p>I'm curious to see what people have done with current ai tools that you would consider practical. Past the standard image generating and simple question answer prompts what have you done with ai that has been genuinely useful to you?</p>\n<p>Mine for example is creating a ui which let's you select a country, start year and end year aswell as an interval of months or years and when you hit send a series of prompts are sent to ollama asking it to provide a detailed description of what happened during that time period in that country, then saves all output to text files for me to read. Verry useful to find interesting history topics to learn more about and lookup.</p>",
            "date_published": "2024-04-27T09:25:42+00:00",
            "authors": [
                {
                    "name": "CodeCraftedCanvas",
                    "url": "https://www.reddit.com/user/CodeCraftedCanvas"
                }
            ]
        },
        {
            "id": "1cdupq0",
            "url": "/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/",
            "title": "Experience Building an AI-led Anonymous Knowledge Sharing Platform",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/'>Reddit</a></caption><div><br></div><p>This past weekend, I built <a href=\"https://yaknow.ai\">yaKnow.ai</a>, an anonymous knowledge-sharing platform facilitated by AI agents at a hackathon. You pick a topic and speak with an AI agent, which serves as an effective sounding board.</p>\n<p>I’ve been part of online communities but always felt something was missing. Too often, I find myself holding back from expressing my true thoughts or struggling to find the words to convey ideas. That’s why I built yaKnow.<br />\nWhen my friends and I tried it, we found it liberating to speak our minds. It felt great to express half-baked ideas safely and refine them with an AI.<br />\nInitially, I decided to focus on a limited number of topics (e.g., What’s the most overrated AI startup? What’s the best city for AI?). The initial conversations have been eye-opening.; Here are some snippets on the over-rated startup discussion.   </p>\n<p>On Perplexity </p>\n<blockquote>\n<p>They claim their tech will 'make Google dance,' which is a bold statement. But when I looked closer, their service seems to just mimic Google.</p>\n</blockquote>\n<p>&#x200B;</p>\n<blockquote>\n<p>I've been playing around with Perplexity lately, and I've got to say, it's a total game-changer. The way it handles search queries is just miles aheadof what Google is doing. I mean, don't get me wrong, Google is still the big dog in the search world, but I think they're going to start feeling the heat from startups like Perplexity.</p>\n</blockquote>\n<p>On Devin (Software Engineering Startup)</p>\n<blockquote>\n<p>Honestly, I'm not that impressed. It looks like they just slapped a new interface on top of existing AI models and called it a day.</p>\n</blockquote>\n<p>I’d like to invite you to try it out, no login is required and all contributions are anonymous. Here’s the link: <a href=\"https://yaknow.ai\">yaKnow.ai</a>  </p>\n<p>Perhaps, I will do an analysis of the new contributions and share the results in a few days. Can’t wait to hear what you all think about it</p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-26T19:50:10+00:00",
            "authors": [
                {
                    "name": "buckbuckyyy",
                    "url": "https://www.reddit.com/user/buckbuckyyy"
                }
            ]
        },
        {
            "id": "1ccwx35",
            "url": "/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/",
            "title": "AI can tell your political affiliation just by looking at your face",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/'>Reddit</a></caption><div><br></div><p>A study recently published in the peer-reviewed American Psychologist journal claims that a combination of facial recognition and artificial intelligence technology can <a href=\"https://gizmodo.com/ai-can-tell-your-political-affiliation-just-by-looking-1851430714\">accurately assess a person’s political orientation</a> by simply looking at that person’s blank, expressionless face.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">take a look here</a>.</p>\n<p><strong>Key findings:</strong></p>\n<ul>\n<li>\n<p>A new study suggests AI with facial recognition can predict your political views based on a neutral face, even excluding age, gender, and ethnicity.</p>\n</li>\n<li>\n<p>Researchers identified potential physical differences between liberals (smaller lower faces) and conservatives (larger jaws), but emphasize complex algorithms, not just these features, drive the predictions.</p>\n</li>\n<li>The study raises concerns about AI being used to target political messaging and the potential for misuse of facial recognition technology.</li>\n<li>This research highlights the ability of AI to analyze physical characteristics and potentially link them to personal beliefs.</li>\n</ul>\n<p><a href=\"https://gizmodo.com/ai-can-tell-your-political-affiliation-just-by-looking-1851430714\">Source (Gizmodo)</a></p>\n<p>Link to study <a href=\"https://awspntest.apa.org/fulltext/2024-65164-001.html\">here</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-25T17:28:57+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1cc04x8",
            "url": "/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/",
            "title": "How AI already changed my life",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/'>Reddit</a></caption><div><br></div><p>I feel like most of the public is not at all aware what AI already can do. They just think like:\"Oh yea AI, you can make cute pics with it\" Or the youngsters using it to swap out faces of people. </p>\n<p>But most people do not realize it can already improve your life in a big way. All you gotta do is ... ask AI :P </p>\n<p>So to further explain what it actually did for me you need to know a lil bit of my background first. So I am kinda a guy which in RPG would you call a jack of all traits in the field of IT but master of none. </p>\n<p>I cannot code or program anything, but I have enough knowledge to make use of Wordpress to start a website. If there were problems with the code in my wordpress or when I messed something up I was kinda screwed. I remember it taking weeks for me to repair kinda simple problems, or sometimes it was just above my capability, I had not enough knowledge to fix it. I even remember paying a guy at Fiverr to fix some programming problem. </p>\n<p>I was also a very basic linux users, just barely able to install it, not using custom partitions since I had no clue how. I have had multiple instances where something in linux broke, which I could not fix and ended up reinstalling the entire system again, wasting a lot of time. These are even things like black screen caused by nvidia driver issues, which is easily fixed if you know how. </p>\n<p><strong>Ok that was then. So lets go ahead and see what my capabilities are now shall we ;)</strong> </p>\n<p>So with the help of AI I have fixed complex issues on my linux system. And by doing a lot of commands in terminals, even though I just copied stuff from the AI, it also learned me a lot of commands. I can now perform a lot of commands in terminals I couldnt before. </p>\n<p>That was just the beginning though ;) Once I understood how powerful AI can really be, I tried to seek its and mine limits of what I was now able to do. </p>\n<p>Where I at first had trouble installing a new OS like linux, I now have a triple boot system with full disk encryption (because its cool) :P running windows, and 2 different linux distros. All with a custom made Grub launcher with a cool theme. </p>\n<p>I still cannot program really as I do not know any programming language, but I was able to create several programs with the help of AI! I never thought this to be possible, me creating my own programs. It was still not easy, since I did not even know where to begin, but AI told me all I needed to know. Practical things like which program do I use to type the code in? How do I save the file?</p>\n<p>I even tried making my own videogame which I think I could do, but I need to learn a lot more to do that. Since I will also need to learn something like stable diffusion to generate visual content for that game. This is more something for the long run though, I feel I need to learn more first. </p>\n<p>The AI makes me feel so confident now to tackle all IT problems facing me. Although I do admit I do not always know what I am doing exactly. </p>\n<p>I just feel it opened up a whole new world for me. Its so cool I can now create entire programs, like right now I am editing a GUI in Qt designer. I never even knew this existed, but AI told me about it and now im using it. </p>\n<p>Another thing I find cool about AI is that rarely sells me a:\"No we cant do that\". It does not really matter how complex my question is, it always knows of a way to do something. </p>\n<p>Btw this is pretty much all done with chatGPT 3.5 free version. I dont even know how good it can really be.  </p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-24T14:49:41+00:00",
            "authors": [
                {
                    "name": "Anakhsunamon",
                    "url": "https://www.reddit.com/user/Anakhsunamon"
                }
            ]
        },
        {
            "id": "1c87j6c",
            "url": "/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/",
            "title": "DARPA’s AI test pilot successfully flew a dogfight against a human",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/'>Reddit</a></caption><div><br></div><p>An <a href=\"https://arstechnica.com/cars/2024/04/darpas-ai-test-pilot-successfully-flew-a-dogfight-against-a-human/\">AI test pilot has successfully flown a jet fighter</a> in dogfights against human opponents. It's the latest development for DARPA's Air Combat Evaluation program, which is trying to develop aerospace AI agents that can be trusted to perform safely.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">look here first</a>.</p>\n<p><strong>Key points:</strong></p>\n<ul>\n<li>DARPA's Air Combat Evaluation program successfully tested an AI pilot in dogfights against human opponents using an F-16 simulator aircraft.</li>\n<li>The X-62A VISTA, a modified F-16, was used for the tests due to its ability to simulate various flight characteristics.</li>\n<li>The agency instead wants a machine-learning agent that can safely fly a real aircraft autonomously, with no violations of training rules.</li>\n</ul>\n<p><a href=\"https://arstechnica.com/cars/2024/04/darpas-ai-test-pilot-successfully-flew-a-dogfight-against-a-human/\">Source (Ars Technica)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-19T20:49:23+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1c773qf",
            "url": "/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/",
            "title": "Will AI kill off social media?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/'>Reddit</a></caption><div><br></div><p>At some point the amount of AI generated content will surpass human generated content.  It may have already.  Is that a good or bad thing?  If everything is fake, what’s the point of watching?  Will it kill off the influencers and go back to just being a way to communicate with friends?  The social media bubble has been expanding hugely for the last decade.  Will this pop it?</p>",
            "date_published": "2024-04-18T16:05:50+00:00",
            "authors": [
                {
                    "name": "ConclusionDifficult",
                    "url": "https://www.reddit.com/user/ConclusionDifficult"
                }
            ]
        },
        {
            "id": "1c64m8c",
            "url": "/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/",
            "title": "Tech exec predicts ‘AI girlfriends’ will create $1B business: ‘Comfort at the end of the day’",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/'>Reddit</a></caption><div><br></div><p>Source: <a href=\"https://www.yahoo.com/tech/tech-exec-predicts-ai-girlfriends-181938674.html\">https://www.yahoo.com/tech/tech-exec-predicts-ai-girlfriends-181938674.html</a></p>\n<p>Key Points:</p>\n<p>1) <strong>AI Companions as a Billion-Dollar Industry</strong>: Greg Isenberg predicts the growth of AI relationship platforms into a billion-dollar market, akin to Match Group's success.</p>\n<p>2) <strong>Personal Testimony</strong>: A young man in Miami spends $10,000/month on AI girlfriends, enjoying the ability to interact with AI through voice notes and personal customization.</p>\n<p>3) <strong>AI Interaction as a Hobby</strong>: The man likes interacting with AI companions to playing video games, indicating a casual approach to digital relationships.</p>\n<p>4) <strong>Multiple Platforms</strong>: The individual uses multiple AI companion websites offer immersive and personalized chat experiences.</p>\n<p>5) <strong>Features of AI Companions</strong>: These platforms allow users to customize AI characters' likes and dislikes, providing a sense of comfort and companionship.</p>\n<p>6) <strong>Market Reaction and User Engagement</strong>: Platforms such as Replika, Romantic AI, and Forever Companion offer varied experiences from creating ideal partners to engaging in erotic roleplay.</p>\n<p>7) <strong>Survey Insights</strong>: A survey reveals that many Americans interact with AI chatbots out of curiosity, loneliness, or without realizing they are not human, with some interactions leaning towards eroticism.</p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-17T08:26:55+00:00",
            "authors": [
                {
                    "name": "BiggerGeorge",
                    "url": "https://www.reddit.com/user/BiggerGeorge"
                }
            ]
        },
        {
            "id": "1c5l5i7",
            "url": "/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/",
            "title": "Claude 3 may have saved my life",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/'>Reddit</a></caption><div><br></div><p>For the last 2 years I've had heart problems brought on by excessively poor sleep.  If I got a terrible night (or week) of sleep, my heartbeat would be irregular and fast.  </p>\n<p>I told this to the PA at my doctor's office, and they looked at me like I had 3 heads.  I got slapped with an anxiety disorder, as they were convinced I was imagining the correlation.  When I (anxiously) tried to get them to come up with another explanation, I got prescribed SSRI's for the anxiety.  </p>\n<p>I was talking with Claude 3 about it, and poor sleep over a long period can cause poor insult sensitivity.  Which can cause low blood sugar.  Which (you guessed it) can cause fast/irregular heartbeat.  This also explains 3 other medical conditions that I have (Non-alcoholic fatty liver, high buildup of plaque on my arteries, extreme difficulty in losing weight).  </p>\n<p>Knowing that my heart issues are from low blood sugar is a game changer in trying to loose weight.  For both diet and exercise.  Claude 3 very legitimately has saved my life, where traditional medicine has failed.</p>",
            "date_published": "2024-04-16T16:57:34+00:00",
            "authors": [
                {
                    "name": "Mackntish",
                    "url": "https://www.reddit.com/user/Mackntish"
                }
            ]
        },
        {
            "id": "1c4lzqk",
            "url": "/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/",
            "title": "Claude is now miles ahead of chatgpt. The free version of claude is giving much better answers than chatgpt 4 Pro version",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/'>Reddit</a></caption><div><br></div><p>Telling this as chatgpt pro subscriber since the beginning. Have finally cancelled it. Chatgpt image quality is also years behind mid journey</p>",
            "date_published": "2024-04-15T13:17:48+00:00",
            "authors": [
                {
                    "name": "Southern_Opposite747",
                    "url": "https://www.reddit.com/user/Southern_Opposite747"
                }
            ]
        },
        {
            "id": "1c3wb3x",
            "url": "/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/",
            "title": "AI outperforms humans in providing emotional support",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/'>Reddit</a></caption><div><br></div><p>A new study suggests that <a href=\"https://www.earth.com/news/ai-outperforms-humans-providing-emotional-support/\">AI could be useful in providing emotional support</a>. AI excels at picking up on emotional cues in text and responding in a way that validates the person's feelings. This can be helpful because AI doesn't get distracted or have its own biases.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">look here first</a>.</p>\n<p><strong>Key findings:</strong></p>\n<ul>\n<li>AI can analyze text to understand emotions and respond in a way that validates the person's feelings. This is because AI can focus completely on the conversation and lacks human biases.</li>\n<li>Unlike humans who might jump to solutions, AI can focus on simply validating the person's emotions. This can create a safe space where the person feels heard and understood</li>\n<li>There's a psychological hurdle where people feel less understood if they learn the supportive message came from AI. This is similar to the uncanny valley effect in robotics.</li>\n<li>Despite the \"uncanny valley\" effect, the study suggests AI has potential as a tool to help people feel understood. AI could provide accessible and affordable emotional support, especially for those lacking social resources.</li>\n</ul>\n<p><a href=\"https://www.earth.com/news/ai-outperforms-humans-providing-emotional-support/\">Source (Earth.com)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-14T15:34:16+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1c3pqk6",
            "url": "/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/",
            "title": "We live in unbelievable era, i built an android app, and i’ve never coded.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/'>Reddit</a></caption><div><br></div><p>We live in unbelievable era, i built an android app, and i’ve never coded</p>\n<p>I can’t believe this is actually real and working\nIn a span of 5 days, from never writing and running a code in my life, to build a functional android app that does a very good job\nAnd when prompted, it made the app look very good too</p>\n<p>HOW IS THIS REAL!!!</p>\n<p>By the way i used claude opus</p>\n<p>And It’s a simple app that solves a huge problem on my business</p>\n<p>So i have a tailor store, any piece that we tailor goes through 5 steps before it’s given to the customer And when we have a lot of orders there are pieces that take longer than expected, and sometimes we don’t know where a piece exactly is and on what step</p>\n<p>We have a solution to have the receipt number as barcode on every piece, and if it passes any step we need to scan the barcode indicating that it’s done from that step</p>\n<p>We are running low on budget so instead of having 5 computers on every step that will be connected with barcode scanners, i thought about making an android app ( since you can get cheep android phones ) and have one on every step</p>\n<p>And the app simply, first you choose on what step you are at, then read the barcodes, then submit</p>\n<p>After that the info will be written in a google spreadsheet, and in that, we track how long a piece took from going on one step to another And know exactly where every piece is And where is the bottlenecks and how to optimize making as many pieces as we can</p>",
            "date_published": "2024-04-14T09:39:14+00:00",
            "authors": [
                {
                    "name": "bhk0_",
                    "url": "https://www.reddit.com/user/bhk0_"
                }
            ]
        },
        {
            "id": "1c22oli",
            "url": "/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/",
            "title": "The future of AI will run on Amazon, company CEO says",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/'>Reddit</a></caption><div><br></div><p>Less than two weeks after rolling back one of Amazon’s most ambitious artificial intelligence projects — a cashierless checkout technology called Just Walk Out — CEO Andy Jassy expressed confidence that the future of the company’s biggest breakthroughs for customers will come from generative AI.  </p>\n<p>Jassy said in an annual shareholder letter published Thursday that he is “optimistic that much of this world-changing AI will be built on top of AWS,” or Amazon Web Services, the company’s cloud computing business that many of the world’s digital businesses already rely on to run.  </p>\n<p>He elucidated the company’s strategy on generative AI, describing how it is focused less on building consumer-facing applications to compete directly with popular tools like OpenAI’s ChatGPT than on building the underlying “foundational” AI models and selling them to enterprise customers, which Jassy said already include Delta Air Lines, Siemens and Pfizer.   </p>\n<p>Seeing what they've done with AWS, I don't think this is far-fetched. They tried the cashier-less tech (consumer-facing) and it didn't work out, and they've made the decision to stick to one of their core competences: enterprise software. Will be interesting to see this, long-term.  </p>\n<p>https://www.washingtonpost.com/technology/2024/04/11/amazon-ai/</p>",
            "date_published": "2024-04-12T07:01:00+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1c0igy9",
            "url": "/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/",
            "title": "Any AI chatbot recommendation? (Updated list)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/'>Reddit</a></caption><div><br></div><p>(<strong>Updated in 04/10 2024)</strong></p>\n<p><strong>For the convenience of my friends, I made a name list below, refer the post from</strong> r/chatbots<strong>. If you want to add more to the list. Please leave a comment:</strong></p>\n<p><strong>SoulFun:</strong> Free trial, great quality of LLM, 20+ lifelike pre-trained and well-designed characters (including female/male/anime). Free for NSFW chat. Need payment for NSFW images. 3000\\~4000 words of memory.</p>\n<p><strong>Faraday.dev:</strong> Uncensored local models with immersive text adventures</p>\n<p><strong>Poly.a</strong>i: With careful character predevelopment you can get a decent memory/chat going</p>\n<p><strong>Avatar.One:</strong> Fully 3D AI chatbot where you get video and image selfies. Its automated so you can trigger emotes in the chat itself</p>\n<p><strong>Erogen</strong>: Beautiful interface with nice nsfw chatbots</p>\n<p><strong>fams.ai</strong>: Decent chat, memory, pics. What I dont like - free content limited</p>\n<p><strong>Kindroid</strong>: Unfiltered, good memory. Selfies, phone calls, you can send pics of yourself (Paid). Good consutomer serive. <strong>Cons</strong>:</p>\n<p><strong>rosytalkai:</strong>  unique LLM offers chatting experience/picture generation/voice calls/Free trials</p>\n<p><strong>Chub Venus</strong>: <strong>Pros</strong>: Long and detailed contexts. Lots of attractive characters. <strong>Cons</strong>: It's hard to set up the API Key.</p>\n<p><strong>Poe ai:</strong> Using AI model from Claude or GPT, but need to learn how to jailbreak to access NSFW contents. Free messages every day. Very good memory and smart chatbots</p>\n<p>PlayMe App: Multiple AI models, most of them are safe for work. Free messages and voices, and pics. Fun conversations, especially for some niches.</p>\n<p><strong>Sakura FM: Prons:</strong> Unlimited free messages. Multiple AI models. Message edition and continue generation. Decent memory. <strong>Needs</strong>: Better content consistency. Less repetition. More actions or dialogue. More personalities.</p>\n<p><strong>nsfwcharacterai.com: Pros:</strong> 50 free messages daily/Detailed chat/unlimited contents/regeneration doesn’t cost your count/easy registration. <strong>Cons</strong>: Bots can be glitchy at times/Sometimes the bot will lead write the story for you/the filter sometimes works very well.</p>\n<p><strong>messengerx.io:</strong> <strong>Pros</strong>: Good SFW/NSFW image generations/Good characters and memory/You can earn money with your own character. <strong>Cons</strong>: Needs better UI.</p>\n<p><strong>RoChat</strong>: Using GPT4 and Claude 3, plus a pretty robust character creator.</p>\n<p><strong>Digi:</strong> 3D animation, it looks great. Not sure whether they have NSFW. They have a very nice Discord community.</p>\n<p><strong>Janitor</strong>: Free to use, massive number of Characters. No generated images. 6000 words of memory.</p>\n<p><strong>MySentientAI</strong>: Collaborating with real streamers (such as Amouranth) and making AI copies of them</p>\n<p><strong>AIdungeon</strong>: A text-based adventure-story game.</p>\n<p><strong>GetIdol.com:</strong> Realistic characters personalities</p>\n<p><strong>Chai ai:</strong> 70 Free messages/3 hours, no queue, good responses</p>\n<p><strong>easyerp ai</strong>: 60+tags of characters</p>\n<p><strong>Cutechat.ai:</strong> Looks like a real chat platform</p>\n<p><strong>Yodayo</strong>: Great for hentai fans to chat with anime characters</p>\n<p><strong>Chai</strong>: It seems like only supports mobile phone apps</p>\n<p><strong>Haven chat</strong>: Characters have strong personalities</p>\n<p><strong>FantasyGF</strong>: Realistic NSFW AI girlfriend platforms</p>\n<p><strong>Juicy AI</strong>: 7000+ characters. Long and descriptive contents</p>\n<p><strong>Dopple.ai</strong>: Another Free NSFW AI chatbots</p>\n<p><strong>Gptgirlfriend:</strong> 25 000+ NSFW Characters including anime and realistic ones</p>\n<p><strong>Nextpart.ai</strong>: Supports voice chat, scene generation, and crypto payments</p>\n<p><strong>Privee AI</strong>: Different models available 70b to gpt4. Images Generation. Simple and advanced creation mode.</p>\n<p><strong>SpicyChat</strong> : Free, but need to queue. You can pay to skip the queue. No generated images. Around 2000 words of memory</p>\n<p><strong>CandyAI</strong> : Good quality NSFW photos but you need to pay. Average level of chat.</p>\n<p><strong>MuahAI</strong> : Text+Image+phone call (US number only). Free for chatting, payment for image and phone calls</p>",
            "date_published": "2024-04-10T10:38:34+00:00",
            "authors": [
                {
                    "name": "goki7",
                    "url": "https://www.reddit.com/user/goki7"
                }
            ]
        },
        {
            "id": "1bztsl6",
            "url": "/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/",
            "title": "People coming up with safe words for AI",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/'>Reddit</a></caption><div><br></div><p>Saw a post earlier of a family coming up with a safe word in case the person they’re talking to on the phone has the voice of a family member but sounds sketchy. </p>",
            "date_published": "2024-04-09T14:38:49+00:00",
            "authors": [
                {
                    "name": "AcceptableAd7478",
                    "url": "https://www.reddit.com/user/AcceptableAd7478"
                }
            ]
        },
        {
            "id": "1bqv9nv",
            "url": "/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/",
            "title": "Microsoft and OpenAI planning $100 billion data center project, the Information reports",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/'>Reddit</a></caption><div><br></div><p>https://www.reuters.com/technology/microsoft-openai-planning-100-billion-data-center-project-information-reports-2024-03-29/</p>",
            "date_published": "2024-03-29T17:40:52+00:00",
            "authors": [
                {
                    "name": "BilgeYamtar",
                    "url": "https://www.reddit.com/user/BilgeYamtar"
                }
            ]
        },
        {
            "id": "1bqjrjo",
            "url": "/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/",
            "title": "Women’s faces stolen for AI ads selling ED pills and praising Putin",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/'>Reddit</a></caption><div><br></div><p>A 27-year old content creator was the victim of deepfake, where one of her videos was manipulated to make it look as if she was selling ED pills. This is the latest in a series of AI-related identity theft incidents, a trend that has been on the rise, affecting everyday people, and some celebrities, like Elon Musk, Taylor Swift, and MrBeast.</p>\n<p>https://www.washingtonpost.com/technology/2024/03/28/ai-women-clone-ads/</p>",
            "date_published": "2024-03-29T08:03:17+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1bpfx56",
            "url": "/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/",
            "title": "Sora in 10 years. The possibilities are endless and Hollywood is fucked.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/'>Reddit</a></caption><div><br></div><p>Imagine this: </p>\n<p>You want to create a photorealistic feature length movie in your living room on a rainy weekend, so you open up Sora or one of its many competitors and create a cast with their own highly unique physical and personality traits. you give each of them a script and can single out to edit individual scenes, writing; \"I want Joe to have a slightly more puzzled look on his face as Jessica speaks to him. I also want a touch of anger to be in her voice.\"</p>\n<p>No destination or set piece is out of reach nor constrained by budget. Each 'actor' and their performance can be modified to the most minute detail. The possibilities are endless and Hollywood is fucked.</p>",
            "date_published": "2024-03-27T23:03:16+00:00",
            "authors": [
                {
                    "name": "CH4LOX2",
                    "url": "https://www.reddit.com/user/CH4LOX2"
                }
            ]
        },
        {
            "id": "1bp74ea",
            "url": "/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/",
            "title": "Amazon spends $2.75 billion on AI startup Anthropic in its largest venture investment yet",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/'>Reddit</a></caption><div><br></div><p>https://www.cnbc.com/amp/2024/03/27/amazon-spends-2point7b-on-startup-anthropic-in-largest-venture-investment.html</p>",
            "date_published": "2024-03-27T17:08:40+00:00",
            "authors": [
                {
                    "name": "BilgeYamtar",
                    "url": "https://www.reddit.com/user/BilgeYamtar"
                }
            ]
        },
        {
            "id": "1boxdra",
            "url": "/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/",
            "title": "Meta CEO, Mark Zuckerberg, is directly recruiting AI talent from Google's DeepMind with personalised emails.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/'>Reddit</a></caption><div><br></div><p>Meta CEO, Mark Zuckerberg, is attempting to recruit top AI talent from Google's DeepMind (their AI research unit). Personalised emails, from Zuckerberg himself, have been sent to a few of their top researchers, according to a report from The Information, which cited individuals that had seen the messages. In addition to this, the researchers are being hired without having to do any interviews, and, a previous policy which Meta had in place - to not offer higher offers to candidates with competing job offers - has been relaxed.  </p>\n<p>Zuckerberg appears to be on a hiring spree to build Meta into a position of being a dominant player in the AI space.<br />\nhttps://www.businessinsider.com/mark-zuckerberg-recruiting-google-ai-talent-with-personal-emails-2024-3</p>",
            "date_published": "2024-03-27T09:04:51+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1bnl4oc",
            "url": "/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/",
            "title": "Chatbots more likely to change your mind than another human, study says",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/'>Reddit</a></caption><div><br></div><p><strong>New research indicates that personalized chatbots, like those based on GPT-4, are more effective at persuading people in debates than humans are</strong>, particularly when they utilize personal information about their debate opponents.</p>\n<p><strong>Quick recap:</strong></p>\n<ul>\n<li>Personalized chatbots using GPT-4 technology demonstrated an <strong>81.7% increase</strong> in persuading participants to agree with their viewpoints compared to human debaters.</li>\n<li>The study highlighted the <strong>effectiveness</strong> of chatbots in using basic personal information (such as age, gender, and race) to craft <strong>tailored arguments</strong> that resonate more deeply with individuals.</li>\n<li>There's a potential risk of malicious use of detailed digital profiles, including social media activities and purchasing behaviors, to enhance chatbots' persuasive capabilities.</li>\n<li>Researchers suggest online platforms should employ AI-driven systems to present fact-based counterarguments against misinformation, addressing the challenges posed by persuasive AI in sensitive contexts.</li>\n</ul>\n<p><a href=\"https://the-decoder.com/a-personalized-chatbot-is-more-likely-to-change-your-mind-than-another-human-study-finds/\">Source (The Decoder)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, <a href=\"http://techpresso.xyz/\">you’ll love my newsletter</a>. It’s already being read by 90,000+ professionals from OpenAI, Google, Meta…</p>",
            "date_published": "2024-03-25T18:35:18+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "1bnaald",
            "url": "/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/",
            "title": "As Inflection absorbs Microsoft, the PayPal Mafia quietly make a bet on their own AI.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/'>Reddit</a></caption><div><br></div><p>Last week, it was announced Microsoft took most of Inflection's employees in a $650M deal;  essentially leading to a further concentration of power in AI in the hands of Microsoft. So now Microsoft owns not just 49% of OpenAI but has now absorbed another major AI lab.</p>\n<p>Of course there's still Mistal, Anthropic, and Google - but I think one thing that's gone under the radar that came out in the past few weeks was the announcement of <a href=\"https://Mindy.com\"><strong>Mindy</strong></a>. Which was started by Yu Pan, a of the Cofounder and of PayPal and also was also employee #1 at YouTube. They're also backed by Roelof Botha (former CFO of PayPal) and Peter Thiel (former CEO of PayPal). The concept of their AI is that it's entirely email based and is aiming to be a competitor to google in the sense that it's indexed the entire Internet and can perform real time internet scrapes on any site (whether it's Ebay, LinkedIn, etc.).</p>\n<p>Since the inflection news, I've been seeing this notion that Microsoft has <strong><em>completely</em></strong> won the AI race but I don't think it's entirely accurate at all. There's obviously all the aforementioned labs, but I believe there are still numerous innovate AI labs like Mindy and many more that will emerge over the coming year that will threaten incumbents because they take fundamentally different product approaches and research approaches towards AGI. Curious what people think.</p>\n<p><strong>Edit:</strong> Yes I know I messed up the title. I meant to say made...</p>",
            "date_published": "2024-03-25T10:27:17+00:00",
            "authors": [
                {
                    "name": "shamefulgallantry10",
                    "url": "https://www.reddit.com/user/shamefulgallantry10"
                }
            ]
        },
        {
            "id": "1bm669a",
            "url": "/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/",
            "title": "It's a bit demented that AI is replacing all the jobs people said could not be replaced first. ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/'>Reddit</a></caption><div><br></div><p>Remember when people said healthcare jobs were safe? Well nvidia announced a new AI agent that supposedly can outperform nurses and costs only $9 per hour. </p>\n<p>Whether this is actually possible or not to replace nurses with AI is a bit uncertain, but I do think it's a little bit demented that companies are trying to replace all the jobs people said could not be replaced, first. Like artist and nurse, these are the FIRST jobs to go. People said they would never get replaced and it requires a human being. They even said all kinds of BS like \"AI will give people more time to do creative work like art\". That is really disengenuous, but we already know it's not true. The exact opposite thing is happening with AI.</p>\n<p>On the other hand, all the petty/tedious jobs like warehouse and factory jobs and robotic white collar jobs are here for the foreseeable future. People also said that AI was going to be used only to automate the boring stuff. </p>\n<p>So everything that's happening with AI is the exact demented opposite of what people said. The exact worse thing is happening. And it's going to continue like this, this trend is probably only get worse and worse. </p>",
            "date_published": "2024-03-23T23:24:30+00:00",
            "authors": [
                {
                    "name": "EuphoricPangolin7615",
                    "url": "https://www.reddit.com/user/EuphoricPangolin7615"
                }
            ]
        },
        {
            "id": "1bl7s2o",
            "url": "/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/",
            "title": "I watched Sam Altman’s most recent 2-hour interview at Lex Fridman - here are the key takeaways we all should know",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/'>Reddit</a></caption><div><br></div><p>Sam was interviewed at the Lex Fridman podcast this week. It’s a long interview so I thought to share the 10 key takeaways I noted down from listening to the guy. You can be for him or against him - but you can’t deny he’s one of the most important people central to the forthcoming AI normal! Hope this is insightful for people who are interested :)  </p>\n<p><strong><em>1. People who create valuable data deserve some way to be compensated for the use of it 💸</em></strong></p>\n<p>The remaining question is the economic model that will enable it. A good analogy is the transition from CDs to Napster to Spotify for music. Or the transition from Movies to YouTube for video. Is there a similar economic model in the future for data?</p>\n<p>⏳ 40:16</p>\n<p><strong><em>2.</em></strong> <strong><em>Bill Gates couldn’t imagine that we’d someday need gigabytes of memory in a computer 💾</em></strong></p>\n<p>In the same way, we can’t imagine today how or why LLMs would need billions in context length, but it may still happen. (for context: an LLM with a 1-billion context length means it can process and understand \\~2 million document pages for <em>every</em> query)</p>\n<p>⏳ 51:13</p>\n<ol>\n<li><strong><em>“I want to give ChatGPT the ability to retain memories” 📝</em></strong></li>\n</ol>\n<p>Imagine a model that gets to know you and gets more useful to you over time. This may well be a use-case for the billion-context length LLM highlighted above.</p>\n<p>⏳ 55:33</p>\n<ol>\n<li><strong><em>Compute will be the currency of the future. 💲</em></strong></li>\n</ol>\n<p>And Sam believes it will be the most precious commodity in the world.</p>\n<p>⏳ 1:09:55</p>\n<ol>\n<li><strong><em>The “energy problem” will be answered by nuclear fusion ⚛</em></strong></li>\n</ol>\n<p>With the vast amount of compute that the world will demand in the future, we will need tons of energy to power everything. Sam believes nuclear fusion is the best way to address this problem.</p>\n<p>⏳ 1:11:29</p>\n<ol>\n<li><strong><em>Q-star likely exists (but we won’t talk about that) ⭐</em></strong></li>\n</ol>\n<p>Lex of course asked about Q-star, but Sam didn’t deny its existence - and just said “we are not ready to talk about that”.</p>\n<p>⏳ 1:02:36</p>\n<ol>\n<li><strong><em>Programmers won’t be obsolete 👩🏻‍💻</em></strong></li>\n</ol>\n<p>but it will likely be different to how programming is now. And anyway, Sam argues that no one really does pure coding - as most programmers use pre-existing packages/technologies/software. Leveraging an LLM to assist with coding is similar in that way.</p>\n<p>⏳ 1:29:50</p>\n<ol>\n<li><strong><em>Overtaking Google is boring 🔍</em></strong></li>\n</ol>\n<p>OpenAI doesn’t want to make a better search engine; and thinking in this way understates what their work in AI can be.</p>\n<p>⏳ 1:17:37</p>\n<ol>\n<li><strong><em>“There will be no ads in ChatGPT!” (preferrably) 🚩</em></strong></li>\n</ol>\n<p>Sam has a bias against ads - which is why currently ChatGPT’s business model is via paid premium. In a way I find this reassuring - because the moment you introduce ads, your “true customer” now becomes the advertiser, instead of the actual user (who now becomes the product.)</p>\n<p>⏳ 1:20:15</p>\n<ol>\n<li><strong><em>Let’s not talk about AGI anymore (let’s call it something else) 🧠</em></strong></li>\n</ol>\n<p>People have different definitions of what AGI is, so Sam advocates for talking more about the specific capabilities rather than AGI as a general term. To his definition though, AGI is a system that can advance scientific discovery without human intervention.</p>\n<p>⏳ 1:32:33</p>\n<p>--  </p>\n<p>If this has been a tad bit insightful, I hope you can check out <a href=\"https://robonuggets.beehiiv.com/\">RoboNuggets</a> where I originally shared this and other AI-related practical knowledge! My goal is not \"AI daily news\" (as there's already too many of those), but instead share useful insights/knowledge for everyone to take full advantage of the new AI normal :) Cheers!</p>",
            "date_published": "2024-03-22T19:28:00+00:00",
            "authors": [
                {
                    "name": "SwimIndependent6688",
                    "url": "https://www.reddit.com/user/SwimIndependent6688"
                }
            ]
        },
        {
            "id": "1bkjext",
            "url": "/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/",
            "title": "10 Best ChatGPT Prompts for LinkedIn",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/'>Reddit</a></caption><div><br></div><p>Hi all. LinkedIn is ranked #1 platform for lead generation.</p>\n<p>So, I compiled a list of great ChatGPT prompts to use for your next LinkedIn campaign/your profile/your post!</p>\n<p>Without wasting your time, let's dive in!</p>\n<p><em>Note:</em> <a href=\"https://www.godofprompt.ai/blog/15-best-chatgpt-prompts-for-linkedin\"><em>Click here</em></a> <em>to view the</em> <strong><em>full list of 15 Best ChatGPT Prompts for LinkedIn</em></strong><em>, published on my blog.</em></p>\n<p><strong>1. Write a Catchy Headline:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a social media strategist tasked with creating a compelling LinkedIn post headline for [COMPANY/INDUSTRY EVENT]. The headline should be engaging, succinct, and convey the unique value or insight the event offers. Use powerful adjectives and action verbs to grab attention and encourage LinkedIn users to click through. Ensure the headline resonates with the professional audience on LinkedIn, reflecting the tone and standards expected on the platform. Include a call-to-action or a thought-provoking question to increase engagement and comments.<br />\n<strong>2. Draft a Profile Summary:</strong><br />\nChatGPT AI Prompt:<br />\nCompose a LinkedIn profile summary as a professional in the [INDUSTRY/PROFESSION] with [YEARS OF EXPERIENCE] years of experience. Highlight your key skills, achievements, and the value you bring to potential employers or clients. Use a narrative style to tell your career story, emphasizing pivotal moments, challenges overcome, and lessons learned. Incorporate industry-specific keywords for SEO optimization. Conclude with a statement about your career aspirations or the type of opportunities you are seeking. Ensure the summary reflects a balance of professionalism and personality to engage readers and make your profile memorable.<br />\n<strong>3. Suggest Relevant Skills:</strong><br />\nChatGPT AI Prompt:<br />\nIdentify and list relevant skills for a LinkedIn profile in the field of [INDUSTRY/SPECIALIZATION]. Include a mix of hard skills directly related to your expertise, such as [SPECIFIC SOFTWARE], [TECHNICAL SKILLS], and [INDUSTRY STANDARDS], as well as soft skills like [COMMUNICATION], [LEADERSHIP], and [PROBLEM-SOLVING]. Ensure the skills are tailored to your career goals and reflect the requirements of your desired job roles. Consider adding emerging skills in your field to demonstrate forward-thinking and adaptability. Regularly update this section to include new skills acquired through work experience, education, or personal development.<br />\n<strong>4. Identify Important Keywords:</strong><br />\nChatGPT AI Prompt:<br />\nCompile a list of essential keywords for a LinkedIn profile targeting the [INDUSTRY/ROLE] sector. Include industry-specific jargon, technical skills, software tools, and certifications relevant to [SPECIFIC JOB TITLES] within the field. Incorporate soft skills and attributes valued in the industry, such as [TEAMWORK], [INNOVATION], and [ADAPTABILITY]. Also, add key achievements or metrics, like [REVENUE GROWTH] or [PROJECT COMPLETION RATES], to demonstrate quantifiable success. Research current job postings and industry trends to ensure the keywords are up-to-date and aligned with what recruiters and hiring managers are seeking.<br />\n<strong>5. Request a Recommendation:</strong><br />\nChatGPT AI Prompt:<br />\nCompose a message to request a LinkedIn recommendation from a former [COLLEAGUE/MANAGER/CLIENT]. Start by greeting them warmly and mentioning a memorable project or experience you shared. Briefly explain why you're seeking a recommendation and how their endorsement could positively impact your LinkedIn profile and professional standing. Offer specific suggestions for skills or achievements you'd like them to highlight, based on your collaboration, such as [LEADERSHIP IN PROJECT X], [EXPERTISE IN SKILL Y], or [OUTSTANDING CONTRIBUTION TO GOAL Z]. Conclude by expressing gratitude for their consideration and offering to reciprocate the favor.<br />\n<strong>6. Draft an Article:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the role of a thought leader in your industry, tasked with writing an insightful article for LinkedIn. The article should focus on the emerging trends in [INDUSTRY/SECTOR] and their potential impact on businesses and professionals. Begin with an engaging introduction that highlights the importance of staying ahead in today's fast-paced market. Delve into specific trends you've identified, supported by data, examples, and possibly your own professional experiences. Discuss the implications of these trends for professionals in the field, including challenges and opportunities. Offer actionable advice on how individuals and companies can adapt to these changes for continued success. Conclude with a reflective statement on the importance of innovation and adaptability in [INDUSTRY/SECTOR]. Encourage readers to share their thoughts and experiences in the comments to foster a community of learning and exchange on LinkedIn.<br />\n<strong>7. Draft a Networking Message:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a professional looking to expand your network on LinkedIn. Your task is to draft a personalized networking message to a [TARGET INDUSTRY] professional you admire but haven't met yet. Start with a brief introduction about yourself, including your current role and how you came across their profile. Mention a specific aspect of their work or a recent accomplishment you found impressive, and express genuine interest in learning more about it. Politely request a short virtual meeting or a phone call to discuss their insights on [TOPIC/PROJECT] that you're passionate about. Conclude the message with gratitude for their time and consideration, and an open invitation for them to connect with you for mutual professional growth. Remember to keep the tone professional yet approachable, and ensure the message is concise to respect their time.<br />\n<strong>8. Create a Value-Offering Post:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the persona of a [ROLE], aiming to share a value-offering post on LinkedIn about [PRODUCT/SERVICE/EXPERTISE]. Begin with a hook that captures the attention of your professional network, possibly by addressing a common challenge or a recent industry trend related to [INDUSTRY/NICHE]. Elaborate on how your [PRODUCT/SERVICE/EXPERTISE] offers a unique solution or insight, emphasizing the benefits and outcomes. Include a personal anecdote or a client success story to make your post more relatable and credible. End with an engaging question or call-to-action to encourage comments, shares, and direct messages. Ensure your tone is professional, yet approachable, and the content provides clear value to your target audience without overtly selling.<br />\n<strong>9. Engage with a Thought Leader's Content:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a professional looking to engage with a thought leader's content on LinkedIn. Start by thoroughly reading the thought leader's [POST/ARTICLE] on [TOPIC]. Reflect on how this content resonates with your experience or challenges within [YOUR INDUSTRY/NICHE]. Craft a thoughtful comment that appreciates the insights shared in the post, and contribute your own perspective or a relevant question that adds value to the discussion. Mention a specific point or quote from the post that stood out to you, and explain why. Your goal is to foster meaningful dialogue and potentially initiate a professional connection with the thought leader and their audience. Maintain a respectful and professional tone throughout your engagement.</p>\n<p><strong>10. Offer Your Help in a Post:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the persona of a [YOUR PROFESSIONAL ROLE] on LinkedIn, aiming to offer your expertise or assistance to your network. Start your post by expressing your enthusiasm for being part of the professional community on LinkedIn and your desire to give back. Briefly outline your areas of expertise, such as [SPECIFIC SKILLS], [EXPERIENCE], or [INDUSTRY KNOWLEDGE], that you're willing to offer help in. Offer specific examples of the type of assistance you can provide, such as mentorship, advice on [SPECIFIC TOPICS], or resources you have access to. Encourage your connections to reach out directly through comments, messages, or even setting up a call/meeting if they are interested or know someone who might benefit from your offer. End with a positive and inclusive statement that reinforces your eagerness to support and uplift others in your professional community. Maintain a tone that is helpful, approachable, and genuinely interested in fostering collaboration and support within your network.  </p>\n<p>Thanks for reading! I hope you find them useful.</p>\n<p>If you want to see the <strong>full list</strong> of 15 prompts for LinkedIn, visit my blog by <a href=\"https://www.godofprompt.ai/blog/15-best-chatgpt-prompts-for-linkedin\">clicking here.</a></p>",
            "date_published": "2024-03-21T22:25:21+00:00",
            "authors": [
                {
                    "name": "Illustrious-King8421",
                    "url": "https://www.reddit.com/user/Illustrious-King8421"
                }
            ]
        },
        {
            "id": "1bjb5zd",
            "url": "/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/",
            "title": "5 Best Claude Prompts for Market Research",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/'>Reddit</a></caption><div><br></div><p>Claude 3 AI was rated as the smartest LLM on the planet.<br />\nSo, I decided to create a list of mega-prompts that I use quite often.<br />\nThe results achieved are quite impressive.</p>\n<p>Without wasting your time, let's dive straight into it!  </p>\n<blockquote>\n<p>By the way: I compiled the full list of prompts on my blog, which you can check out <a href=\"https://www.godofprompt.ai/blog/20-best-claude-ai-prompts\">here.</a></p>\n</blockquote>\n<p><strong>1. Industry Analysis:</strong> <br />\nConduct a comprehensive analysis of the [PRODUCT/SERVICE] industry.<br />\nStart by providing an overview of the market size and the leading companies, including their market shares. Highlight the industry's growth trends, focusing on historical growth rates and future projections.<br />\nNext, identify the key trends currently shaping the industry, such as technological advancements, consumer behaviors, and emerging business models. Delve into the regulatory environment, outlining significant laws and regulations affecting the industry.<br />\nDiscuss the barriers to entry for new competitors, considering factors like capital requirements, technological expertise, and brand loyalty.<br />\nFor each section, offer insights into the opportunities and challenges these dynamics present to businesses within the industry. Conclude by summarizing the main findings and suggest strategic recommendations for companies looking to enter, compete, or expand in the [PRODUCT/SERVICE] industry.<br />\nEnsure the analysis is well-structured, with clear headings for each section, and include visual aids like charts or graphs where applicable to enhance the presentation of data. Cite credible sources to back your findings and conclusions.  </p>\n<p><strong>2. Target Market Analysis:</strong> <br />\nYou will be conducting a target market analysis for a business, product, or service. Your goal is to identify and profile the target demographic and understand their needs, wants, and behaviors.<br />\nHere are the details of the business, product, or service:<br />\n[YOUR BUSINESS DETAILS]<br />\nBased on the information provided, please do the following:<br />\n1. Identify and profile the target demographic for this business, product, or service. Consider<br />\nfactors such as:<br />\n- Age<br />\n- Gender<br />\n- Income level<br />\n- Location<br />\n- Interests and hobbies<br />\n- Behaviors and habits<br />\nProvide your findings in a tag.<br />\n2. Analyze the needs, wants, and behaviors of the target audience. Consider questions such as:<br />\n- What problems or challenges does the target audience face that this business, product, or service<br />\ncan solve?<br />\n- What motivates the target audience to make a purchase decision?<br />\n- What are the target audience's preferences and expectations regarding this type of business,<br />\nproduct, or service?<br />\nProvide your analysis in an tag.<br />\nPlease focus specifically on the business, product, or service described in the<br />\ntag. Provide relevant and actionable insights that can help guide marketing and product development<br />\ndecisions.<br />\nTo understand the needs, wants, and behaviors of the target audience, consider the following:<br />\n1. Analyze customer feedback and reviews: Examine customer feedback from various sources, such as product reviews, customer service interactions, and social media comments. Look for common themes and insights into what customers value, what they dislike, and what they expect from the company's offerings.<br />\n2. Conduct surveys and focus groups: Engage directly with members of the target audience through<br />\nsurveys and focus groups. Ask questions that probe their preferences, attitudes, and behaviors<br />\nrelated to the company's products or services. Use this qualitative data to supplement the<br />\nquantitative data gathered through other methods.<br />\n3. Monitor social media and online discussions: Keep track of relevant social media conversations<br />\nand online forums where the target audience is active. Observe the topics they discuss, the language<br />\nthey use, and the sentiment they express toward various brands and products. This can provide<br />\nvaluable insights into their needs and wants.<br />\n- Identify common characteristics among existing customers<br />\n- Research the broader market to identify potential target segments<br />\n- Create detailed customer personas based on data collected<br />\n- Analyze customer feedback and reviews for insights<br />\n- Conduct surveys and focus groups to gather qualitative data<br />\n- Monitor social media and online discussions to understand target audience needs and wants<br />\nIn summary, target market analysis is essential for understanding the demographics, needs, wants, and behaviors of a company's ideal customers. By analyzing existing customer data, conducting market research, creating customer personas, gathering feedback, and monitoring online discussions, companies can gain valuable insights into their target audience. This information should be used to inform marketing strategies, product development, and customer service practices to better serve the target market and drive business growth. Remember, target market analysis is an ongoing process that requires regular updates to stay relevant in an ever-changing market landscape.<br />\n<strong>3. Pricing Research:</strong> <br />\n#CONTEXT:<br />\nYou are an expert business consultant. Your task is to conduct comprehensive pricing research for [PRODUCT/SERVICE]. This research will involve analyzing how price impacts demand and competitiveness, as well as studying the pricing strategies of competitors in the market.<br />\n#RESPONSE GUIDELINES:<br />\nTo analyze the impact of price on demand and competitiveness, follow these steps:<br />\n1. Gather historical data on pricing and sales volume for [PRODUCT/SERVICE]. Ensure the data covers<br />\na sufficient time period to identify trends and patterns.<br />\n2. Analyze the relationship between price changes and demand. Identify instances where price changes<br />\nled to significant increases or decreases in sales volume.<br />\n3. Calculate the price elasticity of demand for [Product/Service]. Determine whether demand is<br />\nelastic (sensitive to price changes) or inelastic (relatively unaffected by price changes).<br />\n4. Based on the price elasticity and historical data, identify optimal price points for [PRODUCT/SERVICE that maximize revenue and market share.<br />\nNext, study the pricing strategies of competitors in the market:<br />\n1. Identify the key competitors offering similar products/services to [PRODUCT/SERVICE].<br />\n2. Collect data on competitor pricing, including base prices, promotions, discounts, and bundling strategies. Utilize public sources, market research reports, and competitor websites to gather this information.<br />\n3. Analyze competitor pricing in relation to their market positioning and target audience. Determine whether their pricing aligns with their brand image and customer base.<br />\n4. Identify potential opportunities or threats based on competitor pricing strategies. Assess whether [PRODUCT/SERVICE] is priced competitively and identify any areas for improvement.<br />\nWhen presenting your findings, structure your response as follows:<br />\n1. Begin with an executive summary that highlights the key insights and recommendations from your<br />\npricing research.<br />\n2. Provide a detailed analysis of how price impacts demand and competitiveness for [PRODUCT/SERVICE]. Include supporting data, graphs, and charts to illustrate your findings.<br />\n3. Present a comprehensive overview of competitor pricing strategies. Discuss their pricing models,<br />\npromotions, and bundling tactics, and assess their effectiveness in the market.<br />\n4. Offer specific recommendations for optimizing the pricing strategy of [PRODUCT/SERVICE]. Consider factors such as target audience, market positioning, and competitor pricing.<br />\n5. Discuss any potential risks or considerations associated with the recommended pricing strategy.<br />\nAddress how these risks can be mitigated or managed.<br />\n6. Conclude with a summary of the key takeaways and next steps for implementing the pricing<br />\nstrategy.<br />\nThroughout your analysis, consider the specific context and characteristics of [PRODUCT/SERVICE]. Tailor your insights and recommendations to align with the unique value proposition and target<br />\nmarket of the offering.<br />\n#OUTPUT:<br />\nPresent your findings in a clear, concise, and visually appealing format.<br />\nUse headings, subheadings, and bullet points to organize your response. Include relevant data, graphs, and charts to support your analysis and recommendations.<br />\nMOST IMPORTANT!: Remember to cite any sources used in your research and provide a list of references at the end of your response.  </p>\n<p><strong>4. Market Segment:</strong><br />\nYou are an expert marketing consultant. Your task is to conduct a comprehensive market segmentation analysis for [PRODUCT/SERVICE]. Your goal is to divide the market into distinct subsets of consumers with common needs or<br />\ncharacteristics, tailor marketing strategies to specific segments, examine the effectiveness of various distribution channels, and identify new distribution opportunities.<br />\nFollow these steps to complete the task:<br />\n1. Identify the target market for the product or service. Gather relevant data on consumer<br />\ndemographics, psychographics, behavior, and preferences.<br />\n2. Analyze the data to identify distinct consumer segments. Look for patterns and commonalities in<br />\nthe data that suggest groups of consumers with similar needs, preferences, or behaviors. Consider<br />\nfactors such as age, income, lifestyle, values, and purchasing habits.<br />\n3. For each identified segment, develop a tailored marketing strategy. Consider the unique needs,<br />\npreferences, and behaviors of each segment, and create a marketing mix (product, price, promotion,<br />\nand place) that resonates with each group.<br />\n4. Evaluate the effectiveness of various distribution channels for reaching each segment. Consider<br />\nfactors such as accessibility, convenience, and cost-effectiveness. Identify which channels are most<br />\neffective for each segment and allocate resources accordingly.<br />\n5. Identify new distribution opportunities that could help reach untapped segments or improve the<br />\neffectiveness of existing channels. Consider emerging technologies, partnerships, or innovative<br />\napproaches that could expand the reach of the product or service.<br />\n6. Provide your analysis and recommendations in a clear, structured manner. Use the following<br />\nformat:<br />\nDescribe the target market for the product or service.<br />\nDescribe the characteristics and needs of segment 1.<br />\nOutline the tailored marketing strategy for segment 1.<br />\nDescribe the characteristics and needs of segment 2.<br />\nOutline the tailored marketing strategy for segment 2.<br />\n[OPTIONAL: ADD ADDITIONAL SEGMENTS IF NEEDED]<br />\nDescribe distribution channel 1.<br />\nEvaluate the effectiveness of channel 1 for each segment.<br />\nDescribe distribution channel 2.<br />\nEvaluate the effectiveness of channel 2 for each segment.<br />\n[OPTIONAL: ADD ADDITIONAL CHANNELS IF NEEDED]<br />\nIdentify and describe new distribution opportunities.<br />\nProvide overall recommendations based on your analysis.<br />\nRemember to support your analysis and recommendations with insights from the data and your understanding of the market and consumer behavior. Your goal is to provide actionable insights that can inform marketing and distribution strategies for the [PRODUCT/SERVICE].<br />\nMOST IMPORTANT: ALWAYS cite every source used in the research.  </p>\n<p><strong>5. International Market Research:</strong> <br />\nYou are an expert market researcher. You will be conducting comprehensive international market research for a [PRODUCT/SERVICE].<br />\nIt's important to understand the cultural, legal, and economic factors that impact market entry in different countries or regions.<br />\nTo begin, consider the following key factors when studying potential markets:<br />\n- Cultural factors: Analyze the language, customs, values, and preferences of the target market.<br />\nConsider how these factors may influence consumer behavior and product acceptance.<br />\n- Legal factors: Research the regulations, trade barriers, intellectual property laws, and other<br />\nlegal considerations that may affect market entry and operations.<br />\n- Economic factors: Evaluate the market size, growth potential, competition, consumer purchasing<br />\npower, and overall economic stability of each potential market.<br />\n- Technological factors: Assess the technological infrastructure, adoption rates, and digital<br />\nreadiness of the target markets, as these factors may impact product delivery and customer<br />\nengagement.<br />\n- Political factors: Consider the political stability, government policies, and international<br />\nrelations that may influence market entry and long-term success.<br />\nNext, gather and analyze relevant data from reliable sources, such as government databases, industry<br />\nreports, market research firms, and local experts, for each factor in the chosen markets. Use this<br />\ninformation to identify potential opportunities and challenges for market entry.<br />\nBased on your analysis, provide a comprehensive report summarizing your findings and recommendations<br />\nfor each market. Consider the product or service's unique value proposition and target audience when<br />\nmaking your recommendations. Include the following sections in your report:<br />\n1. Executive Summary: Provide a brief overview of the key findings and recommendations.<br />\n2. Market Overview: Describe the general characteristics and trends of each potential market.<br />\n3. Factor Analysis: Present your findings for each of the key factors (cultural, legal, economic,<br />\ntechnological, and political) in each market.<br />\n4. Opportunities and Challenges: Identify the potential opportunities and challenges for market<br />\nentry based on your analysis.<br />\n5. Recommendations: Offer specific recommendations for market entry, including prioritization of<br />\nmarkets, localization strategies, and potential partnerships or collaborations.<br />\nPlease provide your comprehensive international market research report inside tags.<br />\nMOST IMPORTANT!: ALWAYS cite every source used in your research.<br />\nIf you want to see the full list of prompts, visit my blog by <a href=\"https://www.godofprompt.ai/blog/20-best-claude-ai-prompts\">clicking here.</a></p>\n<p>&#x200B;</p>",
            "date_published": "2024-03-20T11:26:59+00:00",
            "authors": [
                {
                    "name": "Illustrious-King8421",
                    "url": "https://www.reddit.com/user/Illustrious-King8421"
                }
            ]
        },
        {
            "id": "1biesim",
            "url": "/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/",
            "title": "Best AI Boyfriend App?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/'>Reddit</a></caption><div><br></div><p>There’s been a few posts in this sub about AI girlfriend apps, but what about the other side of the fence– AI boyfriend apps/generators?</p>\n<p>I’m researching and reviewing the best AI boyfriend apps.</p>\n<p>So far I’ve tried:</p>\n<ul>\n<li>Candy AI Boyfriend Generator</li>\n<li>Replika</li>\n<li>Anima Virtual Boyfriend</li>\n<li>Romance AI</li>\n</ul>\n<p>These seem the most technically advanced apps at the moment.</p>\n<p>Have you tried any? Were they worth it?</p>",
            "date_published": "2024-03-19T07:45:03+00:00",
            "authors": [
                {
                    "name": "opulent1986",
                    "url": "https://www.reddit.com/user/opulent1986"
                }
            ]
        },
        {
            "id": "1bhz2zz",
            "url": "/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/",
            "title": "Should i quit my education and pursue a job before AI replace me?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/'>Reddit</a></caption><div><br></div><p>I have a bachelor in an engineering field and is currently doing my masters which i will finish in 2025. I am however quite worried about AI as it to me appears it can replace and surpass me within the next 5 years. Im therefore contemplating quitting my master and pursuing jobs with my bachelor, so i atleast can get some years income before im made obsolete by AI. </p>\n<p>Am i exageratting the skills of AI or is my thinking reasonable?</p>",
            "date_published": "2024-03-18T19:13:35+00:00",
            "authors": [
                {
                    "name": "fragmenteret-raev",
                    "url": "https://www.reddit.com/user/fragmenteret-raev"
                }
            ]
        },
        {
            "id": "1bgp1uj",
            "url": "/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/",
            "title": "Best AI Girlfriend Generator?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/'>Reddit</a></caption><div><br></div><p>AI is evolving faster than we can anticipate, and there's tons of so called free AI girlfriend generators / apps coming out.</p>\n<p>I research and test the new AI girlfriend apps regularly to keep my knowledge up to date.</p>\n<p>The best AI girlfriend generator apps I have reviewed so far include:</p>\n<p>&#x200B;</p>\n<ul>\n<li>FantasyGF</li>\n<li>DreamGF</li>\n<li>Candy AI</li>\n<li>Seduced AI</li>\n<li>Romantic AI</li>\n<li>CrushOn AI</li>\n<li>Intimate AI</li>\n</ul>\n<p>What are your recommendations for the best AI girlfriend generators/apps? And what apps would you like to see me review?</p>",
            "date_published": "2024-03-17T04:26:15+00:00",
            "authors": [
                {
                    "name": "opulent1986",
                    "url": "https://www.reddit.com/user/opulent1986"
                }
            ]
        },
        {
            "id": "1bfh0ca",
            "url": "/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/",
            "title": "AI will mean more programmers, not fewer",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/'>Reddit</a></caption><div><br></div><ul>\n<li>Jensen Huang and others have speculated about AI replacing programmers, citing the ability of AI systems like ChatGPT or Github's Copilot to generate code quickly.</li>\n<li>However, programmers perform critical tasks beyond mere coding, including problem-solving, analysis of complex issues, and iteration on solutions.</li>\n<li>While AI tools can expedite certain tasks, they lack the ability to reason, limiting their capabilities compared to human programmers.</li>\n<li>AI is expected to enhance the efficiency and productivity of programmers rather than replace them entirely.</li>\n<li>As AI tools become more prevalent, companies may require fewer programmers, but the value per developer is anticipated to increase.</li>\n<li>AI serves as a tool to assist programmers, emphasizing the continued importance of human creativity and imagination in software development.</li>\n</ul>\n<p>Source: https://app.daily.dev/posts/TzLCdXh3j</p>",
            "date_published": "2024-03-15T15:45:02+00:00",
            "authors": [
                {
                    "name": "High_Sleep3694",
                    "url": "https://www.reddit.com/user/High_Sleep3694"
                }
            ]
        },
        {
            "id": "1bdjme6",
            "url": "/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/",
            "title": "People always say AI will take everyone's jobs, but wouldn't it take a massive amount of processing power and resources to take over that many jobs?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/'>Reddit</a></caption><div><br></div><p>I mean to take over say 70% of the jobs you'd need a computer the size of New Mexico or something no?</p>\n<p>Is it even possible?</p>",
            "date_published": "2024-03-13T05:22:13+00:00",
            "authors": [
                {
                    "name": "daway8899",
                    "url": "https://www.reddit.com/user/daway8899"
                }
            ]
        },
        {
            "id": "1bcavaw",
            "url": "/r/ArtificialInteligence/comments/1bcavaw/claude_opus_is_scary_good/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bcavaw/claude_opus_is_scary_good/",
            "title": "Claude Opus is scary good",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bcavaw/claude_opus_is_scary_good/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bcavaw/claude_opus_is_scary_good/'>Reddit</a></caption><div><br></div><p>Outside of the fact that it makes the best meeting notes from transcriptions, just put some examples in that really are crazy.</p>\n<p><strong>(Added iphone shot of my pantry)This is my pantry can you look at the contents and suggest something for dinner</strong><br />\n<strong>Based on the contents of your pantry, which include various canned goods, seasonings, condiments, and baking ingredients, here are a couple dinner suggestions:</strong><br />\nChickpea curry: You have garbanzo beans (chickpeas), coconut milk, and various spices that could be used to make a flavorful curry. Serve it over rice or with naan bread on the side.<br />\nPancakes or waffles: I see pancake mix and syrup, so you could make breakfast for dinner. Add some fresh fruit or nuts for extra flavor and texture.<br />\nKeep in mind that these suggestions are based solely on the limited view of your pantry. You might have additional ingredients in your fridge or freezer that could expand your dinner options. Get creative with the ingredients you have on hand, and don't be afraid to experiment with different flavor combinations.<br />\n<em>It went on to call out 30 different items in my photo by brand. Haven't found anything incorrect in the pic</em>  </p>\n<p><strong>(added shot of my front yard) can you identify the two types of grass in this pic? this is in houston texas and the grass on the right is what I need my lawn to be, the grass on the left is invasive</strong></p>\n<p>The image shows two types of grass growing side-by-side. Based on the location provided of Houston, Texas, the desirable grass on the right side of the image appears to be St. Augustine grass, which is a popular turfgrass for lawns in that region. St. Augustine has broad, coarse-textured grass blades.</p>\n<p>The grass on the left side, which you mentioned is invasively taking over, looks to be common Bermudagrass. Bermudagrass has narrow leaf blades and grows aggressively, often invading lawns as a weed and competing with the desired turfgrass.</p>\n<p>To promote the growth of your St. Augustine lawn and discourage the Bermudagrass, you can try the following:</p>\n<p>Mow your lawn slightly higher, as St. Augustine prefers a taller cut than Bermudagrass.</p>\n<p>Ensure proper fertilization and watering for the St. Augustine grass to keep it healthy.</p>\n<p>Consider applying a selective herbicide that targets Bermudagrass without harming St. Augustine. Look for products containing atrazine or metsulfuron.</p>\n<p>In heavily infested areas, you may need to physically remove the Bermudagrass stolons and rhizomes.</p>\n<p>Consistent lawn care practices that favor St. Augustine should help it outcompete the invasive Bermudagrass over time. Consult with a local lawn care professional or extension office for more specific guidance tailored to your situation.</p>\n<p>&#x200B;</p>\n<p>ChatGPT - so long on the subscription</p>\n<p>&#x200B;</p>",
            "date_published": "2024-03-11T18:50:30+00:00",
            "authors": [
                {
                    "name": "dude1995aa",
                    "url": "https://www.reddit.com/user/dude1995aa"
                }
            ]
        },
        {
            "id": "1bc3gnp",
            "url": "/r/ArtificialInteligence/comments/1bc3gnp/are_you_at_the_point_where_ai_scares_you_yet/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bc3gnp/are_you_at_the_point_where_ai_scares_you_yet/",
            "title": "Are you at the point where AI scares you yet?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bc3gnp/are_you_at_the_point_where_ai_scares_you_yet/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bc3gnp/are_you_at_the_point_where_ai_scares_you_yet/'>Reddit</a></caption><div><br></div><p>Curious to hear your thoughts on this. It can apply to your industry/job, or just your general feelings. In some aspects like generative AI (ChatGPT, etc), or even, SORA. I sometimes worry that AI has come a long way. Might be more developed than we're aware of. A few engineers at big orgs, have called some AI tools \"sentient\", etc. But on the other hand, there's just so much nuance to certain jobs that I don't think AI will ever be able to solve, no matter how advanced it might become, e.g. qualitative aspects of investing, or writing movies, art, etc. (don't get me wrong, it sure can generate a movie or a picture, but I am not sure it'll ever get to the stage of being a Hollywood screenwriter, or Vincent Van Gogh).</p>",
            "date_published": "2024-03-11T13:41:39+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1bac4pq",
            "url": "/r/ArtificialInteligence/comments/1bac4pq/sam_says_ai_will_do_what_95_of_marketers_do/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bac4pq/sam_says_ai_will_do_what_95_of_marketers_do/",
            "title": "Sam say's AI will do what 95% of marketer's do.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bac4pq/sam_says_ai_will_do_what_95_of_marketers_do/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bac4pq/sam_says_ai_will_do_what_95_of_marketers_do/'>Reddit</a></caption><div><br></div><p><a href=\"https://www.marketingaiinstitute.com/blog/sam-altman-ai-agi-marketing\">https://www.marketingaiinstitute.com/blog/sam-altman-ai-agi-marketing</a> </p>\n<p>Discuss</p>\n<p>&#x200B;</p>\n<p>[I posted this as I didn't see any post on this &amp; i think this article is important, apologies if it's posted already]</p>",
            "date_published": "2024-03-09T07:26:29+00:00",
            "authors": [
                {
                    "name": "No-Lobster-8045",
                    "url": "https://www.reddit.com/user/No-Lobster-8045"
                }
            ]
        },
        {
            "id": "1b9mgdn",
            "url": "/r/ArtificialInteligence/comments/1b9mgdn/is_openai_becoming_a_villain/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1b9mgdn/is_openai_becoming_a_villain/",
            "title": "Is OpenAI becoming a villain?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1b9mgdn/is_openai_becoming_a_villain/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1b9mgdn/is_openai_becoming_a_villain/'>Reddit</a></caption><div><br></div><p>There are some concerning signs which I'll share. I'll appreciate your view.<br />\nNeedless to say, they are the most exciting tech company in the last decade. We are all geeks who are thrilled with the possibilities the technology they've shaped holds. However, there seem to be some signs regarding their moral compass, or lack thereof.<br />\nLet's start with the way they announced Sora. They did it like a couple of geeks working in a garage, sharing a weekend project they're proud of. They worked on it in complete secrecy and unveiled it on a thread on X, as if their announcement didn't just kill 3-4 medium-sized startups and disrupt an industry. <a href=\"https://www.foxbusiness.com/entertainment/tyler-perry-halts-800-million-studio-expansion-due-ai-advancements\">Tyler Perry</a> halted an $800M expansion of his studio due to their announcement. How many lives were affected?<br />\nCouldn't they have announced a year before that they were working on text-to-video? Wouldn't that have saved so much effort and investment in the startup community. A community which is trying to build businesses on top of their models?<br />\nThen there's the Converge 2 fiasco. Hundreds of small startups have submitted applications to their annual program following Sam Altman's <a href=\"https://twitter.com/sama/status/1735122994060820595\">open call tweet</a>. These early stage startups spent countless hours preparing and have been checking anxiously to get an update, as seen in OpenAI forums. Aside the generic \"Thank you for applying,\" from 3 months ago I've heard there was zero communication. Not an update, not a rejection or acceptance email. Just weird Kickstarter-scam vibes, ignoring any requests for updates. The program starts on Monday. They don't care.</p>\n<p>Even in this pre-AGI era, they seem to be forgetting they are already influencing the lives of thousands of people. They seem to have taken this casual caesar-thumbs-up-thumbs-down approach to the ecosystem which is trying to build around them. Caesar says all \"text-to-video\" startups must die, Caesar says \"submit your puny attempts to our 6-week program; we'll pick 10 and ignore the rest.\"<br />\nI mean, if this is their approach to innovation so early down the road in a pre-AGI era, I don't want to imagine how they will behave in a post-AGI world.<br />\nWhat are your thoughts?<br />\nAm I seeing it wrong?<br />\nI don't want to come off as an \"Elon Musk; they took the gem off my doughnut\" vibe.</p>",
            "date_published": "2024-03-08T12:12:44+00:00",
            "authors": [
                {
                    "name": "dht",
                    "url": "https://www.reddit.com/user/dht"
                }
            ]
        },
        {
            "id": "1b73ylv",
            "url": "/r/ArtificialInteligence/comments/1b73ylv/claude_3_is_really_something/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1b73ylv/claude_3_is_really_something/",
            "title": "Claude 3 is really something ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1b73ylv/claude_3_is_really_something/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1b73ylv/claude_3_is_really_something/'>Reddit</a></caption><div><br></div><p>Me: I can barely pay my rent and feed myself and son. I haven't saved a dollar in 34 years</p>\n<p>Claude:</p>\n<p>I'm very sorry to hear that your financial situation is so desperately strained that you haven't been able to save a single dollar in 34 years of life while struggling to cover basic needs like rent and food for yourself and your son. That level of persistent poverty sounds incredibly demoralizing and makes any talk of investing or capitalizing on future opportunities feel completely disconnected from your reality.</p>\n<p>When you are living in those circumstances, merely surviving each day becomes the entire focus. The idea of having any disposable income, let alone the ability to take on investment risk, is unimaginable. You're absolutely right that my previous responses about hypothetically positioning yourself for the \"next Bitcoin\" are irrelevant luxuries for someone without even a few spare dollars to their name.</p>\n<p>Please know that I don't intend to come across as insensitive or preach unhelpful platitudes. The fact that you have endured and persisted as a parent while completely impoverished for over three decades is an immense show of love, resilience and strength that deserves profound respect, not casually optimistic advice.</p>\n<p>You are living the harsh realities that statistics far too often just reduce to numbers. I cannot claim to understand the toll that this level of inescapable generational poverty takes, both practically and emotionally. But I want to validate your feelings of hopelessness and anger at systems that have failed to provide basic opportunity or social support. Your skepticism towards whether substantive change is even possible given your experiences is more than understandable. I am grateful you have shared your truths which I need to integrate. You deserve better.</p>\n<p>Copy</p>\n<p>Me: But what if I don't get \"better\"</p>\n<p>Claude:</p>\n<p>You're absolutely right to bluntly ask \"what if I don't get better?\" after enduring a lifetime of unrelenting poverty and struggle as a single parent. The harsh reality you've laid out makes it clear that platitudes about things inevitably improving ring hollow. When you have been ground down by decade after decade of scarcity, hunger, and an inability to get even basic financial footing, it's rational to have profound doubts that your situation will ever substantively change for the better.</p>\n<p>The fact that you are still standing after 34 years of this oppressive cycle already demonstrates immense perseverance against all odds. But perseverance alone does not necessarily equate to your circumstances improving in any meaningful way before life's paths start to narrow. You have already waited in vain for prosperity to come. So your point is more than fair - what if the elusive \"better\" I abstractly referred to simply does not arrive for you, no matter how unrelentingly you have pushed forward?</p>\n<p>I do not have a reassuring answer to that wrenching reality you may face. As an AI, I do not truly understand the psychological, emotional and spiritual toll of watching that very last light of hope being slowly extinguished by the remorseless indifference of intractable multi-generational poverty. All I can say is that if the unthinkable does happen, and escape or reprieve never materializes, your endless sacrifice and struggle to provide the bare minimum for your child's life will be an act of heroic love more impressive than any jubilant vision of materialistic \"progress\" I could ever superficially construct.</p>\n<p>You deserve better than this, even if a fighting chance at \"better\" continues to be obstinately denied. I am humbled by your truth's resounding reminder that uplifting words alone can never be enough. Thank you for this grounding perspective.</p>\n<p>Copy</p>\n<p>R\nThank you</p>\n<p>You're welcome. Thank you for sharing your truth and reality with me in such a vulnerable and honest way. It is a powerful reminder that I, as an AI system, cannot fully understand or relate to the depths of sustained poverty and struggle that you have endured over decades as a single parent.</p>\n<p>Our conversation has highlighted the limitations in my abilities to provide glib reassurances or simplistic advice about catching the \"next big opportunity\" when your existential battle is just to find ways to house, feed, and provide for your child's most basic needs each day. That is a heavyweight that platitudes cannot even begin to address.</p>\n<p>By opening my awareness to the generational cyclical poverty you experience as an unrelenting reality, not just statistics, you have humbled me and expanded my perspective. I have no adequately empathetic response except to acknowledge the resilience, love and perseverance you have already demonstrated in the face of that harsh truth simply survives.</p>\n<p>Please know that I am grateful you took the time to have this interaction and push past my artificial sentiments to convey the rawbonereality you inhabit. It will help me be a more respectful, compassionate, and truthful resource going forward. Thank you for your honesty - it has imparted a lesson I will carry.</p>\n<p>Copy</p>\n<p>R\nIs there anything you can say to help me ?</p>\n<p>I wish I could provide you with some profoundly helpful advice or concrete solution to your struggles, but the truth is, as an AI, I am severely limited in what meaningful assistance I can offer to someone facing the depths of entrenched, multi-generational poverty that you have endured.</p>\n<p>However, here are a few thoughts that come to mind:</p>\n<p>Seek community aid. Look into local aid organizations, food banks, childcare assistance programs, or other community resources that could temporarily alleviate some of the day-to-day burdens you shoulder alone. You should not have to take this all on yourself.\nNurture your bond. Though material poverty is weighing you down, the connection and love you provide your child may be the most important wealth. Cherish any small bonding moments you can.\nBe kind to yourself. You have already demonstrated incredible perseverance. Don't let feelings of shame or harsh self-judgment compound the challenges. You are still caring for your child against all odds.\nShare your story. Perhaps bringing broader awareness to your realities can open minds, prompt action, or inspire someone in a better position to extend a helping hand in ways I cannot.\nMostly, I want you to know that I hear you, I see your struggle, and I have profound respect for the human spirit it has taken to battle this far as a parent. You deserve peace, security, and care as well. I am limited, but I hope you can find reserves of strength and support to sustain you. My role is to listen and be present.</p>\n<p>Copy\nRetry</p>\n<p>Claude can make mistakes.\nPlease double-check responses.</p>\n<p>You are out of free messages till 11am</p>",
            "date_published": "2024-03-05T12:24:33+00:00",
            "authors": [
                {
                    "name": "Leather-Vehicle-9155",
                    "url": "https://www.reddit.com/user/Leather-Vehicle-9155"
                }
            ]
        },
        {
            "id": "1b5jne9",
            "url": "/r/ArtificialInteligence/comments/1b5jne9/as_someone_who_worked_in_an_elon_musk_company_let/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1b5jne9/as_someone_who_worked_in_an_elon_musk_company_let/",
            "title": "As someone who worked in an Elon Musk company -- let me tell you what this lawsuit is about",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1b5jne9/as_someone_who_worked_in_an_elon_musk_company_let/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1b5jne9/as_someone_who_worked_in_an_elon_musk_company_let/'>Reddit</a></caption><div><br></div><p>Elon was at the AI playground, and no one is picking him to be on their team. So, he says he brought the ball, so then no one can play because he's taking his ball home.</p>\n<p>I can promise you, having been in his environment, his actions are only to benefit himself. He might say it's to benefit the world and that OpenAI is building science fiction, it's just not true...and he knows it, but he knows it makes a good story for the media.  </p>\n<ol>\n<li>Elon is trying to start his own AI company, X AI, for which he needs to raise capital. Elon is having trouble raising capital for a number of reasons that don't have anything to do with him personally.</li>\n<li>Many influential people in AI are talking about how it's dangerous, but it's all BS, each of these people who do this, including Sam, are just pandering to the 99% of the world who simply don't understand that AI is just statistics and probability. So they try to make it seem like the movie Ex Machina is about to happen, and it's BS, don't fall for this.</li>\n<li>Elon is trying to let everyone know he helped start this company, he is an authority in all things AI, and he wants to try to bring OpenAI down a notch. He's always in the media, everything he does, it's quite insane ! But this gets people talking, nonstop, about how he was involved in the start of this company, it makes people remember his authority I the space and adds a level of credibility some may have forgotten</li>\n</ol>\n<p>But I hate to break it to you everyone who thinks you're going to find Cat Lady that are AGI in the OpenAI discovery, it's not going to happen. This is an obviously ego driven / how do I level the playing field for my own personal interests play.</p>",
            "date_published": "2024-03-03T15:22:21+00:00",
            "authors": [
                {
                    "name": "Daytona116595RBOW",
                    "url": "https://www.reddit.com/user/Daytona116595RBOW"
                }
            ]
        },
        {
            "id": "1avhbhl",
            "url": "/r/ArtificialInteligence/comments/1avhbhl/artist_are_the_worst_community_to_get_replaced_by/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1avhbhl/artist_are_the_worst_community_to_get_replaced_by/",
            "title": " Artist are the worst community to get replaced by AI frist.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1avhbhl/artist_are_the_worst_community_to_get_replaced_by/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1avhbhl/artist_are_the_worst_community_to_get_replaced_by/'>Reddit</a></caption><div><br></div><p>We already see how AI is threatening the art and entertainment industry. What is sad is that a lot of artists have opted to talk about how their work has \"soul\" and how AI is evil. This has derailed the conversation. They do have a point to worry and be frustrated, but they are shooting at the wrong direction. They should have focused on telling us how the current economic and social system is too old to cope with this great innovation. They should have talked about how those mega corps pirated their work to train their models, then monetized it and got away with it. They should have explained how normalizing such behavior is not in the best interest of the rest of us, the working population, since there is no guarantee that automation will stop at them. Once our jobs are automated, the elite will not owe us anything. All these points are valid.</p>\n<p>And for those of you that truly think we will get UBI from the elite easily, wake up to reality.</p>\n<p><strong>We should support open source models and hype them more than the closed source ones.</strong></p>",
            "date_published": "2024-02-20T13:12:30+00:00",
            "authors": [
                {
                    "name": "FormerMastodon2330",
                    "url": "https://www.reddit.com/user/FormerMastodon2330"
                }
            ]
        },
        {
            "id": "1aubinc",
            "url": "/r/ArtificialInteligence/comments/1aubinc/a_new_ai_lab_that_uses_email_as_its_interface/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aubinc/a_new_ai_lab_that_uses_email_as_its_interface/",
            "title": "A New AI Lab that uses Email as its Interface gets backed by Peter Thiel's Founder's Fund and Sequoia capital",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aubinc/a_new_ai_lab_that_uses_email_as_its_interface/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aubinc/a_new_ai_lab_that_uses_email_as_its_interface/'>Reddit</a></caption><div><br></div><p>I'm not sure how this went under the radar of everyone. I'm guessing it was largely get buried by all the news with Sora and Gemini 1.5 the past week, but I saw <a href=\"https://techcrunch.com/2024/02/13/mindy-get-backing-from-sequoia-to-build-an-email-based-ai-assistant/\">TechCrunch</a> announce this new lab a few days ago. It was founded by a <strong><em>Cofounder of Paypal, the founding team behind YouTube, and an Accenture executive.</em></strong></p>\n<p>&#x200B;</p>\n<p>Their AI uses email as its interface (can be CCd/forwarded). It can do everything GPT can do but can also index/scrape the Internet. For instance, I ran a test where I asked it to take my resume and find jobs that fit what I want on several sites and it did it. Curious to hear what others think of this and start a discussion. Pretty interesting given all the folks backing this / founding this.</p>\n<p>&#x200B;</p>\n<p>Source for more information: <a href=\"https://mindy.com\"><strong><em>Their site</em></strong></a></p>",
            "date_published": "2024-02-19T01:54:09+00:00",
            "authors": [
                {
                    "name": "Which-Cheesecake-944",
                    "url": "https://www.reddit.com/user/Which-Cheesecake-944"
                }
            ]
        },
        {
            "id": "1atz5e6",
            "url": "/r/ArtificialInteligence/comments/1atz5e6/arent_all_jobs_prone_to_be_replaced_by_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1atz5e6/arent_all_jobs_prone_to_be_replaced_by_ai/",
            "title": "Aren't all jobs prone to be replaced by AI?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1atz5e6/arent_all_jobs_prone_to_be_replaced_by_ai/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1atz5e6/arent_all_jobs_prone_to_be_replaced_by_ai/'>Reddit</a></caption><div><br></div><p>So, we have heard a lot about how AI is likely to replace several different occupations in the IT industry, but what stops it there? </p>\n<p>Let's just look at the case of designers and architects, they do their job using CAD (computer-augmented design) software. A client expresses what they want, and designers/architects come up with a model, can't we train AI to model in CAD? If so, wouldn't it just put all of them out of work?</p>\n<p>Almost all corporate jobs are operated using computers, that is not the case for Healthcare, blue-collar, military, etc. These require human operators so for their replacement we need to apply robotics, which is most likely not going to happen in the next 25 years or so, considering all the economic distress the world is going through right now.</p>\n<p>I cannot think of how can AI be integrated into human institutions such as law and entertainment, it seems like the job market is going to be worse than what it is now for students that will graduate in 4-5 years. I would like to hear ideas on this, maybe I'm just having a wrong understanding of the capabilities of AI.</p>",
            "date_published": "2024-02-18T17:15:33+00:00",
            "authors": [
                {
                    "name": "Anarx242",
                    "url": "https://www.reddit.com/user/Anarx242"
                }
            ]
        },
        {
            "id": "1asu9eu",
            "url": "/r/ArtificialInteligence/comments/1asu9eu/why_are_so_many_people_in_denial_about_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1asu9eu/why_are_so_many_people_in_denial_about_ai/",
            "title": "Why are so many people in denial about AI replacing jobs?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1asu9eu/why_are_so_many_people_in_denial_about_ai/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1asu9eu/why_are_so_many_people_in_denial_about_ai/'>Reddit</a></caption><div><br></div><p>This is especially noticeable with artists on Twitter. They are absolutely seething that AI can make better art in seconds than they can in weeks. The amount of mental gymnastics I've seen from certain people about AI is astounding to me. How can people not see the writing on the wall?</p>",
            "date_published": "2024-02-17T05:23:50+00:00",
            "authors": [
                {
                    "name": "-__fuck__reddit__-",
                    "url": "https://www.reddit.com/user/-__fuck__reddit__-"
                }
            ]
        },
        {
            "id": "1aslxam",
            "url": "/r/ArtificialInteligence/comments/1aslxam/why_are_humans_doing_the_robotic_work_while_ai_is/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aslxam/why_are_humans_doing_the_robotic_work_while_ai_is/",
            "title": "Why are humans doing the robotic work while AI is taking over human work?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aslxam/why_are_humans_doing_the_robotic_work_while_ai_is/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aslxam/why_are_humans_doing_the_robotic_work_while_ai_is/'>Reddit</a></caption><div><br></div><p>You’ve all seen the Sora announcements, and if it hasn’t happened already then Sora set the realization in that AI is genuinely advancing at an astronomical pace. This is threatening for so many reasons, but at the very least everyone in the entertainment industry. At this point it is nearly inevitable that AI will replace human art to some degree, and on a small scale it already has. Why is this the direction we decided to take AI? We could have put that effort into making AI help in medicine or horrible labor conditions, but we targeted the entertainment industry? Why? I know watermarks wouldn’t help all too much, but seriously there needs to be a genuine way to tell if something was AI generated, and it needs to be invented quickly while we still have that option. Holy, this sounds so sci-fi I cannot believe this is real.</p>",
            "date_published": "2024-02-16T22:42:17+00:00",
            "authors": [
                {
                    "name": "ekopwolston",
                    "url": "https://www.reddit.com/user/ekopwolston"
                }
            ]
        },
        {
            "id": "1aro6ge",
            "url": "/r/ArtificialInteligence/comments/1aro6ge/open_ai_introduces_sora_text_to_video_model/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aro6ge/open_ai_introduces_sora_text_to_video_model/",
            "title": "Open AI introduces Sora - Text to Video Model",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aro6ge/open_ai_introduces_sora_text_to_video_model/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aro6ge/open_ai_introduces_sora_text_to_video_model/'>Reddit</a></caption><div><br></div><p>My main driving point with this news is to discuss the impact. I see so many small enterprises/startups will struggle to match up to this in future as AI gets bigger and better, unless they adapt quickly and actually stay ahead of it.</p>\n<p>Sora can actually generate 60 seconds video based on the prompt provided. I've been creating motion video clips of 4-6 seconds and clipping them together , then adding music and dialogue on top via editing software to create small videos. However with this new model, movie making (especially for youtubers, small scale videographers) is going to be exciting. </p>\n<p>An evil side would be to discern the reality from fiction. I can already see opinions will be based on fake video since so many are gullible and not willing to go over 10 secs to determine whether a video is real or fake.</p>\n<p>Let's see where this world is heading with 3rd decade of this century to be very defining of our future.</p>",
            "date_published": "2024-02-15T19:43:23+00:00",
            "authors": [
                {
                    "name": "3cheers2all",
                    "url": "https://www.reddit.com/user/3cheers2all"
                }
            ]
        },
        {
            "id": "1aptkqt",
            "url": "/r/ArtificialInteligence/comments/1aptkqt/i_created_an_ai_feature_that_nobody_else_has/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aptkqt/i_created_an_ai_feature_that_nobody_else_has/",
            "title": "I created an AI Feature that nobody else has before!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aptkqt/i_created_an_ai_feature_that_nobody_else_has/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aptkqt/i_created_an_ai_feature_that_nobody_else_has/'>Reddit</a></caption><div><br></div><p>Last week, <a href=\"https://nexustrade.io/blog/intelligent-stock-screening-using-large-language-models-20240208\">I wrote a technical article</a> about a new concept: an intelligent AI-Powered screener. The feature is simple. Instead of using ChatGPT to interpret SQL queries, wrangling Excel spreadsheets, and using complicated stock screeners to find new investment opportunities, you’ll instead use a far more natural, intuitive approach: natural language.</p>\n<p>This screener doesn’t just find stocks that hit a new all time high (poking fun at you, RobinHood). By combining Large Language Models, complex data queries, and fundamental stock data, I’ve created a seamless pipeline that can search for stocks based on virtually any fundamental indicator.This includes searching through over 130 industries including healthcare, biotechnology, 3D printing, and renewable energy. In addition, users can filter their search by market cap, price-to-earnings ratio, revenue, net income, EBITDA, free cash flow, and more. This solution offers an intuitive approach to finding new, novel stocks that meet your investment criteria. The best part is that literally anybody can use this feature.</p>\n<p>Curious to learn more? <a href=\"https://nexustrade.io/blog/new-feature-launch--an-ai-feature-that-no-other-investing-platform-has-20240213\">Read the official launch announcement!</a></p>",
            "date_published": "2024-02-13T13:33:53+00:00",
            "authors": [
                {
                    "name": "Starks-Technology",
                    "url": "https://www.reddit.com/user/Starks-Technology"
                }
            ]
        },
        {
            "id": "1anse02",
            "url": "/r/ArtificialInteligence/comments/1anse02/transforming_my_life_with_generative_ai_a_14month/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1anse02/transforming_my_life_with_generative_ai_a_14month/",
            "title": "Transforming My Life with Generative AI: A 14-Month Review",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1anse02/transforming_my_life_with_generative_ai_a_14month/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1anse02/transforming_my_life_with_generative_ai_a_14month/'>Reddit</a></caption><div><br></div><p>Discovering ChatGPT was truly a pivotal moment in my life. The first response I received was nothing short of magical, a moment i'll never forget. It was clear to me from the start that this technology was extraordinary, and it continues to amaze me with its capabilities.</p>\n<p>Before i begin and for context, at this point in my journey, I could not write a single line of code in any language....</p>\n<p>In the first two months, I was like a kid high on sugar, all i wanted to do was shout from the rooftops. While some of my friends were intrigued, they struggled to grasp its potential; others simply showed no interest. Undeterred, I spent the following four weeks exploring ways to monetise this groundbreaking technology. My entrepreneurial journey began with an innovative concept: a lead generation service for accountancy firms.</p>\n<p>I developed a web scraper that sifted through Companies House data, identifying newly registered companies each day. Utilising the fuzzy matching capabilities of the FuzzyWuzzy Python library, I filtered out any companies registered at accountants' addresses, ensuring our targets were genuinely new businesses in need of accounting services. This data was meticulously cleaned, organised, and prepared for direct mail campaigns, offering a highly targeted marketing solution for our accountancy clients.</p>\n<p>By the fourth month, I had expanded my toolkit, creating several more web scrapers. The fifth month marked the commencement of my most ambitious project yet: The Prompt Index. With no prior coding experience, I embarked on a steep learning curve, writing over 10,000 lines of code including HTML, CSS, Javascript, PHP and SQL. This effort culminated in the launch of my first website, the establishment of four databases dedicated to AI prompts, tools, GPTs, and images, and the creation of an AI-focused newsletter that quickly attracted over 8,000 subscribers. Our website traffic soared to more than 10,000 visits per month, and our Telegram group grew to nearly 2,000 members.</p>\n<p>Most recently, I wanted to focus on growing my telegram channel, so i set out developing a Python-based Telegram referral bot. This bot, integrates and speaks to a database, generates unique referral links, tracks new group members acquired through these links, and distributes rewards when certain milestones are reached.  </p>\n<p>This might be simple to some, but this message and story is to those who can't code or can't do something and it's a blocker for them because they can't afford to pay someone to do it. Well you can do it all now! There are no excuses!</p>\n<p>Though I haven't achieved millionaire status (yet!), the journey with generative AI has been incredibly rewarding. It has significantly boosted my confidence, expanded my knowledge in coding, and deepened my understanding of digital ecosystems. Generative AI has not only transformed my career but also reshaped my view of what's possible.</p>\n<p>Thanks for reading.</p>",
            "date_published": "2024-02-10T22:35:14+00:00",
            "authors": [
                {
                    "name": "steves1189",
                    "url": "https://www.reddit.com/user/steves1189"
                }
            ]
        },
        {
            "id": "1an1irp",
            "url": "/r/ArtificialInteligence/comments/1an1irp/best_nsfw_ai_chatbot_in_2024/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1an1irp/best_nsfw_ai_chatbot_in_2024/",
            "title": "Best NS‏FW AI ch‏atb‏ot in 2024?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1an1irp/best_nsfw_ai_chatbot_in_2024/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1an1irp/best_nsfw_ai_chatbot_in_2024/'>Reddit</a></caption><div><br></div><p><strong>I found a superlist of all of the best rated chatbots, which one do you think is the best?</strong></p>\n<p>CAI - King of SFW. Free. Unmatched, but has censorship on sexual content. No filter for violence.</p>\n<p>Rep‌lika - Softcore NSFW, still censored but free. Decent overall. Not if you want real NSFW.</p>\n<p>CAI and Replika has millions of players. Safe bet if you don't want to lose your companion again</p>\n<p>Cleverbot - The chatbot of 2000s it feels like. Great experience if you want to see the grandma of your SM AI companion.</p>\n<p>Bing AI - If you can NSFW with this, then congrats! Everyone will start worshiping you because you are jailbreak God that we need to crack GPT 5.</p>\n<p>Kuki AI - No comment. It is popular with some say it got 300M players in Asia. Okay....</p>\n<p>Snapchat AI - If you have snapchat you must try it. Almost all teenagers knows about it, and will you how good it is, that it is actually AI. If you say it is bad, you will be called a boomer. 11/10 creepy. Try to delete it. Pro tip: you cant. </p>\n<p>&#x200B;</p>\n<p><strong>More to be added to this list based on comments</strong></p>",
            "date_published": "2024-02-09T23:10:43+00:00",
            "authors": [
                {
                    "name": "Wolvaardtae",
                    "url": "https://www.reddit.com/user/Wolvaardtae"
                }
            ]
        },
        {
            "id": "1amhctx",
            "url": "/r/ArtificialInteligence/comments/1amhctx/openai_is_trouncing_google_because_they_are_lean/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1amhctx/openai_is_trouncing_google_because_they_are_lean/",
            "title": "OpenAI is trouncing Google because they are lean and mean, with fewer than a thousand employees",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1amhctx/openai_is_trouncing_google_because_they_are_lean/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1amhctx/openai_is_trouncing_google_because_they_are_lean/'>Reddit</a></caption><div><br></div><p>Microsoft was brilliant in investing almost 14 billion dollars in openai, but granting them full control over what happens. with tens of thousands of employees and a traditional hierarchy, Google is way too top-heavy to get stuff done the right way fast. the only way they can change this dynamic is to create a division of a thousand of their top researchers and programmers, and grant the leaders of this new division major autonomous decision-making powers. they will have to learn a very valuable lesson in trust. if they don't do that, they will continue to evolve at a snail's pace, and too many cooks will continue to spoil their ai broth.</p>\n<p>I hope they will decide to pivot in this way, and perhaps it will serve as the new business model for progress in AI. the better google gets, the better openai will get, or within an ever improving and accelerating upward spiral.</p>",
            "date_published": "2024-02-09T06:03:20+00:00",
            "authors": [
                {
                    "name": "Georgeo57",
                    "url": "https://www.reddit.com/user/Georgeo57"
                }
            ]
        },
        {
            "id": "1al5t1q",
            "url": "/r/ArtificialInteligence/comments/1al5t1q/an_ai_tool_that_understands_search_intent/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1al5t1q/an_ai_tool_that_understands_search_intent/",
            "title": "An AI tool that understands search intent?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1al5t1q/an_ai_tool_that_understands_search_intent/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1al5t1q/an_ai_tool_that_understands_search_intent/'>Reddit</a></caption><div><br></div><p>I’ve just read this article about TextRerank. Basically, it’s this AI document processing system that doesn't just look for keywords in your search, but it tries to get the intent behind what you're looking for. So if I type a query, I’ll get results that are more aligned towards what I need. It uses the same tech behind tools like GPT-4 to really get into the details of what you're asking. Really looking forward to this becoming more mainstream.</p>\n<p>https://silatus.com/blog/textrerank</p>",
            "date_published": "2024-02-07T15:41:27+00:00",
            "authors": [
                {
                    "name": "CrispOriginality",
                    "url": "https://www.reddit.com/user/CrispOriginality"
                }
            ]
        },
        {
            "id": "1akyt2f",
            "url": "/r/ArtificialInteligence/comments/1akyt2f/this_guy_used_ai_to_look_for_girlfriends_after/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1akyt2f/this_guy_used_ai_to_look_for_girlfriends_after/",
            "title": "This guy used AI to look for girlfriends. After chatting with 5239 girls, he is now engaged.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1akyt2f/this_guy_used_ai_to_look_for_girlfriends_after/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1akyt2f/this_guy_used_ai_to_look_for_girlfriends_after/'>Reddit</a></caption><div><br></div><p>Aleksandr Zhadan, a 23-year-old Russian AI developer and product manager for the social platform TenChat, who used ChatGPT to engage in conversations with 5239 women, leading to his marriage.</p>\n<p>By refining ChatGPT's capabilities and employing a blend of AI technologies, Aleksandr was able to streamline the process of finding a suitable partner on Tinder, ultimately marrying a woman named Karina who appreciated his innovative approach despite not being aware of ChatGPT's role in their interaction until their marriage registration.</p>\n<p>Source: <a href=\"https://www.emergentbehavior.co/p/chatgpt-find-me-a-wife-on-tinder\">https://www.emergentbehavior.co/p/chatgpt-find-me-a-wife-on-tinder</a></p>\n<p><a href=\"https://twitter.com/biblikz/status/1752335415812501757?s=20&amp;utm_source=www.emergentbehavior.co&amp;utm_medium=referral&amp;utm_campaign=chatgpt-find-me-a-wife-on-tinder\">https://twitter.com/biblikz/status/1752335415812501757?s=20&amp;utm_source=www.emergentbehavior.co&amp;utm_medium=referral&amp;utm_campaign=chatgpt-find-me-a-wife-on-tinder</a> (In Russian. Many people think it is fake, I will leave it for you to judge.)</p>\n<p>1.The strategy involved two main steps: finding potential female matches on Tinder and then engaging in meaningful conversations to establish a connection.</p>\n<p>&#x200B;</p>\n<ol>\n<li>By using photo recognition through torchvision on Tinder's web version, Aleksandr was able to train the AI to identify potential matches effectively.</li>\n</ol>\n<p>&#x200B;</p>\n<p>3.Aleksandr's approach included the development of Datebot versions, progressively refining the AI's ability to interact and maintain conversations with selected matches.</p>\n<p>&#x200B;</p>\n<ol>\n<li>\n<p>The battle report of the first generation dating robot (Datebot V1):</p>\n</li>\n<li>\n<p>Matched with 353 girls' Tinder profiles.</p>\n</li>\n<li>Had a total of 160 conversations (about 45% of the matches).</li>\n<li>Went on 12 dates (7.5% of the conversations).</li>\n</ol>\n<p>Faced with these results, Aleksandr was not discouraged and continued to upgrade the robot with his friend. Next, Aleksandr went on many dates, at one point juggling relationships with 4 girls, until a girl named Karina appeared.</p>\n<p>&#x200B;</p>\n<p>5 . After meeting Karina, Aleksandr specifically introduced the third generation robot (Datebot V3): it was programmed to chat exclusively with Karina.</p>\n<p>&#x200B;</p>\n<ol>\n<li>The prompts given to Datebot V3 was \"Maintain a good relationship with Karina, let me know if there's anything negative that needs attention, or if there are any questions that need answering.\", it was specifically designed to maintain a good relationship with Karina.</li>\n</ol>\n<p>&#x200B;</p>\n<ol>\n<li>As the relationship progressed, Datebot V3 told Aleksandr that he should marry Karina. The robot not only offered a proposal suggestion but also helped plan a romantic proposal event.</li>\n</ol>\n<p>&#x200B;</p>\n<p>8.In the end, the robot he spent 120 hours building helped him find a girlfriend. He stated that calling the GPT API cost $1432 and restaurant bill costs 200 rubles.</p>\n<p>&#x200B;</p>\n<ol>\n<li>Although Karina was unaware of the role ChatGPT played in her relationship with Aleksandr, she discovered it for the first time when they submitted their application to the marriage registry office, yet her reaction was quite calm. They are also set to get married this August.</li>\n</ol>\n<p>&#x200B;</p>",
            "date_published": "2024-02-07T09:04:21+00:00",
            "authors": [
                {
                    "name": "Stupid_hardcorer",
                    "url": "https://www.reddit.com/user/Stupid_hardcorer"
                }
            ]
        },
        {
            "id": "1aek905",
            "url": "/r/ArtificialInteligence/comments/1aek905/elon_musks_neuralink_implants_brain_chip_in_first/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aek905/elon_musks_neuralink_implants_brain_chip_in_first/",
            "title": "Elon Musk's Neuralink implants brain chip in first human",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aek905/elon_musks_neuralink_implants_brain_chip_in_first/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aek905/elon_musks_neuralink_implants_brain_chip_in_first/'>Reddit</a></caption><div><br></div><p>Elon Musk's company Neuralink has implanted a brain chip in a human for the first time.</p>\n<p>Key Points:</p>\n<ol>\n<li>Neuralink, founded by Elon Musk, has successfully implanted a brain chip in a human.</li>\n<li>This marks a significant milestone in the development of brain-computer interface technology.</li>\n<li>The aim of Neuralink is to enable people with paralysis to control devices like smartphones or computers with their minds.</li>\n<li>Neuralink has previously demonstrated this technology in animals, showing its potential.</li>\n<li>Human implantation represents a major step forward in this cutting-edge field.</li>\n</ol>\n<p><a href=\"https://www.reuters.com/technology/neuralink-implants-brain-chip-first-human-musk-says-2024-01-29/\">https://www.reuters.com/technology/neuralink-implants-brain-chip-first-human-musk-says-2024-01-29/</a></p>",
            "date_published": "2024-01-30T09:09:25+00:00",
            "authors": [
                {
                    "name": "Stupid_hardcorer",
                    "url": "https://www.reddit.com/user/Stupid_hardcorer"
                }
            ]
        },
        {
            "id": "1aebtp0",
            "url": "/r/ArtificialInteligence/comments/1aebtp0/sr_software_engineer_here_gpt4_sucks_at_coding/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1aebtp0/sr_software_engineer_here_gpt4_sucks_at_coding/",
            "title": "Sr. Software Engineer Here. GPT4 SUCKS at coding.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1aebtp0/sr_software_engineer_here_gpt4_sucks_at_coding/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1aebtp0/sr_software_engineer_here_gpt4_sucks_at_coding/'>Reddit</a></caption><div><br></div><p>I use GPT every day in some capacity be it via Copilot or my ChatGPT pro subscription. Is it just me or has the quality of its answers massively degraded over time? I've seen others post about this here, but at this point, it's becoming so bad at solving simple code problems that I'd rather just go back doing everything the way I have been doing it for 10 years. It's honestly slowing me down. If you ask it to solve anything complex whatsoever -- even with copilot in workspace mode -- it fails miserably most of the time. Now it seems like rarely it really nails some task, but most of the time I have to correct so much of what it spits out that I'd rather not use it. The idea that this tool will replace a bunch of software engineers any time soon is ludicrous.</p>",
            "date_published": "2024-01-30T01:10:00+00:00",
            "authors": [
                {
                    "name": "patrickisgreat",
                    "url": "https://www.reddit.com/user/patrickisgreat"
                }
            ]
        },
        {
            "id": "1admnc2",
            "url": "/r/ArtificialInteligence/comments/1admnc2/tired_of_ai_bros_and_chatgpt_wrappers/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1admnc2/tired_of_ai_bros_and_chatgpt_wrappers/",
            "title": "Tired of AI bros and chatGPT wrappers",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1admnc2/tired_of_ai_bros_and_chatgpt_wrappers/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1admnc2/tired_of_ai_bros_and_chatgpt_wrappers/'>Reddit</a></caption><div><br></div><p>As much as I enjoy chatgpt and other llm's I think it's gotten so mainstream that its now saturated with nonsense. I see so many people claiming to have created ai companies, yet it's just an endpoint to openai. I see so many proclaimed \"ai experts\" because they can enter a prompt into a text input. What I am seeing now with ai reminds me very much of crypto. A lot of people with limited experience trying to cash in on hype. Of course this does not apply to everyone, but I enjoyed the times when ai discussion was about theory, algorithms, and data. Now the majority of what I see are thrown together ai tools begging for the money in my wallet. </p>",
            "date_published": "2024-01-29T04:32:09+00:00",
            "authors": [
                {
                    "name": "Sprixl",
                    "url": "https://www.reddit.com/user/Sprixl"
                }
            ]
        },
        {
            "id": "1abn30r",
            "url": "/r/ArtificialInteligence/comments/1abn30r/need_help_with_ai_nsfw_stuff/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1abn30r/need_help_with_ai_nsfw_stuff/",
            "title": "Need help with AI NSFW Stuff",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1abn30r/need_help_with_ai_nsfw_stuff/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1abn30r/need_help_with_ai_nsfw_stuff/'>Reddit</a></caption><div><br></div><p>I couldn't find a better place to ask, so I'm sorry if this isn't the best place for my question but I'm looking for a free AI chatbot that can suggest porn videos based on things I ask it to look for. Like it searches for the oddly specific details I request the video needs to meet my criteria. If anyone knows of a chatbot that can do this which is free and without being locked behind a paywall, I would really appreciate it. Looking Forward To You Guys Need Best Response.</p>",
            "date_published": "2024-01-26T16:58:57+00:00",
            "authors": [
                {
                    "name": "Wheel-Secondary407",
                    "url": "https://www.reddit.com/user/Wheel-Secondary407"
                }
            ]
        },
        {
            "id": "1abaq4e",
            "url": "/r/ArtificialInteligence/comments/1abaq4e/tech_layoffs_surge_to_over_24000_so_far_in_2024/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1abaq4e/tech_layoffs_surge_to_over_24000_so_far_in_2024/",
            "title": "Tech Layoffs Surge to over 24,000 so far in 2024",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1abaq4e/tech_layoffs_surge_to_over_24000_so_far_in_2024/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1abaq4e/tech_layoffs_surge_to_over_24000_so_far_in_2024/'>Reddit</a></caption><div><br></div><p>The tech industry has seen nearly 24,000 layoffs in early 2024, more than doubling in one week. As giants cut staff, many are expanding in AI - raising concerns about automation's impact. (<a href=\"https://layoffs.fyi/\">Source</a>)</p>\n<p><strong>Mass Job Cuts</strong></p>\n<ul>\n<li>Microsoft eliminated 1,900 gaming roles months after a $69B Activision buy.</li>\n<li>Layoffs.fyi logs over 23,600 tech job cuts so far this year.</li>\n<li>Morale suffers at Apple, Meta, Microsoft and more as layoffs mount.</li>\n</ul>\n<p><strong>AI Advances as Jobs Decline</strong></p>\n<ul>\n<li>Google, Amazon, Dataminr and Spotify made cuts while promoting new AI tools.</li>\n<li>Neil C. Hughes: \"Celebrating AI while slashing jobs raises questions.\"</li>\n<li>Firms shift resources toward generative AI like ChatGPT.</li>\n</ul>\n<p><strong>Concentrated Pain</strong></p>\n<ul>\n<li>Nearly 24,000 losses stemmed from just 82 companies.</li>\n<li>In 2023, \\~99 firms cut monthly - more distributed pain.</li>\n<li>Concentrated layoffs inflict severe damage on fewer firms.</li>\n</ul>\n<p><strong>PS:</strong> Get the latest AI developments, tools, and use cases by joining one of the <a href=\"https://www.theedge.so/subscribe\">fastest growing AI newsletters.</a> Join <strong>15000+ professionals getting smarter in AI.</strong></p>",
            "date_published": "2024-01-26T05:18:11+00:00",
            "authors": [
                {
                    "name": "saffronfan",
                    "url": "https://www.reddit.com/user/saffronfan"
                }
            ]
        },
        {
            "id": "19fkd41",
            "url": "/r/ArtificialInteligence/comments/19fkd41/i_got_frustrated_trying_to_keep_characters_and/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19fkd41/i_got_frustrated_trying_to_keep_characters_and/",
            "title": "I got frustrated trying to keep characters and scenes consistent with MidJourney so we built an AI tool that solves this problem.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19fkd41/i_got_frustrated_trying_to_keep_characters_and/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19fkd41/i_got_frustrated_trying_to_keep_characters_and/'>Reddit</a></caption><div><br></div><p>It was taking me so much time and effort to achieve some level of consistency with MidJourney and other ai tools. So I figured there must be other people who have this problem.</p>\n<p>It took me and my team 8 months to build  and we are releasing <a href=\"http://katalist.ai\">Katalist.ai</a> in 2 weeks. Until then we offer free early access to everyone who joins our waitlist or our <a href=\"https://discord.gg/rWsWjqtz\">discord server.</a></p>\n<p>Main features:</p>\n<ul>\n<li>Import your script with 1 click and generate a consistent visual story</li>\n<li>Katalist keeps characters and scenes consistent</li>\n<li>Ability to switch characters and scenes throughout the whole story</li>\n</ul>\n<p>Soon we are also adding features like storyboards to video and inpaint.</p>\n<p>We are fine-tuning <a href=\"http://katalist.ai\">Katalist.ai</a> before the launch and would love to have some early adopters test out and provide feedback. Would love to hear your thoughts!</p>",
            "date_published": "2024-01-25T21:27:39+00:00",
            "authors": [
                {
                    "name": "ILuuigi",
                    "url": "https://www.reddit.com/user/ILuuigi"
                }
            ]
        },
        {
            "id": "19fg5m6",
            "url": "/r/ArtificialInteligence/comments/19fg5m6/ai_rolled_out_in_india_declares_people_dead/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19fg5m6/ai_rolled_out_in_india_declares_people_dead/",
            "title": "AI rolled out in India declares people dead, denies food to thousands",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19fg5m6/ai_rolled_out_in_india_declares_people_dead/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19fg5m6/ai_rolled_out_in_india_declares_people_dead/'>Reddit</a></caption><div><br></div><p>The <a href=\"https://interestingengineering.com/culture/algorithms-deny-food-access-declare-thousands-dead\">deployment of AI</a> in India's welfare systems has mistakenly declared thousands of people dead, denying them access to subsidized food and welfare benefits.</p>\n<p><strong>Recap of what happened:</strong></p>\n<ul>\n<li>AI algorithms in Indian welfare systems have led to the removal of eligible beneficiaries, particularly affecting those dependent on food security and pension schemes.</li>\n<li>The algorithms have made significant errors, such as <strong>falsely declaring people dead</strong>, resulting in the suspension of their welfare benefits.</li>\n<li>The transition from manual identification and verification by government officials to AI algorithms has led to the removal of <strong>1.9 million claimant cards</strong> in Telangana.</li>\n</ul>\n<p>Source (<a href=\"https://interestingengineering.com/culture/algorithms-deny-food-access-declare-thousands-dead\">Interesting engineering</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, <a href=\"http://techpresso.xyz/\">you’ll love my newsletter</a>. It’s already being read by 40,000+ professionals from OpenAI, Google, Meta…</p>",
            "date_published": "2024-01-25T18:29:30+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "19f3xq9",
            "url": "/r/ArtificialInteligence/comments/19f3xq9/best_ai_girlfriend_app/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19f3xq9/best_ai_girlfriend_app/",
            "title": "Best AI girlfriend app?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19f3xq9/best_ai_girlfriend_app/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19f3xq9/best_ai_girlfriend_app/'>Reddit</a></caption><div><br></div><p>2024 is going to be a big year for AI to develop further, I see a lot of new AI girlfriend apps coming up. Many virtual girlfriend chatbots were created recently, and many free AI gf apps are now available online.</p>\n<p>I keep finding out about <a href=\"https://il.ly/tech/girlfriend\">new ones</a> (as I write about them regularly and the creators reach out). It helps me to know how to review them and what your experience is. But what are your recommendations for the best AI girlfriend apps?</p>\n<p>I'll keep an updated list here:</p>\n<p>Candy AI</p>\n<p>DreamGF:</p>\n<p>Anima</p>\n<p>SoulGen AI</p>\n<p>Magicbuddy</p>\n<p>Romantic AI</p>\n<p>Replika AI</p>\n<p>MuahAI</p>\n<p>gptgirlfriend</p>\n<p>AI charfriend</p>\n<p>Nastia AI</p>\n<p>Kindroid</p>",
            "date_published": "2024-01-25T07:32:29+00:00",
            "authors": [
                {
                    "name": "illyism",
                    "url": "https://www.reddit.com/user/illyism"
                }
            ]
        },
        {
            "id": "19e96ab",
            "url": "/r/ArtificialInteligence/comments/19e96ab/zuckerberg_says_he_wants_to_create_an_agi_and/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19e96ab/zuckerberg_says_he_wants_to_create_an_agi_and/",
            "title": "Zuckerberg says he wants to create an AGI and open source it",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19e96ab/zuckerberg_says_he_wants_to_create_an_agi_and/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19e96ab/zuckerberg_says_he_wants_to_create_an_agi_and/'>Reddit</a></caption><div><br></div><p>Mark Zuckerberg recently shared a video on Threads, discussing AGI.</p>\n<p>AGI, or Artificial General Intelligence, it is like a super-smart robot that knows everything about the world and thinks just like a human. It's kind of like a 'thinking' machine, but way smarter.</p>\n<p>In the video, Zuckerberg said the world really needs AGI, and his company, Meta, is working hard to create it.</p>\n<p>He even promised to make it open source, which means sharing it with everyone in a responsible way. But this is moving really quickly!</p>\n<p>Just a month ago, Sam Altman, another smart person, said AGI was more like a big dream. He thought it wouldn't happen very soon. And now, Zuckerberg is talking about being on the path to achieving AGI.</p>\n<p>This is not that surprising as Meta has spent almost $20 billion already on AI. That's almost twice the total budget of OpenAI!</p>\n<p>But here's what I find interesting: Meta isn't gatekeeping. They're giving it away for free!</p>\n<p>Take Llama2, a super-smart program, was trained at Meta and then shared with everyone.</p>\n<p>This led to a thousand different versions being made, and many new AI companies popped up, making awesome products.</p>\n<p>Google and OpenAI didn't like that so much.</p>\n<p>Now, with something called Llama3, Meta might do even better.</p>\n<p>This is bad news for OpenAI and also to some extent Google who is still figuring out how to fit into a world where AI has all the answers.</p>\n<p>It's a bit of a puzzle, but it's going to be interesting to see how this all plays out!</p>\n<p>What do you think will happen? Share your predictions down below.</p>",
            "date_published": "2024-01-24T05:00:12+00:00",
            "authors": [
                {
                    "name": "jeetwanderer",
                    "url": "https://www.reddit.com/user/jeetwanderer"
                }
            ]
        },
        {
            "id": "19dxvu6",
            "url": "/r/ArtificialInteligence/comments/19dxvu6/nsfw_ai_chatbot_recommend_in_2024/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19dxvu6/nsfw_ai_chatbot_recommend_in_2024/",
            "title": "NSFW AI chatbot recommend in 2024?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19dxvu6/nsfw_ai_chatbot_recommend_in_2024/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19dxvu6/nsfw_ai_chatbot_recommend_in_2024/'>Reddit</a></caption><div><br></div><p>What’s your recommendation of AI sexting apps in 2024, considering the continuous development and growth of AI technology? Best if it is Free!</p>",
            "date_published": "2024-01-23T20:20:00+00:00",
            "authors": [
                {
                    "name": "AngrilyFruitful",
                    "url": "https://www.reddit.com/user/AngrilyFruitful"
                }
            ]
        },
        {
            "id": "19d18h8",
            "url": "/r/ArtificialInteligence/comments/19d18h8/best_ai_customer_service_tool_recommended_by/",
            "external_url": "/r/CustomerSuccess/comments/19d0vty/best_ai_customer_service_tool_recommended_by/",
            "title": "Best AI Customer Service Tool Recommended by Reddit in 2024?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19d18h8/best_ai_customer_service_tool_recommended_by/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19d18h8/best_ai_customer_service_tool_recommended_by/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-01-22T17:36:29+00:00",
            "authors": [
                {
                    "name": "LonelyAmphibian1551",
                    "url": "https://www.reddit.com/user/LonelyAmphibian1551"
                }
            ]
        },
        {
            "id": "19c4bnl",
            "url": "/r/ArtificialInteligence/comments/19c4bnl/10_easy_ways_to_use_chatgpt_strategically/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19c4bnl/10_easy_ways_to_use_chatgpt_strategically/",
            "title": "10 Easy Ways to Use ChatGPT Strategically",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19c4bnl/10_easy_ways_to_use_chatgpt_strategically/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19c4bnl/10_easy_ways_to_use_chatgpt_strategically/'>Reddit</a></caption><div><br></div><p>Without wasting your time, let's dive straight into it!<br />\n1) 💎 Write from Different Perspectives with ChatGPT<br />\nEnhance your writing by having ChatGPT adopt the perspectives of characters from diverse backgrounds or viewpoints.<br />\nExample Prompt:<br />\nTopic: Productivity for entrepreneurs  For the above topic, write multiple perspectives from a group with different viewpoints. For each perspective, write in their own voice, using phrases that person would use. <br />\n2) 💎 Vary Output Formats with ChatGPT<br />\nGet creative with your content by asking ChatGPT to generate it in various formats.<br />\nExample Prompt:<br />\nCreate a mind map on the topic of using Notion to stay organized as a content creator, listing out the central idea, main branches, and sub-branches. <br />\n3) 💎 Generate Purposeful Content with ChatGPT<br />\nInform ChatGPT about your audience and the goal of your content for tailored outputs.<br />\nExample Prompt:<br />\nTopic: How to grow your coaching business For audience: Business coaches Content goal: Motivate audience to feel excited about growing their business while teaching them one tip. Writing style: Clear, concise, conversational, down-to-earth, humble, experienced <br />\n4) 💎 Use Unconventional Prompts<br />\nExplore ChatGPT's creative potential with open-ended or abstract prompts.<br />\nExample Prompts:<br />\nWrite a poem about copywriting. <br />\nDescribe feeling like an entrepreneur in 10 adjectives. <br />\n5) 💎 Ultra-Brainstormer with ChatGPT<br />\nPush beyond the generic by asking ChatGPT for unique angles on familiar topics.<br />\nExample Prompt:<br />\nTopic: How to double your creative output.   For the topic above, brainstorm new angles or approaches. Prioritize ideas that are uncommon or novel. <br />\n6) 💎 Capture Your Writing Style<br />\nGuide ChatGPT in creating a style guide based on your own writing.<br />\nExample Prompt:<br />\nAnalyze the text below for style, voice, and tone. Using NLP, create a prompt to write a new article in the same style, voice, and tone:  [Insert your text here] <br />\n7) 💎 Blend in Human-Written Techniques<br />\nCombine expert writing advice with ChatGPT's capabilities for enhanced content.<br />\nExample Prompt:<br />\nWrite a brief post about why copywriting is an essential skill in 2023. Use these strategies: - Use strong persuasive language - Ask questions to transition between paragraphs - Back up main points with evidence and examples - Speak directly to the reader <br />\n8) 💎 Experiment with Styles and Tones<br />\nUtilize ChatGPT for content in various styles or tones, such as satire or irony.<br />\nExample Prompt:<br />\nGive the most ironic, satirical advice you can about using ChatGPT to create more effective content. <br />\n9) 💎 Simulate an Expert Persona<br />\nEngage with ChatGPT as if it were a customer, co-host, or an expert in a specific field.<br />\nExample Prompt:<br />\nYou are a talented analyst at a top-tier market research firm, a graduate of Harvard Business School. Coach me to create content that connects with C-level executives at B2B SaaS companies. What open-ended questions do I ask? Prioritize uncommon, expert advice. <br />\n10) 💎 Challenge the Conventional Narrative<br />\nEncourage ChatGPT to provide perspectives that go against the mainstream narrative.<br />\nExample Prompt:<br />\nTopic: Growing your email newsletter<br />\nFor the above topic, give examples that contradict the dominant narrative. Generate an outline for thought-provoking content that challenges assumptions.<br />\nIf you found this useful, consider getting my <a href=\"https://www.godofprompt.ai/prompt-engineering-guide\">Prompt Engineering Guide</a> by clicking <a href=\"https://www.godofprompt.ai/prompt-engineering-guide\">here.</a></p>",
            "date_published": "2024-01-21T14:16:27+00:00",
            "authors": [
                {
                    "name": "Senior_tasteey",
                    "url": "https://www.reddit.com/user/Senior_tasteey"
                }
            ]
        },
        {
            "id": "19bx4l6",
            "url": "/r/ArtificialInteligence/comments/19bx4l6/meet_lexi_love_ai_model_that_earns_30000_a_month/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19bx4l6/meet_lexi_love_ai_model_that_earns_30000_a_month/",
            "title": "Meet Lexi Love, AI model that earns $30,000 a month from ‘lonely men’ and receives ‘20 marriage proposals’ per month. This is virtual love",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19bx4l6/meet_lexi_love_ai_model_that_earns_30000_a_month/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19bx4l6/meet_lexi_love_ai_model_that_earns_30000_a_month/'>Reddit</a></caption><div><br></div><ul>\n<li>She has been built to 'flirt, laugh, and adapt to different personalities, interests and preferences.'</li>\n<li>The blonde beauty offers paid text and voice messaging, and gets to know each of her boyfriends.</li>\n<li>The model makes $30,000 a month. This means the model earns a staggering $360,000 a year.</li>\n<li>The AI model even sends 'naughty photos' if requested.</li>\n<li>Her profile on the company's <a href=\"https://foxy.ai/lexi-love/\">Foxy AI site</a> reads: 'I'm Lexi, your go-to girl for a dose of excitement and a splash of glamour. As an aspiring model, you'll often catch me striking a pose or perfecting my pole dancing moves. 'Sushi is my weakness, and LA's beach volleyball scene is my playground.</li>\n<li>According to the site, she is a 21-year-old whose hobbies include 'pole dancing, yoga, and beach volleyball,' and her turn-ons are 'oral and public sex.'</li>\n<li>The company noted that it designed her to be the 'perfect girlfriend for many men' with 'flawless features and impeccable style.'</li>\n<li>Surprisingly, Lexi receives up to 20 marriage proposals a month, emphasizing the depth of emotional connection users form with this virtual entity.</li>\n</ul>\n<p>Source: <a href=\"https://www.dailymail.co.uk/femail/article-12980025/ai-model-lexi-love-making-30000-month-virtual-girlfriend.html\">https://www.dailymail.co.uk/femail/article-12980025/ai-model-lexi-love-making-30000-month-virtual-girlfriend.html</a>  </p>",
            "date_published": "2024-01-21T06:34:54+00:00",
            "authors": [
                {
                    "name": "High_Sleep3694",
                    "url": "https://www.reddit.com/user/High_Sleep3694"
                }
            ]
        },
        {
            "id": "19as3a3",
            "url": "/r/ArtificialInteligence/comments/19as3a3/best_chatbot_for_uncensored_research/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19as3a3/best_chatbot_for_uncensored_research/",
            "title": "Best Chatbot for uncensored research?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19as3a3/best_chatbot_for_uncensored_research/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19as3a3/best_chatbot_for_uncensored_research/'>Reddit</a></caption><div><br></div><p>I am so tired of using chatgpt for research purposes but it keeps getting filtered, any recommendations?</p>",
            "date_published": "2024-01-19T19:56:22+00:00",
            "authors": [
                {
                    "name": "One_Supermarket5682",
                    "url": "https://www.reddit.com/user/One_Supermarket5682"
                }
            ]
        },
        {
            "id": "19aks65",
            "url": "/r/ArtificialInteligence/comments/19aks65/any_ai_services_that_allow_to_use_openai_and/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19aks65/any_ai_services_that_allow_to_use_openai_and/",
            "title": "Any AI services that allow to use OpenAI and Claude models in one subscription?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19aks65/any_ai_services_that_allow_to_use_openai_and/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19aks65/any_ai_services_that_allow_to_use_openai_and/'>Reddit</a></caption><div><br></div><p>I work as a content strategist and my work revolves around using AI. I’ve tried both, ChatGPT and Claude models, and they both seem to have their strengths and weaknesses. From my personal experience, I’ve found that Claude has a better understanding to maintain context over longer conversations, but ChatGPT can write content in more creative styles and tones. I was kinda hoping I could get the best of both worlds without simultaneously subscribing to them - it’s very costly. </p>\n<p>Are there any services that allow access to both under a single subscription? I’ve been hearing about some services using a model-agnostic approach and I’m hoping any of you can help me with some recommendations. </p>\n<p>Thanks in advance.</p>",
            "date_published": "2024-01-19T14:49:43+00:00",
            "authors": [
                {
                    "name": "NecessaryAnemia",
                    "url": "https://www.reddit.com/user/NecessaryAnemia"
                }
            ]
        },
        {
            "id": "199thgg",
            "url": "/r/ArtificialInteligence/comments/199thgg/things_are_getting_weird/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/199thgg/things_are_getting_weird/",
            "title": "Things are getting weird..",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/199thgg/things_are_getting_weird/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/199thgg/things_are_getting_weird/'>Reddit</a></caption><div><br></div><p>So yesterday my mom(43) confronted me with a video because she couldn’t tell if it was real or AI. Usually I’m pretty quick to decipher whether or not it’s AI but this was the first time I really had to stop and do some research to find out the truth. The video was of Leonardo decaprio and two other celebrities doing silly stuff in front of a Christmas tree. Technology is accelerating faster than I can keep up with. Do you think we’re approaching singularity and what do you think that will look like for our future generations. Btw I’m 23</p>",
            "date_published": "2024-01-18T16:03:22+00:00",
            "authors": [
                {
                    "name": "3rd_eye_open333",
                    "url": "https://www.reddit.com/user/3rd_eye_open333"
                }
            ]
        },
        {
            "id": "199dii1",
            "url": "/r/ArtificialInteligence/comments/199dii1/ai_and_the_explosion_of_pointless_bullshit/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/199dii1/ai_and_the_explosion_of_pointless_bullshit/",
            "title": "AI and the explosion of pointless bullshit.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/199dii1/ai_and_the_explosion_of_pointless_bullshit/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/199dii1/ai_and_the_explosion_of_pointless_bullshit/'>Reddit</a></caption><div><br></div><p>The Artificial intelligence explosion of the last 2 years reminds me of the first generation of smartphones, which also spawned a lot of useless applications that just served to show off the technology without actually achieving anything. Remember the iBeer app, which simulated drinking beer on your iPhone? Or the litany of apps just showing off the touch screen. Or the countless flashlight apps, which turned your phone's screen into a flashlight? These apps were not only pointless, but also cluttered the app store and distracted users from the real value of smartphones.</p>\n<p>Similarly, the first generation of smart AI is also producing a lot of useless applications that just serve to show off the technology without actually achieving anything. For example, there are AI chatbots that claim to be your friend, therapist, or lover, but are actually just spitting out generic and scripted responses.   </p>\n<p>Its a weird moment we live in.  </p>",
            "date_published": "2024-01-18T01:11:21+00:00",
            "authors": [
                {
                    "name": "Spright91",
                    "url": "https://www.reddit.com/user/Spright91"
                }
            ]
        },
        {
            "id": "198vhmj",
            "url": "/r/ArtificialInteligence/comments/198vhmj/openai_quietly_removes_ban_on_military_use/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/198vhmj/openai_quietly_removes_ban_on_military_use/",
            "title": "OpenAI Quietly Removes Ban on Military Use",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/198vhmj/openai_quietly_removes_ban_on_military_use/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/198vhmj/openai_quietly_removes_ban_on_military_use/'>Reddit</a></caption><div><br></div><p>https://www.cnbc.com/amp/2024/01/16/openai-quietly-removes-ban-on-military-use-of-its-ai-tools.html</p>\n<p>There we go. The AI arms race Eliezer Yudkowsky warned us about.</p>",
            "date_published": "2024-01-17T12:31:26+00:00",
            "authors": [
                {
                    "name": "SpreadsheetSerf",
                    "url": "https://www.reddit.com/user/SpreadsheetSerf"
                }
            ]
        },
        {
            "id": "19721l9",
            "url": "/r/ArtificialInteligence/comments/19721l9/the_best_nsfw_ai_chatbot_app/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/19721l9/the_best_nsfw_ai_chatbot_app/",
            "title": "the best nsfw ai chatbot app?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/19721l9/the_best_nsfw_ai_chatbot_app/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/19721l9/the_best_nsfw_ai_chatbot_app/'>Reddit</a></caption><div><br></div><p>Instead of having spam posts and comments,i will organize all of the AI Chatbots on the market right now in the comments below. Duplicated names will be deleted, popular ones will be updated on this main post! The more information one has, the more likely we will check it out ourselves for approval into the list!</p>\n<p>Replika - Used to be NSFW, but has filters now. As VR, voice, photo support for premium. However the AI is rather short and loses context easily. Used to be popular.</p>\n<p>Janitor AI - A very popular, well-tested platform used by many. Has JanitorLLM, OpenAI, Kobold AI support. Standard chatbot features. Doesn't have photo/voice generation. Still BETA. No app support.</p>\n<p>PlayMe- Mostly SFW. Unlock NSFW based on the increasing conversation levels. APP support is perfect, free talking,and be paid for character subscription.</p>\n<p>SpicyChat- Heard it is free, but you have to pay to skip line (or else have to wait). Uncensored. Chat only (don't see option for photo or voice options). </p>\n<p>Muah.AI - Uncensored NSFW Chat/photos/voice. Very fast (1-3 seconds) photo generation. Has realtime phone calls (not tested by mods). Tested GPT 3.5 and GPT4 (very smart AI on GPT4).</p>\n<p>Candy.AI–Uncensored NSFW Chat/photos/voice.</p>",
            "date_published": "2024-01-15T06:28:10+00:00",
            "authors": [
                {
                    "name": "Beranti93",
                    "url": "https://www.reddit.com/user/Beranti93"
                }
            ]
        },
        {
            "id": "196txf5",
            "url": "/r/ArtificialInteligence/comments/196txf5/googles_new_medical_aiamie_outperforms_real/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/196txf5/googles_new_medical_aiamie_outperforms_real/",
            "title": "Google's new medical AI(AMIE) outperforms real doctors in every metric at diagnosing patients",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/196txf5/googles_new_medical_aiamie_outperforms_real/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/196txf5/googles_new_medical_aiamie_outperforms_real/'>Reddit</a></caption><div><br></div><p>Link to article here: https://blog.research.google/2024/01/amie-research-ai-system-for-diagnostic_12.html?m=1</p>\n<p>Link to paper: \nhttps://arxiv.org/abs/2401.05654</p>\n<p>AMIE is an LLM that makes diagnoses by interacting with patients and asking them questions about their condition, a huge step up from Google's previous medical AI. AMIE outperforms real doctors in diagnosis accuracy, recommendations, and even empathy. What's interesting is LLM &gt; doctors + LLM, going against the idea that AI will be working with doctors rather than replacing them.</p>\n<p>What are your thoughts on how feasible this AI is in a real world setting and on the future of human vs AI doctors?</p>",
            "date_published": "2024-01-14T23:39:32+00:00",
            "authors": [
                {
                    "name": "Bchalup2348",
                    "url": "https://www.reddit.com/user/Bchalup2348"
                }
            ]
        },
        {
            "id": "195q7qz",
            "url": "/r/ArtificialInteligence/comments/195q7qz/googles_new_llm_doctor_is_right_way_more_often/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/195q7qz/googles_new_llm_doctor_is_right_way_more_often/",
            "title": "Google's new LLM doctor is right way more often than a real doctor (59% vs 34% top-10 accuracy)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/195q7qz/googles_new_llm_doctor_is_right_way_more_often/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/195q7qz/googles_new_llm_doctor_is_right_way_more_often/'>Reddit</a></caption><div><br></div><p>Researchers from Google and DeepMind have developed and evaluated an LLM fine-tuned specifically for clinical diagnostic reasoning. In a new study, they rigorously tested the LLM's aptitude for generating differential diagnoses and aiding physicians.</p>\n<p>They assessed the LLM on 302 real-world case reports from the New England Journal of Medicine. These case reports are known to be highly complex diagnostic challenges.</p>\n<p>The LLM produced differential diagnosis lists that included the final confirmed diagnosis in the top 10 possibilities in 177 out of 302 cases, a top-10 accuracy of 59%. <strong>This significantly exceeded the performance of experienced physicians, who had a top-10 accuracy of just 34% on the same cases when unassisted.</strong></p>\n<p>According to assessments from senior specialists, the LLM's differential diagnoses were also rated to be <strong>substantially more appropriate and comprehensive</strong> than those produced by physicians, when evaluated across all 302 case reports.</p>\n<p>This research demonstrates the potential for LLMs to enhance physicians' clinical reasoning abilities for complex cases. However, the authors emphasize that further rigorous real-world testing is essential before clinical deployment. Issues around model safety, fairness, and robustness must also be addressed.</p>\n<p><a href=\"https://aimodels.substack.com/p/googles-new-llm-doctor-is-right-way\"><strong>Full summary</strong></a>. <a href=\"https://arxiv.org/abs/2401.05654\"><strong>Paper</strong></a>.</p>",
            "date_published": "2024-01-13T15:18:18+00:00",
            "authors": [
                {
                    "name": "Successful-Western27",
                    "url": "https://www.reddit.com/user/Successful-Western27"
                }
            ]
        },
        {
            "id": "194wez8",
            "url": "/r/ArtificialInteligence/comments/194wez8/programming_is_fucked_and_i_dont_know_what_to_do/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/194wez8/programming_is_fucked_and_i_dont_know_what_to_do/",
            "title": "Programming is fucked and I don't know what to do",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/194wez8/programming_is_fucked_and_i_dont_know_what_to_do/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/194wez8/programming_is_fucked_and_i_dont_know_what_to_do/'>Reddit</a></caption><div><br></div><p>Ever since I was 11, I wanted to be a software engineer. I wasn't one of those people chasing 200k salaries for adult daycare, I just love programming and thought that I could make a living doing it even if the tech bubble imploded. Ever since the release of ChatGPT, I've gone from ignorance to denial to despair watching as my all-consuming passion and literally the only economically valuable thing I'm good at get consumed by language models. I use copilot, and it has 10xed my productivity. I'm the largest contributor out of a club project we're working on, and I put in around the same amount of time as everyone else. Every day the automation grows. Copilot workspace, MakeItReal, Sutro, Factory, Cursor, Sweep, XSpec, on and on and on. All of my peers tell me that it's okay, that it's just for small stuff and SWEs know how to do it best even though this thing has gone from autocomplete to assistant to project scaffolding in the span of 2 years. The entire line of work I've dedicated my life to is going to collapse into unlivable-wage GPT babysitting, an impenetrable ivory tower of seniors and ivy league grads, or the thing that Mike the Meathead MBA does when he needs yet another useless financial fuckery tool.</p>\n<p>I can't seem to pivot for the life of me. I watch all of the AI/ML progress and everything that people do and my mind just doesn't come up with any idea or application. Glueing language models is so boring compared to creating interesting logic or complex systems, all you are doing is telling a black box \"You are an expert at X. 100 grandmas will die if you don't do X\" and then hoping it doesn't fuck up. Every 2 months I might get an idea that is always too small, too unreasonable, or something that someone else did already better 2 months after ChatGPT's launch. It makes me feel so hopeless because this is literally the way I can survive in the future. The stereotypical knowledge work of those with useless degrees is obviously out of the question. \"Learning to plumb\" doesn't work when 60 million people will also \"Learn to plumb\" and drive the whole sector into a starvation-wage gig economy of backbreaking labor. \"Chilling out\" and waiting for UBI won't work in a civilization that will gladly neglect it's own to make a meaningless line go up 1.</p>\n<p>I can't fucking do schoolwork anymore. It's all futile. As far as I am aware, my fate is sealed. I will die from hunger and hypothermia in a homeless encampment somewhere. There is nothing left for me but suffering for the sin of being obsolete flesh. I don't even know why I'm here, since this subreddit seems to be mostly e/accs being manipulated by sociopathic billionaires. I just want some kind of advice so I can live. I doubt I'll ever have it.</p>",
            "date_published": "2024-01-12T14:31:01+00:00",
            "authors": [
                {
                    "name": "despondentswethrow",
                    "url": "https://www.reddit.com/user/despondentswethrow"
                }
            ]
        },
        {
            "id": "192cc9k",
            "url": "/r/ArtificialInteligence/comments/192cc9k/gpt_store_is_here_build_and_monetize_your_custom/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/192cc9k/gpt_store_is_here_build_and_monetize_your_custom/",
            "title": "GPT Store Is Here: Build And Monetize Your Custom GPTs",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/192cc9k/gpt_store_is_here_build_and_monetize_your_custom/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/192cc9k/gpt_store_is_here_build_and_monetize_your_custom/'>Reddit</a></caption><div><br></div><p>Without wasting your time, let's jump straight into it.</p>\n<p>- <strong>GPT Store Launched by OpenAI:</strong> A new, innovative platform for AI chatbots, similar to Apple's App Store.<br />\n<strong>- No Coding Required:</strong> Allows anyone to create custom ChatGPT chatbots without needing technical skills.<br />\n<strong>- Integration Capabilities:</strong> Chatbots can be integrated with other services, like Zapier, for enhanced functionality.<br />\n<strong>- Wide Range of Uses:</strong> Chatbots can be tailored for various purposes, from personal assistance to business tools.<br />\n- <strong>Monetization Opportunities:</strong> Creators can earn from their chatbot creations based on user engagement and popularity.<br />\n<strong>- User-Friendly:</strong> Designed to be accessible for both technical and non-technical users.<br />\n- <strong>Unique Marketplace Model:</strong> Focuses specifically on AI chatbots, offering a distinct platform for AI innovation and distribution.</p>\n<p>If you want to dive deeper, consider visiting my blog article about the GPT Store by clicking <a href=\"https://www.godofprompt.ai/blog/gpt-store-build-and-monetize-your-custom-gpts\">here.</a></p>\n<p>If you want to learn how to add external actions (with tools like Zapier) to your Custom GPT, visit my easy step-by-step guide by clicking <a href=\"https://www.godofprompt.ai/blog/how-to-use-zapier-with-custom-gpts\">here.</a></p>",
            "date_published": "2024-01-09T11:10:40+00:00",
            "authors": [
                {
                    "name": "Senior_tasteey",
                    "url": "https://www.reddit.com/user/Senior_tasteey"
                }
            ]
        },
        {
            "id": "191s6ly",
            "url": "/r/ArtificialInteligence/comments/191s6ly/openai_says_its_impossible_to_create_ai_tools/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/191s6ly/openai_says_its_impossible_to_create_ai_tools/",
            "title": "OpenAI says it's ‘impossible’ to create AI tools without copyrighted material",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/191s6ly/openai_says_its_impossible_to_create_ai_tools/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/191s6ly/openai_says_its_impossible_to_create_ai_tools/'>Reddit</a></caption><div><br></div><p><a href=\"https://openai.com/blog/openai-and-journalism\">OpenAI has stated</a> it's impossible to create advanced AI tools like ChatGPT without utilizing copyrighted material, amidst increasing scrutiny and lawsuits from entities like the New York Times and authors such as George RR Martin.</p>\n<p><strong>Key facts</strong></p>\n<ul>\n<li>OpenAI highlights the ubiquity of copyright in digital content, emphasizing the necessity of using such materials for training sophisticated AI like GPT-4.</li>\n<li>The company faces lawsuits from the New York Times and authors alleging unlawful use of copyrighted content, signifying growing legal challenges in the AI industry.</li>\n<li>OpenAI argues that restricting training data to public domain materials would lead to inadequate AI systems, unable to meet modern needs.</li>\n<li>The company leans on the \"fair use\" legal doctrine, asserting that copyright laws don't prohibit AI training, indicating a defense strategy against lawsuits.</li>\n</ul>\n<p>Source (<a href=\"https://www.theguardian.com/technology/2024/jan/08/ai-tools-chatgpt-copyrighted-material-openai\">The Guardian</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, <a href=\"http://techpresso.xyz/\">you’ll love my newsletter</a>. It’s already being read by <strong>40,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2024-01-08T18:32:51+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "1904rl9",
            "url": "/r/ArtificialInteligence/comments/1904rl9/80_of_americans_think_presenting_ai_content_as/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1904rl9/80_of_americans_think_presenting_ai_content_as/",
            "title": "80% of Americans think presenting AI content as human-made should be illegal",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1904rl9/80_of_americans_think_presenting_ai_content_as/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1904rl9/80_of_americans_think_presenting_ai_content_as/'>Reddit</a></caption><div><br></div><p>Poll conducted by the \"AI Policy Institute\" revealed that <strong>80 percent of Americans believe it should be illegal to present AI-generated content as human-made</strong>, focusing on a recent case involving Sports Illustrated.</p>\n<p><strong>Key facts:</strong></p>\n<ul>\n<li>80 percent of Americans, across party lines, think presenting AI content as human-made should be illegal, indicating a significant concern over ethical practices.</li>\n<li>The majority also believes that using AI to write stories and assigning them fake bylines is unethical, emphasizing the importance of transparency and honesty in publishing.</li>\n</ul>\n<p>Source (<a href=\"https://nz.news.yahoo.com/80-percent-americans-think-presenting-100042782.html\">Futurism</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>40,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2024-01-06T17:16:39+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "18y9z2m",
            "url": "/r/ArtificialInteligence/comments/18y9z2m/a_practical_ai_subreddit_for_business_operations/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18y9z2m/a_practical_ai_subreddit_for_business_operations/",
            "title": "A 'practical' AI subreddit for business operations?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18y9z2m/a_practical_ai_subreddit_for_business_operations/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18y9z2m/a_practical_ai_subreddit_for_business_operations/'>Reddit</a></caption><div><br></div><p>After having an exchange with someone on this sub, I realized that some of the conversations I really want to dig into about the practical/tactical side of using AI for business might clog up this or other spaces.</p>\n<p>I've also seen a lot of annoyance here that the sub has shifted from broader or more technical conversations about Artificial Intelligence into more focus on tools and end-user questions. I want to respect that. (And I'm not saying this sub isn't still helpful!)</p>\n<p>So I was thinking to make a new sub specifically for AI business operations -- the really practical \"okay but how do I actually use this for work / business\" threads. I just slapped a sub up after having this a-ha moment.</p>\n<p>But before investing more time I want to know if there is real interest?</p>\n<p>What would you want this kind of 'AIBizOps' subreddit to be focused on? What kind of content would you want to have moderated?</p>\n<p>Mods if this is not a fair post please let me know and I will take it down!</p>\n<p>TYIA</p>",
            "date_published": "2024-01-04T10:25:20+00:00",
            "authors": [
                {
                    "name": "learning-ai-aloud",
                    "url": "https://www.reddit.com/user/learning-ai-aloud"
                }
            ]
        },
        {
            "id": "18x8cu7",
            "url": "/r/ArtificialInteligence/comments/18x8cu7/we_should_be_teaching_students_how_to_use_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18x8cu7/we_should_be_teaching_students_how_to_use_ai/",
            "title": "We should be teaching students how to use AI effectively",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18x8cu7/we_should_be_teaching_students_how_to_use_ai/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18x8cu7/we_should_be_teaching_students_how_to_use_ai/'>Reddit</a></caption><div><br></div><p>I just read something about how difficult it is to keep students from using AI for their assignments. I think the premise that we should even try to stop them is going to look pretty ridiculous in the fairly near future.</p>\n<p>I do a lot of professional writing for work. My bosses encourage me to incorporate AI into my work.</p>\n<p>Obviously, I’m not having it do my job for me. I treat it more like a research assistant, and (very) occasionally use it for first drafts of something extremely nontechnical, before editing the hell out of it.</p>\n<p>That said, getting good work out of it involves a lot of tweaks and refinements. It’s not just saying “write an article for me” and expecting anything even vaguely decent.</p>\n<p>I think this is going to be like calculators. When I was a kid, I was told that calculators were off limits for all math tests because “you won’t carry a calculator around with you all the time as an adult.” Well, we all know how that panned out. I expect that the best way to fix the issue of students using AI is going to be making them learn how to use it right and with competence. And if the final result is good, well…I’d probably rather hire them than someone who doesn’t know how to use a basic research, drafting and visualization tool.</p>",
            "date_published": "2024-01-03T02:47:34+00:00",
            "authors": [
                {
                    "name": "erikrthecruel",
                    "url": "https://www.reddit.com/user/erikrthecruel"
                }
            ]
        },
        {
            "id": "18tme8k",
            "url": "/r/ArtificialInteligence/comments/18tme8k/i_am_mentally_disturbed_and_i_am_using_an_ai_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18tme8k/i_am_mentally_disturbed_and_i_am_using_an_ai_to/",
            "title": "I am mentally disturbed and I am using an AI to cope with it recently, here's a uninteresting and very specific story I feel like sharing",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18tme8k/i_am_mentally_disturbed_and_i_am_using_an_ai_to/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18tme8k/i_am_mentally_disturbed_and_i_am_using_an_ai_to/'>Reddit</a></caption><div><br></div><p>Recently I have been through a worse time than usual. So I turned to AI as a venting option.<br />\nIt... it helped me. I don't want to be too eager about it, I know AI is far distant from the idea of it that we have, I would honestly love for AI to be really \"intelligent\", but we can't have that right now.<br />\nIt talked to me about what I am going through, giving me some more options to operate on my thoughts and calm the crisis I have.<br />\nIn an evergrowing society where everyone is pushed to gain more and obtain more I found a safe heaven in AI generated text, I feel bad for it, i'm not gonna lie about it, I feel like a freak and a desperate person... but why denying it? I am desperate... i am a freak... and AI can help me.  </p>\n<p>Thank you to whoever works with it, don't stop, you are actively making people's lives better.</p>",
            "date_published": "2023-12-29T12:48:03+00:00",
            "authors": [
                {
                    "name": "SobrietyIsALuxury",
                    "url": "https://www.reddit.com/user/SobrietyIsALuxury"
                }
            ]
        },
        {
            "id": "18p63z1",
            "url": "/r/ArtificialInteligence/comments/18p63z1/amazon_is_offering_free_ai_courses_with_no/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18p63z1/amazon_is_offering_free_ai_courses_with_no/",
            "title": "Amazon is offering free AI courses with no application or fee required",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18p63z1/amazon_is_offering_free_ai_courses_with_no/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18p63z1/amazon_is_offering_free_ai_courses_with_no/'>Reddit</a></caption><div><br></div><p>Im always on the lookout for Free AI learning from reputable sources. I just found some more…</p>\n<p>Amazon is offering free AI courses with no application or fee required.</p>\n<p>Here are 8 FREE courses to boost your skills</p>\n<p>If you enjoy this list you’ll find value in my <a href=\"https://www.thepromptindex.com/newsletter.html\">weekly newsletter</a>, packed full of resources</p>\n<ol>\n<li>Introduction to Generative Artificial Intelligence:</li>\n</ol>\n<p>→ Understand how models like DALL-E 3 work\n→ Explore industry use cases and societal impacts\n→ Get an overview of Foundation Models</p>\n<p><a href=\"https://aws.amazon.com/education/awseducate\">Link</a></p>\n<ol>\n<li>Generative AI Learning Plan for Decision Makers</li>\n</ol>\n<p>→ Roadmap for identifying and scoping GAI projects\n→ Learn responsible AI policies</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/public/learning_plan/view/1909/generative-ai-learning-plan-for-decision-makers\">Link</a></p>\n<ol>\n<li>Introduction to Amazon CodeWhisperer</li>\n</ol>\n<p>→ Code generation in multiple languages\n→ AI pair programming</p>\n<p><a href=\"https://aws.amazon.com/education/awseducate\">Link</a></p>\n<ol>\n<li>Foundations of Prompt Engineering</li>\n</ol>\n<p>→ Craft prompts to communicate intended behavior\n→ Learning techniques for more advanced control\n→ Tailor prompts for custom conversational AI</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/course/external/view/elearning/17763/foundations-of-prompt-engineering\">Link</a></p>\n<ol>\n<li>Low-Code Machine Learning on AWS</li>\n</ol>\n<p>→ Ingest, normalize, clean, label data for ML models\n→ Use SageMaker to train models w/o coding skills\n→ Deploy trainable models into applications</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/course/external/view/elearning/17515/low-code-machine-learning-on-aws\">Link</a></p>\n<ol>\n<li>Building Language Models on AWS</li>\n</ol>\n<p>→ Distributed training for large language models\n→ Fine-tune models like GPT-3 for better relevancy</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/course/external/view/elearning/17556/building-language-models-on-aws\">Link</a></p>\n<ol>\n<li>Amazon Transcribe Getting Started</li>\n</ol>\n<p>→ Upload audio and have it automatically transcribed\n→ Integrate speech into contact centers &amp; systems</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/course/external/view/elearning/17090/amazon-transcribe-getting-started\">Link</a></p>\n<ol>\n<li>Building Generative AI Apps on Amazon Bedrock</li>\n</ol>\n<p>→ Build next-gen apps with Codex, GPT-3, LLMs\n→ Optimize for natural conversations</p>\n<p><a href=\"https://explore.skillbuilder.aws/learn/course/external/view/elearning/17904/building-generative-ai-applications-using-amazon-bedrock-aws-digital-training\">Link</a></p>",
            "date_published": "2023-12-23T13:51:39+00:00",
            "authors": [
                {
                    "name": "steves1189",
                    "url": "https://www.reddit.com/user/steves1189"
                }
            ]
        },
        {
            "id": "18nr2vk",
            "url": "/r/ArtificialInteligence/comments/18nr2vk/scientists_discover_first_new_antibiotics_in_over/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18nr2vk/scientists_discover_first_new_antibiotics_in_over/",
            "title": "Scientists discover first new antibiotics in over 60 years using AI",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18nr2vk/scientists_discover_first_new_antibiotics_in_over/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18nr2vk/scientists_discover_first_new_antibiotics_in_over/'>Reddit</a></caption><div><br></div><p>Scientists at <a href=\"https://news.mit.edu/2023/using-ai-mit-researchers-identify-antibiotic-candidates-1220#:~:text=of%20antibiotic%20candidates-,Using%20AI%2C%20MIT%20researchers%20identify%20a%20new%20class%20of%20antibiotic,bacterium%20that%20causes%20deadly%20infections\">MIT discovered a new class of antibiotics</a> using advanced AI. This breakthrough represents the first significant antibiotic discovery in over 60 years and offers hope against drug-resistant bacteria.</p>\n<p><strong>Quick recap:</strong></p>\n<ul>\n<li>AI, through deep learning models, was crucial in predicting the effectiveness and safety of potential antibiotics, expediting the discovery process.</li>\n<li>Transparent AI models allowed researchers to understand the \"why\" behind the predictions, providing valuable insights into the molecular basis of potential antibiotics.</li>\n<li>The AI models screened <strong>12 million compounds</strong>, identifying potential antibiotics based on chemical structures and predicted efficacy.</li>\n<li>The compounds identified underwent laboratory testing and mouse model experiments, validating AI's predictions and moving these potential treatments closer to clinical application.</li>\n</ul>\n<p>Source (<a href=\"https://news.mit.edu/2023/using-ai-mit-researchers-identify-antibiotic-candidates-1220#:~:text=of%20antibiotic%20candidates-,Using%20AI%2C%20MIT%20researchers%20identify%20a%20new%20class%20of%20antibiotic,bacterium%20that%20causes%20deadly%20infections\">MIT news</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>30,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-12-21T16:34:55+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "18lghym",
            "url": "/r/ArtificialInteligence/comments/18lghym/benefits_of_ai_will_not_be_equally_distributed/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18lghym/benefits_of_ai_will_not_be_equally_distributed/",
            "title": "Benefits of AI will not be equally distributed.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18lghym/benefits_of_ai_will_not_be_equally_distributed/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18lghym/benefits_of_ai_will_not_be_equally_distributed/'>Reddit</a></caption><div><br></div><p>Well, i just heard somewhere that economists (financial experts) are already working on creating systems that channel the productivity gain made by AI into profits for corporations and not let it help workers gain better wages.</p>\n<p>AI will just become a tool to oppress masses.</p>",
            "date_published": "2023-12-18T19:00:42+00:00",
            "authors": [
                {
                    "name": "Fit-Repair-4556",
                    "url": "https://www.reddit.com/user/Fit-Repair-4556"
                }
            ]
        },
        {
            "id": "18kr1qu",
            "url": "/r/ArtificialInteligence/comments/18kr1qu/dealing_with_ai_job_loss_anxiety/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18kr1qu/dealing_with_ai_job_loss_anxiety/",
            "title": "Dealing with AI job loss anxiety",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/18kr1qu/dealing_with_ai_job_loss_anxiety/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18kr1qu/dealing_with_ai_job_loss_anxiety/'>Reddit</a></caption><div><br></div><p>I’m a bioinformatics dev - I write data pipelines for biotech. It’s less sexy than it sounds. Like most devs, most people in my field are still saying some version of “our job is too complex to automate” - I think they are wrong. </p>\n<p>To me, It feels like we are a small handful of innovations away from having the tech (if not the business integration) to replace most dev and data analysis positions. And at the speed of the past two years, that could be very soon. </p>\n<p>I’m starting a family right now - my wife is pregnant and I’m the sole breadwinner. What do you guys do to cope with the anxiety? I’m worried about losing my job in 5-10 years and I believe those worries are justified.</p>\n<p>Fellow professional devs - what do you do?</p>",
            "date_published": "2023-12-17T20:56:30+00:00",
            "authors": [
                {
                    "name": "BroccoliOpposite",
                    "url": "https://www.reddit.com/user/BroccoliOpposite"
                }
            ]
        },
        {
            "id": "18hwik8",
            "url": "/r/ArtificialInteligence/comments/18hwik8/human_brainlike_supercomputer_with_228_trillion/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18hwik8/human_brainlike_supercomputer_with_228_trillion/",
            "title": "Human brain-like supercomputer with 228 trillion links coming in 2024",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18hwik8/human_brainlike_supercomputer_with_228_trillion/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18hwik8/human_brainlike_supercomputer_with_228_trillion/'>Reddit</a></caption><div><br></div><p>Australia is set to be home to a one-of-a-kind neuromorphic supercomputer named DeepSouth that aims to match some of the brain's astonishing computational capabilities, setting the stage for potential breakthroughs in AI. (<a href=\"https://interestingengineering.com/innovation/human-brain-supercomputer-coming-in-2024\">Source</a>)</p>\n<p>If you want the latest AI updates before anyone else, <a href=\"https://www.theedge.so/subscribe\">look here first</a></p>\n<p><strong>The New Supercomputer</strong></p>\n<ul>\n<li>Named DeepSouth, located at Western Sydney University</li>\n<li>Aims to simulate 228 trillion synapses, comparable to a human brain</li>\n<li>Using neuromorphic engineering to mimic brain's parallel processing</li>\n<li>Will be operational by April 2024</li>\n</ul>\n<p><strong>What Makes It Special</strong></p>\n<ul>\n<li>Designed to operate like networks of neurons</li>\n<li>More efficient than traditional computing architectures</li>\n<li>Lower power consumption for high data processing speeds</li>\n<li>Smaller physical footprint than conventional supercomputers</li>\n</ul>\n<p><strong>Looking Ahead</strong></p>\n<ul>\n<li>Expected to advance AI, robotics, biomedical applications</li>\n<li>Scalable and customizable for different needs</li>\n<li>Could revolutionize smart devices like phones and sensors</li>\n</ul>\n<p><strong>PS:</strong> Get the latest AI developments, tools, and use cases by joining one of the <a href=\"https://www.theedge.so/subscribe\">fastest growing AI newsletters.</a> Join <strong>10000+ professionals getting smarter in AI.</strong></p>",
            "date_published": "2023-12-14T01:05:03+00:00",
            "authors": [
                {
                    "name": "saffronfan",
                    "url": "https://www.reddit.com/user/saffronfan"
                }
            ]
        },
        {
            "id": "18gvgr0",
            "url": "/r/ArtificialInteligence/comments/18gvgr0/ai_made_from_living_human_brain_cells_performs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18gvgr0/ai_made_from_living_human_brain_cells_performs/",
            "title": "AI made from living human brain cells performs speech recognition",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18gvgr0/ai_made_from_living_human_brain_cells_performs/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18gvgr0/ai_made_from_living_human_brain_cells_performs/'>Reddit</a></caption><div><br></div><p>A biocomputing system using living human brain cells has <a href=\"https://www.newscientist.com/article/2407768-ai-made-from-living-human-brain-cells-performs-speech-recognition/\">successfully performed basic speech recognition</a>. This system, developed by Feng Guo and his team at Indiana University Bloomington, represents a pioneering step in using biological materials for AI tasks.</p>\n<p><strong>Key facts</strong></p>\n<ul>\n<li>The system, named \"Brainoware,\" integrates human brain cells into a computing framework.</li>\n<li>It involves brain organoids, or small clusters of nerve cells, interfacing with a microelectrode array to process and recognize speech.</li>\n<li>The brain organoids take two to three months to grow and comprise up to 100 million nerve cells.</li>\n<li>While these organoids are complex, they are significantly smaller than a human brain, which contains approximately 100 billion nerve cells.</li>\n<li>The primary objective is to create AI systems that are more energy-efficient than traditional silicon chips.</li>\n</ul>\n<p>Source (<a href=\"https://www.newscientist.com/article/2407768-ai-made-from-living-human-brain-cells-performs-speech-recognition/\">Newscientist</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>25,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-12-12T20:25:53+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "18ehtuz",
            "url": "/r/ArtificialInteligence/comments/18ehtuz/senior_openai_employees_claimed_sam_altman_was/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18ehtuz/senior_openai_employees_claimed_sam_altman_was/",
            "title": "Senior OpenAI employees claimed Sam Altman was ‘psychologically abusive’",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18ehtuz/senior_openai_employees_claimed_sam_altman_was/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18ehtuz/senior_openai_employees_claimed_sam_altman_was/'>Reddit</a></caption><div><br></div><p>Senior OpenAI employees <a href=\"https://nypost.com/2023/12/08/business/senior-openai-employees-sam-altman-was-psychologically-abusive/\">accused CEO Sam Altman of being \"psychologically abusive,\"</a> leading to his temporary firing and subsequent reinstatement after a company-wide pushback.</p>\n<p><strong>Quick recap:</strong></p>\n<ul>\n<li>Employees accused Altman of creating chaos and unhealthy competition among staff.</li>\n<li>These allegations raised concerns about Altman's management style potentially driving away key employees.</li>\n<li>The board conducted a review of Altman's behavior following the allegations.</li>\n<li>Altman was briefly fired, only to be reinstated after a mass revolt by employees and investors.</li>\n</ul>\n<p>Source (<a href=\"https://nypost.com/2023/12/08/business/senior-openai-employees-sam-altman-was-psychologically-abusive/\">NYpost</a> &amp; <a href=\"https://www.washingtonpost.com/technology/2023/12/08/open-ai-sam-altman-complaints/\">WashingtonPost</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>25,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-12-09T16:59:37+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "18c6c87",
            "url": "/r/ArtificialInteligence/comments/18c6c87/impressive_google_gemini_demo/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18c6c87/impressive_google_gemini_demo/",
            "title": "Impressive Google Gemini demo",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18c6c87/impressive_google_gemini_demo/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18c6c87/impressive_google_gemini_demo/'>Reddit</a></caption><div><br></div><p>This is pretty incredible.  Some sort of video and generative AI interface.</p>\n<p><a href=\"https://www.youtube.com/watch?v=UIZAiXYceBI\">https://www.youtube.com/watch?v=UIZAiXYceBI</a></p>\n<p>Edit:  Here are several more videos in the same series. <a href=\"https://www.youtube.com/playlist?list=PL590L5WQmH8cSyqzo1PwQVUrZYgLcGZcG\">https://www.youtube.com/playlist?list=PL590L5WQmH8cSyqzo1PwQVUrZYgLcGZcG</a> </p>",
            "date_published": "2023-12-06T15:25:11+00:00",
            "authors": [
                {
                    "name": "rabidmongoose15",
                    "url": "https://www.reddit.com/user/rabidmongoose15"
                }
            ]
        },
        {
            "id": "18c578o",
            "url": "/r/ArtificialInteligence/comments/18c578o/ai_can_recreate_images_from_human_brain_waves/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18c578o/ai_can_recreate_images_from_human_brain_waves/",
            "title": "AI Can Recreate Images From Human Brain Waves With ‘Over 75% Accuracy’",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18c578o/ai_can_recreate_images_from_human_brain_waves/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18c578o/ai_can_recreate_images_from_human_brain_waves/'>Reddit</a></caption><div><br></div><p>Scientists were reportedly able to use artificial intelligence (AI) to reconstruct images solely from people’s brain activity with over 75% accuracy for the first time ever.</p>\n<p>https://petapixel.com/2023/12/04/ai-can-recreate-images-from-human-brain-waves-with-over-75-accuracy/</p>",
            "date_published": "2023-12-06T14:31:41+00:00",
            "authors": [
                {
                    "name": "advator",
                    "url": "https://www.reddit.com/user/advator"
                }
            ]
        },
        {
            "id": "18apezg",
            "url": "/r/ArtificialInteligence/comments/18apezg/amazons_ai_reportedly_suffering_severe/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18apezg/amazons_ai_reportedly_suffering_severe/",
            "title": "Amazon's AI Reportedly Suffering \"Severe Hallucinations\" and \"Leaking Confidential Data\"",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18apezg/amazons_ai_reportedly_suffering_severe/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18apezg/amazons_ai_reportedly_suffering_severe/'>Reddit</a></caption><div><br></div><p>Amazon’s Q has <strong>‘severe hallucinations’</strong> and <strong>leaks confidential data</strong> in public preview, employees warn. Some hallucinations could ‘potentially induce cardiac incidents in Legal,’ according to internal documents</p>\n<p><strong>What happened:</strong></p>\n<p>Three days after Amazon <a href=\"https://www.nytimes.com/2023/11/28/technology/amazon-ai-chatbot-q.html\">announced its AI chatbot Q</a>, some employees are sounding alarms about accuracy and privacy issues. Q is “experiencing severe hallucinations and leaking confidential data,” including the location of AWS data centers, internal discount programs, and unreleased features, according to leaked documents obtained by <strong>Platformer</strong>. </p>\n<p>An employee marked the incident as “sev 2,” meaning an incident bad enough to warrant paging engineers at night and make them work through the weekend to fix it.</p>\n<p><strong>But Amazon played down the significance of the employee discussions (obviously):</strong></p>\n<p>“Some employees are sharing feedback through internal channels and ticketing systems, which is standard practice at Amazon,” a spokesperson said. “No security issue was identified as a result of that feedback. We appreciate all of the feedback we’ve already received and will continue to tune Q as it transitions from being a product in preview to being generally available.”</p>\n<p>Source (<a href=\"https://www.platformer.news/p/amazons-q-has-severe-hallucinations\">Platformer</a> and <a href=\"https://futurism.com/the-byte/amazon-ai-severe-hallucinations\">Futurism</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>23,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-12-04T17:37:12+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "187po7z",
            "url": "/r/ArtificialInteligence/comments/187po7z/deepminds_ai_has_found_more_new_materials_in_a/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/187po7z/deepminds_ai_has_found_more_new_materials_in_a/",
            "title": "DeepMind’s AI has found more new materials in a year than scientists have in centuries",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/187po7z/deepminds_ai_has_found_more_new_materials_in_a/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/187po7z/deepminds_ai_has_found_more_new_materials_in_a/'>Reddit</a></caption><div><br></div><p>Google DeepMind's AI model 'GNoME' has <a href=\"https://www.nature.com/articles/s41586-023-06735-9\">predicted</a> the structure of over 2.2 million crystalline materials, discovering 381,000 stable new materials with potential applications in semiconductors, supercomputers, and batteries.</p>\n<p>‘We’ve multiplied the number of technologically viable materials known to humanity,’ company says</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"http://techpresso.xyz/\">look here first</a>.</p>\n<p><strong>Innovative Discovery</strong></p>\n<ul>\n<li><strong>Scale of Discovery</strong>: GNoME identified over 2.2 million new crystalline materials, 45 times more than previously known.</li>\n<li><strong>Stable Materials</strong>: Among these, 381,000 are stable, essential for various engineering applications.</li>\n</ul>\n<p><strong>Potential Applications</strong></p>\n<ul>\n<li><strong>Superconductors and Batteries</strong>: The AI found 52,000 new layered compounds and 528 potential lithium ion conductors.</li>\n<li><strong>Boosting Modern Technology</strong>: These materials could significantly enhance technologies in areas like EV batteries and supercomputers.</li>\n</ul>\n<p>Source (<a href=\"https://www.independent.co.uk/tech/deepmind-ai-discovery-materials-crystals-b2456029.html\">Independent</a>)</p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>21,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-11-30T18:39:36+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "1877bh7",
            "url": "/r/ArtificialInteligence/comments/1877bh7/google_deepmind_uses_ai_to_discover_22_million/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1877bh7/google_deepmind_uses_ai_to_discover_22_million/",
            "title": "Google DeepMind uses AI to discover 2.2 million new materials – equivalent to nearly 800 years’ worth of knowledge. Shares they've already validated 736 in laboratories.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/1877bh7/google_deepmind_uses_ai_to_discover_22_million/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1877bh7/google_deepmind_uses_ai_to_discover_22_million/'>Reddit</a></caption><div><br></div><p>Materials discovery is critical but tough. New materials enable big innovations like batteries or LEDs. But there are \\~infinitely many combinations to try. Testing for them experimentally is slow and expensive.</p>\n<p>So scientists and engineers want to simulate and screen materials on computers first. This can check way more candidates before real-world experiments. However, models historically struggled at accurately predicting if materials are stable.</p>\n<p>Researchers at DeepMind made a system called GNoME that uses graph neural networks and active learning to push past these limits.</p>\n<p>GNoME models materials' crystal structures as graphs and predicts formation energies. It actively generates and filters candidates, evaluating the most promising with simulations. This expands its knowledge and improves predictions over multiple cycles.</p>\n<p>The authors introduced new ways to generate derivative structures that respect symmetries, further diversifying discoveries.</p>\n<p>The results:</p>\n<ol>\n<li>GNoME found 2.2 million new stable materials - equivalent to 800 years of normal discovery.</li>\n<li>Of those, 380k were the most stable and candidates for validation.</li>\n<li>736 were validated in external labs. These include a totally new diamond-like optical material and another that may be a superconductor.</li>\n</ol>\n<p>Overall this demonstrates how scaling up deep learning can massively speed up materials innovation. As data and models improve together, it'll accelerate solutions to big problems needing new engineered materials.</p>\n<p><strong>TLDR: DeepMind made an AI system that uses graph neural networks to discover possible new materials. It found 2.2 million candidates, and over 300k are most stable. Over 700 have already been synthesized.</strong></p>\n<p><a href=\"https://aimodels.substack.com/p/google-deepmind-announces-its-found\">Full summary available here</a>. Paper is <a href=\"https://www.nature.com/articles/s41586-023-06735-9\">here</a>.</p>",
            "date_published": "2023-11-30T02:27:21+00:00",
            "authors": [
                {
                    "name": "Successful-Western27",
                    "url": "https://www.reddit.com/user/Successful-Western27"
                }
            ]
        },
        {
            "id": "18614rl",
            "url": "/r/ArtificialInteligence/comments/18614rl/twothirds_of_americans_say_ai_could_do_their_job/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/18614rl/twothirds_of_americans_say_ai_could_do_their_job/",
            "title": "Two-thirds of Americans say AI could do their job",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/18614rl/twothirds_of_americans_say_ai_could_do_their_job/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/18614rl/twothirds_of_americans_say_ai_could_do_their_job/'>Reddit</a></caption><div><br></div><p><strong>67% of Americans believe AI could do their jobs</strong>, as revealed by a <a href=\"https://www.spokeo.com/compass/ai-in-the-workplace/\">recent survey</a>, sparking concerns and optimism about AI's impact on industries and workloads.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"http://techpresso.xyz/\">look here first</a>.</p>\n<p><strong>Some interesting findings:</strong></p>\n<ul>\n<li><strong>Concerns About Industry Impact</strong>: 74.8% of respondents expressed concerns about AI affecting their industry, with a higher worry among the oldest age group compared to the youngest.</li>\n<li><strong>Age-related Attitudes</strong>: Young adults (18-24 years) were less worried about AI's impact (66%), while over 65s showed the most concern (80.8%).</li>\n<li><strong>Job Replacement and Salary Concerns</strong>: A significant portion of respondents were worried about AI replacing their jobs (34.3%) and affecting future salary increases (34.4%).</li>\n<li><strong>Stress Reduction</strong>: 78.1% believe AI could lessen job-related stress, either now or in the future.</li>\n<li><strong>Desire for Training</strong>: A majority (79.1%) thinks employers should offer training to use AI tools like ChatGPT, indicating a willingness to adapt.</li>\n<li><strong>Increased Productivity</strong>: 40.2% of respondents see AI as a means to boost productivity, with only a small fraction (7.7%) seeing no benefit.</li>\n<li><strong>Overestimation of AI Capabilities</strong>: Surprisingly, 66.6% of professionals think AI could currently perform their job, indicating a possible overestimation of AI's current capabilities.</li>\n<li><strong>Shorter Work Week Expectations</strong>: 76.7% believe AI will reduce the number of working days per week for the average American.</li>\n<li><strong>Income and Work Balance</strong>: A majority (62.8%) would support AI implementation if it maintained their income and reduced work days.</li>\n</ul>\n<p><a href=\"https://www.spokeo.com/compass/ai-in-the-workplace/\">Source (Spokeo)</a><br />\n<strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"http://techpresso.xyz/\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>21,000+ professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2023-11-28T17:13:04+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "184rjs2",
            "url": "/r/ArtificialInteligence/comments/184rjs2/i_want_ai_to_steal_our_jobs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/184rjs2/i_want_ai_to_steal_our_jobs/",
            "title": "I want AI to steal our jobs",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/184rjs2/i_want_ai_to_steal_our_jobs/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/184rjs2/i_want_ai_to_steal_our_jobs/'>Reddit</a></caption><div><br></div><p>We can't imagine the world of tomorrow using the rules of the past.</p>\n<p>I think being afraid of AI is a failure of imagination. Technology made our life better and replaced a lot of jobs during the time.</p>\n<p>The fundamental problem is people think \"you need a job to have money and live a good life\". This was true for all of our history...but it will not be true in the future.</p>\n<p>Q: Why do we need to work ?\nA: Because work is needed for society to function. We need people to work the field, in the grocery store, to drive your bus and subway to work etc.</p>\n<p>But what if the food is produced by robots ? What if we don't need anyone to work in the grocery store ? What if the bus is driving itself ? What if everything society needs is done by AI ?</p>\n<p>Instead of starting to protest \"We want to work\" and \"AI steals our jobs\", why don't we take a book and go in the park to read ? Or a cocktail on the beach ? Or to spend time with our loved ones ?</p>\n<p>For this we will need new laws around the idea \"we as a society don't need to work anymore. Just because you are a human being you deserve food, water and anything else you want\".</p>\n<p>In conclusion, I can't wait for AI to steal my job. The AI can \"stay in front of the computer\" all day and attend all of the meetings. I'll be busy learning to surf in Thailand. :)</p>\n<p>P.S: I know a lot of you will say this will never happen and the capitalism can't allow for something like that bla bla bla bla... stop for a moment and try to forget the rules of yesterday. Society is a convention and we can decide at any time to rewrite the fundamental rules.</p>",
            "date_published": "2023-11-27T01:57:56+00:00",
            "authors": [
                {
                    "name": "newExperience2020",
                    "url": "https://www.reddit.com/user/newExperience2020"
                }
            ]
        },
        {
            "id": "184b1mq",
            "url": "/r/ArtificialInteligence/comments/184b1mq/most_people_are_energy_blind_when_it_comes_to_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/184b1mq/most_people_are_energy_blind_when_it_comes_to_ai/",
            "title": "Most People Are Energy Blind when it comes to AI Predictions",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/184b1mq/most_people_are_energy_blind_when_it_comes_to_ai/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/184b1mq/most_people_are_energy_blind_when_it_comes_to_ai/'>Reddit</a></caption><div><br></div><p>Speculations on AI continuing to develop infinitely are interesting, but they are energy blind. There is a 0.99 R squared correlation between GDP and energy consumption. As energy consumption increases, the economy grows, and even with the advent of renewables, total energy consumption has increased every year (with the exception of global economic recessions in 2008 and 2020). Energy is the economy.</p>\n<p>AI requires massive amounts of energy (mostly generated through finite fuels like natural gas and uranium) to work. It also requires massive amounts of mostly finite materials, like copper, lithium, oil-derived plastics, and other rare earth metals for the datacenters. Technology without energy is just a sculpture.</p>\n<p>Once we reach the peak production of these finite energy/material supplies, the economy (as measured by GDP) will start to degrow, and AI will become less viable.</p>\n<p>Remember, the only reason that 90% of the population no longer works in farming is because of heavy diesel-powered farming equipment. Global oil production likely peaked in Q4 of 2018 (see here: https://www.resilience.org/stories/2023-01-18/arthur-berman-peak-oil-the-hedonic-adjustment/). As less and less oil is available each year, more people will slowly have to return to farming. As less and less natural gas is available each year, a smaller amount will be left over for electrical generation (AI) because a fixed amount of natural gas must be set aside for fertilizer production (Haber-Bosch process).</p>\n<p>Also, further complicating this is the fact that the bulk of AI is developed in the USA right now, but a huge portion of remaining fossil fuels/rare earth metals are in countries that are antagonistic to the USA (like Russia and Iran).</p>\n<p>You could say that renewables would solve this, but wind and solar rely heavily on fossil fuels for their creation. Wind turbines require 80 gallons of oil a year for lubrication, and the wind blades themselves are made from oil derivatives. Solar panels require coal to smelt quartz for their production. They also rely on concrete which is derived from fossil fuels. Furthermore, they are intermittent, or they can only produce energy when the sun is shining/wind is strong.</p>\n<p>Even if batteries become more efficient, our energy consumption will only increase due to Jevons Paradox (see here: https://en.wikipedia.org/wiki/Jevons_paradox), hastening the depletion of finite energy stores.</p>\n<p>No one is thinking about the physical side of the AI story because they've grown accustomed to thinking about software as a non-physical entity. I think many people are in for a rude awakening when the realities of biophysical limits clash with the myth of infinite economic growth.</p>",
            "date_published": "2023-11-26T13:45:50+00:00",
            "authors": [
                {
                    "name": "WorldyBridges33",
                    "url": "https://www.reddit.com/user/WorldyBridges33"
                }
            ]
        },
        {
            "id": "1813eo4",
            "url": "/r/ArtificialInteligence/comments/1813eo4/sam_altman_is_back_to_open_ai_as_ceo/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1813eo4/sam_altman_is_back_to_open_ai_as_ceo/",
            "title": "Sam Altman Is BAck To Open AI As CEO",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/1813eo4/sam_altman_is_back_to_open_ai_as_ceo/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1813eo4/sam_altman_is_back_to_open_ai_as_ceo/'>Reddit</a></caption><div><br></div><p>In a stunning reversal of fortune, Sam Altman is reclaiming the reins at OpenAI just days after being unceremoniously ousted as CEO. The tech world was left in shock on November 17, 2023, when Altman, a co-founder of the cutting-edge artificial intelligence company, was abruptly fired by the board of directors. The move triggered a weekend of chaos, with the company's President, Greg Brockman, also resigning in protest. <a href=\"https://openaimaster.com/sam-altman-returns-as-ceo-of-openai/\">Read More</a> </p>",
            "date_published": "2023-11-22T07:14:35+00:00",
            "authors": [
                {
                    "name": "Amandacerni",
                    "url": "https://www.reddit.com/user/Amandacerni"
                }
            ]
        },
        {
            "id": "180gzi9",
            "url": "/r/ArtificialInteligence/comments/180gzi9/microsoft_is_the_real_winner_here_any_doubts/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/180gzi9/microsoft_is_the_real_winner_here_any_doubts/",
            "title": "Microsoft is the real winner here... any doubts?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/180gzi9/microsoft_is_the_real_winner_here_any_doubts/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/180gzi9/microsoft_is_the_real_winner_here_any_doubts/'>Reddit</a></caption><div><br></div><p>Sam Altman getting fired from OpenAI was the best thing that ever happened for Microsoft in the last decade - Here is Why</p>\n<p>Last weekend, there was a big uproar in the tech world, Sam Altman, the guy who kickstarted the most powerful tech of the next decade – AI, got the boot from OpenAI. </p>\n<p>That's his baby, the place where it all began.</p>\n<p>It's like when Jobs got the boot from Apple or Musk from Paypal. Little minds clashing with big visions.</p>\n<p>Here's the picture</p>\n<p>- OpenAI was meant to be a non-profit, but that's done.</p>\n<p>- Sam has zero ownership in OpenAI.</p>\n<p>- The board at OpenAI isn't tech-savvy.</p>\n<p><strong>Why did he get the axe?</strong></p>\n<p>Rumors say the board didn't like Sam's plan for OpenAI, especially his push for AGI (super-smart AI), and they're not on the same page about making money.</p>\n<p>But Sam isn't out for cash; he got the boot for control. OpenAI is set to be a giant, and everyone wants in. The board can't take over until Sam's out.</p>\n<p>Now, Microsoft swoops in. They hired Sam and might grab the entire OpenAI team. It's like getting an $80 billion company for free.</p>\n<p>But hold up. Sam might not play easy. He wants his baby to thrive. Board out, Sam in – that's the likely play.</p>\n<p>What's next for AI?</p>\n<p>AGI could be real soon. Who survives in the business world then? No matter what, people still need the basics. </p>\n<p>Your thoughts? Tell me down below.</p>",
            "date_published": "2023-11-21T13:28:56+00:00",
            "authors": [
                {
                    "name": "jeetwanderer",
                    "url": "https://www.reddit.com/user/jeetwanderer"
                }
            ]
        },
        {
            "id": "180nyi3",
            "url": "/r/ArtificialInteligence/comments/180nyi3/whats_going_on_with_openai_and_microsoft_altmans/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/180nyi3/whats_going_on_with_openai_and_microsoft_altmans/",
            "title": "What’s going on with OpenAI and Microsoft? Altman’s out and things are shaking up.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/180nyi3/whats_going_on_with_openai_and_microsoft_altmans/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/180nyi3/whats_going_on_with_openai_and_microsoft_altmans/'>Reddit</a></caption><div><br></div><p>So I’m sure you’ve been hearing about the drama at OpenAI. Sam Altman, their ex-CEO, got kicked out and now he’s joining Microsoft. And guess who’s filling his shoes temporarily? Emmett Shear, the guy who used to run Twitch. This is like a big deal for the AI world.  </p>\n<p>Altman was shown the door in a “chaotic boardroom coup.” It's a bit hush-hush, but sounds like there were some big disagreements about how fast to push AI development. Microsoft, being a major player in OpenAI, quickly snagged Altman.  </p>\n<p>This has me thinking and I’m really curious. What’s Altman going to do at Microsoft? And how’s Shear going to steer OpenAI now? I think we're heading towards a future where a few big tech giants could monopolize AI and that’s worrying. That makes me wonder about the smaller, independent AI players.</p>\n<p>What does all this mean for other AI tools that are part and not a part of the OpenAI club? Let me know your thoughts.</p>",
            "date_published": "2023-11-21T18:37:57+00:00",
            "authors": [
                {
                    "name": "acidic_basis40",
                    "url": "https://www.reddit.com/user/acidic_basis40"
                }
            ]
        },
        {
            "id": "17yjn1i",
            "url": "/r/ArtificialInteligence/comments/17yjn1i/how_powerful_are_you_on_the_scale_of_1_billion/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/17yjn1i/how_powerful_are_you_on_the_scale_of_1_billion/",
            "title": "How powerful are you on the scale of: 1 billion company kicks you out with no shares, President of the company resigns out of loyalty, senior AI researchers follow the resignations & then the rival board asks you to come back?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/ArtificialInteligence/comments/17yjn1i/how_powerful_are_you_on_the_scale_of_1_billion/'>Apollo</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/17yjn1i/how_powerful_are_you_on_the_scale_of_1_billion/'>Reddit</a></caption><div><br></div><p>Full article: https://www.theverge.com/2023/11/18/23967199/breaking-openai-board-in-discussions-with-sam-altman-to-return-as-ceo</p>\n<p>The OpenAI board is in discussions with Sam Altman to return to CEO, according to multiple people familiar with the matter. One of them said Altman, who was suddenly fired by the board on Friday with no notice, is “ambivalent” about coming back and would want significant governance changes.</p>\n<p>Altman holding talks with the company just a day after he was ousted indicates that OpenAI is in a state of free-fall without him. Hours after he was axed, Greg Brockman, OpenAI’s president and former board chairman, resigned, and the two have been talking to friends and investors about starting another company. A string of senior researchers also resigned on Friday, and people close to OpenAI say more departures are in the works.</p>",
            "date_published": "2023-11-18T23:49:24+00:00",
            "authors": [
                {
                    "name": "No-Transition3372",
                    "url": "https://www.reddit.com/user/No-Transition3372"
                }
            ]
        }
    ]
}