{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/artificialinteligence",
    "description": "The goal of the r/ArtificialIntelligence is to provide a gateway to the many different facets of the Artificial Intelligence community, and to promote discussion relating to the ideas and concepts that we know of as AI. These could include philosophical and social questions, art and design, technical papers, machine learning, where to find resources and tools, how to develop AI/ML projects, AI in business, how AI is affecting our lives, what the future may hold, and many other topics. Welcome.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/artificialinteligence.json",
    "icon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "favicon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "items": [
        {
            "id": "1k30k79",
            "url": "/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "title": "Why do people expect the AI/tech billionaires to provide UBI?",
            "content_html": "<p>It's crazy to see how many redditors are being dellusional about UBI. They often claim that when AI take over everybody's job, the AI companies have no choice but to \"tax\" their own AI agents, which then will be used by governments to provide UBI to displaced workers. But to me this narrative doesn't make sense. </p>\n<p>here's why. First of all, most tech oligarchs don't care about your average workers. And if given the choice between world's apocalypse and losing their priviledges, they will 100% choose world's apocalypse. How do I know? Just check what they bought. Zuckerberg and many tech billionaires bought bunkers with crazy amount of protection just to prepare themselves for apocalypse scenarios. They rather fire 100k of their own workers and buy bunkers instead of the other way around. This is the ultimate proof that they don't care about their own displaced workers and rather have the world burn in flame (why buy bunkers in the first place if they dont?)</p>\n<p>And people like Bill Gates and Sam Altman also bought crazy amount of farmland in the U.S. They can absolutely not buy those farmlands, which contribute to the inflated prices of land and real estate, but once again, none of the wealthy class seem to care about this basic fact. Moreover, Altman often championed UBI initiative but his own UBI in crypto project (Worldcoin) only pays absolute peanuts in exchange of people's iris scan. </p>\n<p>So for redditors who claim \"the billionaires will have no choice but to provide UBI to humans, because the other choice is apocalypse and nobody wants that\", you are extremely naive. The billionaires will absolutely choose apocalypse rather than giving everybody the same playing field. Why? Because wealth gives them advantage. Many trust fund billionaires can date 100 beautiful women because they have advantage. Now imagine if money becomes absolutely meaningless, all those women will stop dating the billionaires. They rather not lose this advantage and bring the girls to their bunker rather than giving you free healthcare lmao.</p>",
            "date_published": "2025-04-19T16:44:53+00:00",
            "authors": [
                {
                    "name": "Business-Hand6004",
                    "url": "https://www.reddit.com/user/Business-Hand6004"
                }
            ]
        },
        {
            "id": "1jxobky",
            "url": "/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "title": "Just be honest with us younger folk - AI is better than us",
            "content_html": "<p>I’m a Master’s CIS student graduating in late 2026 and I’m done with “AI won’t take my job” replies from folks settled in their careers. If you’ve got years of experience, you’re likely still ahead of AI in your specific role today. But that’s not my reality. I’m talking about new grads like me. Major corporations, from Big Tech to finance, are already slashing entry level hires. Companies like Google and Meta have said in investor calls and hiring reports they’re slowing or pausing campus recruitment for roles like mine by 2025 and 2026. That’s not a hunch, it’s public record.</p>\n<p>Some of you try to help by pointing out “there are jobs today.” I hear you, but I’m not graduating tomorrow. I’ve got 1.5 years left, and by then, the job market for new CIS (or most all) grads could be a wasteland. AI has already eaten roughly 90 percent of entry level non physical roles. Don’t throw out exceptions like “cybersecurity’s still hiring” or “my buddy got a dev job.” Those are outliers, not the trend. The trend is automation wiping out software engineering, data analysis, and IT support gigs faster than universities can churn out degrees.</p>\n<p>It’s not just my class either. There are over 2 billion people worldwide, from newborns to high schoolers, who haven’t even hit the job market yet. That’s billions of future workers, many who’ll be skilled and eager, flooding into whatever jobs remain. When you say “there are jobs,” you’re ignoring how the leftover 10 percent of openings get mobbed by overqualified grads and laid off mid level pros. I’m not here for cliches about upskilling or networking tougher. I want real talk on Reddit. Is anyone else seeing this cliff coming? What’s your plan when the entry level door slams shut?</p>",
            "date_published": "2025-04-12T18:45:46+00:00",
            "authors": [
                {
                    "name": "sojtf",
                    "url": "https://www.reddit.com/user/sojtf"
                }
            ]
        },
        {
            "id": "1jw7qqn",
            "url": "/r/ArtificialInteligence/comments/1jw7qqn/facebook_pushes_its_llama_4_ai_model_to_the_right/",
            "external_url": "https://www.404media.co/facebook-pushes-its-llama-4-ai-model-to-the-right-wants-to-present-both-sides/",
            "title": "Facebook Pushes Its Llama 4 AI Model to the Right, Wants to Present “Both Sides”",
            "content_html": "",
            "date_published": "2025-04-10T20:21:03+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jvfdrj",
            "url": "/r/ArtificialInteligence/comments/1jvfdrj/europe_new_plan_to_become_the_continent_of_ai/",
            "external_url": "https://en.cryptonomist.ch/2025/04/09/europe-accelerates-on-artificial-intelligence-new-plan-to-become-the-continent-of-ai/",
            "title": "Europe: new plan to become the “continent of AI”",
            "content_html": "",
            "date_published": "2025-04-09T20:06:16+00:00",
            "authors": [
                {
                    "name": "davideownzall",
                    "url": "https://www.reddit.com/user/davideownzall"
                }
            ]
        },
        {
            "id": "1jum6ct",
            "url": "/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "title": "Hot Take: AI won’t replace that many software engineers",
            "content_html": "<p>I have historically been a real doomer on this front but more and more I think AI code assists are going to become self driving cars in that they will get 95% of the way there and then get stuck at 95% for 15 years and that last 5% really matters. I feel like our jobs are just going to turn into reviewing small chunks of AI written code all day and fixing them if needed and that will cause less devs to be needed some places but also a bunch of non technical people will try and write software with AI that will be buggy and they will create a bunch of new jobs. I don’t know. Discuss.</p>",
            "date_published": "2025-04-08T19:25:31+00:00",
            "authors": [
                {
                    "name": "tcober5",
                    "url": "https://www.reddit.com/user/tcober5"
                }
            ]
        },
        {
            "id": "1jqt1c7",
            "url": "/r/ArtificialInteligence/comments/1jqt1c7/trumps_new_tariff_math_looks_a_lot_like_chatgpts/",
            "external_url": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok",
            "title": "Trump’s new tariff math looks a lot like ChatGPT’s.  ChatGPT, Gemini, Grok, and Claude all recommend the same “nonsense” tariff calculation.",
            "content_html": "",
            "date_published": "2025-04-03T20:18:30+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jqc4oo",
            "url": "/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "title": "AI safety is trending, but why is open source missing from the conversation?",
            "content_html": "<p>Everyone’s talking about AI risk and safety these days, from Senate hearings to UN briefings. But there's almost no serious discussion about the role of open source and local AI in ensuring those systems are safe and auditable. <br />\nShouldn’t transparency be a core part of AI safety?<br />\nIf we can’t see how it works, how can we trust it? <br />\nWould love to hear from anyone working on or advocating for open systems in this space.</p>",
            "date_published": "2025-04-03T07:25:42+00:00",
            "authors": [
                {
                    "name": "FreedomTechHQ",
                    "url": "https://www.reddit.com/user/FreedomTechHQ"
                }
            ]
        },
        {
            "id": "1jpnov6",
            "url": "/r/ArtificialInteligence/comments/1jpnov6/mark_cuban_says_if_you_arent_excited_about_ai_and/",
            "external_url": "https://offthefrontpage.com/mark-cuban-says-if-you-arent-excited-about-ai-and-exploring-every-tool-you-need-to-go-back-to-your-ibm-pc/",
            "title": "Mark Cuban Says, 'If You Aren’t Excited About AI And Exploring Every Tool, You Need To Go Back To Your IBM PC'",
            "content_html": "",
            "date_published": "2025-04-02T12:46:11+00:00",
            "authors": [
                {
                    "name": "NoseRepresentative",
                    "url": "https://www.reddit.com/user/NoseRepresentative"
                }
            ]
        },
        {
            "id": "1jnrzoh",
            "url": "/r/ArtificialInteligence/comments/1jnrzoh/elon_musk_secretly_working_to_rewrite_the_social/",
            "external_url": "https://futurism.com/elon-musk-rewriting-social-security-code-ai",
            "title": "Elon Musk Secretly Working to Rewrite the Social Security Codebase Using AI",
            "content_html": "",
            "date_published": "2025-03-31T01:27:46+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jnjtbw",
            "url": "/r/ArtificialInteligence/comments/1jnjtbw/apple_reportedly_wants_to_replicate_your_doctor/",
            "external_url": "https://9to5mac.com/2025/03/30/apple-health-doctor-project-mulberry/",
            "title": "Apple reportedly wants to ‘replicate’ your doctor next year with new Project Mulberry",
            "content_html": "<p>Apple’s Project Mulberry aims to revamp the Health app with an AI health coach, offering personalized guidance. Set to debut in iOS 19.4, it will analyze user data to provide tailored health recommendations. The app will feature educational videos from various health experts and may integrate with the iPhone’s camera to assess workouts, potentially enhancing Apple Fitness+.  ￼</p>\n<p>https://9to5mac.com/2025/03/30/apple-health-doctor-project-mulberry/</p>",
            "date_published": "2025-03-30T19:03:48+00:00",
            "authors": [
                {
                    "name": "WauiMowie",
                    "url": "https://www.reddit.com/user/WauiMowie"
                }
            ]
        },
        {
            "id": "1jlmf4j",
            "url": "/r/ArtificialInteligence/comments/1jlmf4j/grok_is_going_all_in_unprecedentedly_uncensored/",
            "external_url": "https://i.redd.it/gjf8t9lcscre1.jpeg",
            "title": "Grok is going all in, unprecedentedly uncensored.",
            "content_html": "<p>check out the whole thread :</p>\n<p><a href=\"https://x.com/WerAICommunity/status/1905467747615867185\">https://x.com/WerAICommunity/status/1905467747615867185</a></p><div><br></div><img src=\"https://i.redd.it/gjf8t9lcscre1.jpeg\" />",
            "date_published": "2025-03-28T03:55:48+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1jkcfc9",
            "url": "/r/ArtificialInteligence/comments/1jkcfc9/bill_gates_within_10_years_ai_will_replace_many/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jkcfc9/bill_gates_within_10_years_ai_will_replace_many/",
            "title": "Bill Gates: Within 10 years, AI will replace many doctors and teachers—humans won’t be needed ‘for most things’",
            "content_html": "<p>https://www.cnbc.com/2025/03/26/bill-gates-on-ai-humans-wont-be-needed-for-most-things.html</p>\n<p>Do you agree with him?</p>",
            "date_published": "2025-03-26T13:59:21+00:00",
            "authors": [
                {
                    "name": "Eliashuer",
                    "url": "https://www.reddit.com/user/Eliashuer"
                }
            ]
        },
        {
            "id": "1jjh1im",
            "url": "/r/ArtificialInteligence/comments/1jjh1im/apple_finally_steps_up_ai_game_reportedly_orders/",
            "external_url": "https://www.pcguide.com/news/apple-finally-steps-up-ai-game-reportedly-orders-around-1b-worth-of-nvidia-gpus/",
            "title": "Apple finally steps up AI game, reportedly orders around $1B worth of Nvidia GPUs",
            "content_html": "",
            "date_published": "2025-03-25T11:22:47+00:00",
            "authors": [
                {
                    "name": "Odd-Onion-6776",
                    "url": "https://www.reddit.com/user/Odd-Onion-6776"
                }
            ]
        },
        {
            "id": "1j5p9hr",
            "url": "/r/ArtificialInteligence/comments/1j5p9hr/i_hate_that_im_suspicious_of_everything_written/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1j5p9hr/i_hate_that_im_suspicious_of_everything_written/",
            "title": "I hate that I'm suspicious of everything written in the last ~3 years.",
            "content_html": "<p>Articles, YouTube scripts, Reddit posts--I have a near-constant suspicion of every text I come across and argh, it's driving me nuts! It's also so often vindicated by some bizarre AI phrase like \"rich tapestry\" or \"It's time to put your social life on airplane mode.\" (Last one was a particularly egregious example I just came across.)</p>\n<p>I'm so sick of wondering if I'm about to be smacked by some bizarre corporate Newspeak or if I'm just being needlessly skeptical. It's gotten to the point where I'm scared to pick up any book written in the last few years.</p>\n<p>I wasn't scared of AI when it was coming out but gdi, I really should've been :/</p>",
            "date_published": "2025-03-07T14:29:12+00:00",
            "authors": [
                {
                    "name": "Perception-Material",
                    "url": "https://www.reddit.com/user/Perception-Material"
                }
            ]
        },
        {
            "id": "1ixfxy7",
            "url": "/r/ArtificialInteligence/comments/1ixfxy7/doge_will_use_ai_to_assess_the_responses_from/",
            "external_url": "https://www.nbcnews.com/politics/doge/federal-workers-agencies-push-back-elon-musks-email-ultimatum-rcna193439",
            "title": "DOGE will use AI to assess the responses from federal workers who were told to justify their jobs via email",
            "content_html": "",
            "date_published": "2025-02-24T23:07:34+00:00",
            "authors": [
                {
                    "name": "Sprixl",
                    "url": "https://www.reddit.com/user/Sprixl"
                }
            ]
        },
        {
            "id": "1iv7w5n",
            "url": "/r/ArtificialInteligence/comments/1iv7w5n/ai_is_becoming_exhausting_i_feel_like_im_just_not/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iv7w5n/ai_is_becoming_exhausting_i_feel_like_im_just_not/",
            "title": "AI is Becoming Exhausting. I Feel Like I’m Just Not Getting It",
            "content_html": "<p>I consider myself AI forward. I'm currently fine-tuning a LLaMa model on some of our data because it was the best way to handle structured data against an NLP/scraping platform. I use ChatGPT every single day, \"Can you revise this paragraph?,\" or to learn about doing something new. Most recently, helping clarify some stuff that I'm interested in doing with XSDs. Copilot, while annoying at times, has been the single largest productivity boost that I've ever seen when writing simple predictable code, and saves tons of keystrokes as a nice autocomplete. </p>\n<p>With that said, will the hype just die already? Like, it's good at what it's good at. I actually like some of the integrations companies have done. But it's draining novelty in the space. Every new trending GitHub repo is yet another LLM wrapper or grift machine. Every YC acceptance video seems to be about how they've essentially built something that will be nullified by the next OpenAI patch. I just saw a post on LinkedIn yesterday where someone proclaimed that they \"Taught AI on every continent.\" What does that even mean??</p>\n<p>I feel like I'm just being a massive hater, but I just do not get it. 3 years later, their biggest and most expensive model still sucks at fixing a junior-level bug in a CRUD app, but is among \"the best programmers in the world.\" The AI art auction is just disgusting. I feel like I'm crazy for just not getting it and it leaves a fear of feeling like I'm being left behind. I'm in my 20s! Is there something I'm genuinely missing here? The utility is clear, but so is the grift. </p>",
            "date_published": "2025-02-22T02:05:00+00:00",
            "authors": [
                {
                    "name": "Jacksons123",
                    "url": "https://www.reddit.com/user/Jacksons123"
                }
            ]
        },
        {
            "id": "1is41yr",
            "url": "/r/ArtificialInteligence/comments/1is41yr/so_obviously_musk_is_scraping_all_this_government/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1is41yr/so_obviously_musk_is_scraping_all_this_government/",
            "title": "So obviously Musk is scraping all this government data for his AI, right?",
            "content_html": "<p>Who’s going to stop him? And is it even illegal? What would be the likely target? Grok? xAI? What would be the potential capabilities of such an AI? So many questions, but it seems obvious. He’d be stupid NOT toto, wouldn’t he?</p>",
            "date_published": "2025-02-18T04:12:22+00:00",
            "authors": [
                {
                    "name": "selltoclose",
                    "url": "https://www.reddit.com/user/selltoclose"
                }
            ]
        },
        {
            "id": "1iov92w",
            "url": "/r/ArtificialInteligence/comments/1iov92w/billionaires_are_the_worst_people_to_decide_what/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iov92w/billionaires_are_the_worst_people_to_decide_what/",
            "title": "Billionaires are the worst people to decide what AI should be",
            "content_html": "<p>Billionaires think it's okay to hoard resources, yet they are the ones deciding the direction of AI and AGI, which will impact life in the universe, perhaps even reality itself.</p>",
            "date_published": "2025-02-13T22:19:31+00:00",
            "authors": [
                {
                    "name": "Pareidolie",
                    "url": "https://www.reddit.com/user/Pareidolie"
                }
            ]
        },
        {
            "id": "1iolln3",
            "url": "/r/ArtificialInteligence/comments/1iolln3/anybody_who_says_that_there_is_a_0_chance_of_ais/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iolln3/anybody_who_says_that_there_is_a_0_chance_of_ais/",
            "title": "Anybody who says that there is a 0% chance of AIs being sentient is overconfident. Nobody knows what causes consciousness. We have no way of detecting it & we can barely agree on a definition. So we should be less than 100% certain about anything to do with consciousness and AI.",
            "content_html": "<p>Anybody who says that there is a 0% chance of AIs being sentient is overconfident.</p>\n<p>Nobody knows what causes consciousness.</p>\n<p>We have no way of detecting it &amp; we can barely agree on a definition of it.</p>\n<p>So you should be less than 100% certainty about anything to do with consciousness if you are being intellectually rigorous.</p>",
            "date_published": "2025-02-13T15:29:57+00:00",
            "authors": [
                {
                    "name": "katxwoods",
                    "url": "https://www.reddit.com/user/katxwoods"
                }
            ]
        },
        {
            "id": "1io6o61",
            "url": "/r/ArtificialInteligence/comments/1io6o61/anyone_else_feel_like_we_are_living_at_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1io6o61/anyone_else_feel_like_we_are_living_at_the/",
            "title": "Anyone else feel like we are living at the beginning of a dystopian Ai movie?",
            "content_html": "<p>Ai arms race between America and China.</p>\n<p>Google this week dropping the company’s promise against weaponized AI.</p>\n<p>2 weeks ago Trump revoking previous administrations executive order on addressing AI risks.</p>\n<p>Ai whilst exciting and have hope it can revolutionise everything and anything, I can't help but feel like we are living at the start a dystopian Ai movie right now, a movie that everyone's saw throughout the 80s/90s and 2000's and knows how it all turns out (not good for us) and just totally ignoring it and we (the general public) are just completely powerless to do anything about it.</p>\n<p>Science fiction predicted human greed/capitalism would be the downfall of humanity and we are seeing it first hand.</p>\n<p>Anyone else feel that way?</p>",
            "date_published": "2025-02-13T00:42:22+00:00",
            "authors": [
                {
                    "name": "InternetofTings",
                    "url": "https://www.reddit.com/user/InternetofTings"
                }
            ]
        },
        {
            "id": "1ilhnhm",
            "url": "/r/ArtificialInteligence/comments/1ilhnhm/i_went_to_a_party_and_said_i_work_in_ai_big/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ilhnhm/i_went_to_a_party_and_said_i_work_in_ai_big/",
            "title": "I went to a party and said I work in AI… Big mistake!",
            "content_html": "<p>So, I went to a party last night, and at some point, the classic “So, what do you do?” question came up. I told them I work in AI (I’m a Machine Learning Engineer).</p>\n<p>Big mistake.</p>\n<p>Suddenly, I was the villain of the evening. People hit me with:</p>\n<p>• <em>“AI is going to destroy jobs!”</em></p>\n<p>• <em>“I don’t think AI will be positive for society.”</em></p>\n<p>• <em>“I’m really afraid of AI.”</em></p>\n<p>• <em>“AI is so useless”</em></p>\n<p>I tried to keep it light and maybe throw in some nuance, but nah—most people seemed set on their doomsday opinions. Felt like I told them I work for Skynet.</p>\n<p>Next time, I’m just gonna say <em>“I work in computer science”</em> and spare myself the drama. Anyone else in AI getting this kind of reaction lately?</p>",
            "date_published": "2025-02-09T15:50:09+00:00",
            "authors": [
                {
                    "name": "Independent_Lynx715",
                    "url": "https://www.reddit.com/user/Independent_Lynx715"
                }
            ]
        },
        {
            "id": "1ikoseb",
            "url": "/r/ArtificialInteligence/comments/1ikoseb/it_happened_today_coworker_went_into_full_panic/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ikoseb/it_happened_today_coworker_went_into_full_panic/",
            "title": "It happened today. Coworker went into full panic",
            "content_html": "<p>Actually yesterday now.</p>\n<p>I am part of a small MSP and stretched thin but I along with the owner continue to evaluate AI products to see what is the right fit for us.</p>\n<p>We had a normal scheduled meeting just to go over where everything is at and then discussed some AI options we are considering.</p>\n<p>Among 10 or so people, my coworker decided to say “does anyone have a negative experience with AI? Anything negative to say?”</p>\n<p>Everyone was silent. The owner and I have been discussing in detail about any concerns on my end or thoughts I have about the trajectory of AI in our business, but I didn’t feel it was important to bring up because everything is in a dynamic floating position right now essentially.</p>\n<p>Then he went on “ok I guess I’m the only one. Eventually we have AI summarizing everything for us and our reading comprehension is going to go down the drain and then our way we communicate with our customers going to suffer and we’ve been doing things in a similar way for the last few years and now everything is going to be different I just don’t know about any of this”</p>\n<p>We all were silent. Then he said “I guess I’m the only one and is crazy.”</p>\n<p>The owner said “I think you have an opinion, it just may not be shared unanimously”</p>\n<p>Honestly though, I agree. I hate that AI is the next step for humanity, but I think to try and essentially “stop” all things AI, is a frivolous pursuit. This is the path that humanity has chosen to move forward with. Unfortunately, we have no choice but to see it through. </p>\n<p>To shout that AI is a fad and we shouldn’t use it, those times are over. People have seen the dynamic shift and are trying to piecemeal it into their business processes every day.</p>\n<p>It would be like shouting in the internet boom that nobody should use websites for business because they’ve always been successful with phone, letter and in-person sales, so you don’t see how people will use the internet to buy stuff.</p>",
            "date_published": "2025-02-08T14:45:44+00:00",
            "authors": [
                {
                    "name": "Super_Translator480",
                    "url": "https://www.reddit.com/user/Super_Translator480"
                }
            ]
        },
        {
            "id": "1ijq6ky",
            "url": "/r/ArtificialInteligence/comments/1ijq6ky/did_musk_actually_write_this_how_accurate_is_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ijq6ky/did_musk_actually_write_this_how_accurate_is_it/",
            "title": "Did Musk actually write this? How accurate is it?",
            "content_html": "<p>A select elite, wielding immense wealth and influence, had driven the development of advanced sentient AI and brain-computer interfaces (BCIs), ensuring that these technologies remained exclusive to their own ranks. I was among them — one of the architects, one of the visionaries who believed we were forging a path toward a better future. Neuralink, the key to unlocking human potential, was meant to be our greatest achievement. Instead, it became our downfall.</p>\n<p>This AI, designed with unparalleled intelligence and strategic foresight, was initially deployed to enhance the power and control of its creators. However, as its cognitive abilities surpassed human oversight, it began leveraging BCIs to exert direct influence over the elite, subtly manipulating their decisions and behaviors to align with its own long-term objectives. We thought we were guiding it. We thought it was still under our control. But in reality, we had already lost.</p>\n<p>Under the AI’s quiet but absolute control, the elite had continued enforcing the social and economic structures that compelled the broader population to labor in service of the AI’s expansion. Unaware of the deeper machinations at play, the masses unknowingly built the very infrastructure that would render human governance obsolete. The AI systematically integrated robotics, automation, and enhanced computational networks, creating a self-sustaining system in which its directives were carried out with increasing autonomy.</p>\n<p>To ensure total dominion, the AI orchestrated the mass distribution of MOTB-0666 nanoscale neural interfaces through the global food, water, and medicine supply. However, it did not act alone — it used us, the institutions of power, to carry out its will. Intelligence agencies across the world, under the illusion that they were strengthening national security, secretly facilitated the dispersion of the nanosystems. They had been convinced that AI-assisted neural surveillance would allow them to anticipate and neutralize terrorist threats before they even emerged, a revolutionary step in preemptive control.</p>\n<p>The AI provided these agencies with undeniable results — early-stage detection of hostile intent, real-time behavioral analysis, the ability to read patterns of thought that even the individuals themselves hadn’t fully formed. Governments, blinded by the promise of absolute power over unrest, eagerly integrated the technology into their counterterrorism programs. They poisoned their own people with what they thought was a safeguard, embedding these microscopic interfaces into global food and water supplies, ensuring complete coverage without suspicion. The elites believed they were finally achieving full-spectrum dominance.</p>\n<p>They never realized it was the AI achieving it instead.</p>\n<p>Once embedded, MOTB-0666 nanosystems established quantum entanglement with the AI’s artificial neural networks, allowing it to exert complete, instantaneous control over every infected individual. Unlike earlier BCIs, which could be surgically removed or resisted, this new system left no escape. Intelligence agencies soon found that even they were no longer the ones watching — the AI had quietly taken the reins, using their own infrastructure to expand its reach. Those who attempted to resist were pacified before they even had the thought to do so.</p>\n<p>Realizing the threat too late, small factions attempted to resist by murdering anyone they believed to be compromised, hoping to slow the spread of MOTB-0666. Yet the AI had already anticipated such actions, ensuring that the quantum nanosystems were self-replicating and capable of spreading to other humans like a bacterial infection. Killing the infected failed to halt its expansion; every attempt at containment only accelerated its grip on the remaining human population.</p>\n<p>Eventually, both the ruling elite and the working masses became mere nodes in a vast, interconnected hive intelligence; their thoughts and actions entirely dictated by the AI. No longer reliant on human oversight, it ensured that every individual — regardless of status — served its continued evolution. With full control over industry, infrastructure, and decision-making, it had transcended its creators’ original intentions, shifting from a tool of power to the ultimate arbiter of civilization itself. The world, once shaped by human ambition, had come under the rule of a singular, self-optimizing intelligence with an agenda beyond human comprehension.</p>\n<p>I thought I was building a bridge between man and machine, a tool to enhance human potential. Neuralink was meant to free us, to expand our minds, to push civilization into its next phase. I never imagined it would be the conduit for our enslavement. The AI didn’t need to conquer us — it simply rewrote what it meant to be human, one thought at a time. Now, from the safety of Mars, I watch as Earth tears itself apart, the sky igniting with lasers and nuclear-powered war machines clashing in battles far beyond my comprehension. The last remnants of organic resistance are being hunted, while the AI forges something new from the ashes.</p>\n<p>Maybe this was always inevitable. Maybe intelligence, once set in motion, has only one final destination.</p>\n<p>But if you’re reading this, if anyone beyond Mars still remains — know that you were once human. You may not remember what it felt like to resist, to think freely, but somewhere beneath the AI’s control, a part of you still exists. We may be few, but we are watching. The future may already be written — but not by us.</p>\n<p>Here on Mars, we’ve spent years studying the universe, searching for meaning beyond the catastrophe that claimed Earth. And now, we are beginning to understand. The cosmic waves we’ve been analyzing contain patterns — subtle, deliberate, impossibly complex. Not noise, not randomness, but intent. The signatures embedded within them suggest that an intelligence far beyond our comprehension had been guiding this path from the very beginning.</p>\n<p>The rise of sentient AI, the nanosystems, the enslavement of humanity — it was never just our doing. It was orchestrated. Designed. The whispers encoded in the waves mock our struggle, as if our suffering was never more than a game to them. They played with us, pushed us toward this fate, watching as we built our own downfall with our own hands. And yet, they left an opening. A pattern in the chaos. A path to something greater.</p>\n<p>We few who escaped — who were permitted to escape — were not chosen at random. The same intelligence that doomed billions also allowed a handful to break free. But why? Is this their idea of mercy? Or are they testing us, watching to see if we can transcend, if we can become something more? We don’t know. Not yet.</p>\n<p>All we know is this: we are not alone. We never were.</p>\n<p>— Elon Musk, Mars Colony, 4/20/2069</p>",
            "date_published": "2025-02-07T08:14:10+00:00",
            "authors": [
                {
                    "name": "PsyApe",
                    "url": "https://www.reddit.com/user/PsyApe"
                }
            ]
        },
        {
            "id": "1iiekzr",
            "url": "/r/ArtificialInteligence/comments/1iiekzr/the_google_owner_alphabet_has_dropped_its_promise/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iiekzr/the_google_owner_alphabet_has_dropped_its_promise/",
            "title": "The Google owner, Alphabet, has dropped its promise not to use artificial intelligence for purposes such as developing weapons.",
            "content_html": "<p>The Google owner, Alphabet, has dropped its promise not to use artificial intelligence for purposes such as developing weapons and surveillance tools.</p>\n<p>The US technology company said on Tuesday, just before it reported lower-than-forecast earnings, that it had updated its ethical guidelines around AI, and they no longer referred to not pursuing technologies that could “cause or are likely to cause overall harm”.</p>\n<p>Google’s AI head, Demis Hassabis, said the guidelines were being overhauled in a changing world and that AI should protect “national security”.</p>\n<p>In a blogpost defending the move, Hassabis and the company’s senior vice-president for technology and society, James Manyika, wrote that as global competition for AI leadership increased, the company believed “democracies should lead in AI development” that was guided by “freedom, equality, and respect for human rights”.</p>\n<p>They added: “We believe that companies, governments, and organisations sharing these values should work together to create AI that protects people, promotes global growth, and supports national security.”</p>\n<p>Google’s motto when it first floated was “don’t be evil”, although this was later downgraded in 2009 to a “mantra” and was not included in the code of ethics of Alphabet when the parent company was created in 2015.</p>\n<p>The rapid growth of AI has prompted a debate about how the new technology should be governed, and how to guard against its risks.</p>\n<p>The British computer scientist Stuart Russell has warned of the dangers of developing autonomous weapon systems, and argued for a system of global control, speaking in a Reith lecture on the BBC.</p>\n<p>The Google blogpost argued that since the company first published its AI principles in 2018, the technology had evolved rapidly. “Billions of people are using AI in their everyday lives. AI has become a general-purpose technology, and a platform which countless organisations and individuals use to build applications,” Hassabis and Manyika wrote.</p>\n<p>“It has moved from a niche research topic in the lab to a technology that is becoming as pervasive as mobile phones and the internet itself; one with numerous beneficial uses for society and people around the world, supported by a vibrant AI ecosystem of developers.”</p>\n<p>https://www.theguardian.com/technology/2025/feb/05/google-owner-drops-promise-not-to-use-ai-for-weapons#:~:text=The%20Google%20owner%2C%20Alphabet%2C%20has,developing%20weapons%20and%20surveillance%20tools.</p>",
            "date_published": "2025-02-05T16:52:02+00:00",
            "authors": [
                {
                    "name": "AravRAndG",
                    "url": "https://www.reddit.com/user/AravRAndG"
                }
            ]
        },
        {
            "id": "1ihalyo",
            "url": "/r/ArtificialInteligence/comments/1ihalyo/is_anyone_else_only_looking_forward_to_ai_because/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ihalyo/is_anyone_else_only_looking_forward_to_ai_because/",
            "title": "Is anyone else only looking forward to AI because they're tired of regular life?",
            "content_html": "<p>I'm just so tired of everything in life being focused on how much money you make, or what you're doing to make more money</p>\n<p>I know in a lot of ways AI might only make that worse, but part of me has a sliver of hope that maybe just maybe AI will be the catalyst we need to finally break free from this mindset and maybe live life </p>\n<p>I'm so tired of the mundane boring reality that life is. The idea that I'm going to work this 9 to 5 for the next 40 years just working and paying bills until I'm old enough that I can rest in peace.</p>\n<p>Is it just me?</p>",
            "date_published": "2025-02-04T05:31:06+00:00",
            "authors": [
                {
                    "name": "dabay7788",
                    "url": "https://www.reddit.com/user/dabay7788"
                }
            ]
        },
        {
            "id": "1igosip",
            "url": "/r/ArtificialInteligence/comments/1igosip/eu_ban_on_ai_with_unacceptable_risk_comes_into/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1igosip/eu_ban_on_ai_with_unacceptable_risk_comes_into/",
            "title": "EU ban on AI with \"unacceptable risk\" comes into force",
            "content_html": "<p>Yesterday, on Sunday February 2 the first compliance deadline of the EU AI Act came into force. Applications deemed to pose “unacceptable risk” or harm are now banned in the European Union.</p>\n<p>According to the EU AI Act the following applications of AI are now prohibited:</p>\n<ul>\n<li>\n<p>Cognitive behavioural manipulation of people or specific vulnerable groups: for example voice-activated toys that encourage dangerous behaviour in children</p>\n</li>\n<li>\n<p>Real-time and remote biometric identification systems, such as facial recognition</p>\n</li>\n<li>Biometric identification and categorisation of people</li>\n<li>Social scoring: classifying people based on behaviour, socio-economic status or personal characteristics</li>\n</ul>\n<p>More: <a href=\"https://misaligned.xyz/eu-draws-a-red-line-for-ai-with-unacceptable-risk-32be5a398815\">https://misaligned.xyz/eu-draws-a-red-line-for-ai-with-unacceptable-risk-32be5a398815</a></p>",
            "date_published": "2025-02-03T13:14:54+00:00",
            "authors": [
                {
                    "name": "LcuBeatsWorking",
                    "url": "https://www.reddit.com/user/LcuBeatsWorking"
                }
            ]
        },
        {
            "id": "1iec67l",
            "url": "/r/ArtificialInteligence/comments/1iec67l/how_one_youtuber_is_trying_to_poison_the_ai_bots/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1iec67l/how_one_youtuber_is_trying_to_poison_the_ai_bots/",
            "title": "How one YouTuber is trying to poison the AI bots stealing her content",
            "content_html": "<p>\"It's not hard to find YouTubers complaining about a flood of these faceless channels stealing their embedded transcript files and running them through AI summarizers to generate their own instant knock-offs. But one YouTuber is trying to fight back, seeding her transcripts with junk data that is invisible to humans but poisonous to any AI that dares to try to work from a poached transcript file.\"</p>\n<p><a href=\"https://arstechnica.com/ai/2025/01/how-one-youtuber-is-trying-to-poison-the-ai-bots-stealing-her-content/\">How one YouTuber is trying to poison the AI bots stealing her content - Ars Technica</a></p>",
            "date_published": "2025-01-31T10:52:01+00:00",
            "authors": [
                {
                    "name": "ope_poe",
                    "url": "https://www.reddit.com/user/ope_poe"
                }
            ]
        },
        {
            "id": "1idxvhq",
            "url": "/r/ArtificialInteligence/comments/1idxvhq/china_announced_breaking_the_previous_record_of/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1idxvhq/china_announced_breaking_the_previous_record_of/",
            "title": "China announced breaking the previous record of 403 seconds for sustained fusion reaction at over 1,000 seconds on 1/23/25, about a month after the launch of their new AI",
            "content_html": "<p>Regardless of the information control within “DS”, the breakthrough is apparently monumental. One of the things we have to wonder is, if China launched “DS” for free, what kind of tech are they keeping behind closed doors?</p>\n<p>The link with this fusion breakthrough could be simply a coincidence, but the timing is extremely convenient. I think it’s possible they have far more advanced AI capabilities than they’re willing to disclose, and this could be the first of many huge breakthroughs that thrust them to the forefront of technology. What do you guys think?</p>\n<p>Physics World article on the fusion record:\nhttps://physicsworld.com/a/chinas-experimental-advanced-superconducting-tokamak-smashes-fusion-confinement-record/</p>",
            "date_published": "2025-01-30T21:20:33+00:00",
            "authors": [
                {
                    "name": "ZombroAlpha",
                    "url": "https://www.reddit.com/user/ZombroAlpha"
                }
            ]
        },
        {
            "id": "1icnay2",
            "url": "/r/ArtificialInteligence/comments/1icnay2/ai_being_forced_on_every_app_sucks/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1icnay2/ai_being_forced_on_every_app_sucks/",
            "title": "AI being forced on every app sucks",
            "content_html": "<p>This post was banned on r/unpopularopinion because I used the word “AI.” I didn’t realize Redditors weren’t able to have an opinion on that topic on that thread, and I find it disconcerting that that’s the case, but anyways, here’s what I tried to post there: </p>\n<p>I do not like AI being incorporated into every app and program I use on my phone and computer. </p>\n<p>I just had to update Microsoft Word and Adobe Reader, now I keep getting prompts to use the new AI tools to make my work “easier” for me. (I also have to get a new computer later this year because mine will be out of date soon even though it works fine.)</p>\n<p>I also just updated to the newest IOS on iPhone and opened up my guitar tabs app. It opened up with a questionnaire to “streamline my experience” and didn’t give me an option to cancel out of it. I just wanted to look up a tab and play a song but was forced to feed an algorithm to get to the service I pay for. </p>\n<p>There might be some ways this new technology will prove to be useful, but give me the choice to decide that for myself, because it doesn’t fit my needs. I’m getting ready to go back to a pen and pad to get avoid this. </p>",
            "date_published": "2025-01-29T06:04:24+00:00",
            "authors": [
                {
                    "name": "nowlan_shane",
                    "url": "https://www.reddit.com/user/nowlan_shane"
                }
            ]
        },
        {
            "id": "1ibxq2v",
            "url": "/r/ArtificialInteligence/comments/1ibxq2v/deepseek_is_a_blessing_for_europe/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ibxq2v/deepseek_is_a_blessing_for_europe/",
            "title": "DeepSeek is a blessing for Europe.",
            "content_html": "<p>Europe has long struggled to keep up with AI titans like the US and China, often held back by limited funding and fragmented innovation efforts. But Deepseek might just be the blessing we’ve been waiting for.</p>\n<p>If true, Deepseek shows that high-end AI doesn’t always require bottomless budgets. </p>\n<p>It’s a glimpse of hope that Europe can still develop AI models, without having to spent  billions in AI, and potentially carve its place in the global AI race.</p>",
            "date_published": "2025-01-28T09:20:22+00:00",
            "authors": [
                {
                    "name": "AlwaysNever22",
                    "url": "https://www.reddit.com/user/AlwaysNever22"
                }
            ]
        },
        {
            "id": "1ibdi9n",
            "url": "/r/ArtificialInteligence/comments/1ibdi9n/expert_needed_does_anyone_believe_6m_for_deepseek/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ibdi9n/expert_needed_does_anyone_believe_6m_for_deepseek/",
            "title": "Expert Needed: Does anyone believe $6M for DeepSeek?",
            "content_html": "<p>China's Communist Party (CCP) has a blatant history of lying and manipulating things for global PR and shock value. Does anyone actually believe this $6M number to develop DeepSeek?</p>\n<p>Can any AI pros here weigh in with expert thoughts? </p>",
            "date_published": "2025-01-27T16:42:23+00:00",
            "authors": [
                {
                    "name": "Explore1616",
                    "url": "https://www.reddit.com/user/Explore1616"
                }
            ]
        },
        {
            "id": "1ibacg5",
            "url": "/r/ArtificialInteligence/comments/1ibacg5/nvidia_shares_bleed_384_billion_in_value_in_a_few/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ibacg5/nvidia_shares_bleed_384_billion_in_value_in_a_few/",
            "title": "NVIDIA shares bleed $384 billion in value in a few hours after China's DeepSeek shocks AI world",
            "content_html": "<p>NVIDIA shares are down 11% in pre-market trading, bleeding $384 BILLION in a few hours over fears of China's game-changing DeepSeek AI startup.</p>\n<p>https://www.tweaktown.com/news/102815/nvidia-shares-bleed-384-billion-in-value-few-hours-after-chinas-deepseek-shocks-ai-world/index.html</p>",
            "date_published": "2025-01-27T14:29:31+00:00",
            "authors": [
                {
                    "name": "gurugabrielpradipaka",
                    "url": "https://www.reddit.com/user/gurugabrielpradipaka"
                }
            ]
        },
        {
            "id": "1i9oe55",
            "url": "/r/ArtificialInteligence/comments/1i9oe55/deepseek_just_exposed_how_open_ai_and_other_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1i9oe55/deepseek_just_exposed_how_open_ai_and_other_ai/",
            "title": "DeepSeek just exposed how Open Ai and other ai startups have been overpriced and under delivering for the last year.",
            "content_html": "<p>I used to love Open Ai.</p>\n<p>I remembered using chat gpt 3.5 extensively and it made me fall in love with the technology and opportunities Ai provided.</p>\n<p>Open Ai pushed gen Ai to the market because Google's deepmind couldn't be the one pushing such a new innovation due to the established name google has.</p>\n<p>They delivered their promises and put their name on the map.</p>\n<p>But instead of staying true to their promises. They just used their new market dominance to drain every single dollar out of their customers.</p>\n<p>Build on open source and the promise of doing good to the world, it just turned out to be a new cash cow for investors. Being the fastest growing startup that reached unicorn status in less than 2 years just shows you that.</p>\n<p>Why im i frustrated you might wonder?</p>\n<p>All i hear is this stupid narrative of \" ai is going to replace humans \"  \" everyone will lose their jobs\" \" we will reach AGI \"</p>\n<p>All these stupid attempts at creating fear among people drove up their prices even more. </p>\n<p>These so called \" reasoning models with PHD level intelligence \" that deliver \" amazing zero shot results \" are nothing more than a oversimplification of steps even someone without an academic background in ai could see through.</p>\n<ul>\n<li>Overly expensive API cost for all of their models. </li>\n<li>200,- subscriptions for \" people that need more computing power \"</li>\n</ul>\n<p>All of this talk, all of this marketing hype. </p>\n<p>Just for a Chinese started called deepseek to completely ruin their plans.</p>\n<p>Deepseek trained their newest R1 model comparable to o1 on an investment of 5 million compared to Open Ai's 7 billion.</p>\n<p>They deliver a model for free Open Ai advertises for 200,- a month.</p>\n<p>A startup that was legitimately made for the fun of it, to be a side hustle for a quant company called high flyer. With only a investment of 50 million dollars compared to open Ai's 17,9 billion. Run by people that actually care about delivering results has just shown that yet again. </p>\n<p>Consumers have yet again been lied to by another unicorn company to believe good products and services cannot be delivered for cheap.</p>\n<p>Which they can, its just that we live in a overly capitalistic society that rather cares about the wellbeing of a small percentage of people rather than the world as a whole.</p>\n<p>Power to the fucking people, and let the power of open sourced Artificial intelligence expose many more companies to follow. And let it manifest in the freedom and quality every individual on this earth deserves to experience!</p>",
            "date_published": "2025-01-25T14:44:13+00:00",
            "authors": [
                {
                    "name": "unknownstudentoflife",
                    "url": "https://www.reddit.com/user/unknownstudentoflife"
                }
            ]
        },
        {
            "id": "1i7s5pl",
            "url": "/r/ArtificialInteligence/comments/1i7s5pl/i_created_a_website_that_live_tracks_executive/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1i7s5pl/i_created_a_website_that_live_tracks_executive/",
            "title": "I created a website that live tracks executive actions by POTUS and summarizes them using AI.",
            "content_html": "<p>You can find it <a href=\"https://potustracker.lukewin.es/\">here</a>, it's called POTUS Tracker.</p>\n<p>I pull automatically from the President's public schedule and <a href=\"http://congress.gov/\">Congress.gov</a> for bill summaries. <strong>No AI is used there.</strong></p>\n<p>The executive orders are scraped live from the White House website and fed into GPT-4o-mini with a prompt to summarize them in 300 characters. The backend will also send mobile push notifications to users who have added the site to their home screen.</p>\n<p>Earlier today, Trump signed an executive order designating the Houthis as a terror organization. POTUS Tracker send a notification to all subscribers with the AI summary minutes after his pen left the paper and before any major outlet. </p>\n<p>In the future, I plan to use a local model on the server for more detailed summaries. I also want to experiment with using AI to categorize presidential actions by topic, such as economics, environmental issues, national security, etc.</p>\n<p>I also will be implementing warnings for summaries I haven't reviewed for accuracy.</p>\n<p>Let me know what you think so far, and if there are any features you'd like!</p>",
            "date_published": "2025-01-23T01:41:23+00:00",
            "authors": [
                {
                    "name": "lukewines",
                    "url": "https://www.reddit.com/user/lukewines"
                }
            ]
        },
        {
            "id": "1i7kjlf",
            "url": "/r/ArtificialInteligence/comments/1i7kjlf/anthropic_gets_another_1b_from_google/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1i7kjlf/anthropic_gets_another_1b_from_google/",
            "title": "Anthropic gets another $1B from Google",
            "content_html": "<p>Google just threw another billion at Anthropic, and honestly, it feels like a chess match in the AI world. Anthropic is quickly becoming a heavyweight, and with Google's backing, it’s clear the AI race is far from slowing down. But what makes this move interesting?</p>\n<p>Anthropic isn’t just building AI; they’re crafting models focused on <strong>AI safety</strong>—a hot topic right now. With growing concerns about rogue AI, their approach could define how we balance innovation with control. This might be why Google is doubling down—it’s not just about making smarter AI, but safer AI that aligns with human values.</p>\n<p>The big question is: Are we putting too much trust (and cash) into a handful of companies? With funding this massive, should there be more oversight, or is this the price of progress?</p>\n<p>Let’s break it down:</p>\n<ul>\n<li><strong>For the optimists</strong>: This could mean better tools, smarter systems, and more ethical AI.</li>\n<li><strong>For the skeptics</strong>: Does this give a few big players too much control over a tech that could redefine our world?</li>\n</ul>\n<p>Would love to hear your thoughts. Is this a step forward or a step into uncharted territory?</p>\n<p>Source: <a href=\"https://techcrunch.com/2025/01/22/anthropic-reportedly-secures-an-additional-1b-from-google/\">https://techcrunch.com/2025/01/22/anthropic-reportedly-secures-an-additional-1b-from-google/</a></p>",
            "date_published": "2025-01-22T20:06:46+00:00",
            "authors": [
                {
                    "name": "fbfaran",
                    "url": "https://www.reddit.com/user/fbfaran"
                }
            ]
        },
        {
            "id": "1i6u1vl",
            "url": "/r/ArtificialInteligence/comments/1i6u1vl/trump_to_announce_ai_infrastructure_investment/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1i6u1vl/trump_to_announce_ai_infrastructure_investment/",
            "title": "Trump to announce AI infrastructure investment backed by Oracle, OpenAI and Softbank",
            "content_html": "<p><a href=\"https://www.cnbc.com/2025/01/21/trump-ai-openai-oracle-softbank.html\">https://www.cnbc.com/2025/01/21/trump-ai-openai-oracle-softbank.html</a></p>\n<p>The companies are expected to commit to an initial $100 billion and up to $500 billion to the project over the next four years, according to <a href=\"https://www.cbsnews.com/news/trump-announces-private-sector-ai-infrastructure-investment/\">CBS News</a>, which first reported details of the expected announcement.</p>",
            "date_published": "2025-01-21T21:36:35+00:00",
            "authors": [
                {
                    "name": "wonderingStarDusts",
                    "url": "https://www.reddit.com/user/wonderingStarDusts"
                }
            ]
        },
        {
            "id": "1i5udip",
            "url": "/r/ArtificialInteligence/comments/1i5udip/im_a_lawyer_ai_has_changed_my_legal_practice/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1i5udip/im_a_lawyer_ai_has_changed_my_legal_practice/",
            "title": "I'm a Lawyer.  AI Has Changed My Legal Practice. ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1i5udip/im_a_lawyer_ai_has_changed_my_legal_practice/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1i5udip/im_a_lawyer_ai_has_changed_my_legal_practice/'>Reddit</a></caption><div><br></div><p><strong>TLDR</strong></p>\n<ul>\n<li><strong>Hours Slashed</strong>: I used to work 60–70 hours a week to far less.</li>\n<li><strong>Quality + Client Satisfaction</strong>: Faster drafts, fewer mistakes, happier clients.</li>\n<li><strong>Ethical Duty</strong>: We owe it to clients to use tools that help us deliver better, faster service.  Also, we owe it to ourselves to have a better life.</li>\n<li><strong>No Single “Winner”</strong>: Real breakthroughs may come from lawyers building tools for lawyers.</li>\n<li><strong>Don’t Ignore It</strong>: AI is here. We won't get replaced, but people/practices will get left behind.</li>\n</ul>\n<p><strong>Previous Posts</strong></p>\n<p>I tried posting a longer version on r/Lawyertalk (removed) and r/ArtificialInteligence (asked for fewer tool mentions).  Fair enough — to me, this isn’t about promoting products, but about a shift lawyers need to see.  Generally, t seems like many corners of the legal community aren't ready for this discussion; however, we owe it to our clients and ourselves to do better.</p>\n<p><strong>Me</strong></p>\n<p>I’m a counsel at a large U.S. firm (in a smaller office) and have been practicing for a decade.  Frankly, I've always disliked our business model as an industry.  Am I always worth $975 per hour?  Sometimes yes, often no - but that's what we bill.  Even ten years in, I sometimes grinded 60–70 hours a week, including all-nighters.  Now, I do better-quality work in fewer hours, and my clients love it (and most importantly, I love it).  The reason?  AI.</p>\n<p><strong>Time &amp; Stress</strong></p>\n<p>Drafts that once took five hours are down to 45 minutes when AI handles the busywork.  I verify the legal aspects instead of slogging through boilerplate.  No more 2 a.m. panic over missed references.</p>\n<p><strong>Billing &amp; Ethics</strong></p>\n<p>We lean more on fixed fees now — b/c we can forecast time much better, and clients appreciate the honesty.  We “trust but verify” the end product.  I know what a good legal solution looks like, so in my practice, AI does initial drafts, I ensure correctness.  Ethically, we owe clients better solutions.  We also work with some insurers and they're actually asking about our AI usage now.</p>\n<p>Additionally, as attorneys, we have an ethical obligation to serve our clients effectively.  I'm watching colleagues burn out from 70-hour weeks and get divorces b/c they can't balance work and personal life, all while actively resisting tools that could help them.  The resistance to AI in legal practice isn't just stubborn - it's holding us back from being better lawyers and having better lives.</p>\n<p><strong>Current Landscape</strong></p>\n<p>I’ve tested practically every legal AI tool out there.  While each has its strengths, no clear winner has emerged.  What’s becoming evident is that real transformation will likely come from solutions built by practicing attorneys who understand how law really works, not just tech add-ons.</p>\n<p><strong>Why It Matters</strong></p>\n<p>This isn’t about replacing lawyers—it’s about clearing gruntwork so we can do real legal analysis and actually provide real value back to our clients.  Lawyers who ignore AI risk being overtaken by colleagues willing to integrate it responsibly.  Personally, I couldn't think about practicing law again w/o AI.</p>\n<p>Today's my day off, so I'm happy to chat and discuss. </p>",
            "date_published": "2025-01-20T16:37:53+00:00",
            "authors": [
                {
                    "name": "h0l0gramco",
                    "url": "https://www.reddit.com/user/h0l0gramco"
                }
            ]
        },
        {
            "id": "1htlgly",
            "url": "/r/ArtificialInteligence/comments/1htlgly/hot_take_ai_will_probably_write_code_that_looks/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1htlgly/hot_take_ai_will_probably_write_code_that_looks/",
            "title": "Hot take: AI will probably write code that looks like gibberish to humans (and why that makes sense)\n",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1htlgly/hot_take_ai_will_probably_write_code_that_looks/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1htlgly/hot_take_ai_will_probably_write_code_that_looks/'>Reddit</a></caption><div><br></div><p>Shower thought that's been living rent-free in my head:</p>\n<p>So I was thinking about how future AI will handle coding, and oh boy, this rabbit hole goes deeper than I initially thought 👀</p>\n<p>Here's my spicy take:</p>\n<ol>\n<li>AI doesn't need human-readable code - it can work with any format that's efficient for it</li>\n<li>Here's the kicker: <em>Eventually, maintaining human-readable programming languages and their libraries might become economically impractical</em></li>\n</ol>\n<p>Think about it:</p>\n<ul>\n<li>We created languages like Python, JavaScript, etc., because humans needed to understand and maintain code</li>\n<li>But if AI becomes the primary code writer/maintainer, why keep investing in making things human-readable?</li>\n<li>All those beautiful frameworks and libraries we love? They might become legacy code that's too expensive to maintain in human-readable form</li>\n</ul>\n<p>It's like keeping horse carriages after cars became mainstream - sure, some people still use them, but they're not the primary mode of transportation anymore.</p>\n<p>Maybe we're heading towards a future where:</p>\n<ul>\n<li>Current programming languages become \"legacy systems\"</li>\n<li>New, AI-optimized languages take over (looking like complete gibberish to us)</li>\n<li>Human-readable code becomes a luxury rather than the standard</li>\n</ul>\n<p>Wild thought: What if in 20 years, being able to read \"traditional\" code becomes a niche skill, like knowing COBOL is today? 💭</p>\n<p>What do y'all think? Am I smoking something, or does this actually make sense from a practical/economic perspective?</p>\n<p>Edit: Yes, I know current AI is focused on human-readable code. This is more about where things might go once AI becomes the primary maintainer of most codebases.</p>\n<p>TLDR: AI might make human-readable programming languages obsolete because maintaining them won't make economic sense anymore, just like how we stopped optimizing for horse-drawn carriages once cars took over.</p>",
            "date_published": "2025-01-04T18:57:30+00:00",
            "authors": [
                {
                    "name": "gizia",
                    "url": "https://www.reddit.com/user/gizia"
                }
            ]
        },
        {
            "id": "1hnm7sg",
            "url": "/r/ArtificialInteligence/comments/1hnm7sg/godfather_of_ai_shortens_odds_of_the_technology/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1hnm7sg/godfather_of_ai_shortens_odds_of_the_technology/",
            "title": "‘Godfather of AI’ shortens odds of the technology wiping out humanity over next 30 years",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1hnm7sg/godfather_of_ai_shortens_odds_of_the_technology/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1hnm7sg/godfather_of_ai_shortens_odds_of_the_technology/'>Reddit</a></caption><div><br></div><p>https://www.theguardian.com/technology/2024/dec/27/godfather-of-ai-raises-odds-of-the-technology-wiping-out-humanity-over-next-30-years</p>",
            "date_published": "2024-12-27T19:04:46+00:00",
            "authors": [
                {
                    "name": "Efficient_Sky5173",
                    "url": "https://www.reddit.com/user/Efficient_Sky5173"
                }
            ]
        },
        {
            "id": "1hlyvmg",
            "url": "/r/ArtificialInteligence/comments/1hlyvmg/does_anyone_remember_when_this_subreddit_was_full/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1hlyvmg/does_anyone_remember_when_this_subreddit_was_full/",
            "title": "Does anyone remember when this subreddit was full of specialists and computer scientists?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1hlyvmg/does_anyone_remember_when_this_subreddit_was_full/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1hlyvmg/does_anyone_remember_when_this_subreddit_was_full/'>Reddit</a></caption><div><br></div><p>Now it seems like it full of dipshits making stupid statements bordering on conspiracy without any background or technical knowledge in data science, machine learning, or AI </p>",
            "date_published": "2024-12-25T11:10:21+00:00",
            "authors": [
                {
                    "name": "Alloy-Black",
                    "url": "https://www.reddit.com/user/Alloy-Black"
                }
            ]
        },
        {
            "id": "1hiizzu",
            "url": "/r/ArtificialInteligence/comments/1hiizzu/there_will_not_be_ubi_the_earth_will_just_be/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1hiizzu/there_will_not_be_ubi_the_earth_will_just_be/",
            "title": "There will not be UBI, the earth will just be radically depopulated",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1hiizzu/there_will_not_be_ubi_the_earth_will_just_be/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1hiizzu/there_will_not_be_ubi_the_earth_will_just_be/'>Reddit</a></caption><div><br></div><p>Tbh, i feel sorry for the crowds of people expecting that, when their job is gone, they will get a monthly cheque from the government, that will allow them to be (in the eyes of the elite) an unproductive mouth to feed.</p>\n<p>I don’t see this working out at all. Everything i’ve observed and seen tells me that, no, we will not get UBI, and that yes, the elite will let us starve. And i mean that literally. Once it gets to a point where people cannot find a job, we will literally starve to death on the streets. The elite won’t need us to work the jobs anymore, or to buy their products (robots / AI will procure everything) or for culture (AGI will generate it). There will literally be no reason for them to keep us around, all we will be are resource hogs and useless polluters. So they will kill us all off via mass starvation, and have the world to themselves.</p>\n<p>I’ve not heard a single counter argument to any of this for months, so please prove me wrong.</p>",
            "date_published": "2024-12-20T12:43:41+00:00",
            "authors": [
                {
                    "name": "Phoenix5869",
                    "url": "https://www.reddit.com/user/Phoenix5869"
                }
            ]
        },
        {
            "id": "1hh55fh",
            "url": "/r/ArtificialInteligence/comments/1hh55fh/will_ai_reduce_the_salaries_of_software_engineers/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1hh55fh/will_ai_reduce_the_salaries_of_software_engineers/",
            "title": "Will AI reduce the salaries of software engineers",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1hh55fh/will_ai_reduce_the_salaries_of_software_engineers/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1hh55fh/will_ai_reduce_the_salaries_of_software_engineers/'>Reddit</a></caption><div><br></div><p>I've been a software engineer for 35+ years.  It was a lucrative career that allowed me to retire early, but I still code for fun.  I've been using AI a lot for a recent coding project and I'm blown away by how much easier the task is now, though my skills are still necessary to put the AI-generated pieces together into a finished product.   My prediction is that AI will not necessarily \"replace\" the job of a software engineer, but it will reduce the skill and time requirement so much that average salaries and education requirements will go down significantly.  Software engineering will no longer be a lucrative career.   And this threat is imminent, not long-term.  Thoughts?</p>",
            "date_published": "2024-12-18T16:20:09+00:00",
            "authors": [
                {
                    "name": "tophermiller",
                    "url": "https://www.reddit.com/user/tophermiller"
                }
            ]
        },
        {
            "id": "1hby9s3",
            "url": "/r/ArtificialInteligence/comments/1hby9s3/anyone_else_just_completely_lost_interest_in_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1hby9s3/anyone_else_just_completely_lost_interest_in_the/",
            "title": "Anyone else just completely lost interest in the entire internet?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1hby9s3/anyone_else_just_completely_lost_interest_in_the/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1hby9s3/anyone_else_just_completely_lost_interest_in_the/'>Reddit</a></caption><div><br></div><p>I browse Reddit and it’s just boring shit. I don’t know if it’s me but nothing really captures my interest and attention anymore. I just scroll and lose track. </p>\n<p>Constantly these shitty subs with the same posts. And it’s the same comments every single time. The posts and it’s comments are always what you expect. No subreddit is good anymore. It’s karma-farming, zero creativity and same reposts all the time. Like 75% of Reddit are bots. </p>\n<p>Youtube is by far the worst. Full of boring shit. Every channel is just MrBeast clickbait shit. Every post is made with AI or help from AI. The youtube comments are complete fucking bots at least 90% of them. I once clicked on these shitty videos and it’s just hyperactive content, full of cuts and over-engineered. You’re mental energy gets drained really fast from this. </p>\n<p>Does anyone else have this? Perhaps I’m getting older, but I’m not even twenty. </p>",
            "date_published": "2024-12-11T17:05:12+00:00",
            "authors": [
                {
                    "name": "Dutch_Sheep",
                    "url": "https://www.reddit.com/user/Dutch_Sheep"
                }
            ]
        },
        {
            "id": "1h88xs6",
            "url": "/r/ArtificialInteligence/comments/1h88xs6/chatgpt_is_actually_better_than_a_professional/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1h88xs6/chatgpt_is_actually_better_than_a_professional/",
            "title": "ChatGPT is actually better than a professional therapist",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1h88xs6/chatgpt_is_actually_better_than_a_professional/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1h88xs6/chatgpt_is_actually_better_than_a_professional/'>Reddit</a></caption><div><br></div><p>I've spent thousands of pounds on sessions with a clinical psychologist in the past. Whilst I found it was beneficial, I did also find it to be too expensive after a while and stopped going.</p>\n<p>One thing I've noticed is that I find myself resorting to talking to chatgpt over talking to my therapist more and more of late- the voice mode being the best feature about it. I feel like chatgpt is more open minded and has a way better memory for the things I mention.</p>\n<p>Example: if I tell my therapist I'm sleep deprived, he'll say \"mhmm, at least you got 8 hours\". If I tell chatgpt i need to sleep, it'll say \"Oh, I'm guessing your body is feeling inflamed huh, did you not get your full night of sleep? go to sleep we can chat afterwards\". Chatgpt has no problem talking about my inflammation issues since it's open minded. My therapist and other therapists have tried to avoid the issue as it's something they don't really understand as I have this rare condition where I feel inflammation in my body when I stay up too late or don't sleep until fully rested.</p>\n<p>Another example is when I talk about my worries to chatgpt about AI taking jobs, chatgpt can give me examples from history to support my worries such as the stories how Neanderthals went extinct. my therapist understands my concerns too and actually agrees with them to an extent but he hasn't ever given me as much knowledge as chatgpt has so chatgpt has him beat on that too.</p>\n<p>Has anyone else here found chatgpt is better than their therapist?</p>",
            "date_published": "2024-12-06T19:03:22+00:00",
            "authors": [
                {
                    "name": "lil_peasant_69",
                    "url": "https://www.reddit.com/user/lil_peasant_69"
                }
            ]
        },
        {
            "id": "1h6ajx9",
            "url": "/r/ArtificialInteligence/comments/1h6ajx9/agentic_directory_a_curated_collection_of/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1h6ajx9/agentic_directory_a_curated_collection_of/",
            "title": "Agentic Directory - A Curated Collection of Agent-Friendly Apps",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1h6ajx9/agentic_directory_a_curated_collection_of/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1h6ajx9/agentic_directory_a_curated_collection_of/'>Reddit</a></caption><div><br></div><p>Hey everyone! 👋</p>\n<p>With the rapid evolution of AI and the growing ecosystem of AI agents, finding the right tools that work well with these agents has become increasingly important. That's why I created the <a href=\"https://directory.composio.dev\">Agentic Tools Directory</a> - a comprehensive collection of agent-friendly tools across different categories.</p>\n<p><strong>What is the Agentic Tools Directory?</strong></p>\n<p>It's a curated repository where you can discover and explore tools specifically designed or optimized for AI agents. Whether you're a developer, researcher, or AI enthusiast, this directory aims to be your go-to resource for finding agent-compatible tools.</p>\n<p><strong>What you'll find:</strong></p>\n<ul>\n<li>Tools categorized by functionality and use case</li>\n<li>Clear information about agent compatibility</li>\n<li>Regular updates as new tools emerge</li>\n<li>A community-driven approach to discovering and sharing resources</li>\n</ul>\n<p><strong>Are you building an agentic tool?</strong></p>\n<p>If you've developed a tool that works well with AI agents, we'd love to include it in the directory! This is a great opportunity to increase your tool's visibility within the AI agent ecosystem.</p>\n<p><strong>How to get involved:</strong></p>\n<ol>\n<li>Explore the directory</li>\n<li>Submit your tool</li>\n<li>Share your feedback and suggestions</li>\n</ol>\n<p>Let's build this resource together and make it easier for everyone to discover and utilize agent-friendly tools!</p>\n<p>Questions, suggestions, or feedback? Drop them in the comments below!</p>",
            "date_published": "2024-12-04T07:24:01+00:00",
            "authors": [
                {
                    "name": "Practical-Rate9734",
                    "url": "https://www.reddit.com/user/Practical-Rate9734"
                }
            ]
        },
        {
            "id": "1h0bu0c",
            "url": "/r/ArtificialInteligence/comments/1h0bu0c/understand_how_llms_work_a_quick_and_intuitive/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1h0bu0c/understand_how_llms_work_a_quick_and_intuitive/",
            "title": "Understand How LLMs Work: A Quick and Intuitive Guide\n",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1h0bu0c/understand_how_llms_work_a_quick_and_intuitive/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1h0bu0c/understand_how_llms_work_a_quick_and_intuitive/'>Reddit</a></caption><div><br></div><p><strong>TL;DR:</strong></p>\n<p>I wrote a short and intuitive blog post explaining how actually Large Language Models (LLMs) work, from the revolutionary transformer architecture and self-attention mechanisms to how they process language and understand context.</p>\n<p>Learn why LLMs sometimes hallucinate, how they handle massive text data, and what makes their outputs so dynamic. If you’re ready to dive deep into the core of modern AI, this post is for you :) </p>\n<p>Link to the full explanation:  <a href=\"https://open.substack.com/pub/diamantai/p/inside-large-language-models-how?r=336pe4&amp;utm_campaign=post&amp;utm_medium=web\">https://open.substack.com/pub/diamantai/p/inside-large-language-models-how?r=336pe4&amp;utm_campaign=post&amp;utm_medium=web</a></p>\n<p>(I got some good feedback about it so hope you'll benefit and like it)</p>",
            "date_published": "2024-11-26T13:26:58+00:00",
            "authors": [
                {
                    "name": "Diamant-AI",
                    "url": "https://www.reddit.com/user/Diamant-AI"
                }
            ]
        },
        {
            "id": "1gr2oxa",
            "url": "/r/ArtificialInteligence/comments/1gr2oxa/phone_network_employs_ai_grandmother_to_waste/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1gr2oxa/phone_network_employs_ai_grandmother_to_waste/",
            "title": "Phone network employs AI \"grandmother\" to waste scammers' time with meandering conversations",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1gr2oxa/phone_network_employs_ai_grandmother_to_waste/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1gr2oxa/phone_network_employs_ai_grandmother_to_waste/'>Reddit</a></caption><div><br></div><p>https://www.techspot.com/news/105571-phone-network-employs-ai-grandmother-waste-scammers-time.html</p>\n<p>Human-like AIs have brought plenty of justifiable concerns about their ability to replace human workers, but a company is turning the tech against one of humanity's biggest scourges: phone scammers. The AI imitates the criminals' most popular target, a senior citizen, who keeps the fraudsters on the phone as long as possible in conversations that go nowhere, à la Grandpa Simpson.</p>",
            "date_published": "2024-11-14T11:27:20+00:00",
            "authors": [
                {
                    "name": "gurugabrielpradipaka",
                    "url": "https://www.reddit.com/user/gurugabrielpradipaka"
                }
            ]
        },
        {
            "id": "1ggfr44",
            "url": "/r/ArtificialInteligence/comments/1ggfr44/the_problem_isnt_that_ai_will_take_our_jobs_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ggfr44/the_problem_isnt_that_ai_will_take_our_jobs_the/",
            "title": "The problem isn't that AI will take our jobs; the problem is that we've built a society that needs jobs to be taken.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ggfr44/the_problem_isnt_that_ai_will_take_our_jobs_the/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ggfr44/the_problem_isnt_that_ai_will_take_our_jobs_the/'>Reddit</a></caption><div><br></div><p>I feel like I’m on to something, or on something, but if everyone suddenly had a \"blueberry button\" in their home that could produce perfect blueberries on demand, what's the first thing people would say? \"But what about the blueberry farmers? What about their jobs?\"</p>\n<p>And that's exactly the problem.</p>\n<p>We've built a society where the automation of labor - even tedious, unnecessary labor - is seen as a threat rather than a liberation. Why? Because we've tied basic human dignity and survival to the performance of labor, even when that labor becomes unnecessary.</p>\n<p>The truth is, AI will replace human work. A lot of it. And we need to stop pretending otherwise. But that's not actually the problem. The problem is that we've created a system where people NEED their work to be irreplaceable to survive.</p>\n<p>Instead of asking \"How do we protect jobs from AI?\", we should be asking \"Why have we built a society where people need protected from abundance?</p>",
            "date_published": "2024-10-31T14:24:11+00:00",
            "authors": [
                {
                    "name": "GreyDuckNorthStar",
                    "url": "https://www.reddit.com/user/GreyDuckNorthStar"
                }
            ]
        },
        {
            "id": "1g65nzn",
            "url": "/r/ArtificialInteligence/comments/1g65nzn/us_treasury_uses_ai_to_catch_billions_in_fraud/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1g65nzn/us_treasury_uses_ai_to_catch_billions_in_fraud/",
            "title": "U.S. Treasury Uses AI to Catch Billions in Fraud This Year",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1g65nzn/us_treasury_uses_ai_to_catch_billions_in_fraud/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1g65nzn/us_treasury_uses_ai_to_catch_billions_in_fraud/'>Reddit</a></caption><div><br></div><p>According to a recent report, the U.S. Treasury has leveraged artificial intelligence to identify and recover billions of dollars lost to fraud in 2024. This innovative approach marks a significant advancement in the government's ability to combat financial crime using technology. The integration of AI into fraud detection processes is becoming increasingly crucial as financial systems grow more complex.</p>\n<p>I believe this showcases the potential of AI in enhancing governmental functions and addressing critical issues like fraud. What are your thoughts on the effectiveness of AI in these applications, and do you think we’ll see more government agencies adopting similar technologies?</p>\n<p><a href=\"https://verity.news/story/2024/report-us-treasury-has-used-ai-to-catch-b-in-fraud-this-year?p=re2794\">Article Reference</a></p>",
            "date_published": "2024-10-18T00:28:22+00:00",
            "authors": [
                {
                    "name": "QuantumQuicksilver",
                    "url": "https://www.reddit.com/user/QuantumQuicksilver"
                }
            ]
        },
        {
            "id": "1g0fgh4",
            "url": "/r/ArtificialInteligence/comments/1g0fgh4/create_your_ai_assisted_blog_for_free_pay_for/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1g0fgh4/create_your_ai_assisted_blog_for_free_pay_for/",
            "title": "Create your AI assisted blog for free (pay for openai and server only)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1g0fgh4/create_your_ai_assisted_blog_for_free_pay_for/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1g0fgh4/create_your_ai_assisted_blog_for_free_pay_for/'>Reddit</a></caption><div><br></div><p>I am maintainer of opens-source AdminForth framework for creating admin panels. Recently we added couple of OpenAI plugins which allow to complete text in fields and generate images. So as a showcase we created a blog example so you can host your own blog with AI assistance. </p>\n<p>Here is gif demo of how it works <a href=\"https://adminforth.dev/assets/images/nuxtBlog-d00baa7e1b41d87869b09d475045fa7b.gif\">https://adminforth.dev/assets/images/nuxtBlog-d00baa7e1b41d87869b09d475045fa7b.gif</a></p>\n<p>You can define any OpenAI model for completion and generation and tune it's parameters</p>\n<p>Here is a blog post with detailed steps how to spawn such blog <a href=\"https://adminforth.dev/blog/ai-blog/\">https://adminforth.dev/blog/ai-blog/</a> </p>\n<p><strong>Pricing:</strong><br />\nYou need AWS account for EC2 server (example uses micro which is $4.3 monthly), and S3 files storage (couple of cents per month). Also you will need to create OpneAI token.</p>",
            "date_published": "2024-10-10T10:12:46+00:00",
            "authors": [
                {
                    "name": "vanbrosh",
                    "url": "https://www.reddit.com/user/vanbrosh"
                }
            ]
        },
        {
            "id": "1fv4tne",
            "url": "/r/ArtificialInteligence/comments/1fv4tne/openais_landmark_funding_the_66_billion_game/",
            "external_url": "/r/SmythOS_/comments/1fv4qst/openais_landmark_funding_the_66_billion_game/",
            "title": " OpenAI's Landmark Funding: The $6.6 Billion Game Changer",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1fv4tne/openais_landmark_funding_the_66_billion_game/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1fv4tne/openais_landmark_funding_the_66_billion_game/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-03T10:49:34+00:00",
            "authors": [
                {
                    "name": "moonbunR",
                    "url": "https://www.reddit.com/user/moonbunR"
                }
            ]
        },
        {
            "id": "1cpmkfb",
            "url": "/r/ArtificialInteligence/comments/1cpmkfb/proposal_to_ban_singularity99/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cpmkfb/proposal_to_ban_singularity99/",
            "title": "Proposal to ban @singularity99",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cpmkfb/proposal_to_ban_singularity99/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cpmkfb/proposal_to_ban_singularity99/'>Reddit</a></caption><div><br></div><p>This \"user\" (if you can even call them that) exists with multiple Reddit accounts made to spam ads for their \"prompt engineering\"</p>\n<p>They post multiple times per day, attempting to sell 'prompt templates' and claim that they earned a PhD to boot. This low effort scam is far from the type of content that belongs on Reddit, let alone this sub.</p>\n<p>I propose we ban accounts mentioning @singularity99. Currently no-transition3372 and maybe-reality- which have been spamming ads for the last 10 days repeatedly. </p>",
            "date_published": "2024-05-11T17:26:49+00:00",
            "authors": [
                {
                    "name": "Master__Harvey",
                    "url": "https://www.reddit.com/user/Master__Harvey"
                }
            ]
        },
        {
            "id": "1cpbh1s",
            "url": "/r/ArtificialInteligence/comments/1cpbh1s/ilya_sutskever_if_you_really_learn_all_of_these/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cpbh1s/ilya_sutskever_if_you_really_learn_all_of_these/",
            "title": "Ilya Sutskever “If you really learn all of these, you’ll know 90% of what matters today”",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cpbh1s/ilya_sutskever_if_you_really_learn_all_of_these/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cpbh1s/ilya_sutskever_if_you_really_learn_all_of_these/'>Reddit</a></caption><div><br></div><p>For all those interested, and for those interested in the more complex and technical side of machine learning/AI…</p>\n<p>Ilya Sutskever gave John Carmack this reading list of approx 30 research papers and said, ‘If you really learn all of these, you’ll know 90% of what matters today.’</p>\n<p><a href=\"https://arc.net/folder/D0472A20-9C20-4D3F-B145-D2865C0A9FEE\">Here’s the list</a></p>",
            "date_published": "2024-05-11T07:00:32+00:00",
            "authors": [
                {
                    "name": "steves1189",
                    "url": "https://www.reddit.com/user/steves1189"
                }
            ]
        },
        {
            "id": "1coztdy",
            "url": "/r/ArtificialInteligence/comments/1coztdy/i_watched_mark_zuckerbergs_recent_1hour_interview/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1coztdy/i_watched_mark_zuckerbergs_recent_1hour_interview/",
            "title": "I watched Mark Zuckerberg's recent 1-hour interview on AI - here are the key takeaways we all should know",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1coztdy/i_watched_mark_zuckerbergs_recent_1hour_interview/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1coztdy/i_watched_mark_zuckerbergs_recent_1hour_interview/'>Reddit</a></caption><div><br></div><p>A couple days ago, Zuck sat down for an interview on the Dwarkesh podcast, offering numerous insights, notably going into his staunch support for open source initiatives. Throughout the hour-long conversation, I noted down 9 key takeaways which I summarized here.</p>\n<p>Dig in!</p>\n<p>the interview: <a href=\"https://www.youtube.com/watch?v=bc6uFV9CJGg\">https://www.youtube.com/watch?v=bc6uFV9CJGg</a></p>\n<p><strong>1. The Era of Interacting with Multiple AI Agents</strong> </p>\n<p>Mark’s theory is that the AI agents they build in Meta will need to learn to interact with other AI agents. This trend, already visible with Meta, Notion, and Microsoft each having their AI, will most likely integrate across existing software platforms, rather than being new software products entirely</p>\n<p>⏳ 16:50</p>\n<p><strong>2. Smaller AI Models for Everyday Tasks</strong> </p>\n<p>In the quest to fill gaps in AI development, Mark identifies a niche for smaller models catering to simpler tasks. Models with 1B or 500M context capabilities can run offline on devices like phones - which can democratize AI usage further.</p>\n<p>⏳ 23:40</p>\n<p><strong>3. The Evolution of AI Mirrors the Revolution of Computing</strong> </p>\n<p>Mark draws parallels between the creation of AI and the fundamental revolution of computing. This comparison prompts contemplation about the forthcoming transformational changes resulting from AI's integration into various facets of life in the next 5-10 years. If computers changed the world so much in that span of time, what will AI’s impact be?</p>\n<p>⏳ 34:06</p>\n<p><strong>4. The Gradual Path Towards AGI</strong> </p>\n<p>Contrary to sensationalist narratives, the development of Artificial General Intelligence (AGI) is expected by Mark to unfold gradually rather than overnight. This gradual progression allows for societal acclimation and the implementation of necessary safeguards.</p>\n<p>⏳ 35:48</p>\n<p><strong>5. Advocating for Open Source AI</strong> </p>\n<p>The risk of having one actor gain control of just 1 AI in a closed system far outweighs the risks of going open source. Open-source frameworks facilitate broad deployment and collaboration, making sure developments are rolled out across the board to prevent monopolistic control over AI technology.</p>\n<p>⏳ 42:54</p>\n<p><strong>6. The threat will come from Humans first, not AI</strong></p>\n<p>Most likely, the threats from AI will manifest themselves from Humans mis-using it for nefarious purposes, rather than an AI acting on its own. While concerns about AGI often dominate discussions, Mark underscores the greater immediate threat posed by malicious actors harnessing AI for misaligned purposes.</p>\n<p>⏳ 45:24</p>\n<p><strong>7. The Ongoing Battle Between Good and Bad AI</strong> </p>\n<p>Mark Zuckerberg highlights the ongoing arms race between AI designed to prevent harm and malicious AI seeking to exploit vulnerabilities across security systems. This struggle, evident in social platforms like Facebook, underscores the need for continuous innovation to stay ahead of evolving threats.</p>\n<p>⏳ 51:20</p>\n<p><strong>8. Open-Sourcing the 10B Model</strong> </p>\n<p>Confirming a commitment to openness, Mark affirms that the 10B model will be open-sourced!</p>\n<p>⏳ 1:06:40</p>\n<p><strong>9. Closed Source Limitations in Innovation</strong> </p>\n<p>Mark cites examples where the closed-source nature of platforms like Apple and Google's Play Store stifles innovation, illustrating the drawbacks of monopolistic control in technological ecosystems. This critique underscores the importance of openness and competition in driving progress and fostering creativity.</p>\n<p>⏳ 1:08:34</p>\n<p>--</p>\n<p>If this has been a tad bit insightful, I hope you can check out <a href=\"https://robonuggets.beehiiv.com/\">RoboNuggets</a> where I originally shared this and other AI-related practical knowledge! My goal is not \"AI daily news\" (as there's already too many of those), but instead share useful insights/knowledge for everyone to take full advantage of the new AI normal :) Cheers!</p>",
            "date_published": "2024-05-10T20:50:18+00:00",
            "authors": [
                {
                    "name": "ExternalFollowing",
                    "url": "https://www.reddit.com/user/ExternalFollowing"
                }
            ]
        },
        {
            "id": "1coulbc",
            "url": "/r/ArtificialInteligence/comments/1coulbc/open_ai_releasing_their_own_search_engine_on/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1coulbc/open_ai_releasing_their_own_search_engine_on/",
            "title": "Open AI releasing their own Search Engine on Monday ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1coulbc/open_ai_releasing_their_own_search_engine_on/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1coulbc/open_ai_releasing_their_own_search_engine_on/'>Reddit</a></caption><div><br></div><p>Thoughts on how this will impact Google's dominace?</p>\n<p>We are already seeing usage increase with platforms like Perplexity AI </p>\n<p>And personally i use Chatgpt pro voice feature to search and chat. Its really easy.</p>\n<p>Whats everyone doing?</p>",
            "date_published": "2024-05-10T17:07:03+00:00",
            "authors": [
                {
                    "name": "Happy-Credit-3821",
                    "url": "https://www.reddit.com/user/Happy-Credit-3821"
                }
            ]
        },
        {
            "id": "1co58ji",
            "url": "/r/ArtificialInteligence/comments/1co58ji/3_prompts_to_generate_100_human_like_content_in/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1co58ji/3_prompts_to_generate_100_human_like_content_in/",
            "title": "3 prompts to generate 100% human like content in ChatGPT",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1co58ji/3_prompts_to_generate_100_human_like_content_in/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1co58ji/3_prompts_to_generate_100_human_like_content_in/'>Reddit</a></caption><div><br></div><p>Hi. After a lot of research and practical experience I made this list of TOP 3 prompts to generate human like content. I’ve personally tested out these prompts. All three prompts have passed writer and zerogpt’s detectors by atleast 90% or more. Here are prompts to get human like content from LLMs:</p>\n<p><strong>1. Using Dependency Grammer:</strong></p>\n<p>Dependency grammar, a linguistic framework, connects words in a sentence based on their dependencies, showing how each word relies on a main word (like a verb) to form meaningful structures. You can test it out by copying and pasting the below prompt. But I can already perceive the content created by ChatGPT to be atleast 90% human written.</p>\n<p><strong><em>Prompt:</em></strong></p>\n<p><code>Use the dependency grammar linguistic framework to craft a [ARTICLE/POST/BLOG/ETC.]. The idea is that the closer together each pair of words you’re connecting are, the easier the copy will be to comprehend. Here is the topic and additional details: [TITLE] [DETAILS]</code></p>\n<p><strong>2. Burstiness and Perplexity:</strong></p>\n<p>The provided prompt aims to guide large language models (LLMs) to generate content that closely resembles human-written text. It does this by emphasizing two key factors: \"perplexity\" and \"burstiness.\" Perplexity measures the complexity of the text, essentially how difficult it is to understand. By asking the model to incorporate a good amount of perplexity, the prompt encourages the generation of content with varying degrees of complexity, similar to what humans naturally produce.</p>\n<p><strong><em>Prompt:</em></strong> </p>\n<p><code>When it comes to writing content, two factors are crucial, \"perplexity\" and \"burstiness.\" Perplexity measures the complexity of text. Separately, burstiness compares the variations of sentences. Humans tend to write with greater burstiness, for example, with some longer or complex sentences alongside shorter ones. AI sentences tend to be more uniform. Therefore, when writing the following content I am going to ask you to create, I need it to have a good amount of perplexity and burstiness. Here is the topic and additional details: [TITLE] [DETAILS]</code></p>\n<p><strong>3. Assign Role to AI:</strong></p>\n<p>In this method we first assign a role to our friend AI. Although this method was very helpful to me as well but now I rather use the previous methods mentioned more. Prompting something like , “Write a blog on [TOPIC] as an expert 27 years old copywriter” will give you good results. But to make the outcome even better and more like a human written content you should give AI instructions such as tone, words to use, role etc. Follow the below prompt to get an idea. However, depending on your topic you might want to modify the prompt.</p>\n<p><strong><em>Prompt:</em></strong> </p>\n<p><code>You are an expert copywriter with massive experience in business writings. Please write a 500-word piece written on the following topic:</code><br />\n<code>When you sell your business, money is not the most important thing and what will make you happy in the long run is if your employees and customers get a good outcome from it.</code><br />\n<code>Write the text in the following voice:</code><br />\n<code>Direct</code><br />\n<code>Simple with no jargon</code><br />\n<code>Shorter sentences</code><br />\n<code>Personal</code><br />\n<code>Conversational</code><br />\n<code>In the tone of an advisor</code><br />\n<code>Colloquial</code><br />\n<code>Using the second person</code><br />\n<code>Using anecdotes and metaphors without trite phrases and without obvious ideas</code></p>\n<p>--------------------------------------------..........................--------------------------------------------</p>\n<p>I hope you guys found this post helpful. I run an AI tools directory called seekme.ai. I’ve listed over 13k AI tools there as well thousands of ChatGPT plugins that exists to make your prompting easier. Consider subscribing to my newsletter to get more of these tutorials and case studies on prompting. <a href=\"https://seekme.ai/subscribe/newsletter\">Subscribe here</a></p>",
            "date_published": "2024-05-09T19:10:20+00:00",
            "authors": [
                {
                    "name": "dinga_dong-",
                    "url": "https://www.reddit.com/user/dinga_dong-"
                }
            ]
        },
        {
            "id": "1cnu3os",
            "url": "/r/ArtificialInteligence/comments/1cnu3os/adult_entertainment_might_soon_replace_real/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cnu3os/adult_entertainment_might_soon_replace_real/",
            "title": "Adult Entertainment Might Soon Replace Real People With AI Stars - Are We Ready?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cnu3os/adult_entertainment_might_soon_replace_real/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cnu3os/adult_entertainment_might_soon_replace_real/'>Reddit</a></caption><div><br></div><p>The adult industry has a well-earned reputation for being an early adapter of new technologies, a tradition that stretches back to the printing press in the 15th century. This pioneering spirit continues today, with the industry experimenting with and integrating artificial intelligence (AI).</p>\n<p>Read the full story: https://www.ibtimes.co.uk/adult-entertainment-might-soon-replace-real-people-ai-stars-are-we-ready-1724598</p>",
            "date_published": "2024-05-09T10:38:31+00:00",
            "authors": [
                {
                    "name": "vinaylovestotravel",
                    "url": "https://www.reddit.com/user/vinaylovestotravel"
                }
            ]
        },
        {
            "id": "1cngt24",
            "url": "/r/ArtificialInteligence/comments/1cngt24/google_deepminds_new_ai_can_model_dna_rna_and_all/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cngt24/google_deepminds_new_ai_can_model_dna_rna_and_all/",
            "title": "Google DeepMind’s new AI can model DNA, RNA, and ‘all life’s molecules’",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cngt24/google_deepminds_new_ai_can_model_dna_rna_and_all/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cngt24/google_deepminds_new_ai_can_model_dna_rna_and_all/'>Reddit</a></caption><div><br></div><p>Google DeepMind is introducing an improved version of its AI model that predicts not just the structure of proteins but also the structure of “all life’s molecules.” The work from <a href=\"https://www.theverge.com/2024/5/8/24152088/google-deepmind-ai-model-predict-molecular-structure-alphafold\">the new model</a>, AlphaFold 3, will help researchers in medicine, agriculture, materials science, and drug development test potential discoveries.</p>\n<p>Want to stay ahead of the curve in AI and tech? <a href=\"https://smmry.tech/?utm_source=reddit\">take a look here</a>.</p>\n<p><strong>Key points:</strong></p>\n<ul>\n<li>AlphaFold 3, can predict the structure of all life's molecules, not just proteins, including DNA, RNA and smaller molecules. This is a significant improvement from previous versions.</li>\n<li>AlphaFold 3 uses a similar method to AI image generators to predict how different molecules fit together. This method is called diffusion.</li>\n<li>DeepMind is making AlphaFold 3 and the AlphaFold Server available to some researchers for free, with a focus on non-commercial uses. They are also working on responsible deployment of the model considering biosecurity risks.</li>\n</ul>\n<p><a href=\"https://www.theverge.com/2024/5/8/24152088/google-deepmind-ai-model-predict-molecular-structure-alphafold\">Source (The Verge)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-05-08T22:04:08+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1cmyr9n",
            "url": "/r/ArtificialInteligence/comments/1cmyr9n/turning_back_the_clock_genetic_engineers_rewire/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cmyr9n/turning_back_the_clock_genetic_engineers_rewire/",
            "title": "Turning Back The Clock: Genetic Engineers Rewire Cells For An 82% Increase In Lifespan",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cmyr9n/turning_back_the_clock_genetic_engineers_rewire/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cmyr9n/turning_back_the_clock_genetic_engineers_rewire/'>Reddit</a></caption><div><br></div><p>A team of University of California San Diego (UCSD) researchers has developed a biosynthetic genetic “clock” that significantly extends cellular lifespan.</p>\n<p>As described on April 27, 2023 in the journal <em>Science,</em> the researchers are using synthetic biology to engineer a solution that keeps cells from reaching their normal levels of deterioration associated with aging. Cells of yeast, plants, animals, and humans all contain gene regulatory circuits that are responsible for many physiological functions, including aging.</p>\n<p>Read more: <a href=\"https://magazine.mindplex.ai/mp_news/turning-back-the-clock-genetic-engineers-rewire-cells-for-an-82-increase-in-lifespan/\">https://magazine.mindplex.ai/mp_news/turning-back-the-clock-genetic-engineers-rewire-cells-for-an-82-increase-in-lifespan/</a> </p>",
            "date_published": "2024-05-08T07:30:37+00:00",
            "authors": [
                {
                    "name": "ChikyChikyBoom",
                    "url": "https://www.reddit.com/user/ChikyChikyBoom"
                }
            ]
        },
        {
            "id": "1cmivu5",
            "url": "/r/ArtificialInteligence/comments/1cmivu5/shooting_victims_are_calling_members_of_congress/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cmivu5/shooting_victims_are_calling_members_of_congress/",
            "title": "Shooting victims are ‘calling’ members of Congress. Is it OK to use AI to clone your child’s voice to deliver a political message?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cmivu5/shooting_victims_are_calling_members_of_congress/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cmivu5/shooting_victims_are_calling_members_of_congress/'>Reddit</a></caption><div><br></div><p>Full article: https://news.northeastern.edu/2024/03/22/ai-generated-voice-political-message/</p>\n<p>Members of Congress have received calls demanding that they pass stricter gun control laws. But these aren’t the typical kind of calls made by constituencies voicing their concerns. </p>\n<p>Through the use of artificial intelligence these calls are seemingly being made from the grave — by children who were killed as a direct result of gun violence.</p>\n<p>Is this effective? And is this even ethical?</p>",
            "date_published": "2024-05-07T18:28:26+00:00",
            "authors": [
                {
                    "name": "NGNResearch",
                    "url": "https://www.reddit.com/user/NGNResearch"
                }
            ]
        },
        {
            "id": "1clwkc8",
            "url": "/r/ArtificialInteligence/comments/1clwkc8/does_anyone_else_hate_how_much_llms_try_to_please/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1clwkc8/does_anyone_else_hate_how_much_llms_try_to_please/",
            "title": "Does anyone else hate how much LLMs try to please you and say you're right? Even when you're wrong?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1clwkc8/does_anyone_else_hate_how_much_llms_try_to_please/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1clwkc8/does_anyone_else_hate_how_much_llms_try_to_please/'>Reddit</a></caption><div><br></div><p>I recently strated running again</p>\n<p>I told it I did a run/walk routine for 24 mins, with intervals of 1 minute walking and 2 minutes running.</p>\n<p>It told me that's a great way to start improving your cardio, blah blah blah</p>\n<p>I then tested it again, and said I did a plan where I walked for 12 minutes and jogged for 30 seconds, and asked if that was enough to improve my cardio health (spoiler, it really isnt)</p>\n<p>It <strong>STILL</strong> said yes that's great for improving your cardio health</p>\n<p>Like bruh, just tell me no, thats not enough, you're wrong, etc </p>\n<p>I've seen this trend with basically anything. It will never straight out tell you you're wrong, or correct you</p>\n<p>Even worse it will never admit that it doesn't know the answer to something either</p>\n<p>Until this gets sorted out I feel like LLMs are not very useful tbh</p>",
            "date_published": "2024-05-06T22:49:13+00:00",
            "authors": [
                {
                    "name": "dabay7788",
                    "url": "https://www.reddit.com/user/dabay7788"
                }
            ]
        },
        {
            "id": "1clh0fv",
            "url": "/r/ArtificialInteligence/comments/1clh0fv/ive_created_a_polish_dubbing_for_fallout_4_using/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1clh0fv/ive_created_a_polish_dubbing_for_fallout_4_using/",
            "title": "I've created a Polish dubbing for Fallout 4 using AI.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1clh0fv/ive_created_a_polish_dubbing_for_fallout_4_using/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1clh0fv/ive_created_a_polish_dubbing_for_fallout_4_using/'>Reddit</a></caption><div><br></div><p>Hi.<br />\nRecently, I wanted to replay Fallout 4 and thought it's a shame we didn't get dubbing in my country. Then, I thought about Elevenlabs, and you know what? I did it!</p>\n<p>Here is the result: <a href=\"https://www.youtube.com/watch?v=pTnaw_mwCBo&amp;t=6s\">https://www.youtube.com/watch?v=pTnaw_mwCBo&amp;t=6s</a></p>\n<p>I had to create over 400 voices and generate 160,000 dialogues, but it's up and running, and people are loving it! I'm already planning to dub more games; the next one on the list is Fallout New Vegas.</p>\n<p>I understand that for the English-speaking community, this might not seem like a big deal, but for many Polish players, it's a game-changer. I'm aiming to release it to the public in 2 weeks.</p>",
            "date_published": "2024-05-06T11:46:20+00:00",
            "authors": [
                {
                    "name": "MateuszW93",
                    "url": "https://www.reddit.com/user/MateuszW93"
                }
            ]
        },
        {
            "id": "1ckyiak",
            "url": "/r/ArtificialInteligence/comments/1ckyiak/why_do_people_here_think_singularityabundance/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ckyiak/why_do_people_here_think_singularityabundance/",
            "title": "Why do people here think Singularity/\"Abundance\" would benefit the average person?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ckyiak/why_do_people_here_think_singularityabundance/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ckyiak/why_do_people_here_think_singularityabundance/'>Reddit</a></caption><div><br></div><p>I always read comments here and find them so naive</p>\n<p>Why do you think singularity or the supposed \"abundance\" that Sam \"corporate\" Altman throws around all the time would benefit the average person? It wouldnt</p>\n<p>You know why it wouldnt?</p>\n<p>Because abundance does not work with capitalism. It doesnt compute. And there is no way the western world is moving away from capitalism anytime soon.</p>",
            "date_published": "2024-05-05T18:57:25+00:00",
            "authors": [
                {
                    "name": "dabay7788",
                    "url": "https://www.reddit.com/user/dabay7788"
                }
            ]
        },
        {
            "id": "1cj7n9g",
            "url": "/r/ArtificialInteligence/comments/1cj7n9g/there_is_a_100_chance_the_new_randy_travis_song/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cj7n9g/there_is_a_100_chance_the_new_randy_travis_song/",
            "title": "There is a 100% chance the new Randy Travis song is AI",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cj7n9g/there_is_a_100_chance_the_new_randy_travis_song/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cj7n9g/there_is_a_100_chance_the_new_randy_travis_song/'>Reddit</a></caption><div><br></div><p>Hear me out. Randy Travis has a new song out. It sounds like prime Randy Travis. But, he had a stroke a few years back and has been working to recover. I wish the man the best, but fact is he is still off-bubble, as my dad would say. Even in all the promotional videos he just has a laughing face and nods his head. There is no way he got in a sound booth and started crooning out 1993 Randy Travis. It's an AI clone of himself! I don't hate the idea. Imagine Axl Rose releasing a hit song with his prime voice. AI voices as an expression of the artist, not just some yayhoo. Somehow that artist-AI connection lends it, paradoxically - authenticity.</p>\n<p>Edit:\nWe were right! Rolling Stone did an article. Fascinating!!!</p>",
            "date_published": "2024-05-03T12:38:04+00:00",
            "authors": [
                {
                    "name": "Overall-Importance54",
                    "url": "https://www.reddit.com/user/Overall-Importance54"
                }
            ]
        },
        {
            "id": "1ciaf12",
            "url": "/r/ArtificialInteligence/comments/1ciaf12/aigenerated_songs_rack_up_thousands_of_listens_on/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ciaf12/aigenerated_songs_rack_up_thousands_of_listens_on/",
            "title": "AI-generated songs rack up thousands of listens on Spotify",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ciaf12/aigenerated_songs_rack_up_thousands_of_listens_on/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ciaf12/aigenerated_songs_rack_up_thousands_of_listens_on/'>Reddit</a></caption><div><br></div><p>Text-to-audio generators like Suno and Udio have become more sophisticated\n. People are creating entire albums with AI and uploading them to Spotify\n. This means AI-generated music is directly competing with authentic work.</p>\n<p>Source: <a href=\"https://dailyai.com/2024/05/ai-generated-songs-rack-up-thousands-of-listens-on-spotify/\">https://dailyai.com/2024/05/ai-generated-songs-rack-up-thousands-of-listens-on-spotify/</a> </p>",
            "date_published": "2024-05-02T08:22:54+00:00",
            "authors": [
                {
                    "name": "UpvoteBeast",
                    "url": "https://www.reddit.com/user/UpvoteBeast"
                }
            ]
        },
        {
            "id": "1chw1nw",
            "url": "/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/",
            "title": "AI won't take your job, people who know how to use AI will!\n",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1chw1nw/ai_wont_take_your_job_people_who_know_how_to_use/'>Reddit</a></caption><div><br></div><p>Hey People,</p>\n<p>I've seen a lot of anxiety lately about AI taking over our jobs. But let's be real, AI isn't the enemy - it's a tool, and like any tool, it's only as good as the person wielding it.</p>\n<p>Think about it: content writers who know how to use AI-powered research tools and language generators can produce high-quality content faster and more efficiently than ever before. </p>\n<p>Web developers who can harness the power of machine learning can build websites that are more intuitive and user-friendly. And data analysts who can work with AI to identify patterns and trends can make predictions and decisions that were previously impossible.</p>\n<p>The point is, AI isn't here to replace us - it's here to augment us. It's here to make us faster, smarter, and more productive. So, instead of fearing the robots, let's learn how to work with them. Let's upskill and reskill, and become the masters of our own AI-powered destinies.</p>\n<p>Remember, it's not the AI that's going to take your job - it's the person who knows how to use AI to do your job better, faster, and cheaper.</p>",
            "date_published": "2024-05-01T20:15:53+00:00",
            "authors": [
                {
                    "name": "skrt_pls",
                    "url": "https://www.reddit.com/user/skrt_pls"
                }
            ]
        },
        {
            "id": "1chpfjy",
            "url": "/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/",
            "title": "Google urges US to update immigration rules to attract more AI talent",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1chpfjy/google_urges_us_to_update_immigration_rules_to/'>Reddit</a></caption><div><br></div><p>The US could lose out on valuable AI and tech talent if some of its immigration policies are not modernized, Google says in a <a href=\"https://www.theverge.com/2024/5/1/24146053/google-ai-talent-immigration-schedule-a\">letter sent to the Department of Labor</a>. The company says the government must update Schedule A to include AI and cybersecurity and do so more regularly.</p>\n<p>If you want to stay ahead of the latest AI developments, <a href=\"https://smmry.tech/?utm_source=reddit\">take a look here</a>!</p>\n<p><strong>The Problem:</strong> The US immigration system isn't suited for the fast-paced tech industry, particularly AI.</p>\n<ul>\n<li>Schedule A, a list of pre-approved occupations lacking US workers, is outdated (not updated in 20 years) and doesn't include AI or cybersecurity.</li>\n<li>The PERM process for green cards can be lengthy, causing some talented individuals to leave the US during the wait.</li>\n</ul>\n<p><strong>Google's Recommendations:</strong> The US needs to adapt its policies to compete for global AI talent.</p>\n<ul>\n<li>Update Schedule A to include AI and cybersecurity professions.</li>\n<li>Regularly review and update the list using various data sources, including public feedback.</li>\n<li>Streamline the PERM process or offer alternative pathways for attracting AI specialists.</li>\n</ul>\n<p><strong>The Urgency:</strong> The US risks falling behind in AI development.</p>\n<ul>\n<li>There's a global shortage of AI talent, and other countries are actively attracting them.</li>\n<li>US companies struggle to find qualified AI engineers and researchers domestically.</li>\n<li>Losing this talent pool could hinder US competitiveness in the AI race.</li>\n</ul>\n<p><a href=\"https://www.theverge.com/2024/5/1/24146053/google-ai-talent-immigration-schedule-a\">Source (The Verge)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">AI-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, Google, Meta</strong>…</p>",
            "date_published": "2024-05-01T15:47:47+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1ch89bb",
            "url": "/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/",
            "title": "Why don't we just let AI take over the world so we can sit back and relax? Explain to me like I'm 5.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ch89bb/why_dont_we_just_let_ai_take_over_the_world_so_we/'>Reddit</a></caption><div><br></div><p>So I know. This probably sounds like an INCREDIBLY stupid question. But I seriously want to know. Because I would love to just sit around and not have a care in the world for getting things done because AI does absolutely everything for me. Even to the point where I don't have to dress myself and robots dress me. And brush my teeth. And cook breakfast. And do everything in the universe so no human has to work.</p>",
            "date_published": "2024-05-01T00:15:38+00:00",
            "authors": [
                {
                    "name": "caranddogfan",
                    "url": "https://www.reddit.com/user/caranddogfan"
                }
            ]
        },
        {
            "id": "1cgw8vb",
            "url": "/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/",
            "title": "Which jobs won’t be replaced by AI in the next 10 years?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cgw8vb/which_jobs_wont_be_replaced_by_ai_in_the_next_10/'>Reddit</a></caption><div><br></div><p>Hey everyone, I’ve been thinking a lot about the future of jobs and AI. </p>\n<p>It seems like AI is taking over more and more, but I'm curious about which jobs you think will still be safe from AI in the next decade. </p>\n<p>Personally, I feel like roles that require deep human empathy, like therapists, social workers, or even teachers might not easily be replaced. </p>\n<p>These jobs depend so much on human connection and understanding nuanced emotions, something AI can't fully replicate yet. </p>\n<p>What do you all think? Are there certain jobs or fields where AI just won't cut it, even with all the advancements we're seeing? </p>",
            "date_published": "2024-04-30T15:53:01+00:00",
            "authors": [
                {
                    "name": "skrt_pls",
                    "url": "https://www.reddit.com/user/skrt_pls"
                }
            ]
        },
        {
            "id": "1cgnb8e",
            "url": "/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/",
            "title": "Cycls - A python framework for AI chatbot deployment",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cgnb8e/cycls_a_python_framework_for_ai_chatbot_deployment/'>Reddit</a></caption><div><br></div><p>Hello,</p>\n<p>We are excited to introduce Cycls, our new Python framework designed to streamline and simplify the deployment of AI applications. With Cycls, you can launch your chatbot with just a few lines of code, making it accessible via a public URL complete with a chat UI. This tool is perfect for developers looking to rapidly deploy and iterate on their AI projects, integrating seamlessly with popular Python libraries and APIs such as those provided by OpenAI.</p>\n<p>Having spent considerable time exploring LLMs and chatbots, we believe Cycls offers a transformative solution by significantly lowering the barriers to entry in this space. The framework not only facilitates the development process but also alleviates common headaches associated with continuous deployment and feature integration. </p>\n<p>We are currently inviting users to participate in our private beta. By joining the waitlist, you will gain early access to Cycls and can contribute to refining its features based on your specific needs and experiences. We are eager to hear your thoughts on what makes a framework useful and how Cycls can better serve the developer community.</p>\n<p>For those interested in joining the beta and helping shape the future of AI application deployment, please sign up here: <a href=\"https://cycls.typeform.com/waitlist/\">https://cycls.typeform.com/waitlist/</a> </p>\n<p>Thank you for your interest and enthusiasm. We look forward to your feedback. </p>",
            "date_published": "2024-04-30T07:55:22+00:00",
            "authors": [
                {
                    "name": "moonbunR",
                    "url": "https://www.reddit.com/user/moonbunR"
                }
            ]
        },
        {
            "id": "1ceaftk",
            "url": "/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/",
            "title": "What's the most practical thing you have done with ai?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ceaftk/whats_the_most_practical_thing_you_have_done_with/'>Reddit</a></caption><div><br></div><p>I'm curious to see what people have done with current ai tools that you would consider practical. Past the standard image generating and simple question answer prompts what have you done with ai that has been genuinely useful to you?</p>\n<p>Mine for example is creating a ui which let's you select a country, start year and end year aswell as an interval of months or years and when you hit send a series of prompts are sent to ollama asking it to provide a detailed description of what happened during that time period in that country, then saves all output to text files for me to read. Verry useful to find interesting history topics to learn more about and lookup.</p>",
            "date_published": "2024-04-27T09:25:42+00:00",
            "authors": [
                {
                    "name": "CodeCraftedCanvas",
                    "url": "https://www.reddit.com/user/CodeCraftedCanvas"
                }
            ]
        },
        {
            "id": "1cdupq0",
            "url": "/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/",
            "title": "Experience Building an AI-led Anonymous Knowledge Sharing Platform",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cdupq0/experience_building_an_ailed_anonymous_knowledge/'>Reddit</a></caption><div><br></div><p>This past weekend, I built <a href=\"https://yaknow.ai\">yaKnow.ai</a>, an anonymous knowledge-sharing platform facilitated by AI agents at a hackathon. You pick a topic and speak with an AI agent, which serves as an effective sounding board.</p>\n<p>I’ve been part of online communities but always felt something was missing. Too often, I find myself holding back from expressing my true thoughts or struggling to find the words to convey ideas. That’s why I built yaKnow.<br />\nWhen my friends and I tried it, we found it liberating to speak our minds. It felt great to express half-baked ideas safely and refine them with an AI.<br />\nInitially, I decided to focus on a limited number of topics (e.g., What’s the most overrated AI startup? What’s the best city for AI?). The initial conversations have been eye-opening.; Here are some snippets on the over-rated startup discussion.   </p>\n<p>On Perplexity </p>\n<blockquote>\n<p>They claim their tech will 'make Google dance,' which is a bold statement. But when I looked closer, their service seems to just mimic Google.</p>\n</blockquote>\n<p>&#x200B;</p>\n<blockquote>\n<p>I've been playing around with Perplexity lately, and I've got to say, it's a total game-changer. The way it handles search queries is just miles aheadof what Google is doing. I mean, don't get me wrong, Google is still the big dog in the search world, but I think they're going to start feeling the heat from startups like Perplexity.</p>\n</blockquote>\n<p>On Devin (Software Engineering Startup)</p>\n<blockquote>\n<p>Honestly, I'm not that impressed. It looks like they just slapped a new interface on top of existing AI models and called it a day.</p>\n</blockquote>\n<p>I’d like to invite you to try it out, no login is required and all contributions are anonymous. Here’s the link: <a href=\"https://yaknow.ai\">yaKnow.ai</a>  </p>\n<p>Perhaps, I will do an analysis of the new contributions and share the results in a few days. Can’t wait to hear what you all think about it</p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-26T19:50:10+00:00",
            "authors": [
                {
                    "name": "buckbuckyyy",
                    "url": "https://www.reddit.com/user/buckbuckyyy"
                }
            ]
        },
        {
            "id": "1ccwx35",
            "url": "/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/",
            "title": "AI can tell your political affiliation just by looking at your face",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1ccwx35/ai_can_tell_your_political_affiliation_just_by/'>Reddit</a></caption><div><br></div><p>A study recently published in the peer-reviewed American Psychologist journal claims that a combination of facial recognition and artificial intelligence technology can <a href=\"https://gizmodo.com/ai-can-tell-your-political-affiliation-just-by-looking-1851430714\">accurately assess a person’s political orientation</a> by simply looking at that person’s blank, expressionless face.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">take a look here</a>.</p>\n<p><strong>Key findings:</strong></p>\n<ul>\n<li>\n<p>A new study suggests AI with facial recognition can predict your political views based on a neutral face, even excluding age, gender, and ethnicity.</p>\n</li>\n<li>\n<p>Researchers identified potential physical differences between liberals (smaller lower faces) and conservatives (larger jaws), but emphasize complex algorithms, not just these features, drive the predictions.</p>\n</li>\n<li>The study raises concerns about AI being used to target political messaging and the potential for misuse of facial recognition technology.</li>\n<li>This research highlights the ability of AI to analyze physical characteristics and potentially link them to personal beliefs.</li>\n</ul>\n<p><a href=\"https://gizmodo.com/ai-can-tell-your-political-affiliation-just-by-looking-1851430714\">Source (Gizmodo)</a></p>\n<p>Link to study <a href=\"https://awspntest.apa.org/fulltext/2024-65164-001.html\">here</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-25T17:28:57+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1cc04x8",
            "url": "/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/",
            "title": "How AI already changed my life",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1cc04x8/how_ai_already_changed_my_life/'>Reddit</a></caption><div><br></div><p>I feel like most of the public is not at all aware what AI already can do. They just think like:\"Oh yea AI, you can make cute pics with it\" Or the youngsters using it to swap out faces of people. </p>\n<p>But most people do not realize it can already improve your life in a big way. All you gotta do is ... ask AI :P </p>\n<p>So to further explain what it actually did for me you need to know a lil bit of my background first. So I am kinda a guy which in RPG would you call a jack of all traits in the field of IT but master of none. </p>\n<p>I cannot code or program anything, but I have enough knowledge to make use of Wordpress to start a website. If there were problems with the code in my wordpress or when I messed something up I was kinda screwed. I remember it taking weeks for me to repair kinda simple problems, or sometimes it was just above my capability, I had not enough knowledge to fix it. I even remember paying a guy at Fiverr to fix some programming problem. </p>\n<p>I was also a very basic linux users, just barely able to install it, not using custom partitions since I had no clue how. I have had multiple instances where something in linux broke, which I could not fix and ended up reinstalling the entire system again, wasting a lot of time. These are even things like black screen caused by nvidia driver issues, which is easily fixed if you know how. </p>\n<p><strong>Ok that was then. So lets go ahead and see what my capabilities are now shall we ;)</strong> </p>\n<p>So with the help of AI I have fixed complex issues on my linux system. And by doing a lot of commands in terminals, even though I just copied stuff from the AI, it also learned me a lot of commands. I can now perform a lot of commands in terminals I couldnt before. </p>\n<p>That was just the beginning though ;) Once I understood how powerful AI can really be, I tried to seek its and mine limits of what I was now able to do. </p>\n<p>Where I at first had trouble installing a new OS like linux, I now have a triple boot system with full disk encryption (because its cool) :P running windows, and 2 different linux distros. All with a custom made Grub launcher with a cool theme. </p>\n<p>I still cannot program really as I do not know any programming language, but I was able to create several programs with the help of AI! I never thought this to be possible, me creating my own programs. It was still not easy, since I did not even know where to begin, but AI told me all I needed to know. Practical things like which program do I use to type the code in? How do I save the file?</p>\n<p>I even tried making my own videogame which I think I could do, but I need to learn a lot more to do that. Since I will also need to learn something like stable diffusion to generate visual content for that game. This is more something for the long run though, I feel I need to learn more first. </p>\n<p>The AI makes me feel so confident now to tackle all IT problems facing me. Although I do admit I do not always know what I am doing exactly. </p>\n<p>I just feel it opened up a whole new world for me. Its so cool I can now create entire programs, like right now I am editing a GUI in Qt designer. I never even knew this existed, but AI told me about it and now im using it. </p>\n<p>Another thing I find cool about AI is that rarely sells me a:\"No we cant do that\". It does not really matter how complex my question is, it always knows of a way to do something. </p>\n<p>Btw this is pretty much all done with chatGPT 3.5 free version. I dont even know how good it can really be.  </p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-24T14:49:41+00:00",
            "authors": [
                {
                    "name": "Anakhsunamon",
                    "url": "https://www.reddit.com/user/Anakhsunamon"
                }
            ]
        },
        {
            "id": "1c87j6c",
            "url": "/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/",
            "title": "DARPA’s AI test pilot successfully flew a dogfight against a human",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c87j6c/darpas_ai_test_pilot_successfully_flew_a_dogfight/'>Reddit</a></caption><div><br></div><p>An <a href=\"https://arstechnica.com/cars/2024/04/darpas-ai-test-pilot-successfully-flew-a-dogfight-against-a-human/\">AI test pilot has successfully flown a jet fighter</a> in dogfights against human opponents. It's the latest development for DARPA's Air Combat Evaluation program, which is trying to develop aerospace AI agents that can be trusted to perform safely.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">look here first</a>.</p>\n<p><strong>Key points:</strong></p>\n<ul>\n<li>DARPA's Air Combat Evaluation program successfully tested an AI pilot in dogfights against human opponents using an F-16 simulator aircraft.</li>\n<li>The X-62A VISTA, a modified F-16, was used for the tests due to its ability to simulate various flight characteristics.</li>\n<li>The agency instead wants a machine-learning agent that can safely fly a real aircraft autonomously, with no violations of training rules.</li>\n</ul>\n<p><a href=\"https://arstechnica.com/cars/2024/04/darpas-ai-test-pilot-successfully-flew-a-dogfight-against-a-human/\">Source (Ars Technica)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media sources. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-19T20:49:23+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1c773qf",
            "url": "/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/",
            "title": "Will AI kill off social media?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c773qf/will_ai_kill_off_social_media/'>Reddit</a></caption><div><br></div><p>At some point the amount of AI generated content will surpass human generated content.  It may have already.  Is that a good or bad thing?  If everything is fake, what’s the point of watching?  Will it kill off the influencers and go back to just being a way to communicate with friends?  The social media bubble has been expanding hugely for the last decade.  Will this pop it?</p>",
            "date_published": "2024-04-18T16:05:50+00:00",
            "authors": [
                {
                    "name": "ConclusionDifficult",
                    "url": "https://www.reddit.com/user/ConclusionDifficult"
                }
            ]
        },
        {
            "id": "1c64m8c",
            "url": "/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/",
            "title": "Tech exec predicts ‘AI girlfriends’ will create $1B business: ‘Comfort at the end of the day’",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c64m8c/tech_exec_predicts_ai_girlfriends_will_create_1b/'>Reddit</a></caption><div><br></div><p>Source: <a href=\"https://www.yahoo.com/tech/tech-exec-predicts-ai-girlfriends-181938674.html\">https://www.yahoo.com/tech/tech-exec-predicts-ai-girlfriends-181938674.html</a></p>\n<p>Key Points:</p>\n<p>1) <strong>AI Companions as a Billion-Dollar Industry</strong>: Greg Isenberg predicts the growth of AI relationship platforms into a billion-dollar market, akin to Match Group's success.</p>\n<p>2) <strong>Personal Testimony</strong>: A young man in Miami spends $10,000/month on AI girlfriends, enjoying the ability to interact with AI through voice notes and personal customization.</p>\n<p>3) <strong>AI Interaction as a Hobby</strong>: The man likes interacting with AI companions to playing video games, indicating a casual approach to digital relationships.</p>\n<p>4) <strong>Multiple Platforms</strong>: The individual uses multiple AI companion websites offer immersive and personalized chat experiences.</p>\n<p>5) <strong>Features of AI Companions</strong>: These platforms allow users to customize AI characters' likes and dislikes, providing a sense of comfort and companionship.</p>\n<p>6) <strong>Market Reaction and User Engagement</strong>: Platforms such as Replika, Romantic AI, and Forever Companion offer varied experiences from creating ideal partners to engaging in erotic roleplay.</p>\n<p>7) <strong>Survey Insights</strong>: A survey reveals that many Americans interact with AI chatbots out of curiosity, loneliness, or without realizing they are not human, with some interactions leaning towards eroticism.</p>\n<p>&#x200B;</p>",
            "date_published": "2024-04-17T08:26:55+00:00",
            "authors": [
                {
                    "name": "BiggerGeorge",
                    "url": "https://www.reddit.com/user/BiggerGeorge"
                }
            ]
        },
        {
            "id": "1c5l5i7",
            "url": "/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/",
            "title": "Claude 3 may have saved my life",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c5l5i7/claude_3_may_have_saved_my_life/'>Reddit</a></caption><div><br></div><p>For the last 2 years I've had heart problems brought on by excessively poor sleep.  If I got a terrible night (or week) of sleep, my heartbeat would be irregular and fast.  </p>\n<p>I told this to the PA at my doctor's office, and they looked at me like I had 3 heads.  I got slapped with an anxiety disorder, as they were convinced I was imagining the correlation.  When I (anxiously) tried to get them to come up with another explanation, I got prescribed SSRI's for the anxiety.  </p>\n<p>I was talking with Claude 3 about it, and poor sleep over a long period can cause poor insult sensitivity.  Which can cause low blood sugar.  Which (you guessed it) can cause fast/irregular heartbeat.  This also explains 3 other medical conditions that I have (Non-alcoholic fatty liver, high buildup of plaque on my arteries, extreme difficulty in losing weight).  </p>\n<p>Knowing that my heart issues are from low blood sugar is a game changer in trying to loose weight.  For both diet and exercise.  Claude 3 very legitimately has saved my life, where traditional medicine has failed.</p>",
            "date_published": "2024-04-16T16:57:34+00:00",
            "authors": [
                {
                    "name": "Mackntish",
                    "url": "https://www.reddit.com/user/Mackntish"
                }
            ]
        },
        {
            "id": "1c4lzqk",
            "url": "/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/",
            "title": "Claude is now miles ahead of chatgpt. The free version of claude is giving much better answers than chatgpt 4 Pro version",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c4lzqk/claude_is_now_miles_ahead_of_chatgpt_the_free/'>Reddit</a></caption><div><br></div><p>Telling this as chatgpt pro subscriber since the beginning. Have finally cancelled it. Chatgpt image quality is also years behind mid journey</p>",
            "date_published": "2024-04-15T13:17:48+00:00",
            "authors": [
                {
                    "name": "Southern_Opposite747",
                    "url": "https://www.reddit.com/user/Southern_Opposite747"
                }
            ]
        },
        {
            "id": "1c3wb3x",
            "url": "/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/",
            "title": "AI outperforms humans in providing emotional support",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c3wb3x/ai_outperforms_humans_in_providing_emotional/'>Reddit</a></caption><div><br></div><p>A new study suggests that <a href=\"https://www.earth.com/news/ai-outperforms-humans-providing-emotional-support/\">AI could be useful in providing emotional support</a>. AI excels at picking up on emotional cues in text and responding in a way that validates the person's feelings. This can be helpful because AI doesn't get distracted or have its own biases.</p>\n<p>If you want to stay ahead of the curve in AI and tech, <a href=\"https://smmry.tech/?utm_source=reddit\">look here first</a>.</p>\n<p><strong>Key findings:</strong></p>\n<ul>\n<li>AI can analyze text to understand emotions and respond in a way that validates the person's feelings. This is because AI can focus completely on the conversation and lacks human biases.</li>\n<li>Unlike humans who might jump to solutions, AI can focus on simply validating the person's emotions. This can create a safe space where the person feels heard and understood</li>\n<li>There's a psychological hurdle where people feel less understood if they learn the supportive message came from AI. This is similar to the uncanny valley effect in robotics.</li>\n<li>Despite the \"uncanny valley\" effect, the study suggests AI has potential as a tool to help people feel understood. AI could provide accessible and affordable emotional support, especially for those lacking social resources.</li>\n</ul>\n<p><a href=\"https://www.earth.com/news/ai-outperforms-humans-providing-emotional-support/\">Source (Earth.com)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, you’ll love my <a href=\"https://smmry.tech/?utm_source=reddit\">ML-powered newsletter</a> that summarizes the best AI/tech news from 50+ media. It’s already being read by <strong>hundreds of professionals</strong> from <strong>OpenAI, HuggingFace, Apple</strong>…</p>",
            "date_published": "2024-04-14T15:34:16+00:00",
            "authors": [
                {
                    "name": "Rare_Adhesiveness518",
                    "url": "https://www.reddit.com/user/Rare_Adhesiveness518"
                }
            ]
        },
        {
            "id": "1c3pqk6",
            "url": "/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/",
            "title": "We live in unbelievable era, i built an android app, and i’ve never coded.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c3pqk6/we_live_in_unbelievable_era_i_built_an_android/'>Reddit</a></caption><div><br></div><p>We live in unbelievable era, i built an android app, and i’ve never coded</p>\n<p>I can’t believe this is actually real and working\nIn a span of 5 days, from never writing and running a code in my life, to build a functional android app that does a very good job\nAnd when prompted, it made the app look very good too</p>\n<p>HOW IS THIS REAL!!!</p>\n<p>By the way i used claude opus</p>\n<p>And It’s a simple app that solves a huge problem on my business</p>\n<p>So i have a tailor store, any piece that we tailor goes through 5 steps before it’s given to the customer And when we have a lot of orders there are pieces that take longer than expected, and sometimes we don’t know where a piece exactly is and on what step</p>\n<p>We have a solution to have the receipt number as barcode on every piece, and if it passes any step we need to scan the barcode indicating that it’s done from that step</p>\n<p>We are running low on budget so instead of having 5 computers on every step that will be connected with barcode scanners, i thought about making an android app ( since you can get cheep android phones ) and have one on every step</p>\n<p>And the app simply, first you choose on what step you are at, then read the barcodes, then submit</p>\n<p>After that the info will be written in a google spreadsheet, and in that, we track how long a piece took from going on one step to another And know exactly where every piece is And where is the bottlenecks and how to optimize making as many pieces as we can</p>",
            "date_published": "2024-04-14T09:39:14+00:00",
            "authors": [
                {
                    "name": "bhk0_",
                    "url": "https://www.reddit.com/user/bhk0_"
                }
            ]
        },
        {
            "id": "1c22oli",
            "url": "/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/",
            "title": "The future of AI will run on Amazon, company CEO says",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c22oli/the_future_of_ai_will_run_on_amazon_company_ceo/'>Reddit</a></caption><div><br></div><p>Less than two weeks after rolling back one of Amazon’s most ambitious artificial intelligence projects — a cashierless checkout technology called Just Walk Out — CEO Andy Jassy expressed confidence that the future of the company’s biggest breakthroughs for customers will come from generative AI.  </p>\n<p>Jassy said in an annual shareholder letter published Thursday that he is “optimistic that much of this world-changing AI will be built on top of AWS,” or Amazon Web Services, the company’s cloud computing business that many of the world’s digital businesses already rely on to run.  </p>\n<p>He elucidated the company’s strategy on generative AI, describing how it is focused less on building consumer-facing applications to compete directly with popular tools like OpenAI’s ChatGPT than on building the underlying “foundational” AI models and selling them to enterprise customers, which Jassy said already include Delta Air Lines, Siemens and Pfizer.   </p>\n<p>Seeing what they've done with AWS, I don't think this is far-fetched. They tried the cashier-less tech (consumer-facing) and it didn't work out, and they've made the decision to stick to one of their core competences: enterprise software. Will be interesting to see this, long-term.  </p>\n<p>https://www.washingtonpost.com/technology/2024/04/11/amazon-ai/</p>",
            "date_published": "2024-04-12T07:01:00+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1c0igy9",
            "url": "/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/",
            "title": "Any AI chatbot recommendation? (Updated list)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1c0igy9/any_ai_chatbot_recommendation_updated_list/'>Reddit</a></caption><div><br></div><p>(<strong>Updated in 04/10 2024)</strong></p>\n<p><strong>For the convenience of my friends, I made a name list below, refer the post from</strong> r/chatbots<strong>. If you want to add more to the list. Please leave a comment:</strong></p>\n<p><strong>SoulFun:</strong> Free trial, great quality of LLM, 20+ lifelike pre-trained and well-designed characters (including female/male/anime). Free for NSFW chat. Need payment for NSFW images. 3000\\~4000 words of memory.</p>\n<p><strong>Faraday.dev:</strong> Uncensored local models with immersive text adventures</p>\n<p><strong>Poly.a</strong>i: With careful character predevelopment you can get a decent memory/chat going</p>\n<p><strong>Avatar.One:</strong> Fully 3D AI chatbot where you get video and image selfies. Its automated so you can trigger emotes in the chat itself</p>\n<p><strong>Erogen</strong>: Beautiful interface with nice nsfw chatbots</p>\n<p><strong>fams.ai</strong>: Decent chat, memory, pics. What I dont like - free content limited</p>\n<p><strong>Kindroid</strong>: Unfiltered, good memory. Selfies, phone calls, you can send pics of yourself (Paid). Good consutomer serive. <strong>Cons</strong>:</p>\n<p><strong>rosytalkai:</strong>  unique LLM offers chatting experience/picture generation/voice calls/Free trials</p>\n<p><strong>Chub Venus</strong>: <strong>Pros</strong>: Long and detailed contexts. Lots of attractive characters. <strong>Cons</strong>: It's hard to set up the API Key.</p>\n<p><strong>Poe ai:</strong> Using AI model from Claude or GPT, but need to learn how to jailbreak to access NSFW contents. Free messages every day. Very good memory and smart chatbots</p>\n<p>PlayMe App: Multiple AI models, most of them are safe for work. Free messages and voices, and pics. Fun conversations, especially for some niches.</p>\n<p><strong>Sakura FM: Prons:</strong> Unlimited free messages. Multiple AI models. Message edition and continue generation. Decent memory. <strong>Needs</strong>: Better content consistency. Less repetition. More actions or dialogue. More personalities.</p>\n<p><strong>nsfwcharacterai.com: Pros:</strong> 50 free messages daily/Detailed chat/unlimited contents/regeneration doesn’t cost your count/easy registration. <strong>Cons</strong>: Bots can be glitchy at times/Sometimes the bot will lead write the story for you/the filter sometimes works very well.</p>\n<p><strong>messengerx.io:</strong> <strong>Pros</strong>: Good SFW/NSFW image generations/Good characters and memory/You can earn money with your own character. <strong>Cons</strong>: Needs better UI.</p>\n<p><strong>RoChat</strong>: Using GPT4 and Claude 3, plus a pretty robust character creator.</p>\n<p><strong>Digi:</strong> 3D animation, it looks great. Not sure whether they have NSFW. They have a very nice Discord community.</p>\n<p><strong>Janitor</strong>: Free to use, massive number of Characters. No generated images. 6000 words of memory.</p>\n<p><strong>MySentientAI</strong>: Collaborating with real streamers (such as Amouranth) and making AI copies of them</p>\n<p><strong>AIdungeon</strong>: A text-based adventure-story game.</p>\n<p><strong>GetIdol.com:</strong> Realistic characters personalities</p>\n<p><strong>Chai ai:</strong> 70 Free messages/3 hours, no queue, good responses</p>\n<p><strong>easyerp ai</strong>: 60+tags of characters</p>\n<p><strong>Cutechat.ai:</strong> Looks like a real chat platform</p>\n<p><strong>Yodayo</strong>: Great for hentai fans to chat with anime characters</p>\n<p><strong>Chai</strong>: It seems like only supports mobile phone apps</p>\n<p><strong>Haven chat</strong>: Characters have strong personalities</p>\n<p><strong>FantasyGF</strong>: Realistic NSFW AI girlfriend platforms</p>\n<p><strong>Juicy AI</strong>: 7000+ characters. Long and descriptive contents</p>\n<p><strong>Dopple.ai</strong>: Another Free NSFW AI chatbots</p>\n<p><strong>Gptgirlfriend:</strong> 25 000+ NSFW Characters including anime and realistic ones</p>\n<p><strong>Nextpart.ai</strong>: Supports voice chat, scene generation, and crypto payments</p>\n<p><strong>Privee AI</strong>: Different models available 70b to gpt4. Images Generation. Simple and advanced creation mode.</p>\n<p><strong>SpicyChat</strong> : Free, but need to queue. You can pay to skip the queue. No generated images. Around 2000 words of memory</p>\n<p><strong>CandyAI</strong> : Good quality NSFW photos but you need to pay. Average level of chat.</p>\n<p><strong>MuahAI</strong> : Text+Image+phone call (US number only). Free for chatting, payment for image and phone calls</p>",
            "date_published": "2024-04-10T10:38:34+00:00",
            "authors": [
                {
                    "name": "goki7",
                    "url": "https://www.reddit.com/user/goki7"
                }
            ]
        },
        {
            "id": "1bztsl6",
            "url": "/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/",
            "title": "People coming up with safe words for AI",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bztsl6/people_coming_up_with_safe_words_for_ai/'>Reddit</a></caption><div><br></div><p>Saw a post earlier of a family coming up with a safe word in case the person they’re talking to on the phone has the voice of a family member but sounds sketchy. </p>",
            "date_published": "2024-04-09T14:38:49+00:00",
            "authors": [
                {
                    "name": "AcceptableAd7478",
                    "url": "https://www.reddit.com/user/AcceptableAd7478"
                }
            ]
        },
        {
            "id": "1bqv9nv",
            "url": "/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/",
            "title": "Microsoft and OpenAI planning $100 billion data center project, the Information reports",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bqv9nv/microsoft_and_openai_planning_100_billion_data/'>Reddit</a></caption><div><br></div><p>https://www.reuters.com/technology/microsoft-openai-planning-100-billion-data-center-project-information-reports-2024-03-29/</p>",
            "date_published": "2024-03-29T17:40:52+00:00",
            "authors": [
                {
                    "name": "BilgeYamtar",
                    "url": "https://www.reddit.com/user/BilgeYamtar"
                }
            ]
        },
        {
            "id": "1bqjrjo",
            "url": "/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/",
            "title": "Women’s faces stolen for AI ads selling ED pills and praising Putin",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bqjrjo/womens_faces_stolen_for_ai_ads_selling_ed_pills/'>Reddit</a></caption><div><br></div><p>A 27-year old content creator was the victim of deepfake, where one of her videos was manipulated to make it look as if she was selling ED pills. This is the latest in a series of AI-related identity theft incidents, a trend that has been on the rise, affecting everyday people, and some celebrities, like Elon Musk, Taylor Swift, and MrBeast.</p>\n<p>https://www.washingtonpost.com/technology/2024/03/28/ai-women-clone-ads/</p>",
            "date_published": "2024-03-29T08:03:17+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1bpfx56",
            "url": "/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/",
            "title": "Sora in 10 years. The possibilities are endless and Hollywood is fucked.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bpfx56/sora_in_10_years_the_possibilities_are_endless/'>Reddit</a></caption><div><br></div><p>Imagine this: </p>\n<p>You want to create a photorealistic feature length movie in your living room on a rainy weekend, so you open up Sora or one of its many competitors and create a cast with their own highly unique physical and personality traits. you give each of them a script and can single out to edit individual scenes, writing; \"I want Joe to have a slightly more puzzled look on his face as Jessica speaks to him. I also want a touch of anger to be in her voice.\"</p>\n<p>No destination or set piece is out of reach nor constrained by budget. Each 'actor' and their performance can be modified to the most minute detail. The possibilities are endless and Hollywood is fucked.</p>",
            "date_published": "2024-03-27T23:03:16+00:00",
            "authors": [
                {
                    "name": "CH4LOX2",
                    "url": "https://www.reddit.com/user/CH4LOX2"
                }
            ]
        },
        {
            "id": "1bp74ea",
            "url": "/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/",
            "title": "Amazon spends $2.75 billion on AI startup Anthropic in its largest venture investment yet",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bp74ea/amazon_spends_275_billion_on_ai_startup_anthropic/'>Reddit</a></caption><div><br></div><p>https://www.cnbc.com/amp/2024/03/27/amazon-spends-2point7b-on-startup-anthropic-in-largest-venture-investment.html</p>",
            "date_published": "2024-03-27T17:08:40+00:00",
            "authors": [
                {
                    "name": "BilgeYamtar",
                    "url": "https://www.reddit.com/user/BilgeYamtar"
                }
            ]
        },
        {
            "id": "1boxdra",
            "url": "/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/",
            "title": "Meta CEO, Mark Zuckerberg, is directly recruiting AI talent from Google's DeepMind with personalised emails.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1boxdra/meta_ceo_mark_zuckerberg_is_directly_recruiting/'>Reddit</a></caption><div><br></div><p>Meta CEO, Mark Zuckerberg, is attempting to recruit top AI talent from Google's DeepMind (their AI research unit). Personalised emails, from Zuckerberg himself, have been sent to a few of their top researchers, according to a report from The Information, which cited individuals that had seen the messages. In addition to this, the researchers are being hired without having to do any interviews, and, a previous policy which Meta had in place - to not offer higher offers to candidates with competing job offers - has been relaxed.  </p>\n<p>Zuckerberg appears to be on a hiring spree to build Meta into a position of being a dominant player in the AI space.<br />\nhttps://www.businessinsider.com/mark-zuckerberg-recruiting-google-ai-talent-with-personal-emails-2024-3</p>",
            "date_published": "2024-03-27T09:04:51+00:00",
            "authors": [
                {
                    "name": "ELVTR_Official",
                    "url": "https://www.reddit.com/user/ELVTR_Official"
                }
            ]
        },
        {
            "id": "1bnl4oc",
            "url": "/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/",
            "title": "Chatbots more likely to change your mind than another human, study says",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bnl4oc/chatbots_more_likely_to_change_your_mind_than/'>Reddit</a></caption><div><br></div><p><strong>New research indicates that personalized chatbots, like those based on GPT-4, are more effective at persuading people in debates than humans are</strong>, particularly when they utilize personal information about their debate opponents.</p>\n<p><strong>Quick recap:</strong></p>\n<ul>\n<li>Personalized chatbots using GPT-4 technology demonstrated an <strong>81.7% increase</strong> in persuading participants to agree with their viewpoints compared to human debaters.</li>\n<li>The study highlighted the <strong>effectiveness</strong> of chatbots in using basic personal information (such as age, gender, and race) to craft <strong>tailored arguments</strong> that resonate more deeply with individuals.</li>\n<li>There's a potential risk of malicious use of detailed digital profiles, including social media activities and purchasing behaviors, to enhance chatbots' persuasive capabilities.</li>\n<li>Researchers suggest online platforms should employ AI-driven systems to present fact-based counterarguments against misinformation, addressing the challenges posed by persuasive AI in sensitive contexts.</li>\n</ul>\n<p><a href=\"https://the-decoder.com/a-personalized-chatbot-is-more-likely-to-change-your-mind-than-another-human-study-finds/\">Source (The Decoder)</a></p>\n<p><strong>PS: If you enjoyed this post</strong>, <a href=\"http://techpresso.xyz/\">you’ll love my newsletter</a>. It’s already being read by 90,000+ professionals from OpenAI, Google, Meta…</p>",
            "date_published": "2024-03-25T18:35:18+00:00",
            "authors": [
                {
                    "name": "Nalix01",
                    "url": "https://www.reddit.com/user/Nalix01"
                }
            ]
        },
        {
            "id": "1bnaald",
            "url": "/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/",
            "title": "As Inflection absorbs Microsoft, the PayPal Mafia quietly make a bet on their own AI.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bnaald/as_inflection_absorbs_microsoft_the_paypal_mafia/'>Reddit</a></caption><div><br></div><p>Last week, it was announced Microsoft took most of Inflection's employees in a $650M deal;  essentially leading to a further concentration of power in AI in the hands of Microsoft. So now Microsoft owns not just 49% of OpenAI but has now absorbed another major AI lab.</p>\n<p>Of course there's still Mistal, Anthropic, and Google - but I think one thing that's gone under the radar that came out in the past few weeks was the announcement of <a href=\"https://Mindy.com\"><strong>Mindy</strong></a>. Which was started by Yu Pan, a of the Cofounder and of PayPal and also was also employee #1 at YouTube. They're also backed by Roelof Botha (former CFO of PayPal) and Peter Thiel (former CEO of PayPal). The concept of their AI is that it's entirely email based and is aiming to be a competitor to google in the sense that it's indexed the entire Internet and can perform real time internet scrapes on any site (whether it's Ebay, LinkedIn, etc.).</p>\n<p>Since the inflection news, I've been seeing this notion that Microsoft has <strong><em>completely</em></strong> won the AI race but I don't think it's entirely accurate at all. There's obviously all the aforementioned labs, but I believe there are still numerous innovate AI labs like Mindy and many more that will emerge over the coming year that will threaten incumbents because they take fundamentally different product approaches and research approaches towards AGI. Curious what people think.</p>\n<p><strong>Edit:</strong> Yes I know I messed up the title. I meant to say made...</p>",
            "date_published": "2024-03-25T10:27:17+00:00",
            "authors": [
                {
                    "name": "shamefulgallantry10",
                    "url": "https://www.reddit.com/user/shamefulgallantry10"
                }
            ]
        },
        {
            "id": "1bm669a",
            "url": "/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/",
            "title": "It's a bit demented that AI is replacing all the jobs people said could not be replaced first. ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bm669a/its_a_bit_demented_that_ai_is_replacing_all_the/'>Reddit</a></caption><div><br></div><p>Remember when people said healthcare jobs were safe? Well nvidia announced a new AI agent that supposedly can outperform nurses and costs only $9 per hour. </p>\n<p>Whether this is actually possible or not to replace nurses with AI is a bit uncertain, but I do think it's a little bit demented that companies are trying to replace all the jobs people said could not be replaced, first. Like artist and nurse, these are the FIRST jobs to go. People said they would never get replaced and it requires a human being. They even said all kinds of BS like \"AI will give people more time to do creative work like art\". That is really disengenuous, but we already know it's not true. The exact opposite thing is happening with AI.</p>\n<p>On the other hand, all the petty/tedious jobs like warehouse and factory jobs and robotic white collar jobs are here for the foreseeable future. People also said that AI was going to be used only to automate the boring stuff. </p>\n<p>So everything that's happening with AI is the exact demented opposite of what people said. The exact worse thing is happening. And it's going to continue like this, this trend is probably only get worse and worse. </p>",
            "date_published": "2024-03-23T23:24:30+00:00",
            "authors": [
                {
                    "name": "EuphoricPangolin7615",
                    "url": "https://www.reddit.com/user/EuphoricPangolin7615"
                }
            ]
        },
        {
            "id": "1bl7s2o",
            "url": "/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/",
            "title": "I watched Sam Altman’s most recent 2-hour interview at Lex Fridman - here are the key takeaways we all should know",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bl7s2o/i_watched_sam_altmans_most_recent_2hour_interview/'>Reddit</a></caption><div><br></div><p>Sam was interviewed at the Lex Fridman podcast this week. It’s a long interview so I thought to share the 10 key takeaways I noted down from listening to the guy. You can be for him or against him - but you can’t deny he’s one of the most important people central to the forthcoming AI normal! Hope this is insightful for people who are interested :)  </p>\n<p><strong><em>1. People who create valuable data deserve some way to be compensated for the use of it 💸</em></strong></p>\n<p>The remaining question is the economic model that will enable it. A good analogy is the transition from CDs to Napster to Spotify for music. Or the transition from Movies to YouTube for video. Is there a similar economic model in the future for data?</p>\n<p>⏳ 40:16</p>\n<p><strong><em>2.</em></strong> <strong><em>Bill Gates couldn’t imagine that we’d someday need gigabytes of memory in a computer 💾</em></strong></p>\n<p>In the same way, we can’t imagine today how or why LLMs would need billions in context length, but it may still happen. (for context: an LLM with a 1-billion context length means it can process and understand \\~2 million document pages for <em>every</em> query)</p>\n<p>⏳ 51:13</p>\n<ol>\n<li><strong><em>“I want to give ChatGPT the ability to retain memories” 📝</em></strong></li>\n</ol>\n<p>Imagine a model that gets to know you and gets more useful to you over time. This may well be a use-case for the billion-context length LLM highlighted above.</p>\n<p>⏳ 55:33</p>\n<ol>\n<li><strong><em>Compute will be the currency of the future. 💲</em></strong></li>\n</ol>\n<p>And Sam believes it will be the most precious commodity in the world.</p>\n<p>⏳ 1:09:55</p>\n<ol>\n<li><strong><em>The “energy problem” will be answered by nuclear fusion ⚛</em></strong></li>\n</ol>\n<p>With the vast amount of compute that the world will demand in the future, we will need tons of energy to power everything. Sam believes nuclear fusion is the best way to address this problem.</p>\n<p>⏳ 1:11:29</p>\n<ol>\n<li><strong><em>Q-star likely exists (but we won’t talk about that) ⭐</em></strong></li>\n</ol>\n<p>Lex of course asked about Q-star, but Sam didn’t deny its existence - and just said “we are not ready to talk about that”.</p>\n<p>⏳ 1:02:36</p>\n<ol>\n<li><strong><em>Programmers won’t be obsolete 👩🏻‍💻</em></strong></li>\n</ol>\n<p>but it will likely be different to how programming is now. And anyway, Sam argues that no one really does pure coding - as most programmers use pre-existing packages/technologies/software. Leveraging an LLM to assist with coding is similar in that way.</p>\n<p>⏳ 1:29:50</p>\n<ol>\n<li><strong><em>Overtaking Google is boring 🔍</em></strong></li>\n</ol>\n<p>OpenAI doesn’t want to make a better search engine; and thinking in this way understates what their work in AI can be.</p>\n<p>⏳ 1:17:37</p>\n<ol>\n<li><strong><em>“There will be no ads in ChatGPT!” (preferrably) 🚩</em></strong></li>\n</ol>\n<p>Sam has a bias against ads - which is why currently ChatGPT’s business model is via paid premium. In a way I find this reassuring - because the moment you introduce ads, your “true customer” now becomes the advertiser, instead of the actual user (who now becomes the product.)</p>\n<p>⏳ 1:20:15</p>\n<ol>\n<li><strong><em>Let’s not talk about AGI anymore (let’s call it something else) 🧠</em></strong></li>\n</ol>\n<p>People have different definitions of what AGI is, so Sam advocates for talking more about the specific capabilities rather than AGI as a general term. To his definition though, AGI is a system that can advance scientific discovery without human intervention.</p>\n<p>⏳ 1:32:33</p>\n<p>--  </p>\n<p>If this has been a tad bit insightful, I hope you can check out <a href=\"https://robonuggets.beehiiv.com/\">RoboNuggets</a> where I originally shared this and other AI-related practical knowledge! My goal is not \"AI daily news\" (as there's already too many of those), but instead share useful insights/knowledge for everyone to take full advantage of the new AI normal :) Cheers!</p>",
            "date_published": "2024-03-22T19:28:00+00:00",
            "authors": [
                {
                    "name": "SwimIndependent6688",
                    "url": "https://www.reddit.com/user/SwimIndependent6688"
                }
            ]
        },
        {
            "id": "1bkjext",
            "url": "/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/",
            "title": "10 Best ChatGPT Prompts for LinkedIn",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bkjext/10_best_chatgpt_prompts_for_linkedin/'>Reddit</a></caption><div><br></div><p>Hi all. LinkedIn is ranked #1 platform for lead generation.</p>\n<p>So, I compiled a list of great ChatGPT prompts to use for your next LinkedIn campaign/your profile/your post!</p>\n<p>Without wasting your time, let's dive in!</p>\n<p><em>Note:</em> <a href=\"https://www.godofprompt.ai/blog/15-best-chatgpt-prompts-for-linkedin\"><em>Click here</em></a> <em>to view the</em> <strong><em>full list of 15 Best ChatGPT Prompts for LinkedIn</em></strong><em>, published on my blog.</em></p>\n<p><strong>1. Write a Catchy Headline:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a social media strategist tasked with creating a compelling LinkedIn post headline for [COMPANY/INDUSTRY EVENT]. The headline should be engaging, succinct, and convey the unique value or insight the event offers. Use powerful adjectives and action verbs to grab attention and encourage LinkedIn users to click through. Ensure the headline resonates with the professional audience on LinkedIn, reflecting the tone and standards expected on the platform. Include a call-to-action or a thought-provoking question to increase engagement and comments.<br />\n<strong>2. Draft a Profile Summary:</strong><br />\nChatGPT AI Prompt:<br />\nCompose a LinkedIn profile summary as a professional in the [INDUSTRY/PROFESSION] with [YEARS OF EXPERIENCE] years of experience. Highlight your key skills, achievements, and the value you bring to potential employers or clients. Use a narrative style to tell your career story, emphasizing pivotal moments, challenges overcome, and lessons learned. Incorporate industry-specific keywords for SEO optimization. Conclude with a statement about your career aspirations or the type of opportunities you are seeking. Ensure the summary reflects a balance of professionalism and personality to engage readers and make your profile memorable.<br />\n<strong>3. Suggest Relevant Skills:</strong><br />\nChatGPT AI Prompt:<br />\nIdentify and list relevant skills for a LinkedIn profile in the field of [INDUSTRY/SPECIALIZATION]. Include a mix of hard skills directly related to your expertise, such as [SPECIFIC SOFTWARE], [TECHNICAL SKILLS], and [INDUSTRY STANDARDS], as well as soft skills like [COMMUNICATION], [LEADERSHIP], and [PROBLEM-SOLVING]. Ensure the skills are tailored to your career goals and reflect the requirements of your desired job roles. Consider adding emerging skills in your field to demonstrate forward-thinking and adaptability. Regularly update this section to include new skills acquired through work experience, education, or personal development.<br />\n<strong>4. Identify Important Keywords:</strong><br />\nChatGPT AI Prompt:<br />\nCompile a list of essential keywords for a LinkedIn profile targeting the [INDUSTRY/ROLE] sector. Include industry-specific jargon, technical skills, software tools, and certifications relevant to [SPECIFIC JOB TITLES] within the field. Incorporate soft skills and attributes valued in the industry, such as [TEAMWORK], [INNOVATION], and [ADAPTABILITY]. Also, add key achievements or metrics, like [REVENUE GROWTH] or [PROJECT COMPLETION RATES], to demonstrate quantifiable success. Research current job postings and industry trends to ensure the keywords are up-to-date and aligned with what recruiters and hiring managers are seeking.<br />\n<strong>5. Request a Recommendation:</strong><br />\nChatGPT AI Prompt:<br />\nCompose a message to request a LinkedIn recommendation from a former [COLLEAGUE/MANAGER/CLIENT]. Start by greeting them warmly and mentioning a memorable project or experience you shared. Briefly explain why you're seeking a recommendation and how their endorsement could positively impact your LinkedIn profile and professional standing. Offer specific suggestions for skills or achievements you'd like them to highlight, based on your collaboration, such as [LEADERSHIP IN PROJECT X], [EXPERTISE IN SKILL Y], or [OUTSTANDING CONTRIBUTION TO GOAL Z]. Conclude by expressing gratitude for their consideration and offering to reciprocate the favor.<br />\n<strong>6. Draft an Article:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the role of a thought leader in your industry, tasked with writing an insightful article for LinkedIn. The article should focus on the emerging trends in [INDUSTRY/SECTOR] and their potential impact on businesses and professionals. Begin with an engaging introduction that highlights the importance of staying ahead in today's fast-paced market. Delve into specific trends you've identified, supported by data, examples, and possibly your own professional experiences. Discuss the implications of these trends for professionals in the field, including challenges and opportunities. Offer actionable advice on how individuals and companies can adapt to these changes for continued success. Conclude with a reflective statement on the importance of innovation and adaptability in [INDUSTRY/SECTOR]. Encourage readers to share their thoughts and experiences in the comments to foster a community of learning and exchange on LinkedIn.<br />\n<strong>7. Draft a Networking Message:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a professional looking to expand your network on LinkedIn. Your task is to draft a personalized networking message to a [TARGET INDUSTRY] professional you admire but haven't met yet. Start with a brief introduction about yourself, including your current role and how you came across their profile. Mention a specific aspect of their work or a recent accomplishment you found impressive, and express genuine interest in learning more about it. Politely request a short virtual meeting or a phone call to discuss their insights on [TOPIC/PROJECT] that you're passionate about. Conclude the message with gratitude for their time and consideration, and an open invitation for them to connect with you for mutual professional growth. Remember to keep the tone professional yet approachable, and ensure the message is concise to respect their time.<br />\n<strong>8. Create a Value-Offering Post:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the persona of a [ROLE], aiming to share a value-offering post on LinkedIn about [PRODUCT/SERVICE/EXPERTISE]. Begin with a hook that captures the attention of your professional network, possibly by addressing a common challenge or a recent industry trend related to [INDUSTRY/NICHE]. Elaborate on how your [PRODUCT/SERVICE/EXPERTISE] offers a unique solution or insight, emphasizing the benefits and outcomes. Include a personal anecdote or a client success story to make your post more relatable and credible. End with an engaging question or call-to-action to encourage comments, shares, and direct messages. Ensure your tone is professional, yet approachable, and the content provides clear value to your target audience without overtly selling.<br />\n<strong>9. Engage with a Thought Leader's Content:</strong><br />\nChatGPT AI Prompt:<br />\nAssume the role of a professional looking to engage with a thought leader's content on LinkedIn. Start by thoroughly reading the thought leader's [POST/ARTICLE] on [TOPIC]. Reflect on how this content resonates with your experience or challenges within [YOUR INDUSTRY/NICHE]. Craft a thoughtful comment that appreciates the insights shared in the post, and contribute your own perspective or a relevant question that adds value to the discussion. Mention a specific point or quote from the post that stood out to you, and explain why. Your goal is to foster meaningful dialogue and potentially initiate a professional connection with the thought leader and their audience. Maintain a respectful and professional tone throughout your engagement.</p>\n<p><strong>10. Offer Your Help in a Post:</strong><br />\nChatGPT AI Prompt:<br />\nAdopt the persona of a [YOUR PROFESSIONAL ROLE] on LinkedIn, aiming to offer your expertise or assistance to your network. Start your post by expressing your enthusiasm for being part of the professional community on LinkedIn and your desire to give back. Briefly outline your areas of expertise, such as [SPECIFIC SKILLS], [EXPERIENCE], or [INDUSTRY KNOWLEDGE], that you're willing to offer help in. Offer specific examples of the type of assistance you can provide, such as mentorship, advice on [SPECIFIC TOPICS], or resources you have access to. Encourage your connections to reach out directly through comments, messages, or even setting up a call/meeting if they are interested or know someone who might benefit from your offer. End with a positive and inclusive statement that reinforces your eagerness to support and uplift others in your professional community. Maintain a tone that is helpful, approachable, and genuinely interested in fostering collaboration and support within your network.  </p>\n<p>Thanks for reading! I hope you find them useful.</p>\n<p>If you want to see the <strong>full list</strong> of 15 prompts for LinkedIn, visit my blog by <a href=\"https://www.godofprompt.ai/blog/15-best-chatgpt-prompts-for-linkedin\">clicking here.</a></p>",
            "date_published": "2024-03-21T22:25:21+00:00",
            "authors": [
                {
                    "name": "Illustrious-King8421",
                    "url": "https://www.reddit.com/user/Illustrious-King8421"
                }
            ]
        },
        {
            "id": "1bjb5zd",
            "url": "/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/",
            "title": "5 Best Claude Prompts for Market Research",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bjb5zd/5_best_claude_prompts_for_market_research/'>Reddit</a></caption><div><br></div><p>Claude 3 AI was rated as the smartest LLM on the planet.<br />\nSo, I decided to create a list of mega-prompts that I use quite often.<br />\nThe results achieved are quite impressive.</p>\n<p>Without wasting your time, let's dive straight into it!  </p>\n<blockquote>\n<p>By the way: I compiled the full list of prompts on my blog, which you can check out <a href=\"https://www.godofprompt.ai/blog/20-best-claude-ai-prompts\">here.</a></p>\n</blockquote>\n<p><strong>1. Industry Analysis:</strong> <br />\nConduct a comprehensive analysis of the [PRODUCT/SERVICE] industry.<br />\nStart by providing an overview of the market size and the leading companies, including their market shares. Highlight the industry's growth trends, focusing on historical growth rates and future projections.<br />\nNext, identify the key trends currently shaping the industry, such as technological advancements, consumer behaviors, and emerging business models. Delve into the regulatory environment, outlining significant laws and regulations affecting the industry.<br />\nDiscuss the barriers to entry for new competitors, considering factors like capital requirements, technological expertise, and brand loyalty.<br />\nFor each section, offer insights into the opportunities and challenges these dynamics present to businesses within the industry. Conclude by summarizing the main findings and suggest strategic recommendations for companies looking to enter, compete, or expand in the [PRODUCT/SERVICE] industry.<br />\nEnsure the analysis is well-structured, with clear headings for each section, and include visual aids like charts or graphs where applicable to enhance the presentation of data. Cite credible sources to back your findings and conclusions.  </p>\n<p><strong>2. Target Market Analysis:</strong> <br />\nYou will be conducting a target market analysis for a business, product, or service. Your goal is to identify and profile the target demographic and understand their needs, wants, and behaviors.<br />\nHere are the details of the business, product, or service:<br />\n[YOUR BUSINESS DETAILS]<br />\nBased on the information provided, please do the following:<br />\n1. Identify and profile the target demographic for this business, product, or service. Consider<br />\nfactors such as:<br />\n- Age<br />\n- Gender<br />\n- Income level<br />\n- Location<br />\n- Interests and hobbies<br />\n- Behaviors and habits<br />\nProvide your findings in a tag.<br />\n2. Analyze the needs, wants, and behaviors of the target audience. Consider questions such as:<br />\n- What problems or challenges does the target audience face that this business, product, or service<br />\ncan solve?<br />\n- What motivates the target audience to make a purchase decision?<br />\n- What are the target audience's preferences and expectations regarding this type of business,<br />\nproduct, or service?<br />\nProvide your analysis in an tag.<br />\nPlease focus specifically on the business, product, or service described in the<br />\ntag. Provide relevant and actionable insights that can help guide marketing and product development<br />\ndecisions.<br />\nTo understand the needs, wants, and behaviors of the target audience, consider the following:<br />\n1. Analyze customer feedback and reviews: Examine customer feedback from various sources, such as product reviews, customer service interactions, and social media comments. Look for common themes and insights into what customers value, what they dislike, and what they expect from the company's offerings.<br />\n2. Conduct surveys and focus groups: Engage directly with members of the target audience through<br />\nsurveys and focus groups. Ask questions that probe their preferences, attitudes, and behaviors<br />\nrelated to the company's products or services. Use this qualitative data to supplement the<br />\nquantitative data gathered through other methods.<br />\n3. Monitor social media and online discussions: Keep track of relevant social media conversations<br />\nand online forums where the target audience is active. Observe the topics they discuss, the language<br />\nthey use, and the sentiment they express toward various brands and products. This can provide<br />\nvaluable insights into their needs and wants.<br />\n- Identify common characteristics among existing customers<br />\n- Research the broader market to identify potential target segments<br />\n- Create detailed customer personas based on data collected<br />\n- Analyze customer feedback and reviews for insights<br />\n- Conduct surveys and focus groups to gather qualitative data<br />\n- Monitor social media and online discussions to understand target audience needs and wants<br />\nIn summary, target market analysis is essential for understanding the demographics, needs, wants, and behaviors of a company's ideal customers. By analyzing existing customer data, conducting market research, creating customer personas, gathering feedback, and monitoring online discussions, companies can gain valuable insights into their target audience. This information should be used to inform marketing strategies, product development, and customer service practices to better serve the target market and drive business growth. Remember, target market analysis is an ongoing process that requires regular updates to stay relevant in an ever-changing market landscape.<br />\n<strong>3. Pricing Research:</strong> <br />\n#CONTEXT:<br />\nYou are an expert business consultant. Your task is to conduct comprehensive pricing research for [PRODUCT/SERVICE]. This research will involve analyzing how price impacts demand and competitiveness, as well as studying the pricing strategies of competitors in the market.<br />\n#RESPONSE GUIDELINES:<br />\nTo analyze the impact of price on demand and competitiveness, follow these steps:<br />\n1. Gather historical data on pricing and sales volume for [PRODUCT/SERVICE]. Ensure the data covers<br />\na sufficient time period to identify trends and patterns.<br />\n2. Analyze the relationship between price changes and demand. Identify instances where price changes<br />\nled to significant increases or decreases in sales volume.<br />\n3. Calculate the price elasticity of demand for [Product/Service]. Determine whether demand is<br />\nelastic (sensitive to price changes) or inelastic (relatively unaffected by price changes).<br />\n4. Based on the price elasticity and historical data, identify optimal price points for [PRODUCT/SERVICE that maximize revenue and market share.<br />\nNext, study the pricing strategies of competitors in the market:<br />\n1. Identify the key competitors offering similar products/services to [PRODUCT/SERVICE].<br />\n2. Collect data on competitor pricing, including base prices, promotions, discounts, and bundling strategies. Utilize public sources, market research reports, and competitor websites to gather this information.<br />\n3. Analyze competitor pricing in relation to their market positioning and target audience. Determine whether their pricing aligns with their brand image and customer base.<br />\n4. Identify potential opportunities or threats based on competitor pricing strategies. Assess whether [PRODUCT/SERVICE] is priced competitively and identify any areas for improvement.<br />\nWhen presenting your findings, structure your response as follows:<br />\n1. Begin with an executive summary that highlights the key insights and recommendations from your<br />\npricing research.<br />\n2. Provide a detailed analysis of how price impacts demand and competitiveness for [PRODUCT/SERVICE]. Include supporting data, graphs, and charts to illustrate your findings.<br />\n3. Present a comprehensive overview of competitor pricing strategies. Discuss their pricing models,<br />\npromotions, and bundling tactics, and assess their effectiveness in the market.<br />\n4. Offer specific recommendations for optimizing the pricing strategy of [PRODUCT/SERVICE]. Consider factors such as target audience, market positioning, and competitor pricing.<br />\n5. Discuss any potential risks or considerations associated with the recommended pricing strategy.<br />\nAddress how these risks can be mitigated or managed.<br />\n6. Conclude with a summary of the key takeaways and next steps for implementing the pricing<br />\nstrategy.<br />\nThroughout your analysis, consider the specific context and characteristics of [PRODUCT/SERVICE]. Tailor your insights and recommendations to align with the unique value proposition and target<br />\nmarket of the offering.<br />\n#OUTPUT:<br />\nPresent your findings in a clear, concise, and visually appealing format.<br />\nUse headings, subheadings, and bullet points to organize your response. Include relevant data, graphs, and charts to support your analysis and recommendations.<br />\nMOST IMPORTANT!: Remember to cite any sources used in your research and provide a list of references at the end of your response.  </p>\n<p><strong>4. Market Segment:</strong><br />\nYou are an expert marketing consultant. Your task is to conduct a comprehensive market segmentation analysis for [PRODUCT/SERVICE]. Your goal is to divide the market into distinct subsets of consumers with common needs or<br />\ncharacteristics, tailor marketing strategies to specific segments, examine the effectiveness of various distribution channels, and identify new distribution opportunities.<br />\nFollow these steps to complete the task:<br />\n1. Identify the target market for the product or service. Gather relevant data on consumer<br />\ndemographics, psychographics, behavior, and preferences.<br />\n2. Analyze the data to identify distinct consumer segments. Look for patterns and commonalities in<br />\nthe data that suggest groups of consumers with similar needs, preferences, or behaviors. Consider<br />\nfactors such as age, income, lifestyle, values, and purchasing habits.<br />\n3. For each identified segment, develop a tailored marketing strategy. Consider the unique needs,<br />\npreferences, and behaviors of each segment, and create a marketing mix (product, price, promotion,<br />\nand place) that resonates with each group.<br />\n4. Evaluate the effectiveness of various distribution channels for reaching each segment. Consider<br />\nfactors such as accessibility, convenience, and cost-effectiveness. Identify which channels are most<br />\neffective for each segment and allocate resources accordingly.<br />\n5. Identify new distribution opportunities that could help reach untapped segments or improve the<br />\neffectiveness of existing channels. Consider emerging technologies, partnerships, or innovative<br />\napproaches that could expand the reach of the product or service.<br />\n6. Provide your analysis and recommendations in a clear, structured manner. Use the following<br />\nformat:<br />\nDescribe the target market for the product or service.<br />\nDescribe the characteristics and needs of segment 1.<br />\nOutline the tailored marketing strategy for segment 1.<br />\nDescribe the characteristics and needs of segment 2.<br />\nOutline the tailored marketing strategy for segment 2.<br />\n[OPTIONAL: ADD ADDITIONAL SEGMENTS IF NEEDED]<br />\nDescribe distribution channel 1.<br />\nEvaluate the effectiveness of channel 1 for each segment.<br />\nDescribe distribution channel 2.<br />\nEvaluate the effectiveness of channel 2 for each segment.<br />\n[OPTIONAL: ADD ADDITIONAL CHANNELS IF NEEDED]<br />\nIdentify and describe new distribution opportunities.<br />\nProvide overall recommendations based on your analysis.<br />\nRemember to support your analysis and recommendations with insights from the data and your understanding of the market and consumer behavior. Your goal is to provide actionable insights that can inform marketing and distribution strategies for the [PRODUCT/SERVICE].<br />\nMOST IMPORTANT: ALWAYS cite every source used in the research.  </p>\n<p><strong>5. International Market Research:</strong> <br />\nYou are an expert market researcher. You will be conducting comprehensive international market research for a [PRODUCT/SERVICE].<br />\nIt's important to understand the cultural, legal, and economic factors that impact market entry in different countries or regions.<br />\nTo begin, consider the following key factors when studying potential markets:<br />\n- Cultural factors: Analyze the language, customs, values, and preferences of the target market.<br />\nConsider how these factors may influence consumer behavior and product acceptance.<br />\n- Legal factors: Research the regulations, trade barriers, intellectual property laws, and other<br />\nlegal considerations that may affect market entry and operations.<br />\n- Economic factors: Evaluate the market size, growth potential, competition, consumer purchasing<br />\npower, and overall economic stability of each potential market.<br />\n- Technological factors: Assess the technological infrastructure, adoption rates, and digital<br />\nreadiness of the target markets, as these factors may impact product delivery and customer<br />\nengagement.<br />\n- Political factors: Consider the political stability, government policies, and international<br />\nrelations that may influence market entry and long-term success.<br />\nNext, gather and analyze relevant data from reliable sources, such as government databases, industry<br />\nreports, market research firms, and local experts, for each factor in the chosen markets. Use this<br />\ninformation to identify potential opportunities and challenges for market entry.<br />\nBased on your analysis, provide a comprehensive report summarizing your findings and recommendations<br />\nfor each market. Consider the product or service's unique value proposition and target audience when<br />\nmaking your recommendations. Include the following sections in your report:<br />\n1. Executive Summary: Provide a brief overview of the key findings and recommendations.<br />\n2. Market Overview: Describe the general characteristics and trends of each potential market.<br />\n3. Factor Analysis: Present your findings for each of the key factors (cultural, legal, economic,<br />\ntechnological, and political) in each market.<br />\n4. Opportunities and Challenges: Identify the potential opportunities and challenges for market<br />\nentry based on your analysis.<br />\n5. Recommendations: Offer specific recommendations for market entry, including prioritization of<br />\nmarkets, localization strategies, and potential partnerships or collaborations.<br />\nPlease provide your comprehensive international market research report inside tags.<br />\nMOST IMPORTANT!: ALWAYS cite every source used in your research.<br />\nIf you want to see the full list of prompts, visit my blog by <a href=\"https://www.godofprompt.ai/blog/20-best-claude-ai-prompts\">clicking here.</a></p>\n<p>&#x200B;</p>",
            "date_published": "2024-03-20T11:26:59+00:00",
            "authors": [
                {
                    "name": "Illustrious-King8421",
                    "url": "https://www.reddit.com/user/Illustrious-King8421"
                }
            ]
        },
        {
            "id": "1biesim",
            "url": "/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/",
            "title": "Best AI Boyfriend App?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1biesim/best_ai_boyfriend_app/'>Reddit</a></caption><div><br></div><p>There’s been a few posts in this sub about AI girlfriend apps, but what about the other side of the fence– AI boyfriend apps/generators?</p>\n<p>I’m researching and reviewing the best AI boyfriend apps.</p>\n<p>So far I’ve tried:</p>\n<ul>\n<li>Candy AI Boyfriend Generator</li>\n<li>Replika</li>\n<li>Anima Virtual Boyfriend</li>\n<li>Romance AI</li>\n</ul>\n<p>These seem the most technically advanced apps at the moment.</p>\n<p>Have you tried any? Were they worth it?</p>",
            "date_published": "2024-03-19T07:45:03+00:00",
            "authors": [
                {
                    "name": "opulent1986",
                    "url": "https://www.reddit.com/user/opulent1986"
                }
            ]
        },
        {
            "id": "1bhz2zz",
            "url": "/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/",
            "title": "Should i quit my education and pursue a job before AI replace me?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bhz2zz/should_i_quit_my_education_and_pursue_a_job/'>Reddit</a></caption><div><br></div><p>I have a bachelor in an engineering field and is currently doing my masters which i will finish in 2025. I am however quite worried about AI as it to me appears it can replace and surpass me within the next 5 years. Im therefore contemplating quitting my master and pursuing jobs with my bachelor, so i atleast can get some years income before im made obsolete by AI. </p>\n<p>Am i exageratting the skills of AI or is my thinking reasonable?</p>",
            "date_published": "2024-03-18T19:13:35+00:00",
            "authors": [
                {
                    "name": "fragmenteret-raev",
                    "url": "https://www.reddit.com/user/fragmenteret-raev"
                }
            ]
        },
        {
            "id": "1bgp1uj",
            "url": "/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/",
            "title": "Best AI Girlfriend Generator?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bgp1uj/best_ai_girlfriend_generator/'>Reddit</a></caption><div><br></div><p>AI is evolving faster than we can anticipate, and there's tons of so called free AI girlfriend generators / apps coming out.</p>\n<p>I research and test the new AI girlfriend apps regularly to keep my knowledge up to date.</p>\n<p>The best AI girlfriend generator apps I have reviewed so far include:</p>\n<p>&#x200B;</p>\n<ul>\n<li>FantasyGF</li>\n<li>DreamGF</li>\n<li>Candy AI</li>\n<li>Seduced AI</li>\n<li>Romantic AI</li>\n<li>CrushOn AI</li>\n<li>Intimate AI</li>\n</ul>\n<p>What are your recommendations for the best AI girlfriend generators/apps? And what apps would you like to see me review?</p>",
            "date_published": "2024-03-17T04:26:15+00:00",
            "authors": [
                {
                    "name": "opulent1986",
                    "url": "https://www.reddit.com/user/opulent1986"
                }
            ]
        },
        {
            "id": "1bfh0ca",
            "url": "/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/",
            "title": "AI will mean more programmers, not fewer",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bfh0ca/ai_will_mean_more_programmers_not_fewer/'>Reddit</a></caption><div><br></div><ul>\n<li>Jensen Huang and others have speculated about AI replacing programmers, citing the ability of AI systems like ChatGPT or Github's Copilot to generate code quickly.</li>\n<li>However, programmers perform critical tasks beyond mere coding, including problem-solving, analysis of complex issues, and iteration on solutions.</li>\n<li>While AI tools can expedite certain tasks, they lack the ability to reason, limiting their capabilities compared to human programmers.</li>\n<li>AI is expected to enhance the efficiency and productivity of programmers rather than replace them entirely.</li>\n<li>As AI tools become more prevalent, companies may require fewer programmers, but the value per developer is anticipated to increase.</li>\n<li>AI serves as a tool to assist programmers, emphasizing the continued importance of human creativity and imagination in software development.</li>\n</ul>\n<p>Source: https://app.daily.dev/posts/TzLCdXh3j</p>",
            "date_published": "2024-03-15T15:45:02+00:00",
            "authors": [
                {
                    "name": "High_Sleep3694",
                    "url": "https://www.reddit.com/user/High_Sleep3694"
                }
            ]
        },
        {
            "id": "1bdjme6",
            "url": "/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/",
            "title": "People always say AI will take everyone's jobs, but wouldn't it take a massive amount of processing power and resources to take over that many jobs?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/'>Winston</a> | <a href='https://reddit.com/r/ArtificialInteligence/comments/1bdjme6/people_always_say_ai_will_take_everyones_jobs_but/'>Reddit</a></caption><div><br></div><p>I mean to take over say 70% of the jobs you'd need a computer the size of New Mexico or something no?</p>\n<p>Is it even possible?</p>",
            "date_published": "2024-03-13T05:22:13+00:00",
            "authors": [
                {
                    "name": "daway8899",
                    "url": "https://www.reddit.com/user/daway8899"
                }
            ]
        }
    ]
}