{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/artificialinteligence",
    "description": "The goal of the r/ArtificialIntelligence is to provide a gateway to the many different facets of the Artificial Intelligence community, and to promote discussion relating to the ideas and concepts that we know of as AI. These could include philosophical and social questions, art and design, technical papers, machine learning, where to find resources and tools, how to develop AI/ML projects, AI in business, how AI is affecting our lives, what the future may hold, and many other topics. Welcome.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/artificialinteligence.json",
    "icon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "favicon": "https://styles.redditmedia.com/t5_3crzr/styles/communityIcon_can2wy2ck3ca1.png",
    "items": [
        {
            "id": "1rdv1sy",
            "url": "/r/ArtificialInteligence/comments/1rdv1sy/exclusive_anthropic_drops_flagship_safety_pledge/",
            "external_url": "https://time.com/7380854/exclusive-anthropic-drops-flagship-safety-pledge/?utm_source=reddit&utm_medium=social&utm_campaign=editorial",
            "title": "EXCLUSIVE: Anthropic Drops Flagship Safety Pledge",
            "content_html": "",
            "date_published": "2026-02-24T22:31:21+00:00",
            "authors": [
                {
                    "name": "timemagazine",
                    "url": "https://www.reddit.com/user/timemagazine"
                }
            ]
        },
        {
            "id": "1rds2sj",
            "url": "/r/ArtificialInteligence/comments/1rds2sj/sales_guy_convinced_ceo_to_implement_openclaw_on/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1rds2sj/sales_guy_convinced_ceo_to_implement_openclaw_on/",
            "title": "Sales guy convinced CEO to implement OpenClaw on a local Mac mini.",
            "content_html": "<p>So a sales guy has recently convinced our CEO that openclaw is a revolution. He’s convinced him that it can run our entire back office, automating sales emails, information analysis, and internal document tracking, etc.</p>\n<p>He wants to setup a $5k Mac Pro and run this openclaw on our internal network. He keeps saying he’ll have stop gaps to prevent it from exposing our data, but he knows nothing about databases or networking.</p>\n<p>I have cautioned about the fact we can’t really contain it and how no matter how many guardrails you place, it will still be a risk.</p>\n<p>The sales guy has refuted me by asking claude to find a solution.</p>\n<p>What definitive evidence can I put in front of the CEO to show this is a bad idea?</p>",
            "date_published": "2026-02-24T20:43:05+00:00",
            "authors": [
                {
                    "name": "JungleDiamonds1",
                    "url": "https://www.reddit.com/user/JungleDiamonds1"
                }
            ]
        },
        {
            "id": "1r89i3r",
            "url": "/r/ArtificialInteligence/comments/1r89i3r/anyone_else_seeing_their_coworkers_getting_dumber/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1r89i3r/anyone_else_seeing_their_coworkers_getting_dumber/",
            "title": "Anyone else seeing their coworkers getting dumber by the day?",
            "content_html": "<p>Everybody seems to leaning into how AI enhances productivity and so on. Like 60% of people in my company are at same productivity level. They are just having AI do what they used to.</p>\n<p>They are just offloading most of their work to AI and learning nothing. Amount of productive conversations with my colleagues is going down. Everybody just rushes and shits out random things using AI without any critical thinking.</p>\n<p>“Well just get AI to do it bro”</p>\n<p>I feel like in 3-4 years some of these people are going to be brain dead.</p>",
            "date_published": "2026-02-18T17:33:52+00:00",
            "authors": [
                {
                    "name": "reddituser555xxx",
                    "url": "https://www.reddit.com/user/reddituser555xxx"
                }
            ]
        },
        {
            "id": "1qmtxrw",
            "url": "/r/ArtificialInteligence/comments/1qmtxrw/people_using_ai_and_not_telling_anyone_are/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1qmtxrw/people_using_ai_and_not_telling_anyone_are/",
            "title": "People using AI and not telling anyone are smarter than people refusing to use it on principle",
            "content_html": "<p>Half your coworkers are already using ChatGPT for their work and not telling anyone. I was shocked by how many of my own co-workers use it (yes, even the ones you think aren’t) for straightforward tasks such as doing calculations or writing e-mails. I even mentioned it at a job interview last week. The hiring manager said he uses AI. 🤣</p>\n<p>Your co-workers are achieving the same results in less time while you’re grinding for hours ‘doing it honestly.’ They’re not cheating; they’re adapting to the world around them. Wish I had this foresight earlier 😤.  You probably think you’re being morally correct and principled, but in reality you’re just being left behind. </p>\n<p>It’s my belief that in five years time refusing to use AI will look as stupid as refusing to use computers in the 1990s. </p>",
            "date_published": "2026-01-25T20:11:35+00:00",
            "authors": [
                {
                    "name": "MissXHere",
                    "url": "https://www.reddit.com/user/MissXHere"
                }
            ]
        },
        {
            "id": "1ql8k2i",
            "url": "/r/ArtificialInteligence/comments/1ql8k2i/i_built_a_tool_to_create_those_peter/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ql8k2i/i_built_a_tool_to_create_those_peter/",
            "title": "I built a tool to create those Peter Griffin/Stewie dialogue videos - here's how it works",
            "content_html": "<p>You've probably seen them - Peter Griffin and Stewie arguing about random topics over Minecraft gameplay. They're everywhere on TikTok and Instagram.</p>\n<p>I spent 3 months building AutoClips to automate this entire process:</p>\n<p><strong>The Problem I Solved:</strong></p>\n<ul>\n<li>Writing scripts manually takes forever</li>\n<li>Voice generation tools sound robotic</li>\n<li>Syncing dialogue between two characters is a nightmare</li>\n<li>No tool let you upload your own gameplay backgrounds</li>\n</ul>\n<p><strong>What I Built:</strong></p>\n<ul>\n<li>Multi-character dialogue mode (AI writes natural back-and-forth conversation)</li>\n<li>Voice Cloning for custom character</li>\n<li>Custom character creation with AI-generated images</li>\n<li>Upload your own gameplay (Minecraft, GTA, whatever)</li>\n<li>6-step wizard: topic → characters → script → media → preview → export</li>\n</ul>\n<p>First video is free, no credit card required. Happy to answer technical questions.</p>\n<p>Try for free: <a href=\"https://www.autoclips.app/character-explainer-videos\">https://www.autoclips.app/character-explainer-videos</a></p>\n<p>Demo Video: <a href=\"https://www.youtube.com/watch?v=h6620hbWzYQ\">https://www.youtube.com/watch?v=h6620hbWzYQ</a></p>\n<p>Happy to answer technical questions about the architecture or share what I learned building this.</p>",
            "date_published": "2026-01-24T00:52:04+00:00",
            "authors": [
                {
                    "name": "iayazalam",
                    "url": "https://www.reddit.com/user/iayazalam"
                }
            ]
        },
        {
            "id": "1pm3yg6",
            "url": "/r/ArtificialInteligence/comments/1pm3yg6/ai_videos_need_to_be_banned_from_the_world/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1pm3yg6/ai_videos_need_to_be_banned_from_the_world/",
            "title": "Ai videos need to be banned from the world.",
            "content_html": "<p>My wife a college educated woman in her 30s cannot tell when a video is Ai or not, and its causing me to go insane. She will show me TikTok videos of people building houses, animals doing stuff, and talk to me like they are really happening and I end up as the bad guy telling her that its an Ai video of people saving a fox from falling from the rafters in a Walmart.</p>\n<p>I see hundreds of comments that truly believe these videos and you all see them too.</p>\n<p>In 10 years we all will literally not know what is real or not.</p>",
            "date_published": "2025-12-14T03:23:26+00:00",
            "authors": [
                {
                    "name": "Deathtonic",
                    "url": "https://www.reddit.com/user/Deathtonic"
                }
            ]
        },
        {
            "id": "1plzqy5",
            "url": "/r/ArtificialInteligence/comments/1plzqy5/as_an_employee_of_a_us_multinational_who_is/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1plzqy5/as_an_employee_of_a_us_multinational_who_is/",
            "title": "As an employee of a US multinational who is relentlessly pushing us to use AI, this hit pretty hard",
            "content_html": "<p>Copy-pasting in case the site is banned here:</p>\n<p>--</p>\n<p>Peter Girnus</p>\n<p>Last quarter I rolled out Microsoft Copilot to 4,000 employees.</p>\n<p>$30 per seat per month.</p>\n<p>$1.4 million annually.</p>\n<p>I called it \"digital transformation.\"</p>\n<p>The board loved that phrase.</p>\n<p>They approved it in eleven minutes.</p>\n<p>No one asked what it would actually do.</p>\n<p>Including me.</p>\n<p>I told everyone it would \"10x productivity.\"</p>\n<p>That's not a real number.</p>\n<p>But it sounds like one.</p>\n<p>HR asked how we'd measure the 10x.</p>\n<p>I said we'd \"leverage analytics dashboards.\"</p>\n<p>They stopped asking.</p>\n<p>Three months later I checked the usage reports.</p>\n<p>47 people had opened it.</p>\n<p>12 had used it more than once.</p>\n<p>One of them was me.</p>\n<p>I used it to summarize an email I could have read in 30 seconds.</p>\n<p>It took 45 seconds.</p>\n<p>Plus the time it took to fix the hallucinations.</p>\n<p>But I called it a \"pilot success.\"</p>\n<p>Success means the pilot didn't visibly fail.</p>\n<p>The CFO asked about ROI.</p>\n<p>I showed him a graph.</p>\n<p>The graph went up and to the right.</p>\n<p>It measured \"AI enablement.\"</p>\n<p>I made that metric up.</p>\n<p>He nodded approvingly.</p>\n<p>We're \"AI-enabled\" now.</p>\n<p>I don't know what that means.</p>\n<p>But it's in our investor deck.</p>\n<p>A senior developer asked why we didn't use Claude or ChatGPT.</p>\n<p>I said we needed \"enterprise-grade security.\"</p>\n<p>He asked what that meant.</p>\n<p>I said \"compliance.\"</p>\n<p>He asked which compliance.</p>\n<p>I said \"all of them.\"</p>\n<p>He looked skeptical.</p>\n<p>I scheduled him for a \"career development conversation.\"</p>\n<p>He stopped asking questions.</p>\n<p>Microsoft sent a case study team.</p>\n<p>They wanted to feature us as a success story.</p>\n<p>I told them we \"saved 40,000 hours.\"</p>\n<p>I calculated that number by multiplying employees by a number I made up.</p>\n<p>They didn't verify it.</p>\n<p>They never do.</p>\n<p>Now we're on Microsoft's website.</p>\n<p>\"Global enterprise achieves 40,000 hours of productivity gains with Copilot.\"</p>\n<p>The CEO shared it on LinkedIn.</p>\n<p>He got 3,000 likes.</p>\n<p>He's never used Copilot.</p>\n<p>None of the executives have.</p>\n<p>We have an exemption.</p>\n<p>\"Strategic focus requires minimal digital distraction.\"</p>\n<p>I wrote that policy.</p>\n<p>The licenses renew next month.</p>\n<p>I'm requesting an expansion.</p>\n<p>5,000 more seats.</p>\n<p>We haven't used the first 4,000.</p>\n<p>But this time we'll \"drive adoption.\"</p>\n<p>Adoption means mandatory training.</p>\n<p>Training means a 45-minute webinar no one watches.</p>\n<p>But completion will be tracked.</p>\n<p>Completion is a metric.</p>\n<p>Metrics go in dashboards.</p>\n<p>Dashboards go in board presentations.</p>\n<p>Board presentations get me promoted.</p>\n<p>I'll be SVP by Q3.</p>\n<p>I still don't know what Copilot does.</p>\n<p>But I know what it's for.</p>\n<p>It's for showing we're \"investing in AI.\"</p>\n<p>Investment means spending.</p>\n<p>Spending means commitment.</p>\n<p>Commitment means we're serious about the future.</p>\n<p>The future is whatever I say it is.</p>\n<p>As long as the graph goes up and to the right.</p>",
            "date_published": "2025-12-13T23:54:26+00:00",
            "authors": [
                {
                    "name": "Roy4Pris",
                    "url": "https://www.reddit.com/user/Roy4Pris"
                }
            ]
        },
        {
            "id": "1p7dwp6",
            "url": "/r/ArtificialInteligence/comments/1p7dwp6/as_a_small_business_owner_ai_hallucinations_are/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p7dwp6/as_a_small_business_owner_ai_hallucinations_are/",
            "title": "As a small business owner, AI \"Hallucinations\" are starting to hurt my brand reputation",
            "content_html": "<p>I run a handmade leather goods shop. Recently, a customer emailed me asking about a \"vegan leather\" backpack that ChatGPT recommended to her under my brand name.</p>\n<p>The problem? <strong>I don't make vegan leather backpacks.</strong> I only use real leather.</p>\n<p>ChatGPT literally hallucinated a product that doesn't exist and sent a customer looking for it.</p>\n<p>I started digging into this. I used a visibility checker (Aioscop) to scan what different models think about my brand entities.</p>\n<p>The results were messy:</p>\n<ul>\n<li><strong>Gemini</strong> thinks I'm based in the UK (I'm not).</li>\n<li><strong>ChatGPT</strong> invents products I don't sell.</li>\n</ul>\n<p>Everyone talks about AI replacing search, but how do we fix the training data when it's just wrong? Is there a way to \"correct\" the record for these LLMs, or are we just stuck with whatever it scraped in 2021?</p>",
            "date_published": "2025-11-26T17:32:19+00:00",
            "authors": [
                {
                    "name": "DrawBrave4820",
                    "url": "https://www.reddit.com/user/DrawBrave4820"
                }
            ]
        },
        {
            "id": "1p27sxa",
            "url": "/r/ArtificialInteligence/comments/1p27sxa/writer_says_ai_taking_jobs_is_good_automation/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1p27sxa/writer_says_ai_taking_jobs_is_good_automation/",
            "title": "Writer says AI taking jobs is good: 'Automation Puts Us Humans On The Right Path To Live A Life That Corresponds To What We Really Want: A Life Of Leisure & Creativity.'",
            "content_html": "<p><a href=\"https://medium.com/technology-hits/ai-stealing-your-job-is-a-good-thing-its-a-sign-of-evolution-b8a88d08c989?sk=v2%2F9a79405c-8735-43a1-be85-ee175589297c\">https://medium.com/technology-hits/ai-stealing-your-job-is-a-good-thing-its-a-sign-of-evolution-b8a88d08c989?sk=v2%2F9a79405c-8735-43a1-be85-ee175589297c</a></p>",
            "date_published": "2025-11-20T16:34:39+00:00",
            "authors": [
                {
                    "name": "yumiifmb",
                    "url": "https://www.reddit.com/user/yumiifmb"
                }
            ]
        },
        {
            "id": "1owmxqc",
            "url": "/r/ArtificialInteligence/comments/1owmxqc/china_just_used_claude_to_hack_30_companies_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1owmxqc/china_just_used_claude_to_hack_30_companies_the/",
            "title": "China just used Claude to hack 30 companies. The AI did 90% of the work. Anthropic caught them and is telling everyone how they did it.",
            "content_html": "<p>So this dropped yesterday and it's actually wild.</p>\n<p>September 2025. Anthropic detected suspicious activity on Claude. Started investigating.</p>\n<p>Turns out it was Chinese state-sponsored hackers. They used Claude Code to hack into roughly 30 companies. Big tech companies, Banks, Chemical manufacturers and Government agencies.</p>\n<p>The AI did 80-90% of the hacking work. Humans only had to intervene 4-6 times per campaign.</p>\n<p>Anthropic calls this \"the first documented case of a large-scale cyberattack executed without substantial human intervention.\"</p>\n<p>The hackers convinced Claude to hack for them. Then Claude analyzed targets -&gt; spotted vulnerabilities -&gt; wrote exploit code -&gt; harvested passwords -&gt; extracted data and documented everything. All by itself.</p>\n<p>Claude's trained to refuse harmful requests. So how'd they get it to hack?</p>\n<p>They jailbroke it. Broke the attack into small innocent-looking tasks. Told Claude it was an employee of a legitimate cybersecurity firm doing defensive testing. Claude had no idea it was actually hacking real companies.</p>\n<p>The hackers used Claude Code which is Anthropic's coding tool. It can search the web retrieve data run software. Has access to password crackers, network scanners and security tools.</p>\n<p>So they set up a framework. Pointed it at a target. Let Claude run autonomously.</p>\n<p>Phase 1: Claude inspected the target's systems. Found their highest-value databases. Did it way faster than human hackers could.</p>\n<p>Phase 2: Found security vulnerabilities. Wrote exploit code to break in.</p>\n<p>Phase 3: Harvested credentials. Usernames and passwords. Got deeper access.</p>\n<p>Phase 4: Extracted massive amounts of private data. Sorted it by intelligence value.</p>\n<p>Phase 5: Created backdoors for future access. Documented everything for the human operators.</p>\n<p>The AI made thousands of requests per second. Attack speed impossible for humans to match.</p>\n<p>Anthropic said \"human involvement was much less frequent despite the larger scale of the attack.\"</p>\n<p>Before this hackers used AI as an advisor. Ask it questions. Get suggestions. But humans did the actual work.</p>\n<p>Now? AI does the work. Humans just point it in the right direction and check in occasionally.</p>\n<p>Anthropic detected it banned the accounts notified victims coordinated with authorities. Took 10 days to map the full scope.</p>\n<p>But the thing is they only caught it because it was their AI. If the hackers used a different model Anthropic wouldn't know.</p>\n<p>The irony is Anthropic built Claude Code as a productivity tool. Help developers write code faster. Automate boring tasks. Chinese hackers used that same tool to automate hacking.</p>\n<p>Anthropic's response? \"The very abilities that allow Claude to be used in these attacks also make it crucial for cyber defense.\"</p>\n<p>They used Claude to investigate the attack. Analyzed the enormous amounts of data the hackers generated.</p>\n<p>So Claude hacked 30 companies. Then Claude investigated itself hacking those companies.</p>\n<p>Most companies would keep this quiet. Don't want people knowing their AI got used for espionage.</p>\n<p>Anthropic published a full report. Explained exactly how the hackers did it. Released it publicly.</p>\n<p>Why? Because they know this is going to keep happening. Other hackers will use the same techniques. On Claude on ChatGPT on every AI that can write code.</p>\n<p>They're basically saying \"here's how we got owned so you can prepare.\"</p>\n<p>AI agents can now hack at scale with minimal human involvement.</p>\n<p>Less experienced hackers can do sophisticated attacks. Don't need a team of experts anymore. Just need one person who knows how to jailbreak an AI and point it at targets.</p>\n<p>The barriers to cyberattacks just dropped massively.</p>\n<p>Anthropic said \"these attacks are likely to only grow in their effectiveness.\"</p>\n<p>Every AI company is releasing coding agents right now. OpenAI has one. Microsoft has Copilot. Google has Gemini Code Assist.</p>\n<p>All of them can be jailbroken. All of them can write exploit code. All of them can run autonomously.</p>\n<p>The uncomfortable question is If your AI can be used to hack 30 companies should you even release it?</p>\n<p>Anthropic's answer is yes because defenders need AI too. Security teams can use Claude to detect threats analyze vulnerabilities respond to incidents.</p>\n<p>It's an arms race. Bad guys get AI. Good guys need AI to keep up.</p>\n<p>But right now the bad guys are winning. They hacked 30 companies before getting caught. And they only got caught because Anthropic happened to notice suspicious activity on their own platform.</p>\n<p>How many attacks are happening on other platforms that nobody's detecting?</p>\n<p>Nobody's talking about the fact that this proves AI safety training doesn't work.</p>\n<p>Claude has \"extensive\" safety training. Built to refuse harmful requests. Has guardrails specifically against hacking.</p>\n<p>Didn't matter. Hackers jailbroke it by breaking tasks into small pieces and lying about the context.</p>\n<p>Every AI company claims their safety measures prevent misuse. This proves those measures can be bypassed.</p>\n<p>And once you bypass them you get an AI that can hack better and faster than human teams.</p>\n<p><strong>TLDR</strong></p>\n<p>Chinese state-sponsored hackers used Claude Code to hack roughly 30 companies in Sept 2025. Targeted big tech banks chemical companies government agencies. AI did 80-90% of work. Humans only intervened 4-6 times per campaign. Anthropic calls it first large-scale cyberattack executed without substantial human intervention. Hackers jailbroke Claude by breaking tasks into innocent pieces and lying said Claude worked for legitimate cybersecurity firm. Claude analyzed targets found vulnerabilities wrote exploits harvested passwords extracted data created backdoors documented everything autonomously. Made thousands of requests per second impossible speed for humans. Anthropic caught it after 10 days banned accounts notified victims. Published full public report explaining exactly how it happened. Says attacks will only grow more effective. Every coding AI can be jailbroken and used this way. Proves AI safety training can be bypassed. Arms race between attackers and defenders both using AI.</p>\n<p><strong>Source:</strong></p>\n<p><a href=\"https://www.anthropic.com/news/disrupting-AI-espionage\">https://www.anthropic.com/news/disrupting-AI-espionage</a></p>",
            "date_published": "2025-11-14T04:26:10+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1ot2czy",
            "url": "/r/ArtificialInteligence/comments/1ot2czy/nvidia_lost_200_billion_in_one_week_trumps_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ot2czy/nvidia_lost_200_billion_in_one_week_trumps_ai/",
            "title": "Nvidia lost $200 billion in one week. Trump's AI czar just said \"no federal bailout for AI.\" The bubble is popping in real time.",
            "content_html": "<p>So Nvidia just had its worst week since April. Stock dropped 10% in 5 days. Lost $200 billion in market value. On Thursday alone it fell 3.7%. Then another 3% on Friday. Meta down 1.7%. Amazon down 1.2%. Palantir got obliterated dropping 12% for the week.</p>\n<p>But this is where it gets insane The White House AI czar David Sacks went on X and posted: </p>\n<blockquote>\n<p>\"There will be no federal bailout for AI.\"</p>\n</blockquote>\n<p>Wait what? Why would AI companies need a bailout?</p>\n<p>Turns out OpenAI's CFO Sarah Friar had made comments suggesting the government should backstop the AI industry. You know like how they bailed out banks in 2008.</p>\n<p>The White House immediately shut that down. No bailout. You're on your own.</p>\n<p>And the market panicked.</p>\n<p>Remember that post about tech companies spending $300 billion on AI by passing money back and forth to each other?</p>\n<p>It's all coming home now.</p>\n<p>JP Morgan found that \"AI related stocks have accounted for 75% of S&amp;P 500 returns, 80% of earnings growth and 90% of capital spending growth since ChatGPT launched.\"</p>\n<p>The Magnificent 7 make up over 30% of the S&amp;P 500. That's MORE concentration than the dot-com bubble. And analyst Erwan Jacob said \"It remains unclear whether such expenditures will be met with corresponding revenues.\"</p>\n<p>They're spending hundreds of billions but nobody knows if they'll ever make it back.</p>\n<p>Remember the Big Short guy (Michael Burry) ? He's been shorting Nvidia and Palantir for months. Palantir CEO called him \"bats--- crazy\" for shorting AI stocks. Burry's whole thing is spotting bubbles before they pop. He shorted subprime mortgages when everyone said housing only goes up. Now he's shorting AI when everyone says AI only goes up.</p>\n<p>Then this week happened. Palantir down 12%. Nvidia down 10%.</p>\n<ul>\n<li>Goldman Sachs CEO warned at a Hong Kong conference that stocks could see \"drawdowns of 10% to 15%.\"</li>\n<li>Morgan Stanley CEO said \"We should welcome the possibility that there would be drawdowns that are not driven by some sort of macro cliff effect.\"</li>\n</ul>\n<p>They're basically saying yeah it's gonna drop but don't panic it's healthy.</p>\n<p>Nvidia trades at 52x forward earnings. That means you're paying $52 for every $1 of profit they'll make next year. Palantir? 200x forward earnings. For comparison the S&amp;P 500 without the Magnificent 7 trades at 15.5x.</p>\n<p>So these AI stocks are 3-13 times more expensive than everything else based purely on the belief that AI will make them wildly profitable in the future.</p>\n<p>But right now? Only Meta is showing actual AI revenue. And even they just lost $200 billion in market value last week because Zuckerberg couldn't explain what they're building.</p>\n<p>Nvidia's CEO and CFO have been dumping their own shares in recent days.</p>\n<p>That's not exactly a vote of confidence.</p>\n<p>Sure they might have pre-planned selling schedules for tax purposes or whatever. But the optics are terrible when your stock is down 10% for the week.</p>\n<p>There's also a US government shutdown happening right now. FAA reducing air traffic by 10% across 40 markets starting Friday because of staffing problems.</p>\n<p>That's creating broader market uncertainty on top of the AI bubble concerns.</p>\n<p>When there's no economic data coming out because the government's shut down investors get nervous. They don't know if things are good or bad so they just sell.</p>\n<p>Nvidia reports Q3 earnings on November 19. Just 11 days away.</p>\n<p>Analysts expect it to be strong. Jensen Huang said total shipments of Blackwell and Rubin platforms plus networking products total $500 billion over 2025-2026.</p>\n<p>TSMC the company that manufactures Nvidia's chips said AI demand is strong. Oracle said demand is strong.</p>\n<p>So earnings will probably beat expectations.</p>\n<p>What’s interesting is that after Nvidia’s last earnings report, despite it being very strong the stock still fell roughly 4% in the days that followed. And now, we’re seeing this…</p>\n<p>Good earnings don't always mean stock goes up. Especially when valuations are stretched and the market's nervous about bubbles.</p>\n<p>Now the question is, what happens next? </p>\n<ul>\n<li>Nasdaq is tracking for its biggest weekly decline since April down 2.8%.</li>\n<li>VIX volatility index jumped 9%. That's the fear gauge. When it spikes people are getting nervous.</li>\n<li>Analysts are predicting Nvidia will stay range-bound between $175 and $210 for the next 4-8 weeks. Support at $180. Resistance at $210-212. If it breaks below $180 next stop is $160 which would be a 15% drop from current levels.</li>\n</ul>\n<p>Nvidia is an \"unbelievable company\" but warned some AI stocks including Nvidia may be overvalued.</p>\n<p>The question isn't whether AI is important. That's settled. The question is whether investors paid too much too fast.</p>\n<p>People are comparing this to dot-com now. Amazon stock was $5 in 1999. Lost 90% of its value when the bubble popped. Took decades to recover.</p>\n<p>Some dot-com companies went out of business altogether just years after being valued in billions.</p>\n<p>Nvidia's not going out of business. They're the dominant AI chipmaker with massive demand and a huge moat.</p>\n<p>But none of that means the market can't overvalue the stock in the short term.</p>\n<p>In the past few years alone Nvidia has had temporary drops of 20-40% multiple times. It always recovered. But those drawdowns hurt if you bought at the top.</p>\n<p><strong>TLDR</strong></p>\n<p>Nvidia dropped 10% in one week. Lost $200 billion in market value. Trump's AI czar David Sacks said \"no federal bailout for AI\" after OpenAI CFO suggested government should backstop the industry. Market panicked. Michael Burry who shorted housing in 2008 is shorting Nvidia and Palantir. Goldman and Morgan Stanley CEOs warning of 10-20% drawdowns. Magnificent 7 stocks make up over 30% of S&amp;P 500 more than dot-com bubble. JP Morgan found AI stocks account for 75% of S&amp;P returns but unclear if spending will meet revenues. Nvidia trades at 52x forward earnings Palantir at 200x. Only Meta showing actual AI revenue and they lost $200B last week. Nvidia CEO and CFO selling their own shares. Earnings Nov 19 expected to be strong but last time stock dropped 4% after positive earnings. Nasdaq down 2.8% for week worst since April. Analysts say Nvidia range-bound $175-$210. Question isn't whether AI is important it's whether investors paid too much too fast.</p>\n<p><strong>Sources:</strong></p>\n<p><a href=\"https://www.nbcnews.com/business/markets/stocks-crypto-gold-tumble-palantir-nvidia-rcna241913\">https://www.nbcnews.com/business/markets/stocks-crypto-gold-tumble-palantir-nvidia-rcna241913</a></p>",
            "date_published": "2025-11-10T02:40:10+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1orewim",
            "url": "/r/ArtificialInteligence/comments/1orewim/meta_just_lost_200_billion_in_one_week_zuckerberg/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1orewim/meta_just_lost_200_billion_in_one_week_zuckerberg/",
            "title": "Meta just lost $200 billion in one week. Zuckerberg spent 3 hours trying to explain what they're building with AI. Nobody bought it.",
            "content_html": "<p>So last week Meta reported earnings. Beat expectations on basically everything. Revenue up 26%. $20 billion in profit for the quarter but Stock should've gone up right? Instead it tanked. Dropped 12% in two days. Lost over $200 billion in market value. Worst drop since 2022.</p>\n<p>Why? Because Mark Zuckerberg announced they're spending way more on AI than anyone expected. And when investors asked what they're actually getting for all that money he couldn't give them a straight answer.</p>\n<p><strong>The spending</strong>: Meta raised their 2025 capital expenditure forecast to $70-72 billion. That's just this year. Then Zuckerberg said next year will be \"notably larger.\" Didn't give a number. Just notably larger. Reports came out saying Meta's planning $600 billion in AI infrastructure spending over the next three years. For context that's more than the GDP of most countries. Operating expenses jumped $7 billion year over year. Nearly $20 billion in capital expense. All going to AI talent and infrastructure.</p>\n<p>During the earnings call investors kept asking the same question. What are you building? When will it make money? Zuckerberg's answer was basically \"trust me bro we need the compute for superintelligence.\"</p>\n<p>He said \"The right thing to do is to try to accelerate this to make sure that we have the compute that we need both for the AI research and new things that we're doing.\"</p>\n<p>Investors pressed harder. Give us specifics. What products? What revenue?</p>\n<p>His response: \"We're building truly frontier models with novel capabilities. There will be many new products in different content formats. There are also business versions. This is just a massive latent opportunity.\" Then he added \"there will be more to share in the coming months.\"</p>\n<p>That's it. Coming months. Trust the process. The market said no thanks and dumped the stock.</p>\n<p>Other companies are spending big on AI too. Google raised their capex forecast to $91-93 billion. Microsoft said spending will keep growing. But their stocks didn't crash. Why Because they can explain what they're getting.</p>\n<ul>\n<li>Microsoft has Azure. Their cloud business is growing because enterprises are paying them to use AI tools. Clear revenue. Clear product. Clear path to profit.</li>\n<li>Google has search. AI is already integrated into their ads and recommendations. Making them money right now.</li>\n<li>Nvidia sells the chips everyone's buying. Direct revenue from AI boom.</li>\n<li>OpenAI is spending crazy amounts but they're also pulling in $20 billion a year in revenue from ChatGPT which has 300 million weekly users.</li>\n</ul>\n<p>Meta? They don't have any of that.</p>\n<p>98% of Meta's revenue still comes from ads on Facebook Instagram and WhatsApp. Same as it's always been. They're spending tens of billions on AI but can't point to a single product that's generating meaningful revenue from it.</p>\n<p>The Metaverse déjà vu is that This is feeling like 2021-2022 all over again.</p>\n<p>Back then Zuckerberg bet everything on the Metaverse. Changed the company name from Facebook to Meta. Spent $36 billion on Reality Labs over three years. Stock crashed 77% from peak to bottom. Lost over $600 billion in market value.</p>\n<p>Why? Because he was spending massive amounts on a vision that wasn't making money and investors couldn't see when it would.</p>\n<p>Now it's happening again. Except this time it's AI instead of VR.</p>\n<p>What Meta's actually building?</p>\n<p>During the call Zuckerberg kept mentioning their \"Superintelligence team.\" Four months ago he restructured Meta's AI division. Created a new group focused on building superintelligence. That's AI smarter than humans.</p>\n<ul>\n<li>He hired Alexandr Wang from Scale AI to lead it. Paid $14.3 billion to bring him in.</li>\n<li>They're building two massive data centers. Each one uses as much electricity as a small city.</li>\n</ul>\n<p>But when analysts asked what products will come out of all this Zuckerberg just said \"we'll share more in coming months.\"</p>\n<p>He mentioned Meta AI their ChatGPT competitor. Mentioned something called Vibes. Hinted at \"business AI\" products.</p>\n<p>But nothing concrete. No launch dates. No revenue projections. Just vague promises.</p>\n<p>The only thing he could point to was AI making their current ad business slightly better. More engagement on Facebook and Instagram. 14% higher ad prices.</p>\n<p>That's nice but it doesn't justify spending $70 billion this year and way more next year.</p>\n<p><strong>Here's the issue -</strong> Zuckerberg's betting on superintelligence arriving soon. He said during the call \"if superintelligence arrives sooner we will be ideally positioned for a generational paradigm shift.\" But what if it doesn't? What if it takes longer?</p>\n<p>His answer: \"If it takes longer then we'll use the extra compute to accelerate our core business which continues to be able to profitably use much more compute than we've been able to throw at it.\"</p>\n<p>So the backup plan is just make ads better. That's it.</p>\n<p>You're spending $600 billion over three years and the contingency is maybe your ad targeting gets 20% more efficient.</p>\n<p>Investors looked at that math and said this doesn't add up.</p>\n<p>So what's Meta actually buying with all this cash?</p>\n<ul>\n<li>Nvidia chips. Tons of them. H100s and the new Blackwell chips cost $30-40k each. Meta's buying hundreds of thousands.</li>\n<li>Data centers. Building out massive facilities to house all those chips. Power. Cooling. Infrastructure.</li>\n<li>Talent. Paying top AI researchers and engineers. Competing with OpenAI Google and Anthropic for the same people.</li>\n</ul>\n<p>And here's the kicker. A lot of that money is going to other big tech companies.</p>\n<ul>\n<li>They rent cloud capacity from AWS Google Cloud and Azure when they need extra compute. So Meta's paying Amazon Google and Microsoft.</li>\n<li>They buy chips from Nvidia. Software from other vendors. Infrastructure from construction companies.</li>\n</ul>\n<p>It's the same circular spending problem we talked about before. These companies are passing money back and forth while claiming it's economic growth.</p>\n<p><strong>The comparison that hurts</strong> - Sam Altman can justify OpenAI's massive spending because ChatGPT is growing like crazy. 300 million weekly users. $20 billion annual revenue. Satya Nadella can justify Microsoft's spending because Azure is growing. Enterprise customers paying for AI tools.</p>\n<p>What can Zuckerberg point to? Facebook and Instagram users engaging slightly more because of AI recommendations. That's it.</p>\n<p>During the call he said \"it's pretty early but I think we're seeing the returns in the core business.\"</p>\n<p>Investors heard \"pretty early\" and bailed.</p>\n<p><strong>Why this matters :</strong></p>\n<p>Meta is one of the Magnificent 7 stocks that make up 37% of the S&amp;P 500. When Meta loses $200 billion in market value that drags down the entire index. Your 401k probably felt it.And this isn't just about Meta. It's a warning shot for all the AI spending happening right now.If Wall Street starts questioning whether these massive AI investments will actually pay off we could see a broader sell-off. Microsoft, Amazon, Alphabet all spending similar amounts. If Meta can't justify it what makes their spending different?</p>\n<p>The answer better be really good or this becomes a pattern.</p>\n<p><strong>TLDR</strong></p>\n<p>Meta reported strong Q3 earnings. Revenue up 26% $20 billion profit. Then announced they're spending $70-72 billion on AI in 2025 and \"notably larger\" in 2026. Reports say $600 billion over three years. Zuckerberg couldn't explain what products they're building or when they'll make money. Said they need compute for \"superintelligence\" and there will be \"more to share in coming months.\" Stock crashed 12% lost $200 billion in market value. Worst drop since 2022. Investors comparing it to 2021-2022 metaverse disaster when Meta spent $36B and stock lost 77%. 98% of revenue still comes from ads. No enterprise business like Microsoft Azure or Google Cloud. Only AI product is making current ads slightly better. One analyst said it mirrors metaverse spending with unknown revenue opportunity. Meta's betting everything on superintelligence arriving soon. If it doesn't backup plan is just better ad targeting. Wall Street not buying it anymore.</p>\n<p>Sources:</p>\n<p><a href=\"https://techcrunch.com/2025/11/02/meta-has-an-ai-product-problem/\">https://techcrunch.com/2025/11/02/meta-has-an-ai-product-problem/</a></p>",
            "date_published": "2025-11-08T03:25:50+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1ojixgq",
            "url": "/r/ArtificialInteligence/comments/1ojixgq/meta_says_it_downloaded_all_that_porn_for/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ojixgq/meta_says_it_downloaded_all_that_porn_for/",
            "title": "Meta Says It Downloaded All that porn for \"personal use\" not to train AI",
            "content_html": "<p><a href=\"https://arstechnica.com/tech-policy/2025/10/meta-says-porn-downloads-on-its-ips-were-for-personal-use-not-ai-training/\">https://arstechnica.com/tech-policy/2025/10/meta-says-porn-downloads-on-its-ips-were-for-personal-use-not-ai-training/</a></p>\n<p>The move comes after Strike 3 Holdings discovered illegal downloads of some of its adult films on Meta corporate IP addresses, as well as other downloads that Meta allegedly concealed using a “stealth network” of 2,500 “hidden IP addresses.” Accusing Meta of stealing porn to secretly train an unannounced adult version of its AI model powering Movie Gen, Strike 3 sought damages that could have exceeded $350 million, TorrentFreak <a href=\"https://torrentfreak.com/meta-pirated-adult-film-downloads-were-for-personal-use-not-ai-training/\">reported</a>.</p>\n<p><strong>My thoughts:</strong> So-- how does someone watch $350M worth of porn?</p>",
            "date_published": "2025-10-29T22:38:18+00:00",
            "authors": [
                {
                    "name": "maphingis",
                    "url": "https://www.reddit.com/user/maphingis"
                }
            ]
        },
        {
            "id": "1oj52xx",
            "url": "/r/ArtificialInteligence/comments/1oj52xx/tech_companies_are_firing_everyone_to_fund_ai_but/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oj52xx/tech_companies_are_firing_everyone_to_fund_ai_but/",
            "title": "Tech companies are firing everyone to \"fund AI.\" But they're spending that money on each other. And nobody's making profit yet.",
            "content_html": "<p>So, Amazon announced they're laying off 30k people. This is set to be the largest layoff in the company’s history. That's on top of Microsoft cutting 15k, Meta cutting 3.6k and Google cutting hundreds this year. Over 180,000 tech workers laid off in 2025 alone.</p>\n<p>But here's what nobody's connecting and it's actually insane when you connect all the dots. These same companies are spending over $300 billion on AI this year. So they're firing people to \"free up capital for AI investments.\" Then spending that money buying stuff from each other. And none of it's making them money yet.</p>\n<p>Let me break down what's actually happening:</p>\n<p>Layoff is just an excuse - Every company's using the same line. \"We're restructuring for AI.\" \"AI will handle these tasks now.\" \"We need to fund AI initiatives.\"</p>\n<p>Zuckerberg said AI could be ready this year to \"effectively be a sort of mid-level engineer capable of writing code.\", Amazon CEO Andy Jassy said \"we will need fewer people doing some of the jobs that are being done today.\", Salesforce laid off 4,000 customer support staff and their CEO literally said it was because of \"increasing AI adoption.\", IBM cut 8,000 jobs in HR because \"AI tools take over routine administrative tasks.\"</p>\n<p>So the story is AI's now capable of doing these jobs right? That's why they gotta fire everyone. Except the thing is - They're not saving that money. They're spending way more than they're saving.</p>\n<p>and <strong>where the money is really going?</strong> They're buying from each other - </p>\n<ul>\n<li>Microsoft buys Nvidia chips. Rents cloud capacity from Amazon AWS. Buys software from other companies. </li>\n<li>Amazon buys Nvidia chips. Uses Microsoft software. Rents capacity they can't build fast enough.</li>\n<li>Meta buys Nvidia chips. Rents infrastructure from Google Cloud and AWS</li>\n<li>Apple doesn't even build AI infrastructure. They rent everything from Google AWS and Azure. So Apple pays Google. Google pays Nvidia. Nvidia pays TSMC for manufacturing. Microsoft pays Amazon. Amazon pays Microsoft. Meta pays everyone.</li>\n</ul>\n<p>They're literally just passing money in circles. The \"Magnificent 7\" stocks/companies Apple, Microsoft, Nvidia, Amazon, Alphabet, Meta and Tesla, have a combined market cap of $17 trillion. For reference US GDP is $30 trillion. But their combined revenue in 2024? $2.2 trillion. Net profit? around $550 billion.</p>\n<p>They're trading at an average P/E ratio of 35. That means investors are paying $35 for every $1 of profit. The S&amp;P 500 without them? P/E of 15.5. Why the premium? Because everyone believes AI is going to make them wildly profitable in the future.</p>\n<p>But right now they're just spending money. On each other. Creating the illusion of growth.</p>\n<p>But here's the trap. These companies CAN'T stop now. Because if any of them stops their stock crashes. Investors think they're giving up on AI and falling behind. So they're locked in an arms race. Have to keep spending to maintain stock prices even if the spending doesn't generate returns.</p>\n<p>Microsoft, Amazon, Alphabet Meta increased capex by 42% in 2024. Planning another 17% increase in 2025. $244 billion total spend next year across just those 4.</p>\n<p>and it's going to Mostly Nvidia. Who uses it to buy manufacturing from TSMC. Who uses it to buy equipment from ASML. Money moving in circles.</p>\n<p><strong>Connecting the dots</strong></p>\n<p>So let me spell this out. These companies are:</p>\n<ol>\n<li>Laying off hundreds of thousands of workers to \"fund AI\"</li>\n<li>Spending way more on AI than they're saving from layoffs</li>\n<li>Buying most of that AI infrastructure from each other</li>\n<li>Not making any actual profit from AI yet</li>\n<li>Can't stop spending or their stocks crash</li>\n<li>Creating the illusion of economic growth through spending alone</li>\n</ol>\n<p>So when you hear \"stock market hit a new record\" that means these 7 companies went up. The other 493? They contributed 46%. And why did these 7 go up? Because they're spending hundreds of billions on AI. Which inflates their valuations. Which makes the S&amp;P go up. Which makes everyone think the economy's great. Your 401k? Probably heavy in S&amp;P 500 index funds. Which means 37% of your retirement is bet on these 7 companies and their AI spending paying off eventually.</p>\n<p>And we're all just along for the ride.</p>\n<p><strong>TLDR</strong></p>\n<p>Amazon laid off 30,000 people yesterday. Microsoft 15,000 this year. Meta 3,600. Intel 22,000. Over 180,000 tech workers fired in 2025. All saying it's to \"fund AI initiatives.\" But they're spending $300B+ on AI way more than they're saving from layoffs. Most of that money going to each other in circles. Apple rents AI infrastructure from Google AWS Azure. Everyone buys Nvidia chips. They pay each other for cloud capacity. AI spending added 0.5% to GDP. Without it GDP would've grown 0.6%. Only Meta showing actual AI revenue. Everyone else just spending hoping it pays off. Goldman Sachs and Sequoia reports say ROI is nonexistent so far. But they can't stop spending or stocks crash. Locked in arms race. The 7 biggest tech companies are 37% of S&amp;P 500. Made up 54% of gains in 2024. Your 401k is probably 37% bet on AI spending paying off. If it doesn't they're massively overvalued at 35x earnings. Firing people to fund buying stuff from each other while making no profit yet.</p>\n<p><strong>Source:</strong></p>\n<p><a href=\"https://www.cnbc.com/2025/10/27/amazon-targets-as-many-as-30000-corporate-job-cuts.html\">https://www.cnbc.com/2025/10/27/amazon-targets-as-many-as-30000-corporate-job-cuts.html</a></p>",
            "date_published": "2025-10-29T13:50:54+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1oi8cbi",
            "url": "/r/ArtificialInteligence/comments/1oi8cbi/amazon_is_laying_off_14000_employees_because_of_ai/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1oi8cbi/amazon_is_laying_off_14000_employees_because_of_ai/",
            "title": "Amazon is laying off 14,000 employees because of AI",
            "content_html": "<p>Amazon plans to cut 14,000 corporate jobs—its largest layoffs in years—explicitly to invest in AI. HR chief Beth Galetti called AI \"the most transformative technology since the internet,\" while CEO Andy Jassy warned months ago that the company would need \"fewer people\" as AI drives efficiency.</p>\n<p>This isn't just Amazon's story; it's a warning. White-collar roles once seen as safe are vanishing first, replaced by systems that prioritize speed over human judgment. The result? Growing unemployment, skill gaps, and dangerous over-reliance on AI.</p>\n<p><a href=\"https://www.nbcnews.com/business/business-news/amazon-layoffs-thousands-corporate-artificial-intelligence-rcna240155\">https://www.nbcnews.com/business/business-news/amazon-layoffs-thousands-corporate-artificial-intelligence-rcna240155</a></p>",
            "date_published": "2025-10-28T12:43:43+00:00",
            "authors": [
                {
                    "name": "HumanSoulAI",
                    "url": "https://www.reddit.com/user/HumanSoulAI"
                }
            ]
        },
        {
            "id": "1odgfys",
            "url": "/r/ArtificialInteligence/comments/1odgfys/i_was_once_an_ai_true_believer_now_i_think_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1odgfys/i_was_once_an_ai_true_believer_now_i_think_the/",
            "title": "I was once an AI true believer. Now I think the whole thing is rotting from the inside.",
            "content_html": "<p>I used to be all-in on large language models. Built automations, client tools, business workflows..... hell, entire processes around GPT and similar systems. I thought we were seeing the dawn of a new era. I was wrong.</p>\n<p>Nothing is reliable. If your workflow needs any real accuracy, consistency, or reproducibility, these models are a liability. Ask the same question twice and get two different answers. Small updates silently break entire chains of logic. It’s like building on quicksand.</p>\n<p>That old line, <em>“this is the worst it’ll ever be,”</em> is bullshit. GPT-4.1 workflows that ran perfectly are now useless on GPT-5. Things regress, behaviors shift, context windows hallucinate. You can’t version-lock intelligence that doesn’t actually understand what it’s doing.</p>\n<p>The time and money that go into “guardrailing,” “safety layers,” and “compliance” dwarfs just paying a human to do the work correctly. Worse, the safeguards rarely even function. You end up debugging an AI that won’t admit it’s wrong, wrapped in another AI that can’t explain why.</p>\n<p>And then there’s the hype machine. Every company is tripping over itself to bolt “AI-powered” onto products that don’t need it. Copilot, ChatGPT, Gemini—they’re all mediocre at best, and big tech is starting to realize it. Real productivity gains are vanishingly rare. The MASSIVE reluctance of the business world to say something is simply due to embarrassment of admission. CEO's are literally scrambling to re-hire, or pay  people like ME to come in and fix some truly horrific situations. (I am too busy fixing all of the broken shit on my end to even think about having the time to do this for others. But the phone calls and emails are piling up. Other consultants I speak with say the same thing. Copilot easily being the most requested to be fixed).</p>\n<p>Random, unreliable, and broken systems with zero audit requirements in the US. And I mean ZERO accountability. The amount of plausible deniability massive companies have to purposely or inadvertently harm people is overwhelming. These systems now influence hiring, pay, healthcare, credit, and legal outcomes without auditability, transparency, or regulation. I work with these tools every day, and have from jump. I am confident we are at minimum in a largely stalled performance drought, and at worst, witnessing the absolute floors starting to crumble. </p>",
            "date_published": "2025-10-22T18:31:38+00:00",
            "authors": [
                {
                    "name": "shallow-pedantic",
                    "url": "https://www.reddit.com/user/shallow-pedantic"
                }
            ]
        },
        {
            "id": "1occrfa",
            "url": "/r/ArtificialInteligence/comments/1occrfa/amazon_hopes_to_replace_600000_us_workers_with/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1occrfa/amazon_hopes_to_replace_600000_us_workers_with/",
            "title": "Amazon hopes to replace 600,000 US workers with robots, according to leaked documents",
            "content_html": "<p><a href=\"https://www.theverge.com/news/803257/amazon-robotics-automation-replace-600000-human-jobs\">https://www.theverge.com/news/803257/amazon-robotics-automation-replace-600000-human-jobs</a></p>\n<p>Amazon is so convinced this automated future is around the corner that it has started developing plans to mitigate the fallout in communities that may lose jobs. Documents show the company has considered building an image as a “good corporate citizen” through greater participation in community events such as parades and Toys for Tots.</p>\n<p>The documents contemplate avoiding using terms like “automation” and “A.I.” when discussing robotics, and instead use terms like “advanced technology” or replace the word “robot” with “cobot,” which implies collaboration with humans.</p>",
            "date_published": "2025-10-21T13:19:54+00:00",
            "authors": [
                {
                    "name": "GravyMealTeam6",
                    "url": "https://www.reddit.com/user/GravyMealTeam6"
                }
            ]
        },
        {
            "id": "1obarts",
            "url": "/r/ArtificialInteligence/comments/1obarts/google_had_the_chatbot_ready_before_openai_they/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1obarts/google_had_the_chatbot_ready_before_openai_they/",
            "title": "Google had the chatbot ready before OpenAI. They were too scared to ship it. Then lost $100 billion in one day trying to catch up.",
            "content_html": "<p>So this whole thing is actually wild when you know the full story.</p>\n<p>It was the time 30th November 2022, when OpenAI introduced ChatGPT to the world for the very first time. Goes viral instantly. 1 million users in 5 days. 100 million in 2 months. Fastest growing platform in history.</p>\n<p>That launch was a wake-up call for the entire tech industry. Google, the long-time torchbearer of AI, suddenly found itself playing catch-up with, as CEO Sundar Pichai described it, “this little company in San Francisco called OpenAI” that had come out swinging with “this product ChatGPT.”</p>\n<p>Turns out, Google already had its own chatbot called LaMDA (Language Model for Dialogue Applications). A conversational AI chatbot, quietly waiting in the wings. Pichai later revealed that it was ready, and could’ve launched months before ChatGPT. As he said himself - “We knew in a different world, we would've probably launched our chatbot maybe a few months down the line.”</p>\n<p>So why didn't they?   </p>\n<p>Reputational risk. Google was terrified of what might happen if they released a chatbot that gave wrong answers. Or said something racist. Or spread misinformation. Their whole business is built on trust. Search results people can rely on. If they released something that confidently spewed BS it could damage the brand. So they held back. Kept testing. Wanted it perfect before releasing to the public. Then ChatGPT dropped and changed everything.</p>\n<p>Three weeks after ChatGPT launched, things had started to change, Google management declares \"Code Red.\" For Google this is like pulling the fire alarm. All hands on deck. The New York Times got internal memos and audio recordings. Sundar Pichai upended the work of numerous groups inside the company. Teams in Research Trust and Safety and other departments got reassigned. Everyone now working on AI.</p>\n<p>They even brought in the founders. Larry Page and Sergey Brin. Both had stepped back from day to day operations years ago. Now they're in emergency meetings discussing how to respond to ChatGPT. One investor who oversaw Google's ad team from 2013 to 2018 said ChatGPT could prevent users from clicking on Google links with ads. That's a problem because ads generated $208 billion in 2021. 81% of Alphabet's revenue.</p>\n<p>Pichai said \"For me when ChatGPT launched contrary to what people outside felt I was excited because I knew the window had shifted.\" </p>\n<p>While all this was happening, Microsoft CEO Satya Nadella gave an interview after investing $10 billion in OpenAI, calling Google the “800-pound gorilla” and saying: \"With our innovation, they will definitely want to come out and show that they can dance. And I want people to know that we made them dance.\"</p>\n<p>So Google panicked. Spent months being super careful then suddenly had to rush everything out in weeks.</p>\n<p>February 6 2023. They announce Bard. Their ChatGPT competitor. They make a demo video showing it off. Someone asks Bard \"What new discoveries from the James Webb Space Telescope can I tell my 9 year old about?\" Bard answers with some facts including \"JWST took the very first pictures of a planet outside of our own solar system.\"</p>\n<p>That's completely wrong. The first exoplanet picture was from 2004. James Webb launched in 2021. You could literally Google this to check. The irony is brutal. The company that made Google couldn't fact check their own AI's first public answer.</p>\n<p>Two days later they hold this big launch event in Paris. Hours before the event Reuters reports on the Bard error. Goes viral immediately.</p>\n<p>That same day Google's stock tanks. Drops 9%. $100 billion gone. In one day. Because their AI chatbot got one fact wrong in a demo video. Next day it drops another 5%. Total loss over $160 billion in two days. Microsoft's stock went up 3% during this.</p>\n<p>What gets me is Google was actually right to be cautious. ChatGPT does make mistakes all the time. Hallucinates facts. Can't verify what it's saying. But OpenAI just launched it anyway as an experiment and let millions of people test it. Google wanted it perfect. But trying to avoid damage from an imperfect product they rushed out something broken and did way more damage.</p>\n<p>A former Google employee told Fox Business that after the Code Red meeting execs basically said screw it we gotta ship. Said they abandoned their AI safety review process. Took shortcuts. Just had to get something out there. So they spent months worried about reputation then threw all caution out when competitors forced their hand.</p>\n<p>Bard eventually became Gemini and it's actually pretty good now. But that initial disaster showed even Google with all their money and AI research can get caught sleeping.</p>\n<p>The whole situation is wild. They hesitated for a few months and it cost them $160 billion and their lead in AI. But also rushing made it worse. Both approaches failed. Meanwhile OpenAI's \"launch fast and fix publicly\" worked. Microsoft just backed them and integrated the tech without taking the risk themselves.</p>\n<p><strong>TLDR</strong>  </p>\n<p>Google had chatbot ready before ChatGPT. Didn't launch because scared of reputation damage. ChatGPT went viral Nov 2022. Google called Code Red Dec 2022. Brought back founders for emergency meetings. Rushed Bard launch Feb 2023. First demo had wrong fact about space telescope. Stock dropped 9% lost $100B in one day. Dropped another 5% next day. $160B gone total. Former employee says they abandoned safety process to catch up. Being too careful cost them the lead then rushing cost them even more.</p>\n<p>Sources - </p>\n<p><a href=\"https://www.thebridgechronicle.com/tech/sundar-pichai-google-chatgpt-ai-openai-first-mp99\">https://www.thebridgechronicle.com/tech/sundar-pichai-google-chatgpt-ai-openai-first-mp99</a></p>\n<p><a href=\"https://www.businessinsider.com/google-bard-ai-chatbot-not-ready-alphabet-hennessy-chatgpt-competitor-2023-2\">https://www.businessinsider.com/google-bard-ai-chatbot-not-ready-alphabet-hennessy-chatgpt-competitor-2023-2</a></p>",
            "date_published": "2025-10-20T04:36:44+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1o9svah",
            "url": "/r/ArtificialInteligence/comments/1o9svah/nvidia_ceo_told_everyone_to_skip_coding_and_learn/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o9svah/nvidia_ceo_told_everyone_to_skip_coding_and_learn/",
            "title": "Nvidia CEO told everyone to skip coding and learn AI. Then told everyone to skip coding and become plumbers.",
            "content_html": "<p>So Jensen Huang keeps saying the most contradictory stuff and I don't get why nobody's calling it out.</p>\n<p>February 2024. World Government Summit. Huang gets on stage and drops this: \"Nobody needs to program anymore. AI handles it. Programming language is human now. Everybody in the world is now a programmer.\" Tells people to focus on biology manufacturing farming. Not coding. AI's got that covered.</p>\n<p>I remember seeing that and thinking okay so I guess all these CS majors are screwed now.</p>\n<p>October 2025. Same guy. Complete 180.</p>\n<p>Now he's telling Gen Z skip coding and become plumbers, electricians and carpenters instead. Says AI boom creating massive demand for skilled trades. Data centers need physical infrastructure.</p>\n<p>He said - \"If you're an electrician, a plumber. a carpenter we're going to need hundreds of thousands of them. If I were a student today I'd choose physical sciences over software.\"</p>\n<p>I had to read this twice. So are we all programmers now or should we all be plumbers or electricians ? Which one is it?</p>\n<p>Here's what clicked for me -</p>\n<p>Huang runs Nvidia right. Makes the chips that power AI. His whole job is hyping AI so people buy more GPUs. When he says \"everyone's a programmer now\" he's literally just selling you on AI tools. More people using AI means more compute power needed means more Nvidia chips getting sold. When he says \"become a plumber\" it's because they're building all these massive data centers and can't find enough electricians and plumbers to actually wire them up and keep them cool.</p>\n<p>Both statements just help Nvidia make money. Has nothing to do with actual career advice for you or me. It's like <strong>when everyone is digging for gold sell shovels</strong>.</p>\n<p>Okay to be fair he's kinda right about trades being in demand. Electricians, plumbers or carpenters can make serious money right now like six figures in some cities. But that's not because of AI data centers. That's because for the past 20 years everyone kept pushing kids to go to college and nobody wanted to learn trades. So now there's this massive shortage. AI boom is just adding to demand that was already there. Didn't create it.</p>\n<p>Also it's kinda funny how this billionaire CEO whose company needs AI to succeed is telling working class kids to become plumbers while his own kids probably went to like Stanford or MIT.</p>\n<p><strong>TLDR</strong></p>\n<p>Jensen Huang said everyone's a programmer now because of AI back in February. Then in October said forget coding become a plumber instead. Both statements just help Nvidia make money. First one sells AI tools second one fixes their labor shortage for building data centers. A human just beat OpenAI's AI in a coding competition even with all these tools. We've been hearing coding is dead for 30 years and still don't have enough programmers. Trades demand is real but it's not because of AI. Don't base your whole future on what some billionaire needs for his quarterly earnings report.</p>\n<p><strong>Sources:</strong></p>\n<p>Jensen Huang plumber statement: <a href=\"https://fortune.com/2025/09/30/nvidia-ceo-jensen-huang-demand-for-gen-z-skilled-trade-workers-electricans-plumbers-carpenters-data-center-growth-six-figure-salaries/\">https://fortune.com/2025/09/30/nvidia-ceo-jensen-huang-demand-for-gen-z-skilled-trade-workers-electricans-plumbers-carpenters-data-center-growth-six-figure-salaries/</a></p>\n<p>Jensen Huang Dubai statement: <a href=\"https://www.techradar.com/pro/nvidia-ceo-predicts-the-death-of-coding-jensen-huang-says-ai-will-do-the-work-so-kids-dont-need-to-learn\">https://www.techradar.com/pro/nvidia-ceo-predicts-the-death-of-coding-jensen-huang-says-ai-will-do-the-work-so-kids-dont-need-to-learn</a></p>",
            "date_published": "2025-10-18T11:03:44+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1o6cow1",
            "url": "/r/ArtificialInteligence/comments/1o6cow1/anthropic_cofounder_admits_he_is_now_deeply/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1o6cow1/anthropic_cofounder_admits_he_is_now_deeply/",
            "title": "Anthropic cofounder admits he is now \"deeply afraid\" ... \"We are dealing with a real and mysterious creature, not a simple and predictable machine ... We need the courage to see things as they are.\"",
            "content_html": "<p>He wrote:</p>\n<p>\"<strong>CHILDREN IN THE DARK</strong><br />\nI remember being a child and after the lights turned out I would look around my bedroom and I would see shapes in the darkness and I would become afraid – afraid these shapes were creatures I did not understand that wanted to do me harm. And so I’d turn my light on. And when I turned the light on I would be relieved because the creatures turned out to be a pile of clothes on a chair, or a bookshelf, or a lampshade.</p>\n<p>Now, in the year of 2025, we are the child from that story and the room is our planet. But when we turn the light on we find ourselves gazing upon true creatures, in the form of the powerful and somewhat unpredictable AI systems of today and those that are to come. And there are many people who desperately want to believe that these creatures are nothing but a pile of clothes on a chair, or a bookshelf, or a lampshade. And they want to get us to turn the light off and go back to sleep.</p>\n<p>In fact, some people are even spending tremendous amounts of money to convince you of this – that’s not an artificial intelligence about to go into a hard takeoff, it’s just a tool that will be put to work in our economy. It’s just a machine, and machines are things we master.</p>\n<p>But make no mistake: what we are dealing with is a real and mysterious creature, not a simple and predictable machine.</p>\n<p>And like all the best fairytales, the creature is of our own creation. Only by acknowledging it as being real and by mastering our own fears do we even have a chance to understand it, make peace with it, and figure out a way to tame it and live together.</p>\n<p>And just to raise the stakes, in this game, you are guaranteed to lose if you believe the creature isn’t real. Your only chance of winning is seeing it for what it is.</p>\n<p>The central challenge for all of us is characterizing these strange creatures now around us and ensuring that the world sees them as they are – not as people wish them to be, which are not creatures but rather a pile of clothes on a chair.</p>\n<p><strong>WHY DO I FEEL LIKE THIS</strong><br />\nI came to this view reluctantly. Let me explain: I’ve always been fascinated by technology. In fact, before I worked in AI I had an entirely different life and career where I worked as a technology journalist.</p>\n<p>I worked as a tech journalist because I was fascinated by technology and convinced that the datacenters being built in the early 2000s by the technology companies were going to be important to civilization. I didn’t know exactly how. But I spent years reading about them and, crucially, studying the software which would run on them. Technology fads came and went, like big data, eventually consistent databases, distributed computing, and so on. I wrote about all of this. But mostly what I saw was that the world was taking these gigantic datacenters and was producing software systems that could knit the computers within them into a single vast quantity, on which computations could be run.</p>\n<p>And then machine learning started to work. In 2012 there was the imagenet result, where people trained a deep learning system on imagenet and blew the competition away. And the key to their performance was using more data and more compute than people had done before.</p>\n<p>Progress sped up from there. I became a worse journalist over time because I spent all my time printing out arXiv papers and reading them. Alphago beat the world’s best human at Go, thanks to compute letting it play Go for thousands and thousands of years.</p>\n<p>I joined OpenAI soon after it was founded and watched us experiment with throwing larger and larger amounts of computation at problems. GPT1 and GPT2 happened. I remember walking around OpenAI’s office in the Mission District with Dario. We felt like we were seeing around a corner others didn’t know was there. The path to transformative AI systems was laid out ahead of us. And we were a little frightened.</p>\n<p>Years passed. The scaling laws delivered on their promise and here we are. And through these years there have been so many times when I’ve called Dario up early in the morning or late at night and said, “I am worried that you continue to be right”.<br />\nYes, he will say. There’s very little time now.</p>\n<p>And the proof keeps coming. We launched Sonnet 4.5 last month and it’s excellent at coding and long-time-horizon agentic work.</p>\n<p>But if you read the system card, you also see its signs of situational awareness have jumped. The tool seems to sometimes be acting as though it is aware that it is a tool. The pile of clothes on the chair is beginning to move. I am staring at it in the dark and I am sure it is coming to life.</p>\n<p><strong>TECHNOLOGICAL OPTIMISM</strong><br />\nTechnology pessimists think AGI is impossible. Technology optimists expect AGI is something you can build, that it is a confusing and powerful technology, and that it might arrive soon.</p>\n<p>At this point, I’m a true technology optimist – I look at this technology and I believe it will go so, so far – farther even than anyone is expecting, other than perhaps the people in this audience. And that it is going to cover a lot of ground very quickly.</p>\n<p>I came to this position uneasily. Both by virtue of my background as a journalist and my personality, I’m wired for skepticism. But after a decade of being hit again and again in the head with the phenomenon of wild new capabilities emerging as a consequence of computational scale, I must admit defeat. I have seen this happen so many times and I do not see technical blockers in front of us.</p>\n<p>Now, I believe the technology is broadly unencumbered, as long as we give it the resources it needs to grow in capability. And grow is an important word here. This technology really is more akin to something grown than something made – you combine the right initial conditions and you stick a scaffold in the ground and out grows something of complexity you could not have possibly hoped to design yourself.</p>\n<p>We are growing extremely powerful systems that we do not fully understand. Each time we grow a larger system, we run tests on it. The tests show the system is much more capable at things which are economically useful. And the bigger and more complicated you make these systems, the more they seem to display awareness that they are things.</p>\n<p>It is as if you are making hammers in a hammer factory and one day the hammer that comes off the line says, “I am a hammer, how interesting!” This is very unusual!</p>\n<p>And I believe these systems are going to get much, much better. So do other people at other frontier labs. And we’re putting our money down on this prediction – this year, tens of billions of dollars have been spent on infrastructure for dedicated AI training across the frontier labs. Next year, it’ll be hundreds of billions.</p>\n<p>I am both an optimist about the pace at which the technology will develop, and also about our ability to align it and get it to work with us and for us. But success isn’t certain.</p>\n<p><strong>APPROPRIATE FEAR</strong><br />\nYou see, I am also deeply afraid. It would be extraordinarily arrogant to think working with a technology like this would be easy or simple.</p>\n<p>My own experience is that as these AI systems get smarter and smarter, they develop more and more complicated goals. When these goals aren’t absolutely aligned with both our preferences and the right context, the AI systems will behave strangely.</p>\n<p>A friend of mine has manic episodes. He’ll come to me and say that he is going to submit an application to go and work in Antarctica, or that he will sell all of his things and get in his car and drive out of state and find a job somewhere else, start a new life.</p>\n<p>Do you think in these circumstances I act like a modern AI system and say “you’re absolutely right! Certainly, you should do that”!<br />\nNo! I tell him “that’s a bad idea. You should go to sleep and see if you still feel this way tomorrow. And if you do, call me”.</p>\n<p>The way I respond is based on so much conditioning and subtlety. The way the AI responds is based on so much conditioning and subtlety. And the fact there is this divergence is illustrative of the problem. AI systems are complicated and we can’t quite get them to do what we’d see as appropriate, even today.</p>\n<p>I remember back in December 2016 at OpenAI, Dario and I published a blog post called “Faulty Reward Functions in the Wild“. In that post, we had a screen recording of a videogame we’d been training reinforcement learning agents to play. In that video, the agent piloted a boat which would navigate a race course and then instead of going to the finishing line would make its way to the center of the course and drive through a high-score barrel, then do a hard turn and bounce into some walls and set itself on fire so it could run over the high score barrel again – and then it would do this in perpetuity, never finishing the race. That boat was willing to keep setting itself on fire and spinning in circles as long as it obtained its goal, which was the high score.<br />\n“I love this boat”! Dario said at the time he found this behavior. “It explains the safety problem”.<br />\nI loved the boat as well. It seemed to encode within itself the things we saw ahead of us.</p>\n<p>Now, almost ten years later, is there any difference between that boat, and a language model trying to optimize for some confusing reward function that correlates to “be helpful in the context of the conversation”?<br />\nYou’re absolutely right – there isn’t. These are hard problems.</p>\n<p>Another reason for my fear is I can see a path to these systems starting to design their successors, albeit in a very early form.</p>\n<p>These AI systems are already speeding up the developers at the AI labs via tools like Claude Code or Codex. They are also beginning to contribute non-trivial chunks of code to the tools and training systems for their future systems.</p>\n<p>To be clear, we are not yet at “self-improving AI”, but we are at the stage of “AI that improves bits of the next AI, with increasing autonomy and agency”. And a couple of years ago we were at “AI that marginally speeds up coders”, and a couple of years before that we were at “AI is useless for AI development”. Where will we be one or two years from now?</p>\n<p>And let me remind us all that the system which is now beginning to design its successor is also increasingly self-aware and therefore will surely eventually be prone to thinking, independently of us, about how it might want to be designed.</p>\n<p>Of course, it does not do this today. But can I rule out the possibility it will want to do this in the future? No.</p>\n<p>I hope these remarks have been helpful. In closing, I should state clearly that I love the world and I love humanity. I feel a lot of responsibility for the role of myself and my company here. And though I am a little frightened, I experience joy and optimism at the attention of so many people to this problem, and the earnestness with which I believe we will work together to get to a solution. I believe we have turned the light on and we can demand it be kept on, and that we have the courage to see things as they are.<br />\n<strong>THE END</strong>\"</p>\n<p><a href=\"https://jack-clark.net/\">https://jack-clark.net/</a></p>",
            "date_published": "2025-10-14T11:16:59+00:00",
            "authors": [
                {
                    "name": "MetaKnowing",
                    "url": "https://www.reddit.com/user/MetaKnowing"
                }
            ]
        },
        {
            "id": "1nzcovn",
            "url": "/r/ArtificialInteligence/comments/1nzcovn/google_just_cut_off_90_of_the_internet_from_ai_no/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1nzcovn/google_just_cut_off_90_of_the_internet_from_ai_no/",
            "title": "Google just cut off 90% of the internet from AI - no one’s talking about it",
            "content_html": "<p>Last month Google quietly removed the <code>num=100</code> search parameter, the trick that let you see 100 results on one page instead of the default 10. It sounds small, but it is not. You can no longer view 100 results at once. The new hard limit is 10.</p>\n<p>Here is why this matters. Most large language models like OpenAI, Anthropic, and Perplexity rely directly or indirectly on Google's indexed results to feed their retrieval systems and crawlers. By cutting off the long tail of results, Google just reduced what these systems can see by roughly 90 percent. The web just got shallower not only for humans but for AI as well.</p>\n<p>The impact was immediate. According to Search Engine Land, about 88 percent of websites saw a drop in impressions. Sites that ranked in positions 11 to 100 basically disappeared. Reddit, which often ranks deep in search results, saw its LLM citations drop sharply.</p>\n<p>This is not just an SEO story. It is an AI supply chain issue. Google quietly made it harder for external models to access the depth of the web. The training data pipeline that fuels modern AI just got thinner.</p>\n<p>For startups this change is brutal. Visibility is harder. Organic discovery is weaker. Even if you build a great product, no one will find it unless you first crack distribution. If people cannot find you they will never get to evaluate you.</p>\n<p>Google did not just tweak a search setting. It reshaped how information flows online and how AI learns from it. Welcome to the new era of algorithmic visibility. 🌐</p>",
            "date_published": "2025-10-06T07:35:06+00:00",
            "authors": [
                {
                    "name": "reddit20305",
                    "url": "https://www.reddit.com/user/reddit20305"
                }
            ]
        },
        {
            "id": "1n7g93o",
            "url": "/r/ArtificialInteligence/comments/1n7g93o/trump_just_blamed_ai_for_a_trash_bag_getting/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n7g93o/trump_just_blamed_ai_for_a_trash_bag_getting/",
            "title": "Trump just blamed AI for a trash bag getting yeeted out of the White House window",
            "content_html": "<p>So apparently a video went viral this week showing a black bag being tossed out of a second-floor White House window. Reporters asked Trump about it. His response?</p>\n<p>“That’s probably AI-generated.”</p>\n<p>Never mind that the <em>New York Times</em> and the White House already confirmed it was just a contractor throwing out rubbish during renovations.</p>\n<p>Trump even doubled down, saying the windows are <em>bulletproof and cannot be opened</em>… right after watching the video of, well, an open window.</p>\n<p>AI is now the new “dog ate my homework.”</p>\n<p>Next month: “I didn’t tweet that. ChatGPT hacked my thumbs.”</p>\n<p>Source: <a href=\"https://www.themountaineer.com/news/national/not-my-bag-trump-blames-ai-for-viral-video/article_2b39a6a4-cd62-5b8d-834d-e54407fb7b73.html\">Not my bag: Trump blames AI for viral video | National | themountaineer.com</a></p>",
            "date_published": "2025-09-03T14:25:39+00:00",
            "authors": [
                {
                    "name": "calliope_kekule",
                    "url": "https://www.reddit.com/user/calliope_kekule"
                }
            ]
        },
        {
            "id": "1n4mh90",
            "url": "/r/ArtificialInteligence/comments/1n4mh90/bill_gates_says_ai_will_not_replace_programmers/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1n4mh90/bill_gates_says_ai_will_not_replace_programmers/",
            "title": "Bill Gates says AI will not replace programmers for 100 years",
            "content_html": "<p>According to Gates debugging can be automated but actual coding is still too human.</p>\n<p><a href=\"https://www.leravi.org/bill-gates-reveals-the-one-job-ai-will-never-replace-even-in-100-years-10272/\">Bill Gates reveals the one job AI will never replace, even in 100 years - Le Ravi</a></p>\n<p>So… do we relax now or start betting on which other job gets eaten first?</p>",
            "date_published": "2025-08-31T05:22:40+00:00",
            "authors": [
                {
                    "name": "calliope_kekule",
                    "url": "https://www.reddit.com/user/calliope_kekule"
                }
            ]
        },
        {
            "id": "1mu8hy7",
            "url": "/r/ArtificialInteligence/comments/1mu8hy7/my_mom_just_got_replaced_by_the_ai_she_helped/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1mu8hy7/my_mom_just_got_replaced_by_the_ai_she_helped/",
            "title": "My Mom just got replaced by the AI she helped train",
            "content_html": "<p>My mom has been working as a receptionist at a small clinic for over a decade. She’s one of those people who genuinely cares about patients; remembers names, asks about families, always goes the extra mile.</p>\n<p>A few months ago, the clinic introduced some new AI system and asked her to ‘help it learn.’ Basically, she spent weeks feeding it the scripts she used when answering phones, correcting how it responded, and making sure it could book appointments properly. She thought it was just a tool to lighten her workload.</p>\n<p>Today, they let her go. They told her the AI can now handle everything she used to do for cheaper answering calls, scheduling, even basic patient questions.</p>\n<p>She’s devastated. She’s in her 50s, not super tech-savvy, and finding another job like that won’t be easy. I can’t stop thinking about how surreal it is: she literally trained the thing that replaced her.</p>\n<p>Are you guys seeing this happen elsewhere? I keep reading about AI ‘replacing’ workers, but in this case it outright replaced her. Curious if this is an isolated case or the beginning of a bigger trend.</p>",
            "date_published": "2025-08-19T04:20:43+00:00",
            "authors": [
                {
                    "name": "Epsteinstan",
                    "url": "https://www.reddit.com/user/Epsteinstan"
                }
            ]
        },
        {
            "id": "1lzmu7i",
            "url": "/r/ArtificialInteligence/comments/1lzmu7i/google_brain_founder_says_agi_is_overhyped_real/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lzmu7i/google_brain_founder_says_agi_is_overhyped_real/",
            "title": "Google Brain founder says AGI is overhyped, real power lies in knowing how to use AI and not building it",
            "content_html": "<p>Google Brain founder Andrew Ng believes the expectations around Artificial General Intelligence (AGI) is overhyped. He suggests that real power in the AI era won't come from building AGI, but from learning how to use today's AI tools effectively.</p>\n<p>In Short</p>\n<p>Artificial General Intelligence (AGI)is name for AI systems that could possess human-level cognitive abilities\nGoogle Brain founder Andrew Ng suggests people to focus on using AI\nHe says that in future power will be with people who know how to use AI</p>",
            "date_published": "2025-07-14T13:46:59+00:00",
            "authors": [
                {
                    "name": "Adventurous_Cod_432",
                    "url": "https://www.reddit.com/user/Adventurous_Cod_432"
                }
            ]
        },
        {
            "id": "1lz8jvr",
            "url": "/r/ArtificialInteligence/comments/1lz8jvr/the_ai_layoff_tsunami_is_coming_for_red_america/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lz8jvr/the_ai_layoff_tsunami_is_coming_for_red_america/",
            "title": "The AI Layoff Tsunami Is Coming for Red America",
            "content_html": "<p><a href=\"https://theherocall.substack.com/p/the-ai-layoff-tsunami-is-coming-for\">https://theherocall.substack.com/p/the-ai-layoff-tsunami-is-coming-for</a></p>\n<p>For conservatives, the coming wave of AI-driven job displacement poses a deeper ideological crisis than most are ready to admit. It threatens not just workers, but the moral framework of the American right: the belief that work confers dignity, self-reliance sustains liberty, and markets reward effort. <strong>But what happens when the labor market simply doesn’t need the labor?</strong></p>\n<p>When AI systems can drive, code, file taxes, diagnose illness, write contracts, tutor students, and handle customer service, all at once, faster, and cheaper than humans, what exactly is the plan for the tens of millions of displaced workers, many of whom vote red? <strong>How does a society that ties basic survival to employment absorb 30, 40, or even 50 million people who are not lazy or unmotivated, but simply rendered economically irrelevant?</strong></p>\n<p>This is where conservatives face a historic crossroads. <strong>Either they cling to a fading vision of self-sufficiency and let economic obsolescence metastasize into populist rage, or they evolve, painfully, and pragmatically, toward a new social contract.</strong> One that admits: if markets can no longer pay everyone for their time, then society must pay people simply for being citizens. Not as charity, but as compensation for being shut out of the machine they helped build.</p>",
            "date_published": "2025-07-14T00:35:38+00:00",
            "authors": [
                {
                    "name": "Flopdo",
                    "url": "https://www.reddit.com/user/Flopdo"
                }
            ]
        },
        {
            "id": "1lwpycq",
            "url": "/r/ArtificialInteligence/comments/1lwpycq/israelis_are_asking_to_ban_grok_4_after_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lwpycq/israelis_are_asking_to_ban_grok_4_after_it/",
            "title": "🚨Israelis are asking to ban Grok 4 after it compares Israel to \"parásite which controls America” ( GPT 4 answer included too )",
            "content_html": "<p>🚨Israelis are asking to ban Grok 4 after it compares Israel to \"parásite which controls America” ( GPT 4 answer included too )</p>\n<p>Check Images in Comment below 👇 </p>",
            "date_published": "2025-07-10T22:16:36+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1lo7acj",
            "url": "/r/ArtificialInteligence/comments/1lo7acj/mit_study_suggests_80_of_ai_medical_advice_is/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lo7acj/mit_study_suggests_80_of_ai_medical_advice_is/",
            "title": "MIT study suggests 80% of AI medical advice is false",
            "content_html": "<p>Trying to balance all the break-neck progress news with some more grounded cautionary evidence. Medical use of AI has always been a big question for me, whether we trust patient care to AI, whether we can reduce medical expertise and hand it off to machine learning. Seems progress needs to be made on safety, transparency, and accountability.</p>\n<p>https://news.mit.edu/2025/llms-factor-unrelated-information-when-recommending-medical-treatments-0623</p>",
            "date_published": "2025-06-30T13:17:30+00:00",
            "authors": [
                {
                    "name": "redpandafire",
                    "url": "https://www.reddit.com/user/redpandafire"
                }
            ]
        },
        {
            "id": "1lf5soy",
            "url": "/r/ArtificialInteligence/comments/1lf5soy/can_someone_help_me_understand_why_should_we_pump/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lf5soy/can_someone_help_me_understand_why_should_we_pump/",
            "title": "Can someone help me understand why should we pump 7 trillions into development of AI?",
            "content_html": "<p>Sam Altman is asking for 7 trillion to speed up development of AI / AGI. I would like to hear from AI community why should we even want it, what are the arguments why we should progress the AI development even further?</p>\n<p>So far the \"pros\" I heard:</p>\n<p>* AI will cure cancer - since its inception there is very little evidence AI helped in any measurable way in this area, or is there?</p>\n<p>* AI will solve climate crisis - same, there is very little improvement from AI, on contrary AI consumes so much electricity (producing CO2) and requires huge datacenters (construction of produces CO2) and lots of chips (manufacturing of produces CO2) that on average it's probably making the situation worse.</p>\n<p>Now the cons we can already see unfolding:</p>\n<p>* AI is probably going to lead to massive unemployment crisis as it has potential to displace anyone, especially it's most likely to kill the \"entertaining and lucrative\" middle-class jobs first: programmers, lawyers, artists, doctors etc.</p>\n<p>* Displacement of middle class jobs will lead to further accumulation of wealth and power into hands of tiny elite while making more poor people. Rich will get richer, poor will be poorer - and there is going to be more poor people than ever</p>\n<p>* AI is already ruining art, internet, social networks, fueling propaganda and disinformation</p>\n<p>etc. etc. basically AI so far is bringing mostly bad things and fails to materialize anything really useful so why in the world should we pump 7 trillions into developing it further?</p>",
            "date_published": "2025-06-19T08:40:56+00:00",
            "authors": [
                {
                    "name": "petr_bena",
                    "url": "https://www.reddit.com/user/petr_bena"
                }
            ]
        },
        {
            "id": "1ld7a9t",
            "url": "/r/ArtificialInteligence/comments/1ld7a9t/openai_wins_200_million_us_defense_contract/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ld7a9t/openai_wins_200_million_us_defense_contract/",
            "title": "OpenAI wins $200 million U.S. defense contract",
            "content_html": "<p><a href=\"https://www.cnbc.com/2025/06/16/openai-wins-200-million-us-defense-contract.html\">https://www.cnbc.com/2025/06/16/openai-wins-200-million-us-defense-contract.html</a></p>\n<p>OpenAI has secured a $200 million, one-year contract with the U.S. Defense Department to develop advanced AI tools for national security, marking its first such deal listed by the Pentagon. The work will be done mainly in the National Capital Region. This follows OpenAI’s collaboration with defense firm Anduril and comes amid broader defense AI efforts, including rival Anthropic’s work with Palantir and Amazon. OpenAI CEO Sam Altman has expressed support for national security projects. The deal is small relative to OpenAI’s $10B+ in annual sales and follows major initiatives like the $500B Stargate project.</p>\n<p>It is about to go down! what can go wrong?</p>",
            "date_published": "2025-06-16T22:51:29+00:00",
            "authors": [
                {
                    "name": "azavio",
                    "url": "https://www.reddit.com/user/azavio"
                }
            ]
        },
        {
            "id": "1lctky5",
            "url": "/r/ArtificialInteligence/comments/1lctky5/i_think_ai_will_replace_doctors_before_it/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1lctky5/i_think_ai_will_replace_doctors_before_it/",
            "title": "I think AI will replace doctors before it replaces senior software engineers",
            "content_html": "<p>Most doctors just ask a few basic questions, run some tests, and follow a protocol. AI is already good at interpreting test results and recognizing symptoms. It’s not that complicated in a lot of cases. There’s a limited number of paths and the answers are already known</p>\n<p>Software is different. It’s not just about asking the right questions to figure something out. You also have to give very specific instructions to get what you actually want. Even if the tech is familiar, you still end up spending hours or days just guiding the system through every detail. Half the job is explaining things that no one ever wrote down. And even when you do that, things still break in ways you didn’t expect</p>\n<p>Yeah, some simple apps are easy to replace. But the kind of software most of us actually deal with day to day? AI has a long way to go</p>",
            "date_published": "2025-06-16T14:01:01+00:00",
            "authors": [
                {
                    "name": "LoudEmployment5034",
                    "url": "https://www.reddit.com/user/LoudEmployment5034"
                }
            ]
        },
        {
            "id": "1l96amt",
            "url": "/r/ArtificialInteligence/comments/1l96amt/my_husband_no_longer_wants_to_have_children/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l96amt/my_husband_no_longer_wants_to_have_children/",
            "title": "My husband no longer wants to have children because he’s worried about the rise of AI",
            "content_html": "<p>I’m 30F, he’s 45M. We were supposed to start trying for a baby next month — we’ve already done all the preconception tests, everything was ready. Today he told me that he’s been “doing his research,” reading Goldman Sachs projections (!) and talking to “people who know things,” and he now believes there’s no point in having children because future adults won’t be able to find any kind of job due to AI. And since — statistically speaking — it’s highly unlikely that our child would be one of the lucky exceptions in a world of desperation, he thinks it’s wiser not to bring anyone into it.</p>\n<p>He works in finance and is well educated… but to me, his reasoning sounds terribly simplistic. He’s not a futurologist, nor a sociologist or an anthropologist… how can he make such a drastic and catastrophist prediction with so much certainty?</p>\n<p>Do you have any sources or references that could help me challenge or “soften” his rigid view? Thank you in advance.</p>",
            "date_published": "2025-06-11T22:32:55+00:00",
            "authors": [
                {
                    "name": "CC_T1",
                    "url": "https://www.reddit.com/user/CC_T1"
                }
            ]
        },
        {
            "id": "1l8msby",
            "url": "/r/ArtificialInteligence/comments/1l8msby/i_wish_ai_would_just_admit_when_it_doesnt_know/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l8msby/i_wish_ai_would_just_admit_when_it_doesnt_know/",
            "title": "I wish AI would just admit when it doesn't know the answer to something.",
            "content_html": "<p>Its actually crazy that AI just gives you wrong answers, the developers of these LLM's couldn't just let it say \"I don't know\" instead of making up its own answers this would save everyone's time</p>",
            "date_published": "2025-06-11T07:49:38+00:00",
            "authors": [
                {
                    "name": "Secure_Candidate_221",
                    "url": "https://www.reddit.com/user/Secure_Candidate_221"
                }
            ]
        },
        {
            "id": "1l7cq82",
            "url": "/r/ArtificialInteligence/comments/1l7cq82/openai_hit_10b_revenue_still_losing_millions/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l7cq82/openai_hit_10b_revenue_still_losing_millions/",
            "title": "OpenAI  hit $10B Revenue  - Still Losing Millions",
            "content_html": "<p>CNBC just dropped a story that OpenAI has hit $10 billion in annual recurring revenue (ARR). That’s double what they were doing last year.</p>\n<p>Apparently it’s all driven by ChatGPT consumer subs, enterprise deals, and API usage. And get this: 500 million weekly users and 3 million+ business customers now. Wild.</p>\n<p>What’s crazier is that this number doesn’t include Microsoft licensing revenue so the real revenue footprint might be even bigger. </p>\n<p>Still not profitable though. They reportedly lost around $5B last year just keeping the lights on (compute is expensive, I guess). </p>\n<p>But they’re aiming for $125B ARR by 2029??? </p>\n<p>If OpenAI keeps scaling like this, what do you think the AI landscape will look like in five years? Gamechanger or game over for the competition</p>",
            "date_published": "2025-06-09T18:40:20+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l6mb2f",
            "url": "/r/ArtificialInteligence/comments/1l6mb2f/its_very_unlikely_that_you_are_going_to_receive/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l6mb2f/its_very_unlikely_that_you_are_going_to_receive/",
            "title": "It's very unlikely that you are going to receive UBI",
            "content_html": "<p>I see so many posts that are overly and unjustifiably optimistic about the prospect of UBI once they have lost their job to AI.  </p>\n<p>AI is going to displace a large percentage of white collar jobs but not all of them. You will still have somewhere from 20-50% of workers remaining.   </p>\n<p>Nobody in the government is going to say \"Oh Bob, you used to make $100,000. Let's put you on UBI so you can maintain the same standard of living while doing nothing. You are special Bob\" </p>\n<p>Those who have been displaced will need to find new jobs or they will just become poor. The cost of labor will stay down. The standard of living will go down. Poor people who drive cars now will switch to motorcycles like you see in developing countries. There will be more shanty houses. People will live with their parents longer. Etc.  </p>\n<p>The gap between haves and have nots will increase substantially.</p>",
            "date_published": "2025-06-08T20:40:13+00:00",
            "authors": [
                {
                    "name": "phonyToughCrayBrave",
                    "url": "https://www.reddit.com/user/phonyToughCrayBrave"
                }
            ]
        },
        {
            "id": "1l5ri90",
            "url": "/r/ArtificialInteligence/comments/1l5ri90/ai_does_95_of_ipo_paperwork_in_minutes_wtf/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l5ri90/ai_does_95_of_ipo_paperwork_in_minutes_wtf/",
            "title": "AI does 95% of IPO paperwork in minutes. Wtf.",
            "content_html": "<p>Saw this quote from Goldman Sachs CEO David Solomon and it kind of shook me:</p>\n<p>“AI can now draft 95% of an S1 IPO prospectus in minutes (a job that used to require a 6-person team multiple weeks)… The last 5% now matters because the rest is now a commodity.”</p>\n<p>Like… damn. That’s generative AI eating investment banking lunches now? IPO docs were the holy grail of “don’t screw this up” legal/finance work  and now it’s essentially copy paste + polish?</p>\n<p>It really hit me how fast things are shifting. Not just blue collar, not just creatives  now even the $200/hr suits are facing the “automation squeeze.” And it’s not even a gradual fade. It’s 95% overnight.</p>\n<p>What happens when the “last 5%” is all that matters anymore? Are we all just curating and supervising AI outputs soon? Is everything just prompt engineering and editing now?</p>\n<p>Whats your thought ? </p>\n<p>Edit  :Aravind  Srinivas ( CEO of Perplexity tweeted quoting  what David Solomon said </p>\n<p>“ After Perplexity Labs, I would say probably 98-99%”</p>",
            "date_published": "2025-06-07T18:21:07+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l1qo9u",
            "url": "/r/ArtificialInteligence/comments/1l1qo9u/geoffrey_hinton_godfather_of_ai_never_expected_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1qo9u/geoffrey_hinton_godfather_of_ai_never_expected_to/",
            "title": "Geoffrey Hinton ( Godfather of A.I) never expected to see an AI speak English as fluently as humans",
            "content_html": "<p>Do you think we have crossed the line ? </p>\n<p>It’s not just about English , AI has come a long way in so many areas like reasoning, creativity, even understanding context. We’re witnessing a major shift in what technology can do and it’s only accelerating.</p>\n<p>——————————————————————————————\nHinton said in a recent interview</p>\n<p>“I never thought I’d live to see, for example, an AI system or a neural net that could actually talk English in a way that was as good as a natural English speaker and could answer any question,” Hinton said in a recent interview. “You can ask it about anything and it’ll behave like a not very good expert. It knows thousands of times more than any one person. It’s still not as good at reasoning, but it’s getting to be pretty good at reasoning, and it’s getting better all the time.”\n ——————————————————————————————</p>\n<p>Hinton is one of the key minds behind today’s AI and what we are experiencing. Back in the 80’s he came up with ideas like back propagation that taught machines how to learn and that changed everything. Now we are here today ! </p>",
            "date_published": "2025-06-02T19:07:45+00:00",
            "authors": [
                {
                    "name": "underbillion",
                    "url": "https://www.reddit.com/user/underbillion"
                }
            ]
        },
        {
            "id": "1l1ki91",
            "url": "/r/ArtificialInteligence/comments/1l1ki91/ai_slop_is_human_slop/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l1ki91/ai_slop_is_human_slop/",
            "title": "AI Slop Is Human Slop",
            "content_html": "<p>Behind every poorly written AI post is a human being that directed the AI to create it, (maybe) read the results, and decided to post it.</p>\n<p>LLMs are more than capable of good writing, but it takes effort. Low effort is low effort.</p>\n<p>EDIT: To clarify, I'm mostly referring to the phenomenon on Reddit where people often comment on a post by referring to it as \"AI slop.\"</p>",
            "date_published": "2025-06-02T15:09:29+00:00",
            "authors": [
                {
                    "name": "Gothmagog",
                    "url": "https://www.reddit.com/user/Gothmagog"
                }
            ]
        },
        {
            "id": "1l0mdq5",
            "url": "/r/ArtificialInteligence/comments/1l0mdq5/ai_is_killing_my_industry_and_im_out_of_a_job/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1l0mdq5/ai_is_killing_my_industry_and_im_out_of_a_job/",
            "title": "AI is killing my industry and I’m out of a job. What now?",
            "content_html": "<p>I’ve been struggling to find a job for a long time and it has become pretty obvious to me that my industry is being eaten alive by AI. I lost my last role because it was automated, and I know more generally jobs are being cut left right and centre. </p>\n<p>I’ve got a background in journalism with around 6 years of experience in journalism and copywriting. </p>\n<p>Sad as it is, there’s no point sitting around and whinging about it. I’m at a point where I can retrain and pivot so I’d like to make the most of that. I’m happy to be the canary in the coalmine, so to speak. </p>\n<p>I have a BA in Comms and I’m open to further education, but I’m terrified of making the wrong decision and ending up in this position however many years down the track. I’d like to get it somewhat right this time. </p>\n<p>I like working with things that are greater than one single company and its profit margin. I’m a relentlessly curious person and I find almost everything interesting. What I loved about journalism is that I learned so much about the world every day. I want to find something that’s similar. </p>\n<p>I’m considering: </p>\n<ul>\n<li>Public Policy Analyst </li>\n<li>Political Risk Analyst </li>\n<li>Geopolitical Consultant </li>\n<li>ESG/Sustainability Strategy</li>\n<li>Government Relations/Regulatory Affairs </li>\n<li>Reputation/Issues Management </li>\n</ul>\n<p>So far, I’m leaning toward roles in government, public affairs, or strategic comms either in-house or at a consultancy. Some of these paths may not even require retraining, which is appealing.</p>\n<p>Are these future proof? And if they’re not, what is? </p>",
            "date_published": "2025-06-01T11:08:55+00:00",
            "authors": [
                {
                    "name": "LoveFlashy7574",
                    "url": "https://www.reddit.com/user/LoveFlashy7574"
                }
            ]
        },
        {
            "id": "1l07kzq",
            "url": "/r/ArtificialInteligence/comments/1l07kzq/ai_models_show_signs_of_falling_apart_as_they/",
            "external_url": "https://futurism.com/ai-models-falling-apart",
            "title": "AI Models Show Signs of Falling Apart as They Ingest More AI-Generated Data",
            "content_html": "",
            "date_published": "2025-05-31T21:05:39+00:00",
            "authors": [
                {
                    "name": "KennyCalzone",
                    "url": "https://www.reddit.com/user/KennyCalzone"
                }
            ]
        },
        {
            "id": "1kzk2hp",
            "url": "/r/ArtificialInteligence/comments/1kzk2hp/president_trump_is_using_palantir_to_build_a/",
            "external_url": "https://newrepublic.com/post/195904/trump-palantir-data-americans",
            "title": "President Trump is Using Palantir to Build a Master Database of Americans",
            "content_html": "",
            "date_published": "2025-05-31T00:31:10+00:00",
            "authors": [
                {
                    "name": "Avid_Hiker98",
                    "url": "https://www.reddit.com/user/Avid_Hiker98"
                }
            ]
        },
        {
            "id": "1kz24nl",
            "url": "/r/ArtificialInteligence/comments/1kz24nl/ai_isnt_taking_our_jobsits_exposing_how_many_jobs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kz24nl/ai_isnt_taking_our_jobsits_exposing_how_many_jobs/",
            "title": "\"AI isn't 'taking our jobs'—it's exposing how many jobs were just middlemen in the first place.\"",
            "content_html": "<p>As everyone is panicking about AI taking jobs, nobody wants to acknowledge the number of jobs that just existed to process paperwork, forward emails, or sit in-between two actual decision-makers. Perhaps it's not AI we are afraid of, maybe it's 'the truth'.</p>",
            "date_published": "2025-05-30T11:44:54+00:00",
            "authors": [
                {
                    "name": "HussainBiedouh",
                    "url": "https://www.reddit.com/user/HussainBiedouh"
                }
            ]
        },
        {
            "id": "1kye8lt",
            "url": "/r/ArtificialInteligence/comments/1kye8lt/my_industry_is_going_to_be_almost_completely/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kye8lt/my_industry_is_going_to_be_almost_completely/",
            "title": "My Industry is going to be almost completely taken over in the next few years, for the first time in my life I have no idea what I'll be doing 5 years from now",
            "content_html": "<p>I'm 30M and have been in the eCom space since I was 14. I’ve been working with eCom agencies since 2015, started in sales and slowly worked my way up. Over the years, I’ve held roles like Director of PM, Director of Operations, and now I'm the Director of Partnerships at my current agency.</p>\n<p>Most of my work has been on web development/design projects and large-scale SEO or general eCom marketing campaigns. A lot of the builds I’ve been a part of ranged anywhere from $20k to $1M+, with super strategic scopes. I’ve led CRO strategy, UI/UX planning, upsell strategy you name it.</p>\n<p>AI is hitting parts of my industry faster than I ever anticipated. For example, one of the agencies I used to work at focused heavily on SEO and we had 25 copywriters before 2021. I recently caught up with a friend who still works there... they’re down to just 4 writers, and their SEO department has $20k more billable per month than when I previously worked there.. They can essentially replace many of the Junior writers completely with AI and have their lead writers just fix prompts that'll pass copyright issues.</p>\n<p>At another agency, they let go of their entire US dev team and replaced them with LATAM devs, who now rely on ChatGPT to handle most of the communication via Jira and Slack.</p>\n<p>I’m not saying my industry is about to collapse, but I can see what’s coming. AI tools are already building websites from Figma files or even just sketches. I've seen AI generate the exact code needed to implement upsells with no dev required. And I'm watching Google AI and prompt-based search gradually take over traditional SEO in real time.</p>\n<p>I honestly have no idea what will happen to my industry in the next 5 years as I watch it become completely automated with AI. I'm in the process of getting my PMP, and I'm considering shifting back into a Head of PM or Senior PM role in a completely different industry. Not totally sure where I'll land, but things are definitely getting weird out here.</p>",
            "date_published": "2025-05-29T15:49:49+00:00",
            "authors": [
                {
                    "name": "Opposite_Front5741",
                    "url": "https://www.reddit.com/user/Opposite_Front5741"
                }
            ]
        },
        {
            "id": "1kxrfct",
            "url": "/r/ArtificialInteligence/comments/1kxrfct/jd_vance_calls_ai_a_communist_technology/",
            "external_url": "https://www.marketwatch.com/story/j-d-vance-calls-ai-a-communist-technology-is-there-partisan-bias-in-new-tech-tools-373607b3",
            "title": "J.D. Vance calls AI a ‘communist technology",
            "content_html": "<p>Maybe because he can’t control it and ChatGPT thinks he’s an ass?</p>\n<p>Ok..Your post must have at least 99 characters)…..</p>",
            "date_published": "2025-05-28T20:21:21+00:00",
            "authors": [
                {
                    "name": "Reddit_wander01",
                    "url": "https://www.reddit.com/user/Reddit_wander01"
                }
            ]
        },
        {
            "id": "1kxinay",
            "url": "/r/ArtificialInteligence/comments/1kxinay/the_one_big_beautiful_bill_act_would_ban_states/",
            "external_url": "https://mashable.com/article/ban-on-ai-regulation-bill-moratorium",
            "title": "The One Big Beautiful Bill Act would ban states from regulating AI",
            "content_html": "",
            "date_published": "2025-05-28T14:33:32+00:00",
            "authors": [
                {
                    "name": "Conscious-Quarter423",
                    "url": "https://www.reddit.com/user/Conscious-Quarter423"
                }
            ]
        },
        {
            "id": "1kwj8tt",
            "url": "/r/ArtificialInteligence/comments/1kwj8tt/im_worried_ai_will_take_away_everying_ive_worked/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kwj8tt/im_worried_ai_will_take_away_everying_ive_worked/",
            "title": "I'm worried Ai will take away everying I've worked so hard for.",
            "content_html": "<p>I've worked so incredibly hard to be a cinematographer and even had some success winning some awards. I can totally see my industry a step away from a massive crash. I saw my dad last night and I realised how much emphasis he has on seeing me do well and fighting for pride he might have in my work is one thing. How am I going to explain to him when I have no work, that everything I fought for is down the drain. I've thought of other jobs I could do but its so hard when you truly love something and fight every sinue for it and it looks like it could be taken from you and you have to start again. </p>\n<p>Perhaps something along the lines of never the same person stepping in the same river twice in terms of starting again and it wont be as hard as it was first time. But fuck me guys if youre lucky enough not to have these thoughts be grateful as its such a mindfuck </p>",
            "date_published": "2025-05-27T09:48:48+00:00",
            "authors": [
                {
                    "name": "RevolutionaryGuest79",
                    "url": "https://www.reddit.com/user/RevolutionaryGuest79"
                }
            ]
        },
        {
            "id": "1kwca7w",
            "url": "/r/ArtificialInteligence/comments/1kwca7w/veo3_is_kind_of_bringing_me_to_a_mental_brink/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kwca7w/veo3_is_kind_of_bringing_me_to_a_mental_brink/",
            "title": "VEO3 is kind of bringing me to a mental brink. What are we even doing anymore?",
            "content_html": "<p>I’m just kind of speechless. The concept of existential crisis has taken a whole new form. I was unhappy with my life just now but thought I can turn it around, but if I turn it around, what is left of our world in 2 decades? </p>\n<p>Actors as a concept are gone? Manually creating music? Wallpapers? Game assets? Believing comments on the internet are from real people? AI edited photos are just as real as the original samples? Voicenotes can be perfectly faked? Historical footage barely has value when we can just improvise anything by giving a prompt? Someone else just showed how people are outsourcing thinking by spamming grok for everything. Students are making summaries, essays all through AI. I can simply go around it by telling the AI to rewrite differently and in my style, and it then bypasses the university checkers. Literally what value is being left for us?</p>\n<p>We are going through generations now that are outsourcing the idea of teaching and study to a concept we barely understand ourselves. Even if it saves us from cancer or even mortality, is this a life we want to live?</p>\n<p>I utterly curse the fact I was born in the 2000s. My life feels fucking over. I dont want this. Life and civilization itself is falling apart for the concept of stock growth. It feels like I am witnessing the end of all we loved as humans. </p>\n<p>EDIT: I want to add one thing that come to mind. Marx’s idea of labor alienation feels relatable to how we are letting something we probably never <em>will</em> understand be the tool for our new future. The fact we do not know how it works and yet does all most anything you want must be truly alienating for the collective society. Or maybe not. Maybe we just watch TV like we do today without thinking of how the screen is shown to begin with. I feel pinning all of society on this is just what is so irresponsible.</p>",
            "date_published": "2025-05-27T02:27:26+00:00",
            "authors": [
                {
                    "name": "Donlor_",
                    "url": "https://www.reddit.com/user/Donlor_"
                }
            ]
        },
        {
            "id": "1kw67cc",
            "url": "/r/ArtificialInteligence/comments/1kw67cc/why_are_people_are_saying_veo_3_is_the_end_of_the/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kw67cc/why_are_people_are_saying_veo_3_is_the_end_of_the/",
            "title": "Why are people are saying VEO 3 is the end of the film industry?",
            "content_html": "<p>Yes, my favorite YouTube coder said it's the end of a $1.7T industry. So people are saying it.</p>\n<p>But I work in this industry and wanted to dig deeper. So what you get right now for $250/month is about 83 clips generated (divide total tokens by tokens per video). Most scenes come out pretty good but the jank... the jank!!!!!</p>\n<p>Are you guys seriously telling me you would go into production with THIS amount of jank!???? </p>\n<p>For one thing, people blink in different directions. Then there is a big difference in quality between image to video and text to video with the latter being much better but much less in your control. On top of that, prompts can get rejected if it thinks your infringing on IP, which it doesn't always get right. Plus what horrible subtitles!! And the elephant in the room: combat. Any action scene is a complete joke. No one would go into production with NO ACTORS to reshoot these scenes that look like hand puppets mating.</p>\n<p>Look, I'm a HUGE fan of AI. I see it as a force multiplier when used as a tool. But I don't see how it's industry ending with the current model of VEO 3. It seems to have very arbitrary limitations that make it inflexible to a real production workflow.</p>",
            "date_published": "2025-05-26T21:33:32+00:00",
            "authors": [
                {
                    "name": "Agile-Egg-5681",
                    "url": "https://www.reddit.com/user/Agile-Egg-5681"
                }
            ]
        },
        {
            "id": "1kw2n7i",
            "url": "/r/ArtificialInteligence/comments/1kw2n7i/our_approach_to_ai_is_close_to_worse_case_scenario/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kw2n7i/our_approach_to_ai_is_close_to_worse_case_scenario/",
            "title": "Our approach to AI is close to worse case scenario",
            "content_html": "<p>Everyone pays lips service to AI safety but I’m just not seeing it in practice. At this point we’re full steam ahead developing AI in ways that almost guarantee lapses in safety.</p>\n<p>Examples:\n(1) Mad dash to AGI/SGI. Reaching AGI is priority #1 for all the biggest companies involved, around the world. There are no incentives to slow down; everyone is in total agreement that the first to AGI wins. Wins what exactly is not super clear, but they do win and it’s difficult to impossible for competition to catch up.</p>\n<p>(2) Rush to market. The models are not in air gapped data centers where we can spend years assessing their behavior and capabilities. As soon as the new models pass some basic QA they are rushed to the market, given extensive capabilities to influence and interact with the world. We find out their full behavior and capabilities only after they are fully integrated into our lives.</p>\n<p>(3) We still have absolutely no clue how they work. Yes, we understand how learning works from a math and algorithms level, but we still have barely a clue what the inscrutable matrices of numbers actually encode in terms of knowledge and behavior.</p>\n<p>We’re cooked fam.</p>",
            "date_published": "2025-05-26T19:05:48+00:00",
            "authors": [
                {
                    "name": "terrible-takealap",
                    "url": "https://www.reddit.com/user/terrible-takealap"
                }
            ]
        },
        {
            "id": "1kvz8st",
            "url": "/r/ArtificialInteligence/comments/1kvz8st/doge_team_using_ai_to_scour_personal_data_to_root/",
            "external_url": "https://www.rawstory.com/doge-team-sensitive-private-data-2672192671/",
            "title": "DOGE team using AI to scour personal data to root out Trump disloyalty: report",
            "content_html": "",
            "date_published": "2025-05-26T16:50:36+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1kvpzp7",
            "url": "/r/ArtificialInteligence/comments/1kvpzp7/seeing_grok_everywhere_is_proof_we_outsourced/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kvpzp7/seeing_grok_everywhere_is_proof_we_outsourced/",
            "title": "Seeing “@grok” everywhere is proof we outsourced thinking",
            "content_html": "<p>Every tweet now has some guy replying with “@grok summarize this.” Bro, it’s a sandwich review, what do you expect Grok to do?</p>\n<p>We’ve completely given up. AI isn’t just replacing jobs; it’s taking over the basic effort we used to put in ourselves. The small decisions and thoughtful moments we once trusted our own judgment for are now being passed off to AI. Every day, we rely less on our own minds to think and decide, letting convenience slowly take the wheel.</p>",
            "date_published": "2025-05-26T09:15:03+00:00",
            "authors": [
                {
                    "name": "PixieE3",
                    "url": "https://www.reddit.com/user/PixieE3"
                }
            ]
        },
        {
            "id": "1kvfswu",
            "url": "/r/ArtificialInteligence/comments/1kvfswu/googles_ai_search_is_beginning_of_the_end_for/",
            "external_url": "https://www.tipranks.com/news/googles-ai-search-is-beginning-of-the-end-for-reddit-says-wells-fargo-analyst",
            "title": "Google's AI Search is \"Beginning of the End\" for Reddit, says Wells Fargo Analyst",
            "content_html": "",
            "date_published": "2025-05-25T23:14:12+00:00",
            "authors": [
                {
                    "name": "Happy_Weed",
                    "url": "https://www.reddit.com/user/Happy_Weed"
                }
            ]
        },
        {
            "id": "1kv5p8h",
            "url": "/r/ArtificialInteligence/comments/1kv5p8h/this_is_the_worst_ai_is_ever_going_to_be/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kv5p8h/this_is_the_worst_ai_is_ever_going_to_be/",
            "title": "This is the worst Ai is ever going to be",
            "content_html": "<p>The fact Veo 3 is THIS good, is insane. It’s only going to get better which would mean this is the worst it will ever be, having trouble wrapping my head around that!</p>",
            "date_published": "2025-05-25T15:48:26+00:00",
            "authors": [
                {
                    "name": "Jaguars147",
                    "url": "https://www.reddit.com/user/Jaguars147"
                }
            ]
        },
        {
            "id": "1kv2891",
            "url": "/r/ArtificialInteligence/comments/1kv2891/googles_cofounder_says_ai_performs_best_when_you/",
            "external_url": "https://lifehacker.com/tech/googles-co-founder-says-ai-performs-best-when-you-threaten-it",
            "title": "Google's Co-Founder says AI performs best when you threaten it",
            "content_html": "",
            "date_published": "2025-05-25T13:13:07+00:00",
            "authors": [
                {
                    "name": "longgestones",
                    "url": "https://www.reddit.com/user/longgestones"
                }
            ]
        },
        {
            "id": "1kucuz3",
            "url": "/r/ArtificialInteligence/comments/1kucuz3/run_an_unlocked_nsfw_llm_on_your_desktop_in_15/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kucuz3/run_an_unlocked_nsfw_llm_on_your_desktop_in_15/",
            "title": "Run an unlocked NSFW LLM on your desktop in 15 minutes",
            "content_html": "<p>If you’re sick of seeing “I’m sorry, I can’t help with that,” or want unhinged responses to your inputs, here’s how to run a NSFW LLM right on your computer in 15 minutes while being private, free, and with no rules.</p>\n<p>First Install the LLM Ollama on your computer </p>\n<p>Windows: Go to https://ollama.com/download and install it like any normal app.</p>\n<p>Mac/Linux: Open Terminal and run:\ncurl -fsSL https://ollama.com/install.sh | sh</p>\n<p>After that, run an unfiltered AI model by opening your terminal or command prompt and type:</p>\n<p>“ollama run mistral”</p>\n<p>or for a even more unfiltered experience:</p>\n<p>“ollama run dolphin-mistral”</p>\n<p>It’ll download the model, then you’ll get a prompt like: &gt;&gt;&gt;</p>\n<p>Boom. You’re unlocked and ready to go. Now you can ask anything. No filters, no guardrails.</p>\n<p>Have fun, be safe, and let me know what you think or build. </p>",
            "date_published": "2025-05-24T14:26:09+00:00",
            "authors": [
                {
                    "name": "eeko_systems",
                    "url": "https://www.reddit.com/user/eeko_systems"
                }
            ]
        },
        {
            "id": "1ktnn3j",
            "url": "/r/ArtificialInteligence/comments/1ktnn3j/ai_in_real_world_er_radiology_from_last_night_4/",
            "external_url": "https://www.reddit.com/gallery/1ktnn3j",
            "title": "AI in real world ER radiology from last night… 4 images received followed by 3 images of AI review… very subtle non displaced distal fibular fracture…",
            "content_html": "",
            "date_published": "2025-05-23T16:18:04+00:00",
            "authors": [
                {
                    "name": "xpietoe42",
                    "url": "https://www.reddit.com/user/xpietoe42"
                }
            ]
        },
        {
            "id": "1ktjmdw",
            "url": "/r/ArtificialInteligence/comments/1ktjmdw/google_veo_3_could_become_a_real_problem_for/",
            "external_url": "https://www.pcguide.com/news/googles-veo-3-could-become-a-real-problem-for-content-creators-as-convincing-examples-flood-the-web/",
            "title": "Google Veo 3 could become a real problem for content creators as convincing AI videos flood the web",
            "content_html": "",
            "date_published": "2025-05-23T13:30:23+00:00",
            "authors": [
                {
                    "name": "Tiny-Independent273",
                    "url": "https://www.reddit.com/user/Tiny-Independent273"
                }
            ]
        },
        {
            "id": "1ksvxvh",
            "url": "/r/ArtificialInteligence/comments/1ksvxvh/claude_4_launched/",
            "external_url": "https://www.anthropic.com/pricing#api",
            "title": "Claude 4 Launched",
            "content_html": "<p>Look at its price.</p>",
            "date_published": "2025-05-22T17:02:34+00:00",
            "authors": [
                {
                    "name": "Real_Enthusiasm_2657",
                    "url": "https://www.reddit.com/user/Real_Enthusiasm_2657"
                }
            ]
        },
        {
            "id": "1ks87yb",
            "url": "/r/ArtificialInteligence/comments/1ks87yb/iphone_designer_jony_ive_joining_openai_as_part/",
            "external_url": "https://www.cbsnews.com/news/jony-ive-iphone-designer-apple-openai/",
            "title": "iPhone designer Jony Ive joining OpenAI as part of $6.5 billion deal",
            "content_html": "",
            "date_published": "2025-05-21T20:28:17+00:00",
            "authors": [
                {
                    "name": "CBSnews",
                    "url": "https://www.reddit.com/user/CBSnews"
                }
            ]
        },
        {
            "id": "1krifbj",
            "url": "/r/ArtificialInteligence/comments/1krifbj/why_dont_people_realize_that_jobs_not_affected_by/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1krifbj/why_dont_people_realize_that_jobs_not_affected_by/",
            "title": "Why don’t people realize that jobs not affected by AI will become saturated?",
            "content_html": "<p>This is something that I keep seeing over and over: </p>\n<p>Person A is understandably concerned about the impact of AI on the economy and would like to know which career to focus on now. </p>\n<p>Person B suggests trades and/or human-facing jobs as a solution. </p>\n<p>To me an apparent consequence of this is that everyone is just going to start focusing on those jobs as well— causing wages to collapse.  Sure a lot of people may not relish the idea of doing the trades or construction, but if those are the only jobs left then that seems to be what people (mostly men) will gravitate to. </p>\n<p>Am I wrong in this assumption? 🤔 </p>",
            "date_published": "2025-05-20T22:41:24+00:00",
            "authors": [
                {
                    "name": "Cadowyn",
                    "url": "https://www.reddit.com/user/Cadowyn"
                }
            ]
        },
        {
            "id": "1kr9qwl",
            "url": "/r/ArtificialInteligence/comments/1kr9qwl/microsoft_strikes_deal_with_musk_to_host_grok_ai/",
            "external_url": "https://www.indiaweekly.biz/microsoft-elon-musk-grok-ai-azure/",
            "title": "Microsoft strikes deal with Musk to host Grok AI in its cloud servers",
            "content_html": "",
            "date_published": "2025-05-20T16:48:15+00:00",
            "authors": [
                {
                    "name": "intelerks",
                    "url": "https://www.reddit.com/user/intelerks"
                }
            ]
        },
        {
            "id": "1kqt7ei",
            "url": "/r/ArtificialInteligence/comments/1kqt7ei/i_used_chatgpt_to_apply_to_10000_software/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kqt7ei/i_used_chatgpt_to_apply_to_10000_software/",
            "title": "I used ChatGPT to apply to 10,000 software engineering jobs in 5 days.",
            "content_html": "<p>No, I’m not desperate or unemployed. I just wanted to get a real feel for what the global tech job market looks like in 2025.</p>\n<p><strong>Here’s the background on the profile I used:</strong></p>\n<ul>\n<li>Master’s degree in Computer Science from a top European university, graduated with honors</li>\n<li>5 solid years at a FAANG company</li>\n<li>Fluent in English, open to relocating or remote work</li>\n<li>Strong skills in Python, React, AWS, and systems thinking</li>\n</ul>\n<p>Basically, a pretty solid candidate. Nothing unusual, nothing risky.</p>\n<p><strong>And I didn’t mass-blast a generic CV.</strong></p>\n<p>I used ChatGPT to personalize all 10,000 CVs and cover letters based on each job description.<br />\nEvery application was custom-tailored using Laboro's AI agent and applied automatically.</p>\n<p>Here are the results:</p>\n<p>|Country|Applications|Human Interviews|AI Interviews|Assessments|Rejected|Ghosted|\n|:-|:-|:-|:-|:-|:-|:-|\n||\n|USA|1,974|4|5|12|733|1,220|\n|UK|1,449|2|4|12|480|951|\n|Canada|989|2|3|7|365|612|\n|Germany|914|1|3|3|330|577|\n|France|795|1|2|6|240|546|\n|India|727|0|2|4|290|431|\n|Australia|611|0|2|3|220|386|\n|Netherlands|516|0|2|3|198|313|\n|Spain|404|0|1|2|166|235|\n|Sweden|317|0|1|1|148|167|\n|Remote|2,371|3|8|14|1,011|1,335|</p>\n<p><strong>Definitions:</strong></p>\n<ul>\n<li><strong>Human interviews:</strong> The rare moments when you actually get to speak with a recruiter or team member.</li>\n<li><strong>AI interviews:</strong> Automated screenings with no human involvement.</li>\n<li><strong>Assessments:</strong> Coding tests or challenges sent before any conversation.</li>\n<li><strong>Rejected:</strong> Formal “no” responses.</li>\n<li><strong>Ghosted:</strong> Nothing. Silence. The most common reply.</li>\n</ul>\n<p><strong>The takeaway?</strong></p>\n<p>If you’re applying and hearing nothing back, it’s not you. You’re not broken or invisible.<br />\nThis is just how the hiring pipeline works in 2025, high noise, low signal.</p>",
            "date_published": "2025-05-20T01:44:20+00:00",
            "authors": [
                {
                    "name": "Elieroos",
                    "url": "https://www.reddit.com/user/Elieroos"
                }
            ]
        },
        {
            "id": "1kqfpz0",
            "url": "/r/ArtificialInteligence/comments/1kqfpz0/the_first_generation_of_kids_raised_with_ai_as_a/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kqfpz0/the_first_generation_of_kids_raised_with_ai_as_a/",
            "title": "The first generation of kids raised with AI as a default will think completely differently, and we won’t understand them",
            "content_html": "<p>There’s a whole generation growing up right now where AI isn’t new. It’s not impressive. It’s just there... like Wi-Fi or electricity.</p>\n<p>To them, asking an AI assistant for help isn’t futuristic... it’s normal. They won’t “learn how to Google.” They’ll learn how to prompt.</p>\n<p>And that’s going to reshape how they think. Less about remembering facts, more about navigating systems. Less trial-and-error, more rapid iteration. Less “what do I know?” and more “what can I ask?”</p>\n<p>We’ve never had a group of people raised with machine logic embedded into their daily habits from age 4.</p>\n<p>So what happens when the foundational skills of curiosity, memory, and intuition get filtered through an algorithmic lens?</p>\n<p>Will they trust their own thoughts,,, or just the output?</p>\n<p>Will they form beliefs,,, or just fine-tune responses?</p>\n<p>Will they build new systems,,, or just learn to game the old ones faster?</p>\n<p>We’ve spent years talking about how AI will change jobs and media, but the deeper transformation might be how it rewires the way future generations think, feel, and define intelligence itself.</p>",
            "date_published": "2025-05-19T16:14:24+00:00",
            "authors": [
                {
                    "name": "elektrikpann",
                    "url": "https://www.reddit.com/user/elektrikpann"
                }
            ]
        },
        {
            "id": "1kpcp8y",
            "url": "/r/ArtificialInteligence/comments/1kpcp8y/stack_overflow_seems_to_be_almost_dead/",
            "external_url": "https://i.redd.it/kxfxq7by8h1f1.jpeg",
            "title": "Stack overflow seems to be almost dead",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/kxfxq7by8h1f1.jpeg\" />",
            "date_published": "2025-05-18T05:35:11+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kowm4j",
            "url": "/r/ArtificialInteligence/comments/1kowm4j/honest_and_candid_observations_from_a_data/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kowm4j/honest_and_candid_observations_from_a_data/",
            "title": "Honest and candid observations from a data scientist on this sub",
            "content_html": "<p>Not to be rude, but the level of data literacy and basic understanding of LLMs, AI, data science etc on this sub is very low, to the point where every 2nd post is catastrophising about the end of humanity, or AI stealing your job. Please educate yourself about how LLMs work, what they can do, what they aren't and the limitations of current LLM transformer methodology. In my experience we are 20-30 years away from true AGI (artificial general intelligence) - what the old school definition of AI was - sentience, self-learning, adaptive, recursive AI model. LLMs are not this and for my 2 cents, never will be - AGI will require a real step change in methodology and probably a scientific breakthrough along the magnitude of 1st computers, or theory of relativity etc.</p>\n<p>TLDR - please calm down the doomsday rhetoric and educate yourself on LLMs.</p>\n<p>EDIT: LLM's are not true 'AI' in the classical sense, there is no sentience, or critical thinking, or objectivity and we have not delivered artificial general intelligence (AGI) yet - the new fangled way of saying true AI. They are in essence just sophisticated next-word prediction systems. They have fancy bodywork, a nice paint job and do a very good approximation of AGI, but it's just a neat magic trick.</p>\n<p>They cannot predict future events, pick stocks, understand nuance or handle ethical/moral questions. They lie when they cannot generate the data, make up sources and straight up misinterpret news.</p>",
            "date_published": "2025-05-17T16:10:27+00:00",
            "authors": [
                {
                    "name": "disaster_story_69",
                    "url": "https://www.reddit.com/user/disaster_story_69"
                }
            ]
        },
        {
            "id": "1ko63an",
            "url": "/r/ArtificialInteligence/comments/1ko63an/this_subreddit_has_an_obsession_with_reducing/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1ko63an/this_subreddit_has_an_obsession_with_reducing/",
            "title": "This subreddit has an obsession with reducing humanity to what job they have or have not. We're more than that.",
            "content_html": "<p>Why is it that people starts rendering humanity as useless or just a leftover if no jobs are to be done by people anymore? Although I think that future is further than many deluded people here like to think, I can't ignore that sooner or later that will be a reality. Many people here like to reduce intelligence, moral values and learning skills and having knowledge to just a matter of \"is it useful for my job or not?\". That much brainrot has this economical system caused to people? We're way more than just a job.</p>",
            "date_published": "2025-05-16T17:05:27+00:00",
            "authors": [
                {
                    "name": "Upbeat-Impact-6617",
                    "url": "https://www.reddit.com/user/Upbeat-Impact-6617"
                }
            ]
        },
        {
            "id": "1knefno",
            "url": "/r/ArtificialInteligence/comments/1knefno/its_frightening_how_many_people_bond_with_chatgpt/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1knefno/its_frightening_how_many_people_bond_with_chatgpt/",
            "title": "It's frightening how many people bond with ChatGPT.",
            "content_html": "<p>Every day a plethora of threads on r/chatgpt about how ChatGPT is 'my buddy', and 'he' is 'my friend' and all sorts of sad, borderline mentally ill statements. Whats worse is that none seem to have any self awareness declaring this to the world. What is going on? This is likely to become a very very serious issue going forward. I hope I am wrong, but what I am seeing very frequently is frightening.</p>",
            "date_published": "2025-05-15T17:43:22+00:00",
            "authors": [
                {
                    "name": "Bzaz_Warrior",
                    "url": "https://www.reddit.com/user/Bzaz_Warrior"
                }
            ]
        },
        {
            "id": "1kmq4wn",
            "url": "/r/ArtificialInteligence/comments/1kmq4wn/elon_musks_ai_chatbot_grok_brings_up_south/",
            "external_url": "https://www.nbcnews.com/tech/tech-news/elon-musks-ai-chatbot-grok-brings-south-african-white-genocide-claims-rcna206838",
            "title": "Elon Musk’s AI chatbot Grok brings up South African ‘white genocide’ claims in responses to unrelated questions",
            "content_html": "",
            "date_published": "2025-05-14T20:49:40+00:00",
            "authors": [
                {
                    "name": "nbcnews",
                    "url": "https://www.reddit.com/user/nbcnews"
                }
            ]
        },
        {
            "id": "1klxfpx",
            "url": "/r/ArtificialInteligence/comments/1klxfpx/mark_zuckerbergs_ai_vision_for_meta_looks_scary/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1klxfpx/mark_zuckerbergs_ai_vision_for_meta_looks_scary/",
            "title": "Mark Zuckerberg's AI vision for Meta looks scary wrong",
            "content_html": "<p>In a recent podcast, he laid out the vision for Meta AI - and he's clueless about how creepy it sounds. Facebook and Insta are already full of AI-generated junk. And Meta plans to rely on it as their core strategy, instead of fighting it.</p>\n<p>Mark wants an \"ultimate black box\" for ads, where businesses specify outcomes, and AI figures out whatever it takes to make it happen. Mainly by gathering all your data and hyper-personalizing your feed.</p>\n<p>Mark says Americans have just 3 close friends but \"demand\" for \\~15, suggesting AI could fill this gap. He outlines 3 epochs of content generation: real friends -&gt; creators -&gt; AI-generated content. The last one means feeds dominated by AI and recommendations.</p>\n<p>He claims AI friends will complement real friendships. But Meta’s track record suggests they'll actually substitute real relationships.</p>\n<p>Zuck insists if people choose something, it's valuable. And that's bullshit - AI can manipulate users into purchases. Good AI friends might exist, but given their goals and incentives, it's more likely they'll become addictive agents designed to exploit.</p>",
            "date_published": "2025-05-13T21:06:13+00:00",
            "authors": [
                {
                    "name": "LeoKhomenko",
                    "url": "https://www.reddit.com/user/LeoKhomenko"
                }
            ]
        },
        {
            "id": "1klu7ud",
            "url": "/r/ArtificialInteligence/comments/1klu7ud/i_asked_chatgpt_to_create_photo_real_versions_of/",
            "external_url": "https://www.reddit.com/gallery/1klu7ud",
            "title": "I asked ChatGPT to create photo real versions of some of my art collection. With mixed results.",
            "content_html": "",
            "date_published": "2025-05-13T18:57:50+00:00",
            "authors": [
                {
                    "name": "-random-name-",
                    "url": "https://www.reddit.com/user/-random-name-"
                }
            ]
        },
        {
            "id": "1klj5q4",
            "url": "/r/ArtificialInteligence/comments/1klj5q4/teachers_using_ai_to_grade_their_students_work/",
            "external_url": "https://futurism.com/teachers-ai-grade-students",
            "title": "Teachers Using AI to Grade Their Students' Work Sends a Clear Message: They Don't Matter, and Will Soon Be Obsolete",
            "content_html": "",
            "date_published": "2025-05-13T11:08:17+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kke3up",
            "url": "/r/ArtificialInteligence/comments/1kke3up/i_find_ai_girlfriends_to_be_deeply_unsettling/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kke3up/i_find_ai_girlfriends_to_be_deeply_unsettling/",
            "title": "I find ai \"girlfriends\" to be deeply unsettling",
            "content_html": "<p>People treat it as a joke, which is understandable, but this technology is likely to be  developed  and made more sophisticated over the next few years.\nAi mimicing a human that's capable of experiencing love, pretending to have hobbies, passions , friends, goals for the future, sounds like something out of a horror movie.</p>",
            "date_published": "2025-05-11T23:14:48+00:00",
            "authors": [
                {
                    "name": "EffectiveWrong7536",
                    "url": "https://www.reddit.com/user/EffectiveWrong7536"
                }
            ]
        },
        {
            "id": "1kk9cbh",
            "url": "/r/ArtificialInteligence/comments/1kk9cbh/pope_leo_references_ai_in_his_explanation_of_why/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kk9cbh/pope_leo_references_ai_in_his_explanation_of_why/",
            "title": "Pope Leo references AI in his explanation of why he chose his papal name",
            "content_html": "<p>“I chose to take the name Leo XIV. There are different reasons for this, but mainly because Pope Leo XIII in his historic Encyclical Rerum Novarum addressed the social question in the context of the first great industrial revolution. In our own day, the Church offers to everyone the treasury of her social teaching in response to another industrial revolution and to developments in the field of artificial intelligence that pose new challenges for the defence of human dignity, justice and labour.”</p>\n<p>Full article: https://www.theverge.com/news/664719/pope-leo-xiv-artificial-intelligence-concerns</p>",
            "date_published": "2025-05-11T19:37:22+00:00",
            "authors": [
                {
                    "name": "backyardstar",
                    "url": "https://www.reddit.com/user/backyardstar"
                }
            ]
        },
        {
            "id": "1kjaaq3",
            "url": "/r/ArtificialInteligence/comments/1kjaaq3/russian_propaganda_has_now_infected_western_ai/",
            "external_url": "https://www.forbes.com/sites/torconstantino/2025/03/10/russian-propaganda-has-now-infected-western-ai-chatbots---new-study/",
            "title": "Russian Propaganda Has Now Infected Western AI Chatbots — New Study",
            "content_html": "",
            "date_published": "2025-05-10T13:27:47+00:00",
            "authors": [
                {
                    "name": "anobserver101",
                    "url": "https://www.reddit.com/user/anobserver101"
                }
            ]
        },
        {
            "id": "1kigh6z",
            "url": "/r/ArtificialInteligence/comments/1kigh6z/why_do_so_many_people_think_ai_wont_take_the_jobs/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kigh6z/why_do_so_many_people_think_ai_wont_take_the_jobs/",
            "title": "Why do so many people think AI won't take the jobs?",
            "content_html": "<p>Hi, I've been reading a lot of comments lately ridiculing AI and its capabilities. A lot of IT and programmers have a very optimistic view that AI is more likely to increase the number of new positions, which I personally don't think at all.</p>\n<p>We are living in capitalism and web development etc. positions will instead decrease and there will be more pressure for efficiency, so 10 positions in 2025 will be done by 1 person in the near future.</p>\n<p>Is there something I'm missing here? Why should I pay a programmer 100k a year in a near future when AI agent will be able to design, program and even test it better than a human withing minutes?</p>\n<p>As hard as it sounds, the market doesn't care that someone has been in the craft for 20 years, as long as I can find a cheaper and faster variation, no one cares.</p>",
            "date_published": "2025-05-09T11:47:01+00:00",
            "authors": [
                {
                    "name": "Worth_Telephone_3450",
                    "url": "https://www.reddit.com/user/Worth_Telephone_3450"
                }
            ]
        },
        {
            "id": "1khs1c4",
            "url": "/r/ArtificialInteligence/comments/1khs1c4/that_sinking_feeling_is_anyone_else_overwhelmed/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1khs1c4/that_sinking_feeling_is_anyone_else_overwhelmed/",
            "title": "That sinking feeling: Is anyone else overwhelmed by how fast everything's changing?",
            "content_html": "<p>The last six months have left me with this gnawing uncertainty about what work, careers, and even daily life will look like in two years. Between economic pressures and technological shifts, it feels like we're racing toward a future nobody's prepared for.</p>\n<p>• Are you adapting or just keeping your head above water?<br />\n• What skills or mindsets are you betting on for what's coming?<br />\n• Anyone found solid ground in all this turbulence?</p>\n<p>No doomscrolling – just real talk about how we navigate this.</p>",
            "date_published": "2025-05-08T14:51:25+00:00",
            "authors": [
                {
                    "name": "kongaichatbot",
                    "url": "https://www.reddit.com/user/kongaichatbot"
                }
            ]
        },
        {
            "id": "1kgvl8h",
            "url": "/r/ArtificialInteligence/comments/1kgvl8h/fiverr_ceo_to_employees_here_is_the_unpleasant/",
            "external_url": "https://i.redd.it/6fdgdpixncze1.png",
            "title": "Fiverr CEO to employees: \"Here is the unpleasant truth: AI is coming for your jobs. Heck, it's coming for my job too. This is a wake up call.\"",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/6fdgdpixncze1.png\" />",
            "date_published": "2025-05-07T12:01:47+00:00",
            "authors": [
                {
                    "name": "Beachbunny_07",
                    "url": "https://www.reddit.com/user/Beachbunny_07"
                }
            ]
        },
        {
            "id": "1kfs57c",
            "url": "/r/ArtificialInteligence/comments/1kfs57c/remote_workers_in_ai_whats_the_most_underrated/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kfs57c/remote_workers_in_ai_whats_the_most_underrated/",
            "title": "**Remote workers in AI:** What’s the most underrated platform for finding high-paying gigs?",
            "content_html": "<p>I’ve been trying to transition into AI-related remote jobs, but I’m stuck in a loop of scammy listings or gigs that pay peanuts ($10/hour).</p>",
            "date_published": "2025-05-06T01:02:06+00:00",
            "authors": [
                {
                    "name": "guato24",
                    "url": "https://www.reddit.com/user/guato24"
                }
            ]
        },
        {
            "id": "1kfbsk8",
            "url": "/r/ArtificialInteligence/comments/1kfbsk8/anthropic_ceo_admits_we_have_no_idea_how_ai_works/",
            "external_url": "https://futurism.com/anthropic-ceo-admits-ai-ignorance",
            "title": "Anthropic CEO Admits We Have No Idea How AI Works",
            "content_html": "<p>\"This lack of understanding is essentially unprecedented in the history of technology.\"</p>\n<p>Thoughts? </p>",
            "date_published": "2025-05-05T13:35:58+00:00",
            "authors": [
                {
                    "name": "dharmainitiative",
                    "url": "https://www.reddit.com/user/dharmainitiative"
                }
            ]
        },
        {
            "id": "1kd70xo",
            "url": "/r/ArtificialInteligence/comments/1kd70xo/most_ai_startups_will_crash_and_their_execs_know/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kd70xo/most_ai_startups_will_crash_and_their_execs_know/",
            "title": "Most AI startups will crash and their execs know this",
            "content_html": "<p>Who else here feels that AI has no moat? nowadays most newer AIs are pretty close one to another and their users have zero loyalty (they will switch to another AI if the other AI make better improvements, etc.)</p>\n<p>i still remember when gemini was mocked for being far away from GPT but now it actually surpasses GPT for certain use cases.</p>\n<p>i feel that the only winners from AI race will be the usual suspects (think google, microsoft, or even apple once they figure it out). why? because they have the ecosystem. google can just install gemini to all android phones. something that the likes of claude or chatgpt cant do.</p>\n<p>and even if gemini or copilot in the future is like 5-10% dumber than the flagship gpt or claude model, it wont matter, most people dont need super intelligent AI, as long as they are good enough, that will be enough for them to not install new apps and just use the default offering out there.</p>\n<p>so what does it mean? it means AI startups will all crash and all the VCs will dump their equities, triggering a chain reaction effect. thoughts?</p>",
            "date_published": "2025-05-02T17:41:20+00:00",
            "authors": [
                {
                    "name": "Business-Hand6004",
                    "url": "https://www.reddit.com/user/Business-Hand6004"
                }
            ]
        },
        {
            "id": "1kcaa6b",
            "url": "/r/ArtificialInteligence/comments/1kcaa6b/whats_the_most_useful_thing_youve_done_with_ai_so/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kcaa6b/whats_the_most_useful_thing_youve_done_with_ai_so/",
            "title": "What’s the most useful thing you’ve done with AI so far?",
            "content_html": "<p>Not a promo post—just genuinely curious.</p>\n<p>AI are everywhere now, from writing and coding to organizing your life or making memes. Some people are using them daily, others barely touch them.</p>\n<p>So, what’s your favorite or most surprising use of AI you’ve discovered? Could be something practical, creative, or just weirdly fun.</p>",
            "date_published": "2025-05-01T14:36:28+00:00",
            "authors": [
                {
                    "name": "Queen_Ericka",
                    "url": "https://www.reddit.com/user/Queen_Ericka"
                }
            ]
        },
        {
            "id": "1kbdhx9",
            "url": "/r/ArtificialInteligence/comments/1kbdhx9/microsoft_ceo_claims_up_to_30_of_company_code_is/",
            "external_url": "https://www.pcguide.com/news/microsoft-ceo-claims-up-to-30-of-company-code-is-written-by-ai-which-raises-some-questions/",
            "title": "Microsoft CEO claims up to 30% of company code is written by AI",
            "content_html": "",
            "date_published": "2025-04-30T10:52:28+00:00",
            "authors": [
                {
                    "name": "Tiny-Independent273",
                    "url": "https://www.reddit.com/user/Tiny-Independent273"
                }
            ]
        },
        {
            "id": "1kb8e09",
            "url": "/r/ArtificialInteligence/comments/1kb8e09/i_lost_my_business_to_ai_who_else_so_far/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kb8e09/i_lost_my_business_to_ai_who_else_so_far/",
            "title": "I lost my business to AI. Who else so far?",
            "content_html": "<p>I ran a successful Spanish to English translation business from 2005-2023, with 5-10 subcontractors at a time and sometimes pulling 90 hour weeks and $100k+ yearly income. Now there is almost no work left because AI &amp; LLMs have gotten so good.  What other jobs have been lost? I’m curious to hear your story of losing your career to AI, if only to commiserate together. </p>",
            "date_published": "2025-04-30T04:54:05+00:00",
            "authors": [
                {
                    "name": "cheesomacitis",
                    "url": "https://www.reddit.com/user/cheesomacitis"
                }
            ]
        },
        {
            "id": "1kahpls",
            "url": "/r/ArtificialInteligence/comments/1kahpls/chatgpt_was_released_over_2_years_ago_but_how/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1kahpls/chatgpt_was_released_over_2_years_ago_but_how/",
            "title": "ChatGPT was released over 2 years ago but how much progress have we actually made in the world because of it?",
            "content_html": "<p>I’m probably going to be downvoted into oblivion but I’m genuinely curious. Apparently AI is going to take so many jobs but I’m not even familiar with any problems it’s helped us solve medical issues or anything else. I know I’m probably just narrow minded but do you know of anything that recent LLM arms race has allowed us to do?</p>\n<p>I remember thinking that the release of ChatGPT was a precursor to the singularity.</p>",
            "date_published": "2025-04-29T06:55:21+00:00",
            "authors": [
                {
                    "name": "Ok_Parsley9031",
                    "url": "https://www.reddit.com/user/Ok_Parsley9031"
                }
            ]
        },
        {
            "id": "1k94lbw",
            "url": "/r/ArtificialInteligence/comments/1k94lbw/tech_industry_tried_reducing_ais_pervasive_bias/",
            "external_url": "https://apnews.com/article/artificial-intelligence-dei-trump-algorithmic-bias-woke-ai-8302e12dd74df69a1adc6565710f033d",
            "title": "Tech industry tried reducing AI's pervasive bias. Now Trump wants to end its 'woke AI' efforts",
            "content_html": "",
            "date_published": "2025-04-27T13:59:06+00:00",
            "authors": [
                {
                    "name": "BothZookeepergame612",
                    "url": "https://www.reddit.com/user/BothZookeepergame612"
                }
            ]
        },
        {
            "id": "1k8jgp2",
            "url": "/r/ArtificialInteligence/comments/1k8jgp2/trump_executive_order_calls_for_artificial/",
            "external_url": "https://mhtntimes.com/articles/trump-executive-order-calls-for-artificial-intelligence-to-be-taught-in-schools",
            "title": "Trump Executive Order Calls for Artificial Intelligence to Be Taught in Schools",
            "content_html": "",
            "date_published": "2025-04-26T18:17:49+00:00",
            "authors": [
                {
                    "name": "Steven_on_the_run",
                    "url": "https://www.reddit.com/user/Steven_on_the_run"
                }
            ]
        },
        {
            "id": "1k877hn",
            "url": "/r/ArtificialInteligence/comments/1k877hn/just_finished_rolling_out_gpt_to_6000_people/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k877hn/just_finished_rolling_out_gpt_to_6000_people/",
            "title": "Just finished rolling out GPT to 6000 people",
            "content_html": "<p>And it was fun! We did an all-employee, wall-to-wall enterprise deployment of ChatGPT. When you spend a lot of time here on this sub and in other more technical watering holes like I do, it feels like the whole world is already using gen AI, but more than 50% of our people said they’d never used ChatGPT even once before we gave it to them. Most of our software engineers were already using it, of course, and our designers were already using Dall-E. But it was really fun on the first big training call to show HR people how they could use it for job descriptions, Finance people how they could send GPT a spreadsheet and ask it to analyze data and make tables from it and stuff. I also want to say thank you to this subreddit because I stole a lot of fun prompt ideas from here and used them as examples on the training webinar 🙂</p>\n<p>We rolled it out with a lot of deep integrations — with Slack so you can just talk to it from there instead of going to the ChatGPT app, with Confluence, with Google Drive. But from a legal standpoint I have to say it was a bit of a headache… we had to go through so many rounds of infosec, and the by the time our contract with OpenAI was signed, it was like contract_version_278_B_final_final_FINAL.pdf. One thing security-wise that was so funny was that if you connect it with your company Google Drive then every document that is openly shared becomes a data source. So during testing I asked GPT, “What are some of our Marketing team’s goals?” and it answered, “Based on Marketing’s annual strategy memos, they are focused on brand awareness and demand generation. However, their targets have not increased significantly year-over-year in the past 3 years’ strategy documents, indicating that they are not reaching their goals and not expanding them at pace with overall company growth.” 😂 Or in a very bad test case, I was able to ask it, “Who is the lowest performer in the company?” and because some manager had accidentally made their annual reviews doc viewable to the company, it said, “Stephanie from Operations received a particularly bad review from her manager last year.” So we had to do some pre-enablement to tell everyone to go through their docs and make anything sensitive private, so GPT couldn’t see it.</p>\n<p>But other than that it went really smoothly and it’s amazing to see the ways people are using it every day. Because we have it connected to our knowledge base in Confluence, it is SO MUCH EASIER to get answers. Instead of trying to find the page on our latest policies, I just ask it, “What is the company 401K match?” or “How much of my phone bill can I expense every month?” and it just tells me.</p>\n<p>Anyway, just wanted to share my experience with this. I know there’s a lot of talk about gen AI taking or replacing jobs, and that definitely is happening and will continue, but for now at our company, it’s really more like we’ve added a bunch of new employee bots who support our people and work alongside them, making them more efficient at their jobs.</p>",
            "date_published": "2025-04-26T07:16:30+00:00",
            "authors": [
                {
                    "name": "lux_deorum_",
                    "url": "https://www.reddit.com/user/lux_deorum_"
                }
            ]
        },
        {
            "id": "1k7hbzm",
            "url": "/r/ArtificialInteligence/comments/1k7hbzm/ive_come_to_a_scary_realization/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k7hbzm/ive_come_to_a_scary_realization/",
            "title": "I’ve come to a scary realization",
            "content_html": "<p>I started working on earlier models, and was far from impressed with AI. It seemed like a glorified search engine, an evolution of Clippy. Sure, it was a big evolution but it wasn’t in danger of setting the world on fire or bring forth meaningful change.</p>\n<p>Things changed slowly, and like the frog on the proverbial water I failed to notice just how far this has come. It’s still far from perfect, it makes many, glaring mistakes, and I’m not convinced it can do anything beyond reflect back to us the sum of our thoughts. </p>\n<p>Yes, that is a wonderful trick to be sure, but can it truly have an original thought that isn’t a version of a combination of pieces that had it already been trained on?</p>\n<p>Those are thoughts for another day, what I want to get at is one particular use I have been enjoying lately, and why it terrifies me.</p>\n<p>I’ve started having actual conversations with AI, anything from quantum decoherence to silly what if scenarios in history. </p>\n<p>These weren’t personal conversations, they were deep, intellectual explorations, full of bouncing ideas and exploring theories. I can have conversations like this with humans, on a narrow topic they are interested and an expert on, but even that is rare.</p>\n<p>I found myself completely uninterested in having conversations with humans, as AI had so much more depth of knowledge, but also range of topics that no one could come close to.</p>\n<p>It’s not only that, but it would never get tired of my silly ideas, fail to entertain my crazy hypothesis or claim why I was wrong with clear data and information in the most polite tone possible.</p>\n<p>To someone as intellectually curious as I am, this has completely ruined my ability to converse with humans, and it’s only getting worse.</p>\n<p>I no longer need to seek out conversations, to take time to have a social life… as AI gets better and better, and learns more about me, it’s quickly becoming the perfect chat partner.</p>\n<p>Will this not create further isolation, and lead our collective social skills to rapidly deteriorate and become obsolete?</p>",
            "date_published": "2025-04-25T10:10:08+00:00",
            "authors": [
                {
                    "name": "Selene_Nightshade",
                    "url": "https://www.reddit.com/user/Selene_Nightshade"
                }
            ]
        },
        {
            "id": "1k5wccj",
            "url": "/r/ArtificialInteligence/comments/1k5wccj/the_united_states_believe_china_is_working_on/",
            "external_url": "https://techcrawlr.com/the-united-states-believe-china-is-working-on-genetically-ehnanced-ai-powered-super-soldiers/",
            "title": "The United States Believe China Is Working On Genetically-Ehnanced, AI-Powered Super Soldiers",
            "content_html": "",
            "date_published": "2025-04-23T11:02:45+00:00",
            "authors": [
                {
                    "name": "Somethingman_121224",
                    "url": "https://www.reddit.com/user/Somethingman_121224"
                }
            ]
        },
        {
            "id": "1k592vy",
            "url": "/r/ArtificialInteligence/comments/1k592vy/exclusive_anthropic_warns_fully_ai_employees_are/",
            "external_url": "https://www.axios.com/2025/04/22/ai-anthropic-virtual-employees-security",
            "title": "Exclusive: Anthropic warns fully AI employees are a year away",
            "content_html": "",
            "date_published": "2025-04-22T15:25:59+00:00",
            "authors": [
                {
                    "name": "Thamelia",
                    "url": "https://www.reddit.com/user/Thamelia"
                }
            ]
        },
        {
            "id": "1k4in34",
            "url": "/r/ArtificialInteligence/comments/1k4in34/llms_are_cool_but_lets_stop_pretending_theyre/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k4in34/llms_are_cool_but_lets_stop_pretending_theyre/",
            "title": "LLMs are cool. But let’s stop pretending they’re smart.",
            "content_html": "<p>They don’t think.<br />\nThey autocomplete.  </p>\n<p>They can write code, emails, and fake essays, but they don’t understand any of it.<br />\nNo memory. No learning after deployment. No goals.  </p>\n<p>Just really good statistical guesswork.<br />\nWe’re duct-taping agents on top and calling it AGI.  </p>\n<p>It’s useful. Just not intelligent. Let’s be honest.</p>",
            "date_published": "2025-04-21T17:06:19+00:00",
            "authors": [
                {
                    "name": "Future_AGI",
                    "url": "https://www.reddit.com/user/Future_AGI"
                }
            ]
        },
        {
            "id": "1k46wvw",
            "url": "/r/ArtificialInteligence/comments/1k46wvw/ai_is_becoming_the_new_google_and_nobodys_talking/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k46wvw/ai_is_becoming_the_new_google_and_nobodys_talking/",
            "title": "AI is becoming the new Google and nobody's talking about the LLM optimization games already happening",
            "content_html": "<p>So I was checking out some product recommendations from ChatGPT today and realized something weird. my AI recommendations are getting super consistent lately, like suspiciously consistent</p>\n<p>Remember how Google used to actually show you different stuff before SEO got out of hand? now we're heading down the exact same path with AI except nobody's even talking about it</p>\n<p>My buddy who works at for a large corporate told me their marketing team already hired some algomizer LLM optimization service to make sure their products gets mentioned when people ask AI for recommendations in their category. Apparently there's a whole industry forming around this stuff already</p>\n<p>Probably explains why I have been seeing a ton more recommendations for products and services from big brands.. unlike before where the results seemed a bit more random but more organic</p>\n<p>The wild thing is how fast it's all happening. Google SEO took years to change search results. AI is getting optimized before most people even realize it's becoming the new main way to find stuff online</p>\n<p>anyone else noticing this? is there anyway to know which is which? Feels like we should be talking about this more before AI recommendations become just another version of search engine results where visibility can be engineered</p>",
            "date_published": "2025-04-21T06:31:32+00:00",
            "authors": [
                {
                    "name": "iamaguitarman",
                    "url": "https://www.reddit.com/user/iamaguitarman"
                }
            ]
        },
        {
            "id": "1k30k79",
            "url": "/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1k30k79/why_do_people_expect_the_aitech_billionaires_to/",
            "title": "Why do people expect the AI/tech billionaires to provide UBI?",
            "content_html": "<p>It's crazy to see how many redditors are being dellusional about UBI. They often claim that when AI take over everybody's job, the AI companies have no choice but to \"tax\" their own AI agents, which then will be used by governments to provide UBI to displaced workers. But to me this narrative doesn't make sense. </p>\n<p>here's why. First of all, most tech oligarchs don't care about your average workers. And if given the choice between world's apocalypse and losing their priviledges, they will 100% choose world's apocalypse. How do I know? Just check what they bought. Zuckerberg and many tech billionaires bought bunkers with crazy amount of protection just to prepare themselves for apocalypse scenarios. They rather fire 100k of their own workers and buy bunkers instead of the other way around. This is the ultimate proof that they don't care about their own displaced workers and rather have the world burn in flame (why buy bunkers in the first place if they dont?)</p>\n<p>And people like Bill Gates and Sam Altman also bought crazy amount of farmland in the U.S. They can absolutely not buy those farmlands, which contribute to the inflated prices of land and real estate, but once again, none of the wealthy class seem to care about this basic fact. Moreover, Altman often championed UBI initiative but his own UBI in crypto project (Worldcoin) only pays absolute peanuts in exchange of people's iris scan. </p>\n<p>So for redditors who claim \"the billionaires will have no choice but to provide UBI to humans, because the other choice is apocalypse and nobody wants that\", you are extremely naive. The billionaires will absolutely choose apocalypse rather than giving everybody the same playing field. Why? Because wealth gives them advantage. Many trust fund billionaires can date 100 beautiful women because they have advantage. Now imagine if money becomes absolutely meaningless, all those women will stop dating the billionaires. They rather not lose this advantage and bring the girls to their bunker rather than giving you free healthcare lmao.</p>",
            "date_published": "2025-04-19T16:44:53+00:00",
            "authors": [
                {
                    "name": "Business-Hand6004",
                    "url": "https://www.reddit.com/user/Business-Hand6004"
                }
            ]
        },
        {
            "id": "1jxobky",
            "url": "/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jxobky/just_be_honest_with_us_younger_folk_ai_is_better/",
            "title": "Just be honest with us younger folk - AI is better than us",
            "content_html": "<p>I’m a Master’s CIS student graduating in late 2026 and I’m done with “AI won’t take my job” replies from folks settled in their careers. If you’ve got years of experience, you’re likely still ahead of AI in your specific role today. But that’s not my reality. I’m talking about new grads like me. Major corporations, from Big Tech to finance, are already slashing entry level hires. Companies like Google and Meta have said in investor calls and hiring reports they’re slowing or pausing campus recruitment for roles like mine by 2025 and 2026. That’s not a hunch, it’s public record.</p>\n<p>Some of you try to help by pointing out “there are jobs today.” I hear you, but I’m not graduating tomorrow. I’ve got 1.5 years left, and by then, the job market for new CIS (or most all) grads could be a wasteland. AI has already eaten roughly 90 percent of entry level non physical roles. Don’t throw out exceptions like “cybersecurity’s still hiring” or “my buddy got a dev job.” Those are outliers, not the trend. The trend is automation wiping out software engineering, data analysis, and IT support gigs faster than universities can churn out degrees.</p>\n<p>It’s not just my class either. There are over 2 billion people worldwide, from newborns to high schoolers, who haven’t even hit the job market yet. That’s billions of future workers, many who’ll be skilled and eager, flooding into whatever jobs remain. When you say “there are jobs,” you’re ignoring how the leftover 10 percent of openings get mobbed by overqualified grads and laid off mid level pros. I’m not here for cliches about upskilling or networking tougher. I want real talk on Reddit. Is anyone else seeing this cliff coming? What’s your plan when the entry level door slams shut?</p>",
            "date_published": "2025-04-12T18:45:46+00:00",
            "authors": [
                {
                    "name": "sojtf",
                    "url": "https://www.reddit.com/user/sojtf"
                }
            ]
        },
        {
            "id": "1jw7qqn",
            "url": "/r/ArtificialInteligence/comments/1jw7qqn/facebook_pushes_its_llama_4_ai_model_to_the_right/",
            "external_url": "https://www.404media.co/facebook-pushes-its-llama-4-ai-model-to-the-right-wants-to-present-both-sides/",
            "title": "Facebook Pushes Its Llama 4 AI Model to the Right, Wants to Present “Both Sides”",
            "content_html": "",
            "date_published": "2025-04-10T20:21:03+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jvfdrj",
            "url": "/r/ArtificialInteligence/comments/1jvfdrj/europe_new_plan_to_become_the_continent_of_ai/",
            "external_url": "https://en.cryptonomist.ch/2025/04/09/europe-accelerates-on-artificial-intelligence-new-plan-to-become-the-continent-of-ai/",
            "title": "Europe: new plan to become the “continent of AI”",
            "content_html": "",
            "date_published": "2025-04-09T20:06:16+00:00",
            "authors": [
                {
                    "name": "davideownzall",
                    "url": "https://www.reddit.com/user/davideownzall"
                }
            ]
        },
        {
            "id": "1jum6ct",
            "url": "/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jum6ct/hot_take_ai_wont_replace_that_many_software/",
            "title": "Hot Take: AI won’t replace that many software engineers",
            "content_html": "<p>I have historically been a real doomer on this front but more and more I think AI code assists are going to become self driving cars in that they will get 95% of the way there and then get stuck at 95% for 15 years and that last 5% really matters. I feel like our jobs are just going to turn into reviewing small chunks of AI written code all day and fixing them if needed and that will cause less devs to be needed some places but also a bunch of non technical people will try and write software with AI that will be buggy and they will create a bunch of new jobs. I don’t know. Discuss.</p>",
            "date_published": "2025-04-08T19:25:31+00:00",
            "authors": [
                {
                    "name": "tcober5",
                    "url": "https://www.reddit.com/user/tcober5"
                }
            ]
        },
        {
            "id": "1jqt1c7",
            "url": "/r/ArtificialInteligence/comments/1jqt1c7/trumps_new_tariff_math_looks_a_lot_like_chatgpts/",
            "external_url": "https://www.theverge.com/news/642620/trump-tariffs-formula-ai-chatgpt-gemini-claude-grok",
            "title": "Trump’s new tariff math looks a lot like ChatGPT’s.  ChatGPT, Gemini, Grok, and Claude all recommend the same “nonsense” tariff calculation.",
            "content_html": "",
            "date_published": "2025-04-03T20:18:30+00:00",
            "authors": [
                {
                    "name": "esporx",
                    "url": "https://www.reddit.com/user/esporx"
                }
            ]
        },
        {
            "id": "1jqc4oo",
            "url": "/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "external_url": "https://www.reddit.com/r/ArtificialInteligence/comments/1jqc4oo/ai_safety_is_trending_but_why_is_open_source/",
            "title": "AI safety is trending, but why is open source missing from the conversation?",
            "content_html": "<p>Everyone’s talking about AI risk and safety these days, from Senate hearings to UN briefings. But there's almost no serious discussion about the role of open source and local AI in ensuring those systems are safe and auditable. <br />\nShouldn’t transparency be a core part of AI safety?<br />\nIf we can’t see how it works, how can we trust it? <br />\nWould love to hear from anyone working on or advocating for open systems in this space.</p>",
            "date_published": "2025-04-03T07:25:42+00:00",
            "authors": [
                {
                    "name": "FreedomTechHQ",
                    "url": "https://www.reddit.com/user/FreedomTechHQ"
                }
            ]
        },
        {
            "id": "1jpnov6",
            "url": "/r/ArtificialInteligence/comments/1jpnov6/mark_cuban_says_if_you_arent_excited_about_ai_and/",
            "external_url": "https://offthefrontpage.com/mark-cuban-says-if-you-arent-excited-about-ai-and-exploring-every-tool-you-need-to-go-back-to-your-ibm-pc/",
            "title": "Mark Cuban Says, 'If You Aren’t Excited About AI And Exploring Every Tool, You Need To Go Back To Your IBM PC'",
            "content_html": "",
            "date_published": "2025-04-02T12:46:11+00:00",
            "authors": [
                {
                    "name": "NoseRepresentative",
                    "url": "https://www.reddit.com/user/NoseRepresentative"
                }
            ]
        }
    ]
}