{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/btd6",
    "description": "For discussion of Bloons TD 6 by Ninja Kiwi with Ninja Kiwi!",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/btd6.json",
    "icon": "https://styles.redditmedia.com/t5_3k11a/styles/communityIcon_chsu9k1ino361.png",
    "favicon": "https://styles.redditmedia.com/t5_3k11a/styles/communityIcon_chsu9k1ino361.png",
    "items": [
        {
            "id": "u2ehaq",
            "url": "/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/",
            "external_url": "https://www.reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/",
            "title": "Bloons TD 6 - Update Notes! Version 31.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/'>Apollo</a></caption> <div><p>https://preview.redd.it/vksm1nfb67t81.png?width=800&amp;format=png&amp;auto=webp&amp;s=97f44e4e548dfa5beb46dfc510ef0e964616d140</p>\n<h1>Bloons TD 6 v31.0 - Update Notes!</h1>\n<p>Rolling out across iOS, Steam, (Android still a few hours away). Please restart your storefront or be patient if it does not appear for you, these updates can take some time to be rolled out to every region due to how the storefronts are set up.</p>\n<h1>Key New Features</h1>\n<ul>\n<li><strong>New Hero, Geraldo the Mystic Shopkeeper!</strong></li>\n<li>A bold adventurer and seeker of fine things, Geraldo has explored the distant, mysterious reaches of the Monkey world to assemble his signature collection</li>\n<li>Geraldo is almost nothing without his shop, so select the “Shop” icon next to Geraldo’s portrait when he is selected; the shop will remember its open or closed state for easy access &amp; can be toggled open/closed for PC users with the Monkey Special hotkey (PageDown)</li>\n<li>Shop items have a variety of uses - some place on the map, some on the track, others target Monkeys or subtowers; they all must be pulled from the shop to the playfield</li>\n<li>Get ready for a wild ride, as Geraldo is intended to be a “build” hero, supporting a variety of strategies that are designed to scale; heaps of dev and balance time behind this one - we hope you enjoy the mysteries!</li>\n<li><strong>New Bloon Boss - Vortex, Deadly Master of Air!</strong></li>\n<li>Affectionately known as speedy boi, but it may be some time before you feel any affection for this incredibly tough boss</li>\n<li>Spawns with a temporary shield of wind that for a short time blows away all projectiles that are too slow to pass through it</li>\n<li>Natural Bloon spawns are buffed by Vortex’s slipstream, moving at incredible speeds until they catch up</li>\n<li>On Skulls Vortex stuns all nearby towers with a burst of lightning, activates its storm shield, and retreats a short distance</li>\n<li>Periodically triggers a storm wave that destroys all projectiles in a large radius</li>\n<li>Distributed placements and ranged attacks are key to victory - good luck!</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Beginner Map, Scrapyard!</li>\n<li>Old cars and other scrap go to die in places off the beaten track, but the Bloons have even found this remote location; defend the derelicts and don’t forget to play with the heavy machinery!</li>\n<li>Sorry to the players who submitted similar ideas during the competition, but we already had our own idea in the works for a while now</li>\n<li>New Trophy Store Items</li>\n<li>Bloons: Cat Ear Bloons, Disguise Glasses</li>\n<li>Co-op: Pat Flex emote,  Mind Blown emote</li>\n<li>Game &amp; UI: Sunshine Serenade - Fiesta Mix music track, 2 New Avatars - Super Monkey &amp; Striker Jones</li>\n<li>Reddit Banner Competition winners<ul>\n<li>Banner winner (Arrival) - by betapotata</li>\n<li>Banner winner (Beneath the Waves) - by Cyliia </li>\n</ul>\n</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>New Special Conditions for Custom Challenge victory</li>\n<li>Least Cash has no limits on earning cash &amp; allows all forms of income generation, but rewards victory only if a player remains below a chosen cash spent threshold</li>\n<li>Least Tiers limits victory to staying under a chosen value of tiers which increments for every tower/ upgrades/ hero/ level purchased</li>\n<li>We added these special conditions for victory as we thought they would be fun on their own, but we also have them in mind for the Contested Territory update coming later this year, as a variety of victory conditions will make the team dynamics needed to capture and hold a range of territory more interesting</li>\n<li>Updated Heroes Screen</li>\n<li>We’ve been wanting to update the Heroes screen for awhile, so with the addition of our 14th Hero, Geraldo, we made that happen</li>\n<li>Hopefully you will enjoy the full rework - making it easier to see all Heroes, allowing side by side comparisons of Heroes’ powers, and surfacing the visual changes that accompany various upgrades</li>\n<li>Structural and performance reworks to Bloons and the Bloon overlay system. All in the interest of tighter code and more flexibility for future updates.</li>\n<li>Added commas to Cash, Damage Numbers, &amp; Income for increased visibility and slightly delayed visits to your respective optometrists</li>\n<li>Large changes to backend co-op game communication between clients for increased stability</li>\n<li>Facebook friends’ scores has been replaced with LiNK Friends scores so that we have more reliable control of score sharing; please note your Facebook friends will not autopopulate into your LiNK Friends - you will have to reestablish any Friend connections manually</li>\n<li>Due to demand over the years, we have added a Logout option to our in game webview. Since we recommend players using another account for their modded games, it’s nice to support doing that a little better.</li>\n<li>To prevent event games running past the final cutoff on score submission time for ranked events, there will now be a short break in the final moments of competitive events in which the event is still active but no further games can be started. <em>*Note this will only be in place for ranked events, meaning that Boss events will allow you to create games still so long as you swap back to non-ranked mode</em></li>\n<li><em>Example: there is a 24h event, with a 1hour cutoff (the cutoff can be set to any value, bosses will have a longer one but races wont need so much)</em></li>\n<li><em>When the event first starts it will display 23h remaining not 24</em></li>\n<li><em>After those 23 hours once the timer ends it begins a new timer with 1h remaining</em></li>\n<li><em>During this final hour you cannot start a new game or continue an existing game on ranked mode, but you can finish off one that is already started and open</em></li>\n<li><em>If you quit out of a run that has already started, that's it, you will not be able to enter the play menu to load that save again.</em></li>\n<li><em>In the case of bosses, you can swap back to non-ranked mode and create as many games as you want as normal during this final hour to finish off your milestones if you have not done them</em></li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved an issue with Custom Odyssey title/description being reset</li>\n<li>Changed how boss bloon status overlays are applied to look better</li>\n<li>Resolved an issue with Techbot ignoring hard limits on ability use in custom challenges in regards to overlap, causing laggy animation loops</li>\n<li>Resolved players getting booted out of co-op sessions on some low end devices due to being timed out from a long desync</li>\n<li>Optimizations made to freeplay roundsets</li>\n<li>Resolved some low quality animation issues</li>\n<li>Using Thrive right before defeat, and restarting should no longer break the animation</li>\n<li>Fixed some incorrect medal displays on leaderboards</li>\n<li>Resolved some specific cases causing the pause penalty on races to carry over onto the next attempt</li>\n<li>Join Match button in play social now checks if you have internet again on press to prevent some edge case creation of broken lobbies requiring a game restart</li>\n<li>Map Area data converted to a new System which should improve performance &amp; allow for more complex shapes</li>\n<li>Rocket Storm ability is now grayed out between rounds</li>\n<li>Add new localization for all hero skins to remove ‘skin’ from their names on player profiles.</li>\n<li>Resolved some issues with retry last round in challenge editor</li>\n<li>Resolved some issues with hero skins changing when changing owner in co-op</li>\n<li>Resolved a number of rare crashes</li>\n<li>Added a new icon for the ‘Create Challenge’ button</li>\n<li>Fixed Water Textures on Cargo map</li>\n<li>A number of minor UI fixes</li>\n<li>Resolved some issues with UI animation speed</li>\n<li>Resolved a number of map specific height and placement issues</li>\n<li>Added in fixes in a number of places to prevent the game from crashing due to certain server issues or loading broken challenges</li>\n<li>Resolved an edge case crash on the data conflict screen</li>\n<li>Resolved a crash with Lych Soul being saved on multi-path maps</li>\n<li>Investigation success</li>\n</ul>\n<p>Boomerang Monkey</p>\n<ul>\n<li>5xx Boomerang glaives again crosspath correctly with xx2</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<ul>\n<li>Resolved Buccaneer showing wrong upgrade text after upgrading a ninja</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>104 Heli's Mini Comanche now correctly fire 5 darts at a time </li>\n<li>xx5 Comanche Commander's damage has been corrected with crosspaths</li>\n</ul>\n<p>Mortar Monkey</p>\n<ul>\n<li>502 Mortar now applies burn to DDTs without MIB so long as they circumvent the camo</li>\n</ul>\n<p>Dartling Gunner</p>\n<ul>\n<li>x5x MAD height inconsistencies compare to x4x Rocket Storm have been resolved</li>\n</ul>\n<p>Wizard Monkey</p>\n<ul>\n<li>042 Summon Phoenix should now correctly interact with camo prio</li>\n</ul>\n<p>Ninja Monkey</p>\n<ul>\n<li>Resolved an issue with Master Bomber Stickies sometimes hitting regular Bloons instead of MOABs</li>\n</ul>\n<p>Druid</p>\n<ul>\n<li>5xx Superstorm now benefits from Ball Lightning 25% freeze chance regardless of crosspath</li>\n<li>Resolved an issue with the Cold Front MK not always showing ice overlays on Bloons</li>\n</ul>\n<p>Monkey Village</p>\n<ul>\n<li>Resolved some inconsistencies with top path farm buff icons</li>\n</ul>\n<p>Engineer</p>\n<ul>\n<li>xx4 Bloon Trap issue resolved on Sunken Columns with Bloontraps falling under the map in certain locations</li>\n<li>014 Bloon Trap issue resolved with certain conditions causing Bloontraps to repeatedly auto-collect even while empty</li>\n</ul>\n<p>Adora</p>\n<ul>\n<li>Adora sacrifice buff should now apply to Mini Sun Avatars from Temples</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>Resolved an issue with Admiral Brickell's Mega Mine sometimes not showing stun effects</li>\n</ul>\n<h1>Desktop Version</h1>\n<ul>\n<li>If you have already placed your hero, your ‘Hero hotkey’ (U by default) will now swap to instead ‘select your hero’ wherever it is. If you have more than one hero this will cycle through them</li>\n<li>Resolved an issue with using hotkeys during loading screens causing some tower portraits to become faded out</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>To add a little more synergetic crosspath use for the Juggernaut 402 crosspath, xx2 will now also grant bonus projectile lifespan, this applies to any use of that crosspath though we feel it will in particular pair nicely with the ricocheting projectiles. Juggernaut in general is also seeing a small utility knockback buff to help it carry on a little longer into the game.</p>\n<ul>\n<li>xx1 Long Range Darts also increases projectile lifespan +15%</li>\n<li>xx2 Enhanced Eyesight also increases projectile lifespan +20%</li>\n<li>4xx Juggernaut gains a slight Bloon knockback (Same as xx3 dartling, but half duration)</li>\n</ul>\n<p>Bomb Shooter</p>\n<p>The Frags crosspath for top path Bomb Shooter has always been quite a poor choice, trying to compete with attack speed as a benefit for stun utility isn’t going to ever work out so we have instead gone the route of turning the frags crosspath into a DPS/Stun hybrid with a lot of small buffs to frag power.</p>\n<ul>\n<li>302 Really Big Bombs frag damage increased 1 -&gt; 3</li>\n<li>302 Really Big Bombs gains more frags 8 -&gt; 12</li>\n<li>402 Bloon Impact frag pierce increased +1</li>\n<li>402 Bloon Impact frag damage increased 2 -&gt; 3</li>\n<li>402 Bloon Impact gains even more frags 8 -&gt; 16</li>\n<li>502 Bloon Crush remains at frag damage 12</li>\n<li>502 Bloon Crush frags gain bonus to ceramic +12</li>\n<li>502 Bloon Crush gains frag pierce 3 -&gt; 20</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>2xx Corrosive Glue DoT rate increased 2.3s -&gt; 2</li>\n<li>3xx Bloon Dissolver DoT ceramic bonus increased 0 -&gt; 1</li>\n<li>4xx Bloon Liquifier DoT ceramic bonus unchanged</li>\n<li>5xx The Bloon Solver bonus moab damage increased 3 -&gt; 5</li>\n</ul>\n<p>Monkey Sub</p>\n<p>Energizer upgrade offers nothing extra to the reactor sub aside from niche utility buffs, so we have increased the lategame cleanup potential by a large amount to help deal with Super Ceramics.</p>\n<ul>\n<li>5xx Energizer damage increased 3 -&gt; 5</li>\n<li>5xx Energizer now adds bonus damage to ceramics +5</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>The base Grape attack of T4 MOAB Takedown has had a ceramic bonus added to lead up to the T5 a little better.</p>\n<ul>\n<li>x4x MOAB Takedown grapeshot ceramic bonus added +1</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Spy Plane is always a lesser crosspath aside from specific challenges that call for camo detection. It has a similar vibe to Night Vision sniper so we have given it a similar buff.</p>\n<ul>\n<li>x2x Spy Plane grants attacks bonus damage to camos +1</li>\n</ul>\n<p>Heli Pilot</p>\n<p>Previously Razor Rotor’s used to make the heli pursue for a further distance &amp; this caused it to often fail to reach Lead Bloons with the rotor attack that could pop them. This overall seemed like a design flaw so that back-off distance has been moved up to the T4 instead. Apache Dartship has also fallen off over time as a viable saveup for prime, though it is meant to be reasonably difficult some changes have made this a little more difficult than it probably should be so we have increased the pierce of the machinegun attack.</p>\n<ul>\n<li>3xx Razor Rotor’s pursuit no longer backs so far away from Leads that it can’t hit them</li>\n<li>4xx Apache Dartship pursuit distance increase now occurs here</li>\n<li>4xx Apache Dartship Machinegun pierce increased 5 -&gt; 7</li>\n<li>5xx Apache Prime Machinegun pierce unchanged</li>\n</ul>\n<p>Dartling Gunner</p>\n<p>Ray of Doom suffers from the downsides of being designed as a high piercing tower, for the price this makes it feel far too weak against the round 100 BAD if you invest in it too early without some other forms of single target, to bring back a little of the interesting sort of targeting that the T4 has and help with this single target problem it will now deal a massive damage bonus to the first target hit along the beam’s path.</p>\n<ul>\n<li>5xx Ray of Doom now deals bonus damage to the first target hit +55</li>\n<li>3xx Laser Cannon pierce increased from 4 -&gt; 6</li>\n<li>302 Laser Cannon pierce increased from 6 -&gt; 9</li>\n<li>xx2 Powerful Darts now also gives 'larger projectiles' as a crosspath</li>\n<li>002 Powerful Darts normal projectile size increased from 2 -&gt; 3</li>\n<li>032 Hydra Rocket Pods explosion size increased from 8 -&gt; 12</li>\n<li>402 Plasma Accelerator focal point size increased from 4 -&gt; 6</li>\n<li>402 Plasma Accelerator beam width increased from 2 -&gt; 3</li>\n<li>502 Ray of Doom beam width increased from 6 -&gt; 9</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Arcane Blast's benefit to the base tower is quite small for the price and also doesn't carry on well as a crosspath to the other T3s since they add new attacks instead of buffing the base attack, the price has been reduced to add a little more value here along with more MOAB damage at the T5 to give it a little more value over Arcane Spikes. As we somewhat expected the last Prince of Darkness rework didn’t end up really nerfing it so much, so we are now following up with a small price nerf.</p>\n<ul>\n<li>2xx Arcane Blast price reduced $600 -&gt; $450</li>\n<li>5xx Archmage bonus damage to MOABs 17 -&gt; 19</li>\n<li>xx5 Prince of Darkness price increased from $24,000 -&gt; 26,500</li>\n</ul>\n<p>Super Monkey</p>\n<p>Robo didn't need to lose pierce in the last Super Monkey T2 rework, and Dark Knight feels like it has too much pierce without ever considering the pierce crosspath. So to balance these together we’ve taken out pierce from Dark Knight and added it back into x2x carrying up into Robo Monkey. Dark Champion pierce is increased rather than decreased to push it further ahead of Dark Knight.</p>\n<ul>\n<li>x2x Epic Range increases pierce further 3 -&gt; 4</li>\n<li>xx3 Dark Knight pierce decreased 5 -&gt; 4</li>\n<li>xx4 Dark Champion pierce increased 7 -&gt; 8</li>\n</ul>\n<p>Ninja Monkey</p>\n<p>Grand Sabotage is extremely powerful in freeplay, but really boring outside of that one scaling mechanic. For a little more flavour with the shinobi mechanic, the T5 will now boost the potential of your shinobi army.</p>\n<ul>\n<li>x5x Grand Sabotage ability grants all your Shinobi on screen +5 range</li>\n<li>x5x Grand Sabotage ability grants all Shinobi +1 damage to MOABs</li>\n</ul>\n<p>Banana Farm</p>\n<p>Partially to help a little with tedious endgame farm collection in ranked boss events, or any other use you may desire for it, we have added a non-power form of easy banana collection. However  we do not want to trivialize the intended downside of opting for a more micro intensive farm path too much, so this is still restricted behind a low-range tier 5 upgrade.</p>\n<ul>\n<li>xx5 Monkey Wall Street now collects nearby bananas/crates as a Monkey Farmer would</li>\n</ul>\n<p>Spike Factory</p>\n<p>To help make the tradeoff of building one T5 over multiple T4 not be as hard a choice, the basic attack on Carpet of Spikes has had power increased significantly over rate, range &amp; damage.</p>\n<ul>\n<li>x5x Carpet of Spikes range increased from 34 -&gt; 50</li>\n<li>x5x Carpet of Spikes main damage increased from 3 -&gt; 4</li>\n<li>x5x Carpet of Spikes main attack delay reduced 0.98s -&gt; 0.33</li>\n</ul>\n<p>Monkey Village</p>\n<p>Call to Arms ability suffers from uptime, for such an expensive upgrade which is such low range and purely support this makes it hard to use, so duration has now been increased to push it up to a 1/3rd uptime threshold</p>\n<ul>\n<li>x4x Call To Arms ability duration increased 12 -&gt; 15</li>\n<li>x5x Homeland duration remains unchanged</li>\n</ul>\n<p>Engineer</p>\n<p>Sentry Expert really needed some logic fixes to get more of the actual correct sentries placed at the right times, it has also received a number of power buffs across the board to the special sentries at T4 complimenting the new logic reworking. Cleansing Foam has had some extra crosspath utility added at the cost of a small price increase and a large decrease to Ultraboost price.</p>\n<ul>\n<li>4xx Sentry Expert logic has been reworked to evaluate threat levels based on Bloon types that it can counter, Bloon types that counter the sentries that it wants to spawn, and which of the current threats on screen is the greatest. Distribution of sentry types should scale based on how much one Bloon threat is more of a threat than another.</li>\n<li>4xx Sentry Expert Crush Sentry ceramic damage bonus increased from 1 -&gt; 4</li>\n<li>4xx Sentry Expert Crush Sentry damage type changed from Sharp -&gt; Shatter</li>\n<li>4xx Sentry Expert Bomb Sentry damage increased 2 -&gt; 4</li>\n<li>4xx Sentry Expert Cold Sentry pierce increased from 15 -&gt; 25</li>\n<li>4xx Sentry Expert Cold Sentry radius increased from 12 -&gt; 18</li>\n<li>4xx Sentry Expert Energy Sentry gain moab damage bonus of +2</li>\n<li>x3x Cleansing Foam price increased from 800 -&gt; 850</li>\n<li>032 Pin allows Cleansing Foam to slow Bloons 50% briefly</li>\n<li>130 Foam makes Sentries shoot Foamy nails that strip properties</li>\n<li>x5x Ultraboost price decreased from $120,000 -&gt; 105,000</li>\n</ul>\n<p>Gwendolin</p>\n<p>Gwendolin’s Firestorm damage doesn’t carry well into the endgame so has been buffed at a later level.</p>\n<ul>\n<li>Lv16 Firestorm base damage tic increases from 1 &gt; 5</li>\n<li>Lv16 Firestorm MOAB damage tic increases from 10 &gt; 15</li>\n</ul>\n<p>Pat Fusty</p>\n<p>Pat Fusty was initially given a smaller footprint than it felt he should have due to concerns about balance with his small radius, but actually has been extremely powerful for a long time despite these radius issues. We feel like now giving him back the footprint size that he always should have had similar to Churchill will add a reasonable lategame downside to consider without harming his early use so badly.</p>\n<ul>\n<li>Pat Fusty footprint increased from 7 -&gt; 8</li>\n</ul>\n<p>Admiral Brickell</p>\n<p>The Sea Mines delay that was added back in 29 has done well for reducing some of Brickells weaknesses, but as we expected somewhat does add in new weaknesses to rush rounds of Bloons that can now sneak past before all of her mines have been able to acquire a target. To help lessen this new issue she has gained a brand new ability that will allow more Sea Mines to rapidly deploy and find a target over a short duration.</p>\n<ul>\n<li>Lv7 Blast Chain utility ability added for Admiral Brickell. For 10 seconds all sea mines have their delay halved (the new one added in 29), &amp; their projectile speed doubled</li>\n</ul>\n<p>Psi</p>\n<p>We felt that Psi’s early game too easily carried into some extremely powerful endgame setups. These setups were overperforming due to certain cooldown interactions with stalling out cooldown, however in an effort to try to avoid nerfing the cooldown for the average player we decided to make that stalling synergy harder to pull off instead.</p>\n<ul>\n<li>Psi base price increased $800 -&gt; 1000</li>\n<li>Lv10 Psionic Scream ability 'speed of blow back' increased from bloon speed 300% -&gt; 600%</li>\n</ul>\n<p>Glue Rat</p>\n<p>Glue Rat pet has been overperforming in all game modes for a while now without any apparent weakness or strategic downsides.</p>\n<ul>\n<li>Base movement speed ramping level endures persistently</li>\n<li>Max level goggle tightness loosened from Max -&gt; Sam</li>\n</ul></div>",
            "date_published": "2022-04-13T01:17:10+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "0",
            "url": "https://www.reddit.com/r/btd6",
            "title": "r/btd6 has been launched!",
            "content_html": "<p>This feed will be populated as posts match the given criteria.</p>"
        }
    ]
}