{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/btd6",
    "description": "For discussion of Bloons TD 6 by Ninja Kiwi with Ninja Kiwi!",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/btd6.json",
    "icon": "https://styles.redditmedia.com/t5_3k11a/styles/communityIcon_chsu9k1ino361.png",
    "favicon": "https://styles.redditmedia.com/t5_3k11a/styles/communityIcon_chsu9k1ino361.png",
    "items": [
        {
            "id": "12ld01f",
            "url": "/r/btd6/comments/12ld01f/bloons_td_6_update_notes_version_361_362/",
            "external_url": "https://www.reddit.com/r/btd6/comments/12ld01f/bloons_td_6_update_notes_version_361_362/",
            "title": "Bloons TD 6 - Update Notes! Version 36.1 & 36.2",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/12ld01f/bloons_td_6_update_notes_version_361_362/'>Reddit</a></caption><div><br></div><div><p>https://preview.redd.it/w5f104o7oqta1.png?width=350&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=d213e78894824f2977d3df9653d71f0ad5ce56f5</p>\n<p><a href=\"https://www.reddit.com/r/btd6/comments/12b3jtl/bloons_td_6_update_notes_version_360/\">You can view the full list of 36.0 changes here.</a></p>\n<h1>Bloons TD 6 v36.2 - Update Notes!</h1>\n<p><strong>Fixes</strong></p>\n<ul>\n<li>Achievement “What did it cost? - everything” now excludes the Beast Handler</li>\n<li>Resolved an issue with the co-op daily challenges. These will be returning to their regular time slots once the update is live everywhere</li>\n<li>Resolved an issue when selecting remote save when a save conflict occurs</li>\n<li>Resolved an issue causing a softlock when logging in with an Apple ID account</li>\n<li>Resolved an issue when loading a quest save</li>\n<li>Resolved an issue when loading into a co-op game that would sometimes crash the game</li>\n<li>Resolved an issue when Patch would pulse to indicate there was new information but there was not</li>\n<li>Resolved an issue with starting cash distribution in co-op games</li>\n</ul>\n<h1>--- v36.1 - Update Notes! ----</h1>\n<p><strong>Fixes</strong></p>\n<ul>\n<li>\n<p>Resolved an issue where retry last round in the challenge editor was deducting monkey money  </p>\n</li>\n<li>\n<p>We are working to identify all cases where players lost Monkey Money due to this bug and reimburse it. We will update this post with more info as it becomes available!</p>\n</li>\n<li>Resolved an issue where playing the Biker Bones race quest would delete your daily challenge save</li>\n<li>Resolved an issue where Adora was dealing no damage at level 1</li>\n<li>Resolved an issue where co-op lobbies could be started with only 1 player</li>\n<li>Resolved a crash that could occur when the game host places a 040 beast handler then quits</li>\n<li>Resolved a crash that could occur purchasing tier 3 Beast Handler upgrades with a tower that has 2 contributors</li>\n<li>Resolved an issue where xx1 Beast Handler Beasts would continue attacking on 0 lives</li>\n<li>Resolved an issue where the Description for 3xx Great White was being used for the title in Danish</li>\n<li>Resolved an issue where 3xx Great White thrash rate was occurring too frequently if the beast was unable to consume the target &amp; causing merges to not work correctly</li>\n<li>Resolved a crash that could occur when moving through quest dialogue too quickly</li>\n<li>Resolved an issue with the rendering height of butterflies on The Cabin</li>\n<li>Quincy no longer shows a notification pip for his quest being 'available' before the player is actually high enough rank</li>\n<li>Resolved an issue where an Invalid ‘get all’ button was appearing in hero UI</li>\n<li>Resolved an issue where towers with upgrades on 2 paths were no longer showing ‘Path Locked’ text on the 3rd path</li>\n<li>Resolved an issue where selecting only 1 tower for an odyssey would center it in the UI incorrectly</li>\n<li>Resolved a case where Quest Patch on the Main Menu screen was showing a pulse when there was nothing to check</li>\n<li>Resolved an issue where Beast Handler was causing some monkeys in the monkeys menu to not show their current XP earned</li>\n<li>Resolved an issue where tower selection in custom Odysseys was cut off at the bottom and able to be dragged up</li>\n<li>Resolved an issue where the background panel was missing for boss leaderboards when accessed on the in game victory screen</li>\n<li>Resolved an issue with Beast Handler showing incorrect line of sight limitations when moving beasts</li>\n</ul></div>",
            "date_published": "2023-04-14T00:28:04+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "12b3jtl",
            "url": "/r/btd6/comments/12b3jtl/bloons_td_6_update_notes_version_360/",
            "external_url": "https://www.reddit.com/r/btd6/comments/12b3jtl/bloons_td_6_update_notes_version_360/",
            "title": "Bloons TD 6 - Update Notes! Version 36.0",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/12b3jtl/bloons_td_6_update_notes_version_360/'>Reddit</a></caption><div><br></div><div><p>https://preview.redd.it/ww9dvy4z7rra1.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;v=enabled&amp;s=864231359cee63d914eb1bb60a8ada8044da4032</p>\n<h1>Bloons TD 6 v36.0 - Update Notes!</h1>\n<p>The update button has been pressed! These updates can take some time to be rolled out to every region due to how the storefronts are set up. Please restart your storefront or be patient if it does not appear for you right away.</p>\n<p>While you wait, you can check out the <a href=\"https://youtu.be/_Nq4f9n2vdU\">update video here.</a></p>\n<h1>Key New Features</h1>\n<ul>\n<li>New Tower - <strong>The Beast Handler</strong></li>\n<li>chomp, rawr, kakaw!</li>\n<li>So much to say about this tower, but mainly we so hope you enjoy it!</li>\n<li>The first never before seen tower to join the BTD universe since the Druid and Alchemist at launch almost 5 years ago.</li>\n<li>This tower plays and gains power in a completely unique way, and there are intentional tradeoffs along the way - you need to choose the right time to Merge beasts or just like any other tower whether more separate and lower-power beasts are situationally better.</li>\n<li>This is a Support class tower, so seeing how it works with your favorite builds is part of the fun.</li>\n<li>BTW making cool-looking giant beasts pop Bloons has been pretty awesome, even though it took us twice as long as expected. Thanks for your patience!!!</li>\n<li>Quests! Quests are self-contained challenges with their own special rules, difficulty, and unlock requirements. Patch joins the main menu and acts as the entry point for the Quest system. The intent along with fun gameplay is to sprinkle more story into the game, teaching certain strategies, introducing game modes, trying out items before unlocking them, as well as being a place for us to experiment with new mechanics. Did someone say special missions? No we didn’t say that for 36, but definitely downstream.</li>\n<li>With the launch of the Quests system we have 3 beginner Quests aimed towards newer players. In future updates we will expand this with mid-rank, high rank, and expert level Quests that will introduce higher level ideas and challenges.</li>\n<li>Beast Handler Quest - The Dartling Gunner unlocks via a basic pop target objective, but this was a simple system and had nothing to do with the tower itself. To unlock the Beast Handler with this update, rank 40+ players will take on a short adventure using the lower tiers of this tower.</li>\n<li>Race Introduction - When Races unlock at rank 20, they can be quite an intimidating system to start learning. Now rank 20+ players will be able to access their first persistent race, available from the Quest menu. This is a short introduction aimed at new players, or players new to Races. More challenging Race Quests will be added in the future.</li>\n<li>Quincy’s Trial - All players start the game with Quincy available, and now from the Quest menu or from Quincy's profile on the Hero menu players will be able to engage in a short mission showcasing his strengths</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Map - Polyphemus</li>\n<li>No, Lotus Island was never going to be the only stop on that epic journey</li>\n<li>Your next adventure is Polyphemus, whose one great eye closes over any towers in its site. Never fear, unlike Monkdyseus, your crew is not dead, just out of play until you can open the eye again.</li>\n<li>Another one made with challenges in mind, and yes, we’ll look for other uses for this mechanic in the future.</li>\n<li>New Achievements - a simple intro to quests with: Side Quest, World League Training</li>\n<li>New Trophy Store Items</li>\n<li>Monkeys: Tack Shooter Hedgehog pet</li>\n<li>Bloons: Lobster BFB skin</li>\n<li>Game &amp; UI: Avatar73 - Necromancer, Avatar74 - Darts, Avatar75 - Gravelord Lych, Avatar76 - Sun Hat Adora</li>\n<li>Competition Winning items</li>\n<li>Banner29 - community banner by ratcrunch - Avatar of Darkness</li>\n<li>Limited Time only</li>\n<li>Alchemist Flower splash projectiles, Banner29 - Blossom Temple</li>\n<li>New CT Team Store items</li>\n<li>Base Props: Dino Spring Egg, Cake Baker Monkey</li>\n<li>Icons: Overclocked Icon, Choc Bunny icon</li>\n<li>Frames: Bloon From The Dead frame, Flower Burst frame</li>\n</ul>\n<h1>Game Changes / Additions</h1>\n<ul>\n<li>Reworked towers with secondary attack target options to use a smaller icon for this target that is no longer linked to the target priority display. We apologize to the players who were comfortable with the “buttonized” target priorities, but many players were confused by that implementation, so we’re hoping this is a better, clearer UI for all.</li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved an issue with damage bonuses to ‘stunned targets’ where the bonus was not always being applied correctly to targets that were stunned again before their previous stun expired</li>\n<li>Resolved a number of cases of UI not fitting correctly in some resolutions</li>\n<li>Resolved a softlock that could occur canceling request to join a team and reapplying to the same team</li>\n<li>Resolved an issue that could prevent some Teams from appearing when searched</li>\n<li>Resolved sparkle effect not playing on Instamonkey Black borders when viewed through the in game Powers menu</li>\n<li>Resolved an issue that could prevent players from accepting an invite to a team</li>\n<li>Resolved some issues with some textures loading with low resolutions</li>\n<li>Made a number of corrections to tower descriptions</li>\n<li>Resolved an issue with placement behind the water tower on Middle of the Road</li>\n<li>Resolved an issue where certain pets could move under raised terrain and become hidden</li>\n<li>Resolved a game crash that could occur when you select a tower and then quickly perform a tap-hold-drag action.</li>\n<li>Resolved an issue with UI breaking after attempting to create a team without enough monkey money</li>\n<li>Resolved an issue that could prevent paragons from sacrificing their T5 towers</li>\n<li>Added some tap feedback to buttons which did not give feedback</li>\n<li>Added an audio prompt when players join co-op lobbies</li>\n<li>A number of localization fixes</li>\n</ul>\n<h1>Event bug fixes</h1>\n<ul>\n<li>Resolved an issue with Boss Checkpoints not being offered if taking 20 rounds to lose to a boss</li>\n<li>Resolved an issue with Boss co-op lobbies not respecting main boss menu ranked checkbox option</li>\n<li>Resolved an issue that could allow guest accounts to load into co-op event lobbies</li>\n<li>Resolved an issue with Bosses scaling their health both from Boss &amp; MOAB multipliers</li>\n<li>Added Retry Last Round functionality to co-op Boss events</li>\n<li>Resolved a number of Boss HP scaling inconsistencies</li>\n<li>Resolved an issue where T5 bosses would defeat the player earlier than intended</li>\n<li>Corrected the format of CT Time Attack score display</li>\n<li>Resolved an issue that could prevent claiming prime gaming rewards</li>\n<li>Resolved an issue where CT Team tickets may not refresh as often as they should</li>\n<li>Resolved an issue with Odyssey extreme overlay being cropped on wide devices</li>\n<li>Banned accounts will now restore their captured CT tiles to the previous owner</li>\n</ul>\n<h1>Tower Specific Fixes</h1>\n<p>Tack Shooter</p>\n<ul>\n<li>5xx Inferno Ring targeting priority inconsistency resolved</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>5xx Bloon Solver no longer incorrectly applies a pink asset below the green one</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>Resolved a crash that could occur  ¯\\_(ツ)_/¯</li>\n</ul>\n<p>Super Monkey</p>\n<ul>\n<li>050 The Anti-Bloon projectile color for main plasma attack corrected</li>\n</ul>\n<h1>Hero Specific Fixes</h1>\n<p>Ezili</p>\n<ul>\n<li>Resolved incorrect portrait levels for Galaxili</li>\n</ul>\n<p>Pat Fusty</p>\n<ul>\n<li>Resolved an issue with Pat’s height not being set correctly after chinook movement</li>\n</ul>\n<p>Adora</p>\n<p>Admiral Brickell</p>\n<ul>\n<li>Resolved incorrect portrait levels for Dread Pirate Brickell</li>\n</ul>\n<h1>Platform Specific fixes</h1>\n<ul>\n<li>Android: Resolved an issue with slow first time map navigation performance</li>\n</ul>\n<h1>Balance Changes</h1>\n<p><strong>Dart Monkey</strong></p>\n<p>Current Sharp Shooter niches appear to struggle with some tight placement due to their high range opening up a ranged niche but being extremely tight on that range, given this is actually 'the range path' it feels fair to help this with a little further increased range.</p>\n<ul>\n<li>xx4 Sharpshooter range increased 56 -&gt; 60 (+25% over xx2)</li>\n<li>xx5 Crossbow Master range increased 76 -&gt; 80 (+33% over T4)</li>\n<li>xx5 Crossbow Master price reduced from $23500 &gt; 21500</li>\n</ul>\n<p><strong>Boomerang Monkey</strong></p>\n<p>Boomerang’s Ricochet buildup into T4 feels rough compared to many other options that exist nowadays, ignoring obstacles worked out as a strong fix for the T4 so we want to bring that down to the T3 as well along with some other general tweaks to bridge this gap. Glaive lord is too expensive for so low a single target tower so this is going down. We wanted to include a take on the Boomerang paragon’s range buff improving so much to apply to other primaries along with the buff synergy in the last update, but time didn’t quite allow for it.</p>\n<ul>\n<li>3xx Glaive Ricochet now ignores obstacles</li>\n<li>3xx Glaive Ricochet price reduced from $1300 &gt; 1200</li>\n<li>3xx Glaive Ricochet pierce increased from 50 &gt; 60 (4xx same)</li>\n<li>3xx Glaive Ricochet jump distance increased from 62.5 &gt; 90</li>\n<li>4xx MOAR Glaives jump distance reduced from 187.5 &gt; 180</li>\n<li>5xx Glaive Lord price reduced from $32400 &gt; 29400</li>\n<li>Boomerang Paragon grants *0.9 rate to other primary towers including paragons</li>\n</ul>\n<p><strong>Tack Shooter</strong></p>\n<p>Tack Shooter lacks any significant crosspathing choice due to the overwhelmingly large rate increase from top path making it almost always too good an option, we are reducing this crosspath rate benefit but moving that amount back up to the T3.</p>\n<ul>\n<li>2xx Even Faster Shooting attack cooldown bonus 40% &gt; 25%</li>\n<li>3xx Hot Shots gains attack cooldown bonus 20% (0.63 rate)</li>\n</ul>\n<p><strong>Ice Monkey</strong></p>\n<p>Arctic wind felt extremely overbuffed with the slowing field going from 40 to 50%, but we like seeing the use on it go up so we want to meet halfway on that &amp; keep the higher slow at T5. While we like the added pierce value on x2x crosspathing, the drop of pierce on xx3 feels too large now on a tower that already had quite good crosspath balance, so we want to try out removing the pierce downgrade entirely here.</p>\n<ul>\n<li>x3x Arctic Wind slow area 60% &gt; 50%</li>\n<li>x5x Absolute Zero remains at 60%</li>\n<li>xx3 Icicles pierce increased from 20 &gt; 30 (just the same as base ice)</li>\n</ul>\n<p><strong>Glue Gunner</strong></p>\n<p>Our Glue rework last update wasn't quite ready soon enough to go through in depth balancing of how the new mechanics felt before release, but we still wanted to just get them out and see what people thought anyway, so this is mostly just a bit of catch up on that with fixes to crosspathing value.</p>\n<ul>\n<li>4xx Bloon Liquifier rate 1 &gt; 0.75 (T5 unchanged)</li>\n<li>5xx Bloon Solver glue puddles duration increased from 5 &gt; 7.7</li>\n<li>502 Bloon Solver glue puddles duration increased from 5 &gt; 16.8</li>\n<li>5xx Bloon Solver glue puddles pierce increased from 1 &gt; 3</li>\n<li>510 Bloon Solver glue puddles pierce increased from 1 &gt; 4</li>\n<li>5xx Bloon Solver puddles no longer filter out glued targets</li>\n<li>xx4 Relentless Glue on-pop stun pierce increased from 3 &gt; 6</li>\n<li>014 Relentless Glue on-pop stun pierce increased from 3 &gt; 7</li>\n<li>024 Relentless Glue on-pop stun pierce increased from 3 &gt; 9</li>\n<li>xx4 Relentless Glue on-pop stun duration increased from 0.5 &gt; 1</li>\n</ul>\n<p><strong>Sniper Monkey</strong></p>\n<p>Sniper is feeling really good, but Elite Defender gaining further increased MOAB Damage locked behind the 205 crosspath feels unnecessary now given how much current crosspath balance has started leaning towards favoring 205 anyway.</p>\n<ul>\n<li>xx5 Elite Defender MOAB Damage increased from 2 &gt; 4</li>\n<li>105 Elite Defender no longer increases MOAB Damage 1 &gt; 0</li>\n<li>205 Elite Defender no longer increases MOAB Damage 1 &gt; 0</li>\n</ul>\n<p><strong>Monkey Buccaneer</strong></p>\n<p>We wanted to do a little general lower tier balancing of costs, as things work a bit better at higher tiers but on the lower end with T1-2 upgrades cost for power doesn’t compare well. We’ve realized that the 130 crosspath just hasn’t even been working for cannons, so we wanted to correct this so that people get all that they pay for with that crosspath, however middle path buccaneer at higher tiers has been overperforming significantly so in addition to this attack speed buff we have also balanced back out that difference in the opposite direction with a damage reduction.</p>\n<ul>\n<li>1xx Faster Shooting price reduced $350 &gt; 275</li>\n<li>2xx Double Shot price reduced $550 &gt; 425</li>\n<li>xx1 Long Range price increased from $180 &gt; 200</li>\n<li>xx2 Crow's Nest price reduced from $400 &gt; 350</li>\n<li>x2x Hot Shot burn DoT damage increased from 1 &gt; 2</li>\n<li>130 Cannon Ship now reduces attack cooldown of the cannon</li>\n<li>x4x Monkey Pirates cannonball bonus to MOABs 6 -&gt; 3</li>\n<li>x5x Pirate Lord cannon-ball damage decreased 5 &gt; 3</li>\n<li>x5x Pirate Lord cannon-ball MOAB bonus decreased 10 &gt; 6</li>\n<li>x5x Pirate Lord cannon frags damage decreased 10 &gt; 6</li>\n<li>x5x Pirate Lord cannon frags MOAB bonus decreased 5 &gt; 4</li>\n</ul>\n<p><strong>Heli Pilot</strong></p>\n<p>For how powerful downdraft is in comparison to other blowback effects, it didn’t feel right that it wasn’t blowing off status effects as should be normal there. Redeploy feels like it has no business having so long a cooldown, maybe it could see more realistic use cases for this main mechanic if it was able to be utilized more frequently.</p>\n<ul>\n<li>x3x Downdraft can now remove ice &amp; glue mutators from blown Bloons</li>\n<li>x4x Heli redeploy ability cooldown reduced from 60 &gt; 45s</li>\n</ul>\n<p><strong>Wizard Monkey</strong></p>\n<p>Dragon’s Breath will still be great, just a little less excessively so</p>\n<ul>\n<li>x3x Dragons Breath attack rate 0.1 &gt; 0.125</li>\n<li>x3x Dragon's Breath ceramic damage bonus 1 &gt; 0</li>\n</ul>\n<p><strong>Super Monkey</strong></p>\n<p>Higher tiers on the bottom path have struggled to compare to clusters of T3s for a while now. To help with this we thematically really liked the idea of bottom path gaining a ricochet effect, possibly gaining teleport mechanic value repositioning for better ricochet angles, and a big improvement to the tower's camo path identity as higher tiers becomes far more effective at handling DDTs</p>\n<ul>\n<li>xx4 Dark Champion projectiles bounce (like quincy) 0.1s delay</li>\n<li>xx4 Dark Champion cost 60k &gt; 55,555</li>\n<li>xx4 Dark Champion camo bonus increased 1 &gt; 2</li>\n<li>xx5 Legend of the Night camo bonus increased 1 &gt; 4</li>\n<li>xx5 Legend of the Night moab bonus increased 8 &gt; 13</li>\n</ul>\n<p><strong>Ninja Monkey</strong></p>\n<p>Ironing out Caltrop inconsistency &amp; power a little on top and bottom T5s, but also as frequently unused caltrops clutter up the screen and cause extra lag we want to balance out their lifespan to reduce the number always on screen and make them no longer last longer than the base Spike Factory. Ninja currently appears to be the least competitive paragon, &amp; as it is also very similar in cost to the Navarch we feel that lowering Ninja into its own price range will fill a bit of a cost-gap and increase the effective value it has for the cost.</p>\n<ul>\n<li>502 Caltrops pierce increased from 5 &gt; 6</li>\n<li>xx2 Caltrops lifespan reduced from 70 &gt; 35</li>\n<li>xx5 Master Bomber's Caltrops damage increased 1 &gt; 5</li>\n<li>xx5 Master Bomber's Caltrops gain ceramic bonus +5</li>\n<li>Ninja Paragon cost reduced from $600k &gt; 500k</li>\n</ul>\n<p><strong>Druid</strong></p>\n<p>Slightly shifting price down from T4 into T3 midpath, and increasing the base cash amount gained from the ability as it currently needs quite a lot of initial investment to really get going at all compared to other farming options</p>\n<ul>\n<li>x3x Druid of the Jungle price increased from $950 &gt; 1050</li>\n<li>x4x Jungle's Bounty price reduced from $5000 &gt; 4900</li>\n<li>x4x Jungle’s bounty ability base $240 -&gt; $320</li>\n</ul>\n<p><strong>Spike Factory</strong></p>\n<p>Spiked Balls provides incredibly powerful cleanup in all stages of gameplay, and we like the use here but for a cheap T3 it doesn't drop off enough lategame with the lower pierce requirements there. Permaspike, while admittedly not often utilized to its max potential, has sat in a dominant high end position for a long time so we are shifting it away from such high pierce into more damage per pierce.</p>\n<ul>\n<li>3xx Spike Factory pierce reduced from 14 &gt; 12</li>\n<li>xx5 Permaspike pierce reduced 50 &gt; 25</li>\n<li>105 Permaspike pierce reduced 90 &gt; 45</li>\n<li>xx5 Permaspike damage increased 10 &gt; 15</li>\n</ul>\n<p><strong>Monkey Village</strong></p>\n<p>Last update included a change to the x2x Banana Farm which allowed Banks to finally receive external cash production buffs (previously none of these applied to bank path). This didn’t affect base level unbuffed farm balance, but some players noticed slight reductions in how effective buffs were when applied to other farms (320 and 023 crosspaths) due to this change, overall we’re positive about what the change means but to push back past that nerf to endgame farm synergy we balanced it out with a stronger synergy buff from villages</p>\n<ul>\n<li>xx4 village buff to cash producers increased from 15% &gt; 20%</li>\n</ul>\n<p><strong>Engineer</strong></p>\n<p>XXXL Trap 205 crosspath hasn’t actually ‘been working’ due to the base attack rate being faster than minimum deployment delay so we have slowed the base rate to make 205 crosspath actually matter. Along with this, since the fortification bonus aspect of x2x hasn’t ever done anything for Bloontraps, 024 will now ignore the fortification of Bloons that it eats</p>\n<ul>\n<li>024 Bloontrap de-fortifies anything that it consumes</li>\n<li>005 Bloontrap deploy rate reduced from *2.8 &gt; 5.8</li>\n<li>205 'should now work' and actually make Bloontrap’s cooldown faster</li>\n</ul>\n<p><strong>Adora</strong></p>\n<p>Adora skyrocketed in value with her fortification changes and this has been great, but the initial fort bonus she gains doesn't feel like it needs to immediately start at +2 given her base damage of only 1</p>\n<ul>\n<li>Lv9 Adora bonus damage to fortified Bloons reduced from 2 &gt; 1</li>\n</ul>\n<p><strong>Geraldo</strong></p>\n<p>Geraldo has a lot of items that are still undervalued compared to others while Pickles appears to stand far above the rest as the downside for the power increase isn’t quite enough. We’re pulling more of these lower &amp; higher items closer in to the middle</p>\n<ul>\n<li>Lv1 Pickle rate reduction increased from 1.25 &gt; 1.33</li>\n<li>Lv1 Stack of Nails rounds to replenish 5 &gt; 1</li>\n<li>Lv1 Stack of Nails amount replenished 2 &gt; 1</li>\n<li>Lv16 Stack of Nails pierce increased 14 &gt; 24</li>\n<li>Lv16 Stack of Nails damage type Sharp &gt; normal</li>\n<li>Lv9 Fertilizer duration reduced from 5 &gt; 4 rounds</li>\n<li>Lv10 Rabbit pierce increased from 10 &gt; 15</li>\n<li>Lv10 Rabbit max damage boosts increased 30 &gt; 40</li>\n<li>Lv10 Rabbit boost threshold requirement reduced 3000 &gt; 2,250</li>\n<li>Lv17 Tube of Amaz-o-Glue MOAB class extra pierce taken reduced MOAB 9 &gt; 4, DDT 19 &gt; 9, BFB 19 &gt; 9, ZOMG 49 &gt; 24</li>\n</ul>\n<p><strong>Dark Dungeons</strong></p>\n<p>The Spike Traps on Dark Dungeons weren’t intended to have a stun element and having this has scaled them through the game more effectively than intended, this has caused some balance implications so we are reducing the duration of the stun significantly. We also wanted to try out a few tweaks to the secret statue, allowing v2 to 1shot super ceramics, and v3 to 1shot fortified super ceramics along with a slight projectile speed increase on each upgrade.</p>\n<ul>\n<li>Spike Traps stun lifespan reduced 6 &gt; 1</li>\n<li>Dungeon Statue ball v2 projectile speed 24 &gt; 30</li>\n<li>Dungeon Statue ball v2 damage 50 &gt; 100</li>\n<li>Dungeon Statue ball v2 moab bonus 200 &gt; 150</li>\n<li>Dungeon Statue ball v2 cost $150,000 &gt; 100,000</li>\n<li>Dungeon Statue ball v3 projectile speed 24 &gt; 36</li>\n<li>Dungeon Statue ball v2 damage 100 &gt; 150</li>\n<li>Dungeon Statue ball v3 moab bonus 400 &gt; 350</li>\n<li>Dungeon Statue ball v3 cost $300,000 &gt; 200,000</li>\n</ul></div>",
            "date_published": "2023-04-04T00:30:59+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "128kk6z",
            "url": "/r/btd6/comments/128kk6z/bloons_td_6_update_notes_version_360/",
            "external_url": "https://www.reddit.com/r/btd6/comments/128kk6z/bloons_td_6_update_notes_version_360/",
            "title": "Bloons TD 6 - Update Notes! Version 36.0",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/128kk6z/bloons_td_6_update_notes_version_360/'>Reddit</a></caption><div><br></div><div><p>&#x200B;</p>\n<p>https://preview.redd.it/m07mwwaxk9ra1.png?width=300&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=944e59e3dbbb7099c6bf50ad324ec87d5eb648e0</p>\n<h1>Bloons TD 6 v36.0 - Update Notes!</h1>\n<p>Hello and welcome! We decided to release the balance notes a little ahead of time! Enjoy!</p>\n<p><strong>Update video:</strong> <a href=\"https://youtu.be/_Nq4f9n2vdU\">https://youtu.be</a><a href=\"https://youtu.be/ngfaj62UpCE\">/_Nq4f9n2vdU</a></p>\n<h1>Key New Features</h1>\n<ul>\n<li>New Tower - Mr Beast Handler</li>\n<li>chomp, rawr, kakaw!</li>\n<li>So much to say about this tower, but mainly we so hope you enjoy it!</li>\n<li>The first never before seen tower to join the BTD universe since the Druid and Alchemist at launch almost 5 years ago.</li>\n<li>This tower plays and gains power in a completely unique way, and there are intentional tradeoffs along the way - you need to choose the right time to Merge beasts or just like any other tower whether more separate and lower-power beasts are situationally better.</li>\n<li>This is a Support class tower, so seeing how it works with your favorite builds is part of the fun.</li>\n<li>BTW making cool-looking giant beasts pop Bloons has been pretty awesome, even though it took us twice as long as expected. Thanks for your patience!!!</li>\n<li>Quests! Quests are self-contained challenges with their own special rules, difficulty, and unlock requirements. Patch joins the main menu and acts as the entry point for the Quest system. The intent along with fun gameplay is to sprinkle more story into the game, teaching certain strategies, introducing game modes, trying out items before unlocking them, as well as being a place for us to experiment with new mechanics. Did someone say special missions? No we didn’t say that for 36, but definitely downstream.</li>\n<li>With the launch of the Quests system we have 3 beginner Quests aimed towards newer players. In future updates we will expand this with mid-rank, high rank, and expert level Quests that will introduce higher level ideas and challenges.</li>\n<li>Beast Handler Quest - The Dartling Gunner unlocks via a basic pop target objective, but this was a simple system and had nothing to do with the tower itself. To unlock the Beast Handler with this update, rank 40+ players will take on a short adventure using the lower tiers of this tower.</li>\n<li>Race Introduction - When Races unlock at rank 20, they can be quite an intimidating system to start learning. Now rank 20+ players will be able to access their first persistent race, available from the Quest menu. This is a short introduction aimed at new players, or players new to Races. More challenging Race Quests will be added in the future.</li>\n<li>Quincy’s Trial - All players start the game with Quincy available, and now from the Quest menu or from Quincy's profile on the Hero menu players will be able to engage in a short mission showcasing his strengths, like missing pink bloons</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Map - Polyphemus</li>\n<li>No, Lotus Island was never going to be the only stop on that epic journey</li>\n<li>Your next adventure is Polyphemus, whose one great eye closes over any towers in its site. Never fear, unlike Monkdyseus, your crew is not dead, just out of play until you can open the eye again.</li>\n<li>Another one made with challenges in mind, and yes, we’ll look for other uses for this mechanic in the future.</li>\n<li>New Achievements - a simple intro to quests with: Side Quest, World League Training</li>\n<li>New Trophy Store Items</li>\n<li>Monkeys: Tack Shooter Hedgehog pet, Village - Philippines Flag, Village - Trans Flag</li>\n<li>Bloons: Lobster BFB skin, true camo DDT skin, suspicious visor</li>\n<li>Game &amp; UI: Avatar73 - Necromancer, Avatar74 - Darts, Avatar75 - Gravelord Lych, Avatar76 - Sun Hat Adora</li>\n<li>Competition Winning items</li>\n<li>Banner29 - community banner by ratcrunch - Avatar of Darkness</li>\n<li>Limited Time only</li>\n<li>Alchemist Flower splash projectiles, Banner29 - Blossom Temple</li>\n<li>New CT Team Store items</li>\n<li>Base Props: Dino Spring Egg, Cake Baker Monkey</li>\n<li>Icons: Overclocked Icon, Choc Bunny icon</li>\n<li>Frames: Bloon From The Dead frame, Flower Burst frame</li>\n</ul>\n<h1>Game Changes / Additions</h1>\n<ul>\n<li>Reworked towers with secondary attack target options to use a smaller icon for this target that is no longer linked to the target priority display. We apologize to the players who were comfortable with the “buttonized” target priorities, but many players were confused by that implementation, so we’re hoping this is a better, clearer UI for all.</li>\n<li>Added option to enter Races with Monkey Money even if Race Passes are owned</li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<p><strong>Boomerang Monkey</strong></p>\n<ul>\n<li>5xx Glaive Lord and Glaive Dominus Rotating Glaives now visually change direction with the change hand targeting</li>\n</ul>\n<p><strong>Banana Farm</strong></p>\n<ul>\n<li>can now be purchased in Deflation and CHIMPS (they still will not make money)</li>\n<li>gains a pop count display and pop count now properly appears on Named Monkey records</li>\n<li>420, 520, 024, and 025 Farm; fixed bug where the More Valuable Bananas MK was not being used when buffed by a xx4 Village</li>\n<li>x3x Monkey Bank and above can withdraw using the 'Change Targeting' hotkey and withdraw all using the  'Reverse Change Targeting' hotkey</li>\n<li>x4x IMF Loan and above can deposit using the 'Monkey Special' hotkey</li>\n</ul>\n<p><strong>Obyn</strong></p>\n<ul>\n<li>fixed bug where blown back bloons were not filling up Wall of Trees</li>\n</ul>\n<p><strong>Benjamin</strong></p>\n<ul>\n<li>pop count now properly appears on Named Monkey records</li>\n</ul>\n<h1>Balance Changes</h1>\n<p><strong>Boomerang Monkey</strong></p>\n<p>Even with the previous buffs, MOAR Glaives performs poorly in comparison to other cleanup towers and Glaive Lord still struggles against fortified ceramics in the late game.</p>\n<ul>\n<li>4xx MOAR Glaives applies a weaker shred status to the first target hit that deals 3 moab damage every 1s for 15s</li>\n<li>402 MOAR Glaives gains bonus damage to MOABs +1</li>\n<li>5xx Glaive Lord main attack gains bonus to fortified +2</li>\n<li>5xx Glaive Lord Rotating Glaives bonus to fortified increased 2 &gt; 4</li>\n<li>5xx Glaive Lord Rotating Glaives pierce increased 80 &gt; 160</li>\n</ul>\n<p><strong>Ice Monkey</strong></p>\n<p>What was once a bug is back as a feature to help its reliability as a decamo option.</p>\n<ul>\n<li>4xx Embrittlement gains a separate larger decamo radius (similar to Signal Flare) and can decamo whites and zebras</li>\n</ul>\n<p><strong>Glue Gunner</strong></p>\n<p>Despite being purported as a ceramic counter, Bloon Liquefier is terrible at dealing with large groups even with the middle crosspath and as such makes for a poor saveup to The Bloon Solver. Continuing from the changes from last update, we are giving it Relentless Glue's old behavior to help it better deal with crowds, and providing more crosspath interactions for the blobs as promised. Glue Strike and Storm are also getting some reworks to make bottom crosspath more usable.</p>\n<ul>\n<li>4xx Bloon Liquefier upon destroying a Bloon now drops blobs of glue on the track that deal 1 pierce of 0 damage and applies the glue status to whatever hits it</li>\n<li>5xx The Bloon Solver glue blobs damage 20 &gt; 15</li>\n<li>5xx The Bloon Solver glue blobs lifetime 5s &gt; 7.5s</li>\n<li>510 The Bloon Solver glue blobs pierce 1 &gt; 2</li>\n<li>520 The Bloon Solver glue blobs pierce 1 &gt; 5</li>\n<li>501 The Bloon Solver glue blobs lifetime 5s &gt; 10s</li>\n<li>x4x Glue Strike ability can now hit MOAB-class bloons without Corrosive Glue</li>\n<li>x4x Glue Strike ability no longer weakens lead bloons</li>\n<li>x4x Glue Strike ability bonus damage taken while glued reduced 2 &gt; 1</li>\n<li>240 Glue Strike ability remains able to weaken lead bloons</li>\n<li>240 Glue Strike ability bonus damage taken while glued remains at 2</li>\n</ul>\n<p><strong>Monkey Buccaneer</strong></p>\n<p>Giving more utility to the underutilized crosspaths.</p>\n<ul>\n<li>402 Aircraft Carrier aircraft missiles damage type Explosive &gt; Normal</li>\n<li>502 Carrier Flagship buff grants camo detection and applies to towers placed on its decks</li>\n<li>203 Merchantman end of round income 200 &gt; 240</li>\n<li>204 Favored Trades sellback buff +10% -&gt; +12%</li>\n<li>204 Favored Trades end of round income 500 &gt; 600</li>\n<li>205 Trade Empire buff to xx3 limit increased 20 &gt; 24</li>\n<li>205 Trade Empire end of round income 800 &gt; 960</li>\n</ul>\n<p><strong>Monkey Ace</strong></p>\n<p>Toning back our last change to Neva-Miss, because it seems to have fallen off too much.</p>\n<ul>\n<li>xx3 Neva-Miss Targeting price reduced from $2800 &gt; $2400</li>\n</ul>\n<p><strong>Heli Pilot</strong></p>\n<p>Heli's MOAB Shove doesn't scale with higher tiers so additions have been made to the mini Comanches.</p>\n<ul>\n<li>xx4 Comanche Defense minis gain a weaker MOAB Shove effect (50% compared to main heli)</li>\n<li>xx5 Comanche Defense minis gain the full MOAB Shove effect</li>\n</ul>\n<p><strong>Mortar Monkey</strong></p>\n<p>Adapted from a change in Battles 2. We'll see how well it works locked to a upgrade instead of being a base tower feature. Plus giving Burny Stuff more love to make a more competitive crosspath choice for middle path.</p>\n<ul>\n<li>xx1 Increased Accuracy adds 'Follow Touch' targeting option (hotkey: Shift + Tab)</li>\n<li>032 Heavy Shells allows burn from this tower to tic three times as fast (also expires three times as fast) and the burn inherits the bonus damages of the main attack</li>\n</ul>\n<p><strong>Wizard Monkey</strong></p>\n<p>Currently you need to give and remove an external range buff to reset zombie targeting. Automatic targeting for Wall of Fire refers to its old behavior prior to v33.0, where it would follow the tower's targeting priority if bloons were in range. We are also giving Arcane Blast more crosspath interactions and fixing Archmage's Dragon's Breath's range.</p>\n<ul>\n<li>5xx Archmage Dragon's Breath attack now matches tower's range</li>\n<li>120 Wall of Fire can target the outside of the tower's range to revert targeting back to automatic</li>\n<li>x3x Dragon's Breath price increased $3000 &gt; $3300</li>\n<li>230 Dragon's Breath flame attack ceram bonus increased 1 &gt; 2</li>\n<li>104 Necromancer can target the zombie spawn point outside of the tower's range to revert targeting back to automatic</li>\n<li>204 Necromancer zombie gains bonus to ceramic +1</li>\n</ul>\n<p><strong>Alchemist</strong></p>\n<p>Acid Pools have long been unchanged and underpowered, so these changes should give it some utility while not being a Caltrops clone. AMD currently has negative synergy with Lead to Gold's primary function, so this should solve that. The BMA change is to offset some of the money lost from the shrink attack.</p>\n<ul>\n<li>xx2 Acid Pools last +1 round, main potion attack drops Acid Pools on impact unless pierce-capped</li>\n<li>xx3 Lead to Gold Acid Pools can hit camo</li>\n<li>203 Lead to Gold AMD-buffed towers also grant the $50 cash bonus when popping leads</li>\n<li>023 Lead to Gold attacking DDTs weakens them (like Glue Strike ability) and generates the $50 cash bonus</li>\n<li>204 Rubber to Gold AMD-buffed towers get the income bonus when attacking</li>\n<li>024 Rubber to Gold gains +100% income bonus on fortified MOABs</li>\n<li>xx5 BMA shrink potions transforms targets into leads</li>\n</ul>\n<p><strong>Druid</strong></p>\n<p>Heart of Thunder was previously buffed to scale better with higher tiers, but middle path was overlooked back then.</p>\n<ul>\n<li>240 Jungle's Bounty (HoT) bonus damage to MOABs +2</li>\n<li>250 Spirit of the Forest (HoT) damage increased 2 &gt; 10</li>\n<li>250 Spirit of the Forest (HoT) bonus damage to MOABs +4</li>\n</ul>\n<p><strong>Banana Farm</strong></p>\n<p>Giving top path reasons to go for bottom crosspath, more consistency with the middle path, and a quality of life change that lazy farmers everywhere will enjoy.</p>\n<ul>\n<li>x4x IMF Loan and x5x Monkey-nomics ability income will now increase with external buffs</li>\n<li>xx1 EZ Collect bananas can be autocollected by 041 Druids</li>\n<li>xx2 Banana Salvage uncollected bananas now explode and leave banana peels that blow back bloons upon expiry. Explosions deal damage equal to their monetary value and have 20 pierce. Banana peels have pierce equal to their monetary value and lifetime equal to that of the generated bananas (money is still collected like before). If autocollected by 042 Druids, the bananas can be harvested for their full monetary value and still explode and leave peels.  It also becomes able to take Alchemist buffs.</li>\n<li>xx5 Monkey Wall Street autocollect range now matches the tower range and can be affected by external range buffs (including Alchemist)</li>\n</ul>\n<p><strong>Spike Factory</strong></p>\n<p>While Perma-Spike is already a popular and strong option, we felt this change will be a much-appreciated quality of life improvement. To offset this, we are also increasing the prices.</p>\n<ul>\n<li>xx2 Smart Spikes gains a target selection point which can override the regular targeting options using the 'Monkey Special' hotkey</li>\n<li>xx5 Perma-Spike price increased $30000 &gt; $33000</li>\n</ul>\n<p><strong>Monkey Village</strong></p>\n<p>Ever since Monkeyopolis's nerf put it out of the farming meta, there remains little point in making one. This rework should make it more valuable to use again.</p>\n<ul>\n<li>xx5 Monkeyopolis income generated exactly matches the sacrificed farms and income collection method is based on most invested farm type:</li>\n<li>top path &amp; base farms: generates crates (current behavior)</li>\n<li>middle path farms: generates income and interest in a bank balance equal to sacrificed banks' capacities</li>\n<li>bottom path farms: autocollects income</li>\n</ul>\n<p>T4 Farm effects like the Banana Central BRF buff, bank deposits and IMF Loan abilities, and Merchantman buffs do not transfer.</p>\n<p><strong>Engineer Monkey</strong></p>\n<p>The Pin effect is currently underpowered on Sentry Champion, so these changes should help its case without being overpowering. Cleansing Foam's Sentries can currently decamo, though it is rarely useful because they need external support to even see them in the first place.</p>\n<ul>\n<li>502 Sentry Champion sentries can pin ceramics</li>\n<li>502 Sentry Champion sentries can pin MOAB-class bloons when exploding</li>\n<li>130 Cleansing Foam sentries can see camo</li>\n<li>Master Builder's Green Sentry Paragon can now be locked</li>\n</ul>\n<p><strong>Obyn</strong></p>\n<p>With the rework to secondary attack target options, we can now give Obyn the ability to target all of his items individually. No idea how to meaningfully buff him though.</p>\n<ul>\n<li>Lv3 Brambles gains a target selection point</li>\n<li>Lv4 Nature's Ward Totem gains a target selection point</li>\n</ul>\n<p><strong>Benjamin</strong></p>\n<p>How is this not a thing yet?</p>\n<ul>\n<li>Lv7 Bloon Trojan now follows Target Priority</li>\n</ul>\n<p><strong>Geraldo</strong></p>\n<p>I just think it would be neat. I have no idea what the ramifications this would have on the game balance.</p>\n<ul>\n<li>items unlocked between Lv1 and Lv15 can now receive discounts from xx1 and xx2 Villages</li>\n<li>all items can now receive discounts from Sun Temples and True Sun Gods.</li>\n</ul>\n<hr />\n<p>^(If you made it all the way to end, thanks for reading! I am not affiliated with NK; this is simply a collection of my ideas for balance changes with a little April Fool's flair. It was also interesting looking back at previous path notes and trying to replicate NK's writing styles.)</p></div>",
            "date_published": "2023-04-01T12:13:31+00:00",
            "authors": [
                {
                    "name": "CustomFighter2",
                    "url": "https://www.reddit.com/user/CustomFighter2"
                }
            ]
        },
        {
            "id": "128aiw2",
            "url": "/r/btd6/comments/128aiw2/bloons_td_6_update_notes_version_360/",
            "external_url": "https://www.reddit.com/r/btd6/comments/128aiw2/bloons_td_6_update_notes_version_360/",
            "title": "Bloons TD 6 - Update Notes! Version 36.0",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/128aiw2/bloons_td_6_update_notes_version_360/'>Reddit</a></caption><div><br></div><div><p><strong>Bloons TD 6 v36.0 - Update Patch Notes!</strong></p>\n<p><a href=\"https://preview.redd.it/wqq8eo9ry6ra1.png?width=721&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=5cdc59bc8c5f4f04b456becb7393caef3de54671\"> COMING SOON - Update 36! </a></p>\n<p>Hello, and Welcome to the 36.0 Balance Changes! The latest update is right around the corner, so we wanted to hear the communities feedback!! Let us know how you feel about each of these changes in the comments, and we will be sure to take them into consideration.</p>\n<p>Thank you for supporting us after all these years!!</p>\n<h1>BIG CHANGES/UPDATES</h1>\n<p><strong>BEAST HANDLER:</strong> Whereas we recently released a video and upcoming version preview to the Reddit, we feel it necessary to double back on this due to us feeling that the Beast Handler is still too complicated, so we are reworking it, again, meaning it will be delayed another 2+ updates. Sorry!</p>\n<p>However, to ensure this does not happen again, we will be removing tower upgrades entirely from this new tower to ensure the Beast Handler is not too complicated going forwards. We hope to see you play around with this new tower in a few months!!!</p>\n<h1>FIXES</h1>\n<ul>\n<li>Due to popular demand, we have removed portable lake stacking.</li>\n<li>Fixed a bug that allowed games to save when pausing and returning to menu</li>\n<li>Fixed exploit that allowed temporary buffs like heroes and Jungle Drum Villages to not be absorbed by Lych</li>\n<li>Fixed Buff that allowed Monkey Ace and Navarch Paragons to Buff each other. Paragons will never be buffed, so we hope you enjoyed this exploit while it was in the game!</li>\n<li>On a similar note, we have removed the natural overclock from the Engineer Paragon. However to keep true to the middle path, we have given it extra range, cleansing foam targeting, and +1 damage to MOAB Class Bloons</li>\n</ul>\n<h1>HEROES</h1>\n<p>Pat was always intended to be the chunkiest monkey, and his rallying roar is still a little too strong, even after the previous nerf. So we are doubling down on our previous patch of Pat:</p>\n<ul>\n<li>Pat Fusty footprint increased 28 -&gt; 54</li>\n<li>Rallying Roar range decreased 72 -&gt; 58</li>\n</ul>\n<h1>PARAGONS</h1>\n<p>We have noticed many complaining that certain paragons are weaker than their counterpart 3 5th tier towers because the paragons cannot be buffed while the towers can. In order to counter this, we are increasing the Paragon Level cap 100 -&gt; 500.</p>\n<p>However to keep gameplay balanced, the only way to achieve these 400 bonus levels on each paragon is to use Geraldo's Totems.</p>\n<p>-We recognize totem spam will likely be annoying for many players, so we are increasing the total power each paragon totem gives from 300 -&gt; 350.</p>\n<h1>BLOONS CHANGES</h1>\n<p>LEAD BLOONS</p>\n<p><em>Bloons</em> was always intended to portray real life physics. Due to this, we are changing lead bloons to only be popped from melting.</p>\n<ul>\n<li>We also want bloons other than ceramics and fortified to have multiple layers, so lead bloon layers have been increased from 1 -&gt; 4, and fortified leads are increased from 5 -&gt; 15</li>\n<li>Striker Jones, Bomb, and Mortar are no longer able to damage lead bloons</li>\n<li>Juggernaut and Crossbow Master no longer Pop leads</li>\n<li>Of course, x5x Super Maelstrom no longer pops leads</li>\n<li>Ice towers no longer pop leads at any level</li>\n<li>Sniper monkeys are no longer able to Pierce lead bloons</li>\n<li>Hydra Rocket Pods and MAD no longer pop leads</li>\n<li>Razor Rotors no longer pops leads</li>\n<li>Explosive pineapples, and the respective x3x and x4x bombs no longer Pop leads</li>\n<li>Lead to gold converts lead bloons into golden leads instead of popping them, similar to rubber to gold</li>\n<li>Cleansing foam no longer pops leads, but makes them resistant to explosive damage</li>\n</ul>\n<p>PURPLE BLOONS</p>\n<p>Whereas purples are an interesting bloon that prevents the abuse of certain gameplay styles, the long gaps in between rounds in addition to purple bloons only capable of being spawned naturally like leads make it too easy to get around the weakness these bloons are supposed to provide.</p>\n<ul>\n<li>Instead of purple bloons absorbing attacks, they will now Completely Stun All monkeys with plasma projectiles while on screen.</li>\n<li>3xx Submarines and 4xx Bloontonium Reactors now automatically submerge when purple bloons are on screen</li>\n<li>Shimmer and Signal Flare are now incapable of de-camoing Purple Bloons.</li>\n<li>Purple bloon life Drain increased 12 -&gt; 35</li>\n<li>All purple bloons will spawn fortified past round 50. Fortified purples HP 1 -&gt; 6</li>\n</ul>\n<p>SUPER CERAMICS</p>\n<p>Due to the power ceiling being increased over time from constant power buffs, ceramics are no longer a threat late game when compared to MOAB Class bloons. Especially with recent buffs to super mines and bloon solver. This goes against the intended game design, so we are hoping these changes will fix that: </p>\n<ul>\n<li>Super Ceramic Health 60 -&gt; 200</li>\n<li>Fortified Ceramic Health 80 -&gt; 1,000</li>\n<li>MOAB Class bloons ramping reduced 1 -&gt; .5</li>\n<li>Cerams will now incrementally increase in health every round</li>\n</ul>\n<h1>EVENTS</h1>\n<ul>\n<li>\n<p>Due to popular demand, Contested Territory Events have been changed from a weekly event to a daily event. This is to help separate Bloons TD 6 from the monotonous waiting of the standard Facebook game.  </p>\n</li>\n<li>\n<p>Bloonarius feels especially underpowered compared to its boss counterparts. It is meant to be the slow tank compared to other bosses. So, Bloonarius HP has been increased at all levels, and all other boss speeds have increased. Hopefully now Bloonarius will feel like a unique counterpart from the rest!</p>\n</li>\n<li>Bloonarius HP Tripled</li>\n<li>Bloonarius remains at its current speed. All other bosses receive a 50% increase in their current speeds<br />\nVortex is widely known as the easiest boss. To counter this, we are increasing the Stun duration.</li>\n<li>\n<p>Vortex's Stun has been increased from 10s -&gt; 30s  </p>\n</li>\n<li>\n<p>Fixed bug that prevented Lych soul from ramping with freeplay rounds</p>\n</li>\n</ul>\n<p>&#x200B;</p>\n<h1>TOWERS</h1>\n<p>For a long time, we have wanted crit shots to be a bigger part of the game, as you can probably tell by the addition of crit shots on certain towers more recently. We feel ready to make a big jump by giving every tower an 8% chance to crit for 5x damage on the crit attack.</p>\n<p>All around, towers have been feeling a bit strong, so to counteract this new CRIT Change, every tower has had its attack speed reduced. We have extensively play-tested this new change and feel confident it will breed new life to the game! In addition, to clear up any confusion, the word CRIT that pops up will now fully spell out \"CRITICAL SHOT!\"</p>\n<ul>\n<li>Every tower now shoots 33% slower</li>\n<li>\"CRITICAL SHOT\" text on screen increased 0.5s -&gt; 2.8s</li>\n<li>\"CRITICAL SHOT!\" Font size increased 8 -&gt; 20</li>\n<li>A large, thick black border will now be placed on the \"CRITICAL SHOT!\" Text for easier accessibility</li>\n</ul>\n<h1>BALANCE CHANGES</h1>\n<p>DART MONKEY</p>\n<p>Dart monkeys have always been a strong addition to the game. In fact, they are 2-3 times stronger than the dart monkeys from btd 1-5. To level out the insane power increase, we are nerfing the base dart monkey.</p>\n<p>000 dart monkey price increase 200 -&gt; 450</p>\n<p>Whereas we are pleased with the direction paragons are moving in, we feel as if the Dart paragon does not accurately resemble the 3 upgrade paths as well as it should. So we are changing the Ultra Juggernauts damage type so that it may no longer pop purple bloons. We pride ourselves on community feedback, and we have heard how much fun it is to bounce Juggernaut balls off of walls. We are keeping with that influence of game design to make fans happy.</p>\n<ul>\n<li>Juggernaut &amp; Ultra Jug Lifespan Increased 6s -&gt; 180s</li>\n<li>Juggernaut Pierce Increase 50 -&gt; 80</li>\n<li>Ultra Jugg Pierce Increase 80 -&gt; 420</li>\n<li>Ultra Juggernauts damage type from Normal -&gt; Plasma</li>\n</ul>\n<p>The middle path has been neglected for a long time. However before we inevitably buff it, we must first nerf it:</p>\n<ul>\n<li>Any super monkeys on the field get transformed to 000 dart monkeys when a SMFC ability is activated, including VTSGs.</li>\n<li>All SMS Powers are reverted to dart monkeys which do 1 damage to bloons upon usage</li>\n</ul>\n<p>To add more viability to the bottom path, we are increasing total damage.</p>\n<ul>\n<li>CRIT shot changed from every 8 shots to every 1 shot.</li>\n<li>Normal shot damage reduced 30 -&gt; 0</li>\n</ul>\n<p>TACK SHOOTER</p>\n<p>In an effort to reduce late game lag, we are reducing the amount of total projectiles in-game. However, we do not want to disrupt the balance of towers, so we are evening out the damage.</p>\n<ul>\n<li>Tack Sprayer 16 tacks -&gt; 8, damage 1 -&gt; 2</li>\n<li>Overdrive 16 tacks -&gt; 8, Attack speed .28 -&gt; .72, damage 1-&gt;4</li>\n<li>Tack Zone Tacks 32 -&gt; 8, Attack Speed .18 -&gt; .72, damage 2 -&gt; 20</li>\n</ul>\n<p>BOOMERANG</p>\n<p>The top path has been getting a lot of love, however the bottom path feels more neglected due to the buffs of the now-superior top path. Hopefully this rework can change things up.</p>\n<ul>\n<li>MOAB Press 204 MOAB Damage 50 -&gt; 100</li>\n<li>Left Handed Kylie Boomerangs now shoot boomerangs directly behind them instead of in front of them. </li>\n</ul>\n<p>BOMB SHOOTER</p>\n<p>Due to the imbalanced nature of the bomb at release, we quickly needed to adjust gameplay to suit every tower. Now that the gameplay is stable, we will be reverting many of these changes. While also buffing up the rest of the tower in the process.</p>\n<ul>\n<li>Frag bombs 002 no longer does black popping power</li>\n<li>Base bomb shooter attack speed increased .72 -&gt; .48 (All upgrades increased naturally)</li>\n<li>Base cannon explosion radius increased 56 -&gt; 78 (All upgrades increased naturally)</li>\n<li>In order to reduce lag when using this tower, the bottom path has been reworked.</li>\n<li>xx3 xx4 and xx5 cluster bombs, recursive cluster, and bomb Blitz cluster projectiles 8 -&gt; 1. Instead, cluster bombs cause bloons to spread, preventing grouped bloons from overwhelming your defense. Try these against a round 63 cluster!</li>\n</ul>\n<p>GLUE GUNNER</p>\n<p>We were hoping to keep it a surprise, but we are revealing this early: Special Agents are being brought to the game!</p>\n<p>In an effort to make more synergy between towers and special agents, the glue gunner is being renamed to the Honey Gunner to create crossplay between this tower and the Beekeeper.</p>\n<p>Despite the past 8 buffs making the bloon solver one of the strongest towers in the game early on, it falls off in late game play. We feel it could be stronger, so we are buffing its viability all round.</p>\n<ul>\n<li>5xx bloonsolver damage tick speed increased 12-&gt; 58</li>\n<li>Bloonsolver damage to BAD bloons increased 1 -&gt; 8</li>\n</ul>\n<p>The glue gunner has always been a fun tower, ever since its hayday back during BTD 4. However, it has made the bloons too little of a threat as of recently, especially the middle path.</p>\n<ul>\n<li>All ceramics are now immune to any yellow glue, up to and including 252 glue gunners</li>\n</ul>\n<p>Super glue is fun for what it is. However, we felt it isn't sticky enough. In an effort to increase its uses in more scenarios, we are giving it more variability.</p>\n<ul>\n<li>xx5 super glue Pierce increased 8 -&gt; 22</li>\n<li>xx5 super glue attack speed increased 0.36 -&gt; 0.22</li>\n<li>xx5 super glue slow effect increased 128 -&gt; 256</li>\n<li>Super Glue damage to BADS 1 -&gt; 950</li>\n</ul>\n<p>SNIPER MONKEY</p>\n<p>The sniper has always been a good contender for strongest tower in the game, and we have noticed a spike in usage recently. However, it still feels weak compared to the direction we are headed in.</p>\n<ul>\n<li>All shots now crit</li>\n<li>Sniper now ignores lines of sight</li>\n</ul>\n<p>The top path feels too essential in the current late game meta. So we are changing the effect to something more reasonable. </p>\n<ul>\n<li>5xx Cripple MOAB No longer deals 5x more damage to MOAB class bloons. Instead, it has a chance to CRIT for a whopping 120 damage!</li>\n</ul>\n<p>The middle path upgrade, bouncy bullets, never made sense from a physics perspective. To counter this, bullets are no longer bouncy, and instead are piercy.</p>\n<ul>\n<li>Bouncy bullets renamed to Piercy bullets</li>\n<li>Piercy bullets can pierce through 3 bloons, similar to churchill</li>\n<li>x4x and x5x can pierce through 5 and 7 bloons respectively</li>\n</ul>\n<p>Bottom path has always felt a little strong in addition to always being a strong cross path. We hope this change will make the tower more well rounded.</p>\n<ul>\n<li>Sniper base attack speed increased .8 -&gt; .56</li>\n<li>xx1 and xx2 upgrades left unchanged.</li>\n</ul>\n<p>MORTAR MONKEY</p>\n<p>Similar to other towers, Shell Shock Mortars will now shoot explosive turtle shells instead of Mortar rounds to emphasize the synergy between this tower and the new Special Agent Tribal Turtle.</p>\n<p>Due to popular demand, we are adding a pursuit option to the Mortar. However to balance this, we are decreasing its accuracy.</p>\n<ul>\n<li>000 Mortar Pursuit Target Priority</li>\n<li>000 Mortar shot spread reduced .72 -&gt; .12</li>\n<li>1xx Mortar shot spread returned to normal</li>\n<li>We want the Biggest One to FEEL like an upgrade from its inferior stepping stone, the big one. So, it's now a global range tower.</li>\n<li>Biggest One Attack Radius Increased 50 -&gt; 400</li>\n</ul>\n<p>MONKEY SUB</p>\n<p>To switch up gameplay, we are changing around top path upgrades.</p>\n<ul>\n<li>2xx Advanced Intel now has automatic global range. But it can no longer shoot bloons that are in range of other towers.</li>\n<li>3xx submarine now decamos bloons globally, however all bloons within its radius are automatically camoed.</li>\n<li>Bloontonium reactor can no longer Pop regrow bloons</li>\n</ul>\n<p>The middle path ability felt too good at cleaning up the insides, especially of BAD Bloons.</p>\n<ul>\n<li>x4x ability damage decreased 8,000 -&gt; 3,000</li>\n</ul>\n<p>DARTLING GUNNER</p>\n<p>The middle crosspath is the obvious choice over the bottom crosspath in almost all scenarios. In an effort to make each crosspath unique and significant, we are changing things up!</p>\n<ul>\n<li>Base dartling swivel speed reduced 30 -&gt; 6</li>\n<li>xx1 Faster Swivel Speed now grants lock in place targeting priority</li>\n</ul>\n<p>MONKEY ACE</p>\n<p>In order to reduce projectiles late game, we are reworking the Monkey Ace to properly represent how we believe this tower should function in order to minimize lag and maximize fun. The Monkey Ace will now shoot darts out of the front of the Ace, similar to the BTD 5 Specialty Building Bonus:</p>\n<ul>\n<li>Monkey Ace Darts reduced 8 -&gt; 1</li>\n<li>Monkey Ace Attack Speed .7 -&gt; 3</li>\n<li>Monkey Ace Damage Increased 1 -&gt; 2</li>\n<li>2xx, 4xx, and 5xx have received similar changes by reducing darts to 1 and increasing DMG and SPA.</li>\n</ul>\n<p>HELI PILOT</p>\n<p>The Comanche Commander was beloved at the start of the game, however has long since fallen off. So, we are reverting the nerf allowing it to easily solo round 98 once again.</p>\n<ul>\n<li>Comanche Commander damage 2 -&gt; 8</li>\n<li>Mini Comanche damage 4 -&gt; 24</li>\n</ul>\n<p>In order to balance this, we are reducing the speed the heli pilot can move.</p>\n<ul>\n<li>Base Helipilot Speed reduced 3 -&gt; 0.8</li>\n</ul>\n<p>SUPER MONKEY</p>\n<p>Like the tack shooter, the Super Monkey is being reworked to reduce projectiles late game for stability reasons:</p>\n<ul>\n<li>Base Super Monkey Attack Speed .035 -&gt; .35, damage 1 -&gt; 5</li>\n<li>1xx Laser Vision now shoots 1 laser instead of 2.</li>\n<li>3xx Super Monkey Projectiles Reduced 3 -&gt; 1</li>\n<li>x3x Robo Monkey: 2 Arms reduced to 1</li>\n</ul>\n<p>Due to positive fan reception of the recent Call to Arms global Buff, we felt it reasonable to apply this to temples as well:</p>\n<ul>\n<li>4xx and 5xx temples now Sacrifice ALL towers and Heroes on the map</li>\n</ul>\n<p>We believe all towers should have their time to shine. No tower should be able to solo the game without much thought and effort.</p>\n<p>Additionally, in an effort to reduce the over powered nature of Super monkeys, we are reducing their overall damage to encourage a more well rounded gameplay style which favors a variety of towers:</p>\n<ul>\n<li>4xx and 5xx Sun Temple base damage reduced 50 -&gt; 5</li>\n<li>4xx and 5xx Sun Temple sacrifices have received a similar 10x downscale. </li>\n<li>x5x Super Monkey Price Increased 90,000$ -&gt; 300,000$</li>\n<li>xx5 Super Monkey Price Increased 166,000$ -&gt; 635,000$</li>\n</ul>\n<p>ALCHEMISTS</p>\n<p>We greatly enjoy one of our recent change to alchemists, however we feel like we did not go far enough with it to make it viable. Hopefully now it can be used more effectively:</p>\n<ul>\n<li>Lead to gold damage to DDTs 8 -&gt; 80</li>\n</ul>\n<p>BMA is too strong late game, and too weak early game as it loses players money. So hopefully this will wise players up when considering placing him.</p>\n<ul>\n<li>If a Bloon Master Alchemist potion hits a red bloon, the potion will transform the red bloon into a BAD.</li>\n</ul>\n<p>NINJA MONKEY</p>\n<p>Some upgrades feel a little bit too over and under powered for cross paths to be viable. Hopefully these changes will create more balanced play.</p>\n<ul>\n<li>Caltrops no longer place when the Ninja is attacking bloons</li>\n<li>Distraction chance increased 35% -&gt; 100%</li>\n<li>5xx Grandmaster Ninja shots reduced 8 -&gt; 1</li>\n<li>5xx Grandmaster projectile footprint increased 2 -&gt; 38</li>\n<li>5xx Grandmaster Ninja Pierce increased 2 -&gt; 40</li>\n<li>500 Grandmaster Ninja projectiles now Bounce off walls</li>\n</ul>\n<p>WIZARD MONKEYS</p>\n<p>Wizards are purely magic based towers. So it didn't make sense to give them upgrades that granted them purple popping power. Fortunately, the wizard has been buffed up enough that this nerf will still keep it playable without being overpowered:</p>\n<ul>\n<li>xx5 Phoenix ability no longer pops purple bloons.</li>\n<li>xx4 and xx5 Necromancer bloons no longer pops purple bloons.</li>\n</ul>\n<p>MONKEY VILLAGE</p>\n<p>Due to primary towers overshining the village in pretty much all aspects, we are reworking the top path:</p>\n<ul>\n<li>Primary Expertise: Buffs to Primary Towers -&gt; Buffs to other villages in radius:</li>\n<li>xx4 Call to Arms and xx5 Homeland Defense: In an effort to reduce projectiles for in game performance, this towers ability has shifted its double attack speed into double range for all towers.</li>\n</ul>\n<p>ENGINEER MONKEY</p>\n<p>In an effort to minimize the effect of *certain youtubers* to make *specific jokes* about cleansing foam, we are changing the color. In addition, we are changing the later upgrades out of spite:</p>\n<ul>\n<li>x3x cleansing foam color changed from White -&gt; Green</li>\n<li>x4x and x5x Engineer monkeys are now only able to overclock other overclock engineer monkeys.</li>\n</ul>\n<p>Bloontraps have been exploited for too long to absorb 100% of bloons. We are countering this gameplay style with nerfs.</p>\n<ul>\n<li>Placed Bloontraps will now have a 0.8s tick cool down interval of being able to absorb bloons</li>\n<li>Bloontrap radius reduced 100% Engineer range -&gt; 30%</li>\n</ul>\n<p>BANANA FARMS</p>\n<p>To make gameplay more immersive, bananas no longer attract to the cursor, and must be clicked or tapped to pick up.</p>\n<ul>\n<li>For QoL purposes as well as to give more use to this crosspath, the xx2 upgrade allows you to right click to pick up bananas in addition to the left click.</li>\n<li>To avoid potential exploits, Monkey Farmer radius has been reduced 300 -&gt; 80.</li>\n<li>Monkey Farmers Monkey Money Cost 100 -&gt; 500</li>\n</ul>\n<p>SPIKE FACTORY</p>\n<p>Due to constant misunderstandings, we are switching the tack shooter to support class and spike factory to primary class. And again to limit projectiles, we are fixing this tower as well:</p>\n<ul>\n<li>Spike Factory Base Pierce 10 -&gt; 1</li>\n<li>Spike Factory Base Damage 1 -&gt; 10</li>\n<li>xx2 Smart Spikes no longer shoot more spikes at the beginning of the round</li>\n</ul>\n<h1>ADDITIONAL CHANGES</h1>\n<ul>\n<li>Due to high demand, all placeable items will lose their clickable placement locations in favor of randomized placement.</li>\n<li>Friendly Fire is now on by default. Any monkey hit by any projectile will instantly be sold for 0$.</li>\n<li>Removed hotkeys for accessibility reasons</li>\n<li>To make speedruns more competitive as well as to make Apopalypse stand out more as a game mode, Auto start next round has been removed.</li>\n<li>The gameplay cycle of Bloons TD 6 is too short. In an effort to improve this, the fast forward button has been removed. In its place is now a slow-mo button.</li>\n</ul>\n<p>We hope you enjoyed this round of balance changes as Bloons TD 6 moves in a more positive direction, as we return back to the game we released at launch. We are eager to hear your feedback, so please let us know what you would like us to revert next!</p>\n<p>We have WHOPPING plans for where to take Bloons TD 6 and we hope you all will keep playing and have fun helping us get there. Let’s all plan on having a very happy rest of 2023 together as we look for more ways to involve the community in our vision and plans for where we go next, and until then please know that everyone at Ninja Kiwi wishes you the absolute best for a restful and playful April Fools Day!</p>\n<p>ADDITIONAL CHANGES: Update 37+ has been scrapped.</p>\n<p>Happy Popping!!</p></div>",
            "date_published": "2023-04-01T04:01:53+00:00",
            "authors": [
                {
                    "name": "sweetdude64",
                    "url": "https://www.reddit.com/user/sweetdude64"
                }
            ]
        },
        {
            "id": "108lowj",
            "url": "/r/btd6/comments/108lowj/bloons_td_6_update_notes_version_350/",
            "external_url": "https://www.reddit.com/r/btd6/comments/108lowj/bloons_td_6_update_notes_version_350/",
            "title": "Bloons TD 6 - Update Notes! Version 35.0",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/108lowj/bloons_td_6_update_notes_version_350/'>Reddit</a></caption><div><br></div><div><h1>Bloons TD 6 v35.0 - Update Notes!</h1>\n<h1>New Awesome</h1>\n<ul>\n<li>New Paragon Tower - the Wizard Monkey big wizzerd!</li>\n<li>For the low price of $420k cash, <strong>big wizzerd</strong> is balanced more around the level of the Apex Plasma Master and Glaive Dominus as another alternative cheap Paragon for the lower Boss tiers. His 3 big spells are sure to cause a general inconvenience for the Bloons!</li>\n<li>Attack 1 - <strong>Mega Laser:</strong> Every few seconds, big wizzerd will fire a laser towards your cursor, dealing constant damage to all Bloons caught in the blast!</li>\n<li>Attack 2 - <strong>Magic Missile:</strong> big wizzerd's main attack, Magic Missile, will summon a constant barrage of high-damaging missiles designed specifically for obliterating the tough MOABs and Bosses!</li>\n<li>Attack 2 and a half - <strong>rocks</strong>: big wizzerd throws some clusters of rocks that he picks up off the ground at the Bloons also, dealing damage as well as knockback. Does extra knockback to regrow Bloons because it's funny</li>\n<li>Activated Ability - <strong>wizzerd's Big Surprise</strong>: Every 10 rounds, big wizzerd unlocks his ultimate ability. Summoning a mighty craft from the sky, a flying Bloon Trap which produces volleys of 32 \"cleansing caltrops\" 3 times a second, which remove camo and regrow properties from all Bloons and also pop leads. Also turns all nearby Wizard Monkeys into Super Monkeys for 10 seconds. The bloon trap eats BADs but nothing else</li>\n<li>Added the <strong>Steam Workshop!</strong></li>\n<li>New map with pipes that occasionally shoot out steam, blocking towers' vision, but also dealing light damage to Bloons that pass by.</li>\n<li>New Hero Skin: Jeraldo</li>\n<li>Exactly the same as Geraldo but without the mustache (and therefore his source of power) and he has the most boring American accent possible</li>\n<li>New Achievements:</li>\n<li>Triple Threat - Have 3 Paragons at the map at once during a Boss Event</li>\n<li>Diversity Higher - Have a Paragon from every category on the map at once</li>\n<li>Brute Force - Have 2,000,000 damage be fully resisted by Dreadbloon's category immunities</li>\n<li>die - Beat 52 different Tier 5 Elite Boss Events</li>\n<li>New Trophy Store Items</li>\n<li>Avatar 68: big wizzerd</li>\n<li>Avatar 69: Patch ( ͡° ͜ʖ ͡°)</li>\n<li>Co-op: Fullscreen Flashbang emote</li>\n<li>Record Albums: Since no one is playing our other games anymore, we've decided to at least salvage some of the most awesomest soundtracks from them. Be on the lookout for more albums in the future!</li>\n<li>Game &amp; UI:  Prince of Darkness - Toilet skin, Pontoon - Baba Buoy skin,, Music Track - Fiesta Flamenco Helium Heights Mix, Record Album - Bloons Pop!</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>Auto Start can now be toggled by holding Tab while clicking the round start button, or by pressing Tab + Space</li>\n<li>Added option for Paragon limits to the Challenge Editor. Setting it to 0 disables Paragons entirely.</li>\n<li>Added slider for Paragon power scaling to the Challenge Editor.</li>\n<li>Added Paragon degree limit to the Challenge Editor.</li>\n<li>Multiple gamemodes can now be enabled at once in the Challenge Editor</li>\n<li>Custom Boss Events can now be created in the Challenge Editor</li>\n<li>Added more options for the number of maps that make up a custom Odyssey</li>\n<li>Added functionality for custom Contested Territory maps to the Challenge Editor. You have to make all off the tiles yourself. All of them.</li>\n<li>Creating a challenge with Blons unlocks Blons on the singleplayer and Co-op map selects.</li>\n<li>uhhh there was some other stuff outside of the challenge editor too but i forgot</li>\n<li>oh yeah</li>\n<li>Added text chat for Teams and Co-op</li>\n<li>Added chat reporting feature (reporting someone instantly bans them from the whole game even if they haven't actually said anything)</li>\n<li>Flagged accounts can now play in private Co-op games except for ranked Boss Events.</li>\n<li>Heroes that can detect camo without buffs can now use camo prioritization.</li>\n<li>A bunch of shit doesn't pop lead now just to troll people that don't read the patch notes</li>\n</ul>\n<h1>Bug Fixes</h1>\n<ul>\n<li>Fixed the Glue Gunner having less s*x appeal than intended</li>\n<li>All numbers of the alphabet should like him equally now.</li>\n<li>Optimized towers searching for targets to fire at when not currently firing at something</li>\n<li>Fixed some towers occasionally having hyperrealistic eyes and crying blood in niche scenarios</li>\n<li>Where's my joke about ice platforms? I specifically requested that someone bring me a funny joke about Arctic Wind to put in the patch notes. Does no one listen to me around here? C-... Can anyone hear me...? Hello...?</li>\n<li>Fixed your god damn attitude</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>Enough is enough! I have HAD it. If I don't see more people using the Glaive Dominus over the Apex Plasma Master after this update then I swear I'll take a bullet</p>\n<ul>\n<li>xx5 Crossbow Master dmg type Normal -&gt; Sharp</li>\n<li>Apex Plasma Master price increased from $350,000 &gt; a bajillion</li>\n<li>Apex Plasma Master now buffs all Dart Monkeys in range to have Normal type damage and an additional degree% attack speed</li>\n</ul>\n<p>Boomerang Monkey</p>\n<p>train to your house and force you to play <em>Bloons TD Battles 2 (2021)</em>.<br />\nAlso MOAB Press's special attack against MOABs now does more damage to fit with Red Hot Rangs.</p>\n<ul>\n<li>xx4 MOAB Press special attack damage 1 &gt; 2</li>\n<li>xx5 MOAB Domination special attack damage 1 &gt; 2 </li>\n<li>Glaive Dominus price decreased from $325,000 &gt; 0</li>\n</ul>\n<p>Bomb Shooter</p>\n<ul>\n<li>5xx Bloon Crush dmg type Normal -&gt; Explosion</li>\n<li>502 Bloon Crush dmg type back to Normal</li>\n<li>x4x MOAB Assassin ability no longer targets DDTs unless buffed/upgraded to Normal type damage and/or the DDT is vulnerable to explosive damage</li>\n<li>x4x MOAB Assassin ability dmg type Normal -&gt; Explosion</li>\n<li>042 MOAB Assassin ability dmg type back to Normal</li>\n<li>x5x MOAB Eliminator ability dmg type Normal -&gt; Explosion</li>\n<li>052 MOAB Eliminator ability dmg type back to Normal</li>\n<li>xx3 Cluster Bombs primary bombs dmg type Normal -&gt; Explosion</li>\n<li>xx3 Cluster Bombs secondary bombs now release frags and dmg type back to Normal</li>\n<li>xx4 Recursive Cluster secondary bombs dmg type Normal -&gt; Explosion when releasing tertiary bombs, which replace frags</li>\n<li>xx4 Recursive Cluster tertiary bombs now release frags and dmg type back to Normal</li>\n</ul>\n<p>Tack Shooter</p>\n<ul>\n<li>x5x Super Maelstrom all attacks dmg type Normal -&gt; Sharp</li>\n</ul>\n<p>Ice Monkey</p>\n<ul>\n<li>3xx Ice Shards ice shards dmg type Shatter -&gt; Sharp</li>\n<li>3xx Ice Shards ice shards now always do double the damage of the attack that froze the Bloon they came from</li>\n<li>4xx Embrittlement can now weaken white and zebra bloons that it hits without popping</li>\n<li>5xx Super Brittle main attack dmg type Normal -&gt; Cold</li>\n<li>5xx Super Brittle can now weaken white and zebra bloons that it hits without popping</li>\n<li>x3x Arctic Wind passive slowdown can now affect white and zebra bloons</li>\n<li>x4x Snowstorm passive slowdown can now affect white and zebra bloons</li>\n<li>x4x Snowstorm ability dmg type Normal -&gt; Cold</li>\n<li>x4x Snowstorm ability pierce ∞ &gt; 10,000</li>\n<li>x5x Absolute Zero passive slowdown can now affect white and zebra bloons</li>\n<li>x5x Absolute Zero ability dmg type back to Normal</li>\n<li>x5x Absolute Zero ability pierce ∞ &gt; 50,000</li>\n</ul>\n<p>Glue Gunner</p>\n<p>Glue stacks now. Yay.</p>\n<ul>\n<li>The strengths of DoT, weakening, and slowdown are now overridden separately. If a Glue Gunner cannot override any of the 3 aspects, it will not target the bloon. If it can override any of them, it will attack the bloon, and if it hits, will only override what it can. Glue on the same tier as another glue will not override the other glue, and will not target if there's nothing to override, but will refresh the cooldown if it happens to hit.</li>\n<li>DoT: 5xx The Bloon Solver &gt; 4xx Bloon Liquefier &gt; 3xx Bloon Dissolver &gt; 2xx Corrosive Glue &gt; xx5 Super Glue &gt; all other glue</li>\n<li>Weakening: x5x Glue Storm ability &gt; x4x Glue Strike ability &gt; all other glue</li>\n<li>Slowdown (MOAB class): xx5 Super Glue initial slowdown &gt; xx3 MOAB Glue &gt; all other glue</li>\n<li>Slowdown (Non-MOAB class): xx5 Super Glue &gt; xx2 Stronger Glue &gt; all other glue</li>\n<li>x4x Glue Strike ability glue color yellow &gt; orange</li>\n<li>x4x Glue Strike ability pierce ∞ &gt; 10,000</li>\n<li>x5x Glue Storm ability pierce ∞ &gt; 50,000</li>\n<li>x5x Glue Storm ability slowdown 25% speed &gt; 50% speed</li>\n<li>052 Glue Storm ability slowdown 10% speed &gt; 25% speed</li>\n</ul>\n<p>Sniper Monkey</p>\n<ul>\n<li>x4x Supply Drop all attacks dmg type Normal &gt; Shatter</li>\n<li>x5x Elite Sniper all attacks dmg type back to Normal</li>\n</ul>\n<p>Monkey Sub</p>\n<p>Jokes aside, very little thought went into these changes, and they were meant to be memey, but it turns out I actually think they're decent ideas. The top path changes could probably use with a price nerf, and I do kinda wish it wasn't too huge of a buff otherwise, but buffing damage to a non-integer seems odd. However it's a better idea than \"lol lead is immune to... radiation\"... Well I guess it is, it's like THE thing that's immune to radiation, but it's meant to be reacting with the Bloons themselves since they're made out of Bloontonium as far as I know. As for middle path, bottom crosspath seems totally useless and having the missiles be noticeably much faster inside the sub's vastly decreased range compared to the top crosspath is what I expected, but instead it's only a minor increase.</p>\n<ul>\n<li>4xx Bloontonium Reactor submerged attack dmg type Shatter &gt; Normal</li>\n<li>420 Bloontonium Reactor submerged attack damage 1 &gt; 2</li>\n<li>401 Bloontonium Reactor submerged attack speed .255s &gt; .225s</li>\n<li>402 Bloontonium Reactor submerged attack speed  .19125s &gt; .15s</li>\n<li>520 Energizer submerged attack damage 5 &gt; 10</li>\n<li>x2x Heat-tipped Darts damage 1 &gt; 2</li>\n<li>x3x Ballistic Missile missile attack speed .9945s &gt; 1s (why was it such a specific value)</li>\n<li>031 Ballistic Missile missile attack speed .8701875s &gt; .5s</li>\n<li>032 Ballistic Missile missile attack speed .8701875s &gt; .25s</li>\n<li>x4x First Strike Capability ability splash damage dmg type Normal &gt; Explosion</li>\n<li>x5x Pre-emptive Strike automatic ability now deals 30 splash explosion damage within 22 units and with 90 pierce</li>\n<li>x5x Pre-emptive Strike activated ability splash damage dmg type Normal &gt; Explosion</li>\n<li>024 Armor Piercing Darts damage 2 &gt; 4</li>\n<li>024 Armor Piercing Darts MOAB damage 2 &gt; 4</li>\n<li>024 Armor Piercing Darts airburst dart MOAB damage 1 &gt; 2</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<ul>\n<li>5xx Carrier Flagship all dart attacks dmg type Normal &gt; Sharp</li>\n<li>5xx Carrier Flagship missile dmg type Normal &gt; Explosion</li>\n<li>5xx Carrier Flagship missile no longer targets DDTs unless its damage type is buffed to Normal</li>\n<li>x2x Hot Shot grapes dmg type Fire &gt; Normal</li>\n<li>x3x Cannon Ship cannonball explosion dmg type Explosion &gt; Normal</li>\n</ul>\n<p>Monkey Ace</p>\n<ul>\n<li>5xx Sky Shredder dart dmg type Normal &gt; Sharp</li>\n<li>5xx Sky Shredder missile dmg type Normal &gt; Explosion</li>\n<li>5xx Sky Shredder missile no longer targets DDTs unless its damage type is buffed to Normal</li>\n<li>xx5 Flying Fortress dart dmg type Normal &gt; Sharp</li>\n<li>xx5 Flying Fortress bomb dmg type Normal &gt; Explosion</li>\n<li>Goliath Doomship purple missile attack gains an extra projectile every 6.25 degrees (rounded)</li>\n<li>Goliath Doomship carpet bomb damage 20,000 &gt; 15,000</li>\n<li>Goliath Doomship carpet bombs now also deal 5000 normal damage to everything on the map, which stuns for 2 seconds (overridden by smaller range stun)</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>x5x Special Poperations marine dmg type Normal &gt; Sharp</li>\n<li>x5x Special Poperations redeploy ability replaced with Door Gunner</li>\n<li>Door Gunner Monkey Knowledge replaced with fart</li>\n<li>fart Monkey Knowledge poisons Bloons blown back by Downdraft including those immune to the blowback, also renames tower to \"Smeli Pilot\" upon upgrading to x3x</li>\n<li>Door Gunner now works the same as the Support Chinook redeploy ability, however you can now cancel after picking a tower up to keep them inside the helicopter</li>\n</ul>\n<p>Mortar Monkey</p>\n<ul>\n<li>4xx The Big One dmg type Normal &gt; Explosion</li>\n<li>402 The Big One dmg type back to Normal</li>\n<li>x5x Pop and Awe ability sound effect now 10 times longer and louder</li>\n<li>052 Pop and Awe ability now sets all Bloons on fire</li>\n</ul>\n<p>Dartling Gunner</p>\n<ul>\n<li>5xx Ray of Doom dmg type Normal &gt; Plasma</li>\n<li>x5x M.A.D name extended out to Massive Ornary Air Blimp Assured Destroyer</li>\n<li>x5x Massive Ornary Air Blimp Assured Destroyer price $60,000 &gt; $60,001 during Boss Events</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>You know what? You know what? Fuck you. Die. You like races? Too bad. <em>oH I LoVe wAlL Of fIrE It'S SuCh a gOoD ToWeR</em> no fuck you get owned and die - ninja kiwi</p>\n<ul>\n<li>Swapped placement of Wall of Fire and Dragon's Breath</li>\n<li>x3x Wall of Fire price $950 &gt; $691,337,420 and a half.5</li>\n<li>Base dmg type Energy &gt; Plasma</li>\n<li>5xx Archmage now needs to eat one of your towers every round or he kills you instead</li>\n<li>Added animations for Archmage eating your towers</li>\n<li>x1x Fireball now explodes when hitting purples even without being able to damage them</li>\n<li>x3x Wall of Fire now kills your towers if it hits them</li>\n<li>Added animations for Archmage eating your roasted towers</li>\n<li>xx2 Monkey Sense renamed to Monkey Sans</li>\n<li>big wizzerd existence false &gt; plausible</li>\n</ul>\n<p>Super Monkey</p>\n<p>Laser Blasts seriously sucks and something needs to be done about it. All it does is give +1 pierce and it even takes away your ability to pop leads in the process.</p>\n<ul>\n<li>1xx Laser Blasts buffed.</li>\n<li>Souper Monkey now makes soup for all your monkeys to eat because he's cool like that</li>\n<li>Added animations for Archmage eating soup</li>\n</ul>\n<p>Ninja Monkey</p>\n<ul>\n<li>xx3 Flash Bomb dmg type Normal &gt; Explosion (can still stun black bloons and zebras without damaging them)</li>\n<li>xx4 Sticky Bomb sticky bombs dmg type Normal &gt; Explosion</li>\n<li>xx4 Sticky Bomb will no longer target DDTs with sticky bombs unless they're buffed to Normal type</li>\n<li>xx5 Master Bomber sticky bombs will target DDTs again, and will stun them even if it can't damage them</li>\n<li>Shuriken can now spin up to 10% faster</li>\n<li>Ascended Shadow now drops regular old caltrops</li>\n</ul>\n<p>Alchemist</p>\n<ul>\n<li>Renamed to Monkey Alchemist</li>\n<li>x3x Unstable Concoction explosion dmg type Normal &gt; Explosion</li>\n<li>Added animations for Archmage drinking potions</li>\n</ul>\n<p>Druid</p>\n<ul>\n<li>Renamed to Druid Monkey</li>\n<li>x5x Spirit of the Forest gains Vine Rupture ability</li>\n<li>Vine Rupture Monkey Knowledge replaced with 🗿</li>\n<li>🗿 makes Spirit of the Forest's track vines go \"🗿\" when they explode, dealing damage to all Bloons on screen proportional to your sound effects volume with every explosion (takes an average in Co-op)</li>\n</ul>\n<p>Banana Farm</p>\n<ul>\n<li>Can now be used in CHIMPS. Everything generates $0, though.</li>\n<li>Can be placed on teammates' property in Co-op CHIMPS</li>\n</ul>\n<p>Spike Factory</p>\n<ul>\n<li>5xx Super Mines all explosions dmg type Normal &gt; Explosion</li>\n</ul>\n<p>Monkey Village</p>\n<ul>\n<li>xx5 Monkeyopolis now always produces 10 crates per round, unless it produces less than $10 in a round, which it will then produce however many $1 crates it needs to</li>\n<li>xx5 Monkeyopolis now truly combines all of the Banana Farms that it sacrifices</li>\n<li>Crates are now worth the amount of money each of the tier ≤2 and/or top path farms produce in one round, divided by 10, then rounded. Crates will have collection radii based on the average collection radii of the collectables from the applicable farms, based on how many of them had the EZ Collect upgrade. Upon expiry, crates will give an average compensation based on how many applicable farms had the Banana Salvage upgrade.</li>\n<li>If banks were sacrificed, the Monkeyopolis gains their balances and debts, and also has their combined generation and storage space, but will always have 15% interest. A light will turn on inside the Monkeyopolis when the storage is full if the majority of banks had the EZ Collect upgrade, and the Monkeyopolis will autocollect at the end of a round after calculating interest if the storage is full if the majority of banks had the Banana Salvage upgrade</li>\n<li>The Monkeyopolis will also generate the combined cash and lives generation of all sacrificed Marketplaces and Central Markets</li>\n<li>Added animations for Monkeyopolis eating your farms</li>\n</ul>\n<p>Engineer Monkey</p>\n<ul>\n<li>4xx Sentry Expert cold sentry dmg type Cold &gt; Glacier</li>\n<li>Master Builder now Ultraboosts every tower in its range including itself and other Paragons every round</li>\n<li>Stacks cap at the Master Builder's degree instead of 10 except for Paragons other than the Master Builder</li>\n<li>For Paragons other than the Master Builder, the cap is degree / 10, always rounded down</li>\n<li>Master Builder now sprays cleansing foam all over the track within its range when it isn't attacking anything</li>\n<li>Master Builder now also places a new building separate from its sentries, known as the Exa-Bite</li>\n<li>The Exa-Bite is a massive Bloon Trap that holds 50,000 RBE at degree 1. It eats everything, but can't completely consume BADs or Bosses. Instead, it bites onto them, dealing continuous damage and slowing BADs down by (degree / 10)%. While stuck, it still continues to eat Bloons that pass by it, and will always eat all the insides of a Bloon that dies while it's clinging to it. When the Exa-Bite fills up, it causes a massive explosion that pierces blimp layers, and initiates a 10 second cooldown before the Master Builder can place another one.</li>\n</ul>\n<p>Quincy</p>\n<ul>\n<li>Lv5 Quincy gains Camo Prioritization</li>\n<li>All voice lines 1% louder</li>\n</ul>\n<p>Captain Churchill</p>\n<ul>\n<li>Lv6 Captain Churchill gains Camo Prioritization</li>\n</ul>\n<p>Benjamin</p>\n<ul>\n<li>Lv18 Benjamin gains Camo Prioritization</li>\n</ul>\n<p>Ezili</p>\n<ul>\n<li>Lv1 Ezili gains Camo Prioritization</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>Lv7 Admiral Brickell gains Camo Prioritization</li>\n</ul>\n<p>Etienne</p>\n<ul>\n<li>Lv5 Etienne gains Camo Prioritization</li>\n</ul>\n<p>Sauda</p>\n<ul>\n<li>Lv1 Sauda gains Camo Prioritization</li>\n<li>Lv10 Sauda now expires when Sword Charge reaches its pierce cap, requiring you to rebuy her</li>\n</ul>\n<p>Psi</p>\n<ul>\n<li>dead now</li>\n<li>reduced forehead size</li>\n<li>using weapons</li>\n<li>this is the cause of death</li>\n</ul>\n<h1>Looking Forward</h1>\n<p>Seeing as though he's still not here, we'd like to end this update off with a more in-depth look at our plans for the Beast Handler.</p>\n<p><strong>Beast Handler</strong></p>\n<p>Top Path</p>\n<ul>\n<li>Upgrade 1: Fish</li>\n<li>Spits long-range water shots at Bloons from bodies of water</li>\n<li>Upgrade 2: fart fish</li>\n<li>Poisons Bloons on hit</li>\n<li>Upgrade 3: Shark with Fricking Laser Beams on Its Fricking Head</li>\n<li>Shoots lasers at the Bloons</li>\n<li>Upgrade 4: pissh</li>\n<li>Fires a concentrated piss beam at the Bloons</li>\n<li>Upgrade 5: Megalo-don</li>\n<li>Buys a speaker from Best Buy and plays Megalovania from Undertale on it, destroying all Bloons in a line in front of it</li>\n</ul>\n<p>Middle Path</p>\n<ul>\n<li>Upgrade 1: Doyouthinkhesaurus</li>\n<li>Kills camo bloons</li>\n<li>Upgrade 2: Doyouthinkhesaurus Rex</li>\n<li>Runs faster</li>\n<li>Upgrade 3: birth</li>\n<li>Dinosaur fires eggs at the Bloons, which explode and release dinosaurs that damage more Bloons for a bit</li>\n<li>Upgrade 4: more of them</li>\n<li>ability that summons more of them</li>\n<li>Upgrade 5: Angryosaurus</li>\n<li>Dinosaur that is really mad at the MOABs and kills them</li>\n</ul>\n<p>Bottom Path</p>\n<ul>\n<li>Upgrade 1: bird</li>\n<li>Flying bird that turns quickly in the air to dive down at Bloons to carry them off before coming back</li>\n<li>Upgrade 2: Powerful Bird</li>\n<li>Bird can pick up up to 3 Bloons at a time now</li>\n<li>Upgrade 3: Birdshot</li>\n<li>Bird picks up rocks off the ground to throw at Bloons also, dealing knockback</li>\n<li>Upgrade 4: Bird Area Denial System</li>\n<li>Summons 3 more birds to fuck up the Bloons, each of which can be independently targeted</li>\n<li>Upgrade 5: Bloonchipper</li>\n<li>crashes the game and opens btd5 instead</li>\n</ul>\n<p>ok that's the update bye see you in a few months</p></div>",
            "date_published": "2023-01-10T21:33:37+00:00",
            "authors": [
                {
                    "name": "Yoshicraft224",
                    "url": "https://www.reddit.com/user/Yoshicraft224"
                }
            ]
        },
        {
            "id": "zelo7s",
            "url": "/r/btd6/comments/zelo7s/bloons_td_6_update_notes_version_340/",
            "external_url": "https://www.reddit.com/r/btd6/comments/zelo7s/bloons_td_6_update_notes_version_340/",
            "title": "Bloons TD 6 - Update Notes! Version 34.0",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/zelo7s/bloons_td_6_update_notes_version_340/'>Reddit</a></caption><div><br></div><div><p>&#x200B;</p>\n<p>https://preview.redd.it/4l5wf6xt2d4a1.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=2ad221703a2b500b8e8e2e594283a0973a22fa86</p>\n<h1>Bloons TD 6 v34.0 - Update Notes!</h1>\n<h1>COMING SOON - Update 34!</h1>\n<p>While we normally do preview notes, we wanted to skip straight to releasing the full update notes before the update itself to let the community know we have made the difficult decision to delay the Beast Handler. See below for more info on that along with all the New Awesome coming this week! We have also adjusted the currently running Boss event to finish early this week so we can get this update out to players but not have balance changes impact the current leaderboards.</p>\n<h1>Key New Features</h1>\n<ul>\n<li>New Boss Bloon: Dreadbloon!</li>\n<li>From the dark underground depths to the skies above, Dreadbloon brings its signature connection to the subterranean to combat even the toughest of Monkey defenses. Destroy Dreadbloon’s earthen armor only to find a lead interior with new special properties - complete immunity to different Monkey Tower categories each time the armor reforms. Even Paragons in those categories are rendered temporarily harmless. As if that’s not enough, Dreadbloon also spawns resilient Rock Bloons each time a skull is reached and until its stone armor is destroyed, and these Rock Bloons are so fearsome that any Monkey set to strong targeting will feel taunted to attack the Rock Bloon before anything else. Watch out for Dreadbloon in upcoming weekly Boss events and win those prestigious Dreadbloon badges!</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Beginner Map: One Two Tree!</li>\n<li>A fun seasonal beginner map with an interesting twist! At certain rounds the trees are taken away to decorate Monkey homes leaving more space in which to build defenses. A bit like an automated Cornfield, but these plots also confer a handful of special properties to the Monkeys placed there. Pay attention to the colors and shapes on the billboard legend to help understand which Monkeys will benefit from each plot. This was a fun system to enable for use in maps, so we’ll plan to do more of this in the future and we also expect this will be heaps of fun for custom challenges - we look forward to seeing your ideas!</li>\n<li>New Hero Skin: Sleigh Churchill skin</li>\n<li>Inspired by the work done in Bloons Pop, Churchill’s combat ready sleigh was an easy pick for a seasonal hero skin. We had heaps of fun with this voiceover recording; Kevin Orlando did an amazing job as always, and we promise we only made a couple of sleigh homonym puns!</li>\n<li>New Achievement: Invigoration</li>\n<li>New Trophy Store Items</li>\n<li>Game &amp; UI: Avatar 66 - Avatar of Wrath, Avatar 68 - Absolute Zero</li>\n<li>Competition Winning items</li>\n<li>Banner 24 - Boomerang Glaives by u/ReconScoutTeemo</li>\n<li>Banner 25 - Glyphs by u/PvtMagnuS</li>\n<li>Limited Time only</li>\n<li>We’ve had heaps of requests for projectile swaps, so be careful what you wish for. Some really fun ones below, but they are limited time so win those Trophies and get them while you can!</li>\n<li>Co-op  - Fullscreen Sleighbells emote</li>\n<li>Banana farm - Presents projectile swap</li>\n<li>Ninja Monkey - Snowflake shuriken projectile swap </li>\n<li>Dart Monkey - Snowballs projectile swap</li>\n<li>Tack Shooter - Icicles and Snowflakes projectile swap </li>\n<li>Avatar 65 - Christmas wreath avatar (Obyn Wolf)</li>\n<li>Avatar 67 - Happy Holidays avatar (Etienne)</li>\n<li>Banner 23 - Seasons Greetings</li>\n<li>New CT Team Store items</li>\n<li>Building Props: Christmas Tree prop</li>\n<li>Team Banners: Team Banner 9 - Delicate Snowflake, Team Banner 10 - Roast Banana</li>\n<li>Icons: Alien Icon, Crown Icon</li>\n<li>Frames: Bloon Frame, Military Frame</li>\n</ul>\n<h1>What’s Not Here - Yet!</h1>\n<ul>\n<li>Context and Reality Check</li>\n<li>2022 was a big year for the BTD6 team and Ninja Kiwi overall. Getting out of lockdowns and back to work in person was a huge gift and we were excited to build big and exciting updates. Both Geraldo and Contested Territory pushed the game into new design and technical areas, but also required additional post-launch work.</li>\n<li>From a team perspective, getting out of lockdowns and the return of travel also meant long overdue family reunions and we supported extended time off for those purposes without hesitation. In parallel, we also saw more sick leave this year as unsurprisingly cold and flu season hit us particularly hard in Auckland this year, causing significantly more time off for ill health during September and October. While we did plan more time and did one fewer update this year than last in order to make room for a huge end of year update, this important leave time did impact us more than expected and planned.</li>\n<li>Rather than delay the entire update, we decided to delay two elements so we could still bring the Dreadbloon, the One Two Tree map, Sleigh Churchill, and new Trophy and Team Store items out for holiday.</li>\n<li>Dark Dungeon Expert Map</li>\n<li>We’ve been excited to respond to community requests for another difficult Expert map, especially with this excellent and inspiring community design. We implemented as designed and then iterated the room areas and path splits, in particular MOAB-class entering from two paths to prevent single path clustering. We riffed on the secret statue tower and included secrets and traps to match the dungeon theme and balance difficulty across modes and late game. These changes were producing a fantastic quality map but the nuances of the statue tower design, art, code, and QA made it compete for attention with the Beast Handler. At the point where we felt Beast Handler could still be delivered, we had to push Dark Dungeon to update 35 in the new year.</li>\n<li>Beast Handler</li>\n<li>This tower is very unique. The Beasts were completely different from any other mechanic in the game, and they of course required 15 new models and animation sets completely separate from the normal tower model and animations. Sharing more about the tower functionality than we have before, the Beasts were also designed to synergize, so several Handlers together would combine their Beasts in order to enable higher tier Beasts. Amazing art and animations were built, signature code was written and optimized, and design was iterated. In many ways, the Beast Handler was completed, bug tested, and nearly ready to release - nearly. Up until last week, we thought the changes were making progress, but ultimately during the last playtests of the week at both Auckland and Dundee offices, we agreed there was too much confusion with the combination system and how Beasts would interact with other Handlers. Ninja Kiwi has always cared about quality and providing our players with the best possible experience and the tower just didn’t feel like it was there. It wasn’t up to the standard we set ourselves and the standard we hold the game to. While we are extremely disappointed that we won’t be able to release a new tower this year, the team felt it was the right call to make as the Beast Handler was just not quite ready to be unleashed. This was a very difficult call after all the incredibly hard teamwork that was put in to get this done - for us to simply say that it is not yet ready to play. We can and will make this better but with the amount of revision needed, we are moving the Beast Handler out at least two updates to update 36 at the earliest. This is not a set date for the release, however. We are giving ourselves a few months to go back to the fundamental design and make sure we can make good on our commitment to quality. We will be working hard to get the Beast Handlers into your hands but we want to release a tower you all find enjoyable, challenging (in a good way!) and, most importantly, fun! We really appreciate the love and support you have all provided us with this year and we hope you will understand the decision we've made and why.</li>\n</ul>\n<h1>Game Changes / Additions</h1>\n<ul>\n<li>A number of localization fixes, especially centered around the newer Polish language option, thank you to everyone who offered their feedback on that.</li>\n<li>Advanced challenges &amp; Time Attack tiles in CT will no longer earn XP</li>\n<li>Failed CT score submissions due to internet problems are now able to attempt to resubmit</li>\n<li>Boss Events now support multipliers to Boss Speed &amp; Boss HP as an event rule</li>\n<li>Boss Events now support paragon count limits as an event rule</li>\n<li>CT Events now support splitting up tile degradation rules based on the tile type</li>\n<li>CT Events rules now support the option of tiles going ‘stale’, not awarding any more points but still remaining captured - we’ve built out some systems to address issues players are having with how CT works currently and will be trying some things out in future now that the systems are in place</li>\n<li>The Trophy Store icon on the main menu will now display a notification when there are limited time items available that you don’t yet own</li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved an issue with placing certain towers near the top of the map preventing their model from loading</li>\n<li>Resolved a game crash on boost upgrading a hero that has already leveled past 10</li>\n<li>Save icon on maps should no longer interact with clicks as if it is it’s own separate button</li>\n<li>Resolved a crash that could occur when exiting a custom input mode for a tower</li>\n<li>Resolved an issue preventing first game launch without internet for no reason</li>\n<li>Resolved a number of map specific placement issues</li>\n<li>Resolved a crash that could occur when quickly entering and exiting from CT</li>\n<li>Resolved an edge case with host re-joining lobby causing games to run in different modes for each player</li>\n<li>Resolved an issue where focus markers could remain on CT map after new event start</li>\n<li>Resolved a noticeable lag spike on game saving the player profile</li>\n<li>Resolved an issue with stacking model assets on CT island menu</li>\n<li>Resolved an issue with store purchased relics &amp; their regular counterparts sometimes not stacking together</li>\n<li>Resolved an issue with CT King item restarting its full animation on every interaction</li>\n<li>Resolved an issue that could occur with the pre-game prep knowledge spikes being removed if not hitting any Bloons</li>\n<li>Resolved an issue with remaining Race Passes sometimes being unable to update display to the correct amount that you have</li>\n<li>Added ‘Teams’ icons to available player banners that are available from their Teams</li>\n<li>Resolved an issue where creating a paragon from the middle path T5 tower would recover cooldown instantly</li>\n<li>Resolved an issue where default hero skins were not initially displayed as a selectable hero skin choice</li>\n<li>All CT Team Store notification Pips should now be clearable by clicking on the items</li>\n<li>Resolved an issue with the ‘Go to Trophy Store’ button instead saying ‘remove’ on banners you don't have</li>\n<li>Removed Hidden T-Posing Monkeys in the background easter egg that could occur when a menu is opened over the top of the Main Menu.</li>\n<li>Resolved some language filtering issues</li>\n<li>Optimizations made to the Team Search / Quick Join search results</li>\n<li>Resolved some low framerate issues on specific pixel devices</li>\n<li>Resolved an issue with Monkey Team rewards not visually displaying for all players in co-op</li>\n<li>Resolved a crash that could occur when purchasing race passes on the pause menu</li>\n<li>Resolved a crash that could occur when loading a save with a necromancer in an odyssey</li>\n<li>Resolved some menu UI situations that displayed a blackened out background </li>\n<li>Potentially fixed that old crooked medal visual bug that still gets reported a lot</li>\n<li>A number of behind the scenes optimizations</li>\n</ul>\n<p>Dart Monkey</p>\n<ul>\n<li>Resolved niche cases in which Juggernaut’s projectiles would not properly be able to hit targets again after rebounds</li>\n</ul>\n<p>Boomerang Monkey</p>\n<ul>\n<li>5xx Glaive Lord DoT can no longer be applied to DDTs from a camo village without being able to deal damage to lead</li>\n</ul>\n<p>Tack Shooter</p>\n<ul>\n<li>Inferno Ring should now swap to 'first' target on upgrade purchase</li>\n</ul>\n<p>Monkey Ace</p>\n<ul>\n<li>Resolved an issue with Goliath doomship degree 100 end trail fx were being culled from the simulation incorrectly</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>Comanche xx4 upgrade damage should no longer incorrectly change with crosspathing</li>\n</ul>\n<p>Super Monkey</p>\n<ul>\n<li>5xx True Sun God resolved a potential Co-op error on purchasing upgrade</li>\n<li>4xx &amp; 5xx Super Monkeys should no longer attack during upgrade animation</li>\n</ul>\n<p>Captain Churchill</p>\n<ul>\n<li>Captain Churchill's Tank Drop Trophy Store item's animation now works correctly again</li>\n</ul>\n<p>Adora</p>\n<ul>\n<li>Resolved an issue with Vengeful Adora projectile assets not correctly displaying</li>\n</ul>\n<p>Etienne</p>\n<ul>\n<li>Resolved an error where Etienne would not record all stats correctly to your profile</li>\n<li>Lv3 Drone Swarm ability now has a forced expiration after the drone swarm duration +10s to prevent them getting stuck</li>\n<li>ETn beam down animation should now play correctly on loading a save</li>\n</ul>\n<h1>Platform Specific fixes</h1>\n<ul>\n<li>Windows Store: Resolved a crash that could occur on save</li>\n<li>Epic version: Webview now supports Linking Codes </li>\n<li>Apple Arcade: Monkey Names trophy item is no longer available for Child Accounts</li>\n<li>Apple Arcade: Resolved an infinite loading screen some users could come across</li>\n<li>Apple Arcade: Resolved an issue with Save Slot 3 not saving to iCloud when using multiple devices logged into the same iCloud account</li>\n<li>Apple Arcade: Resolved an issue with fresh local saves not conflicting with remote saves</li>\n<li>Apple Arcade: New UI to notify players of their iCloud account's enabled/disabled state</li>\n<li>MacOS: can no longer set game resolution to smaller than 800 x 600 since it cannot properly support a resolution that small</li>\n<li>MacOS: Resolved a game softlock on initial loading screen after selecting new cloud data on older version of the game</li>\n<li>Resolved a crash that could occur on certain iOS devices</li>\n<li>Resolved a map compression issue for the Alpine Run map on Android devices.</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>While not appreciated by all because of a lack of map situations it applies well in, we enjoy the quite specific niche that Juggernaut fills. However, we wanted to make some minor tweaks allowing it to apply itself better against fortified ceramics &amp; reducing the exceptionally high ultra-juggernaut secondary balls pierce in favour of damage that can be more reliably used up.</p>\n<ul>\n<li>4xx Juggernaut fortified damage 0 &gt; 2</li>\n<li>5xx Ultra-Juggernaut main ball fortified damage 0 &gt; 5</li>\n<li>5xx Ultra-Juggernaut mini juggernaut ball damage 1 &gt; 2</li>\n<li>5xx Ultra-Juggernaut mini juggernaut ball fortified damage 0 &gt; 2</li>\n<li>5xx Ultra-Juggernaut mini juggernaut ball pierce 100 -&gt; 50</li>\n</ul>\n<p>Boomerang Monkey</p>\n<p>In many situations, especially moving into the deeper lategame, T4 MOAR Glaives didn’t quite feel like enough of a step up over the T3; leading on into the high ceramic cleanup of the T5 we have decided to introduce that ceramic bonus earlier at T4 along with allowing Glaives to overcome their long-standing weakness of being consumed by nearby blockers at T4 with MOAR Glaives ignoring all blocking objects completely. In efforts to cut down on unnecessarily high pierce for more reliable base stats Glaive Lord is having its excessive orbit pierce converted into high base ceramic damage bonus on the orbit &amp; an added bonus to the main attack as well. When the Dart &amp; Boomerang paragons were first introduced the more expensive T5 upgrades were not taken into account for balance as much as the raw paragon upgrade cost, in addition to this we have for a long time taken a no-MK approach to general game balance, however paragons have proven that they should follow the opposite of this ideal and be balanced around a max MK assumed approach, due to MK balance the Dart Paragon gains an incredible degree bonus, so we would like to counterbalance some of that advantage in the base Boomerang design by reducing the price greatly.</p>\n<ul>\n<li>4xx MOAR Glaives gains bonus to ceramic +1</li>\n<li>4xx MOAR Glaives now ignores blocking objects</li>\n<li>5xx Glaive Lord Glaive main attack gains bonus to ceramic +8</li>\n<li>5xx Glaive Lord Rotating Glaives bonus to ceramic increased 5 &gt; 8</li>\n<li>5xx Glaive Lord Rotating Glaives pierce reduced to 80</li>\n<li>Boomerang Paragon price reduced from $400k &gt; $325k</li>\n</ul>\n<p>Bomb Shooter</p>\n<p>Cluster Bombs has far superior pierce over top path which is the actual pierce path while also providing better overall cleanup power, so for now we’d like to reign those in a little closer.</p>\n<ul>\n<li>xx3 Cluster Bombs cluster pierce reduced 10 -&gt; 8</li>\n<li>3xx Really Big Bombs pierce increased 50 &gt; 60</li>\n</ul>\n<p>Ice Monkey</p>\n<p>Ice Monkey base pierce is too high, very easily countering large numbers of strong Bloons early, mid or late in the game for small investment, leading to very low tiers of ice monkey (below t3) being highly effective spam options over upgrading your ice. We are reworking some of this base pierce to require crosspath investment and buffing the damage Ice 3xx Ice Shards to compensate for some of its reduced pierce.</p>\n<ul>\n<li>000 Ice Monkey pierce reduced from 40 -&gt; 30</li>\n<li>xx3 Cryo Cannon pierce reduced from 30 -&gt; 20</li>\n<li>x2x Deep Freeze now also increases pierce by +10</li>\n<li>x2x Deep Freeze price increased from 350 -&gt; 450</li>\n<li>x3x Arctic Wind price reduced from $2900 -&gt; 2800</li>\n<li>3xx Ice Shards base damage increased 1 -&gt; 2</li>\n<li>xx4 Icicles can now targets MOABs but not slow</li>\n</ul>\n<p>Glue Gunner</p>\n<p>Glue Gunner base level doesn’t fit in as a starter placement, while not really changing that at all we feel for now if it was cheaper than $250 you'd be able to start with 2 dart monkeys &amp; a glue on medium for more casual variety. With an expensive tier 2 and the T3 breaking the $3k mark Glue Hose doesn’t feel justifiable a lot of the time so base cost is being shifted up to T4. Bloon Solver appears to be in a fair state now but with low value save up into it from Dissolver &amp; Liquifier, slight improvements have been made here to assist them in cleaning up in some cases it feels they should.</p>\n<ul>\n<li>Base cost reduced from $275 &gt; 225</li>\n<li>x3x Glue Hose price reduced from $3250 &gt; 2900</li>\n<li>x4x Glue Strike price increased from $3500 &gt; 3850</li>\n<li>3xx Bloon Dissolver pierce increased from 1 &gt; 2</li>\n<li>4xx Bloon Liquefier ceramic bonus increased 1 &gt; 2</li>\n<li>3xx Bloon Dissolver tic rate 0.65s &gt; 0.575</li>\n</ul>\n<p>Sniper Monkey</p>\n<p>All paths of the Sniper Monkey are really starting to show strong use in different cases, and we’re quite happy with this, although bottom path feels like it relies a little too heavily on the top-end upgrades for such an overall cheap path, we are shifting a small amount of price out from the T3 into the T5</p>\n<ul>\n<li>xx3 Semi-Automatic price reduced from $3500 &gt; 3000</li>\n<li>xx5 Elite Defender price increased from $14,000 &gt; 14,500</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>While working on the Ace paragon we found a way to make homing appear much cleaner on super long-range attacks, so we’d like to try out this new setup on the Flagship for a little experiment to see if this improves the gameplay feeling there. Recent changes were very popular for Pirate Lord, so now it no longer feels like it needs to be such a cheap T5. While this isn’t enough of a change to curb its newfound power too much the price will be increasing. Buccaneer Farming at the base level is in-line with other farming options, slightly weaker but with enough dps to compensate, we recently experimented with lowering the benefit Trade Empire grants to T3s to slow down this early benefit &amp; this turned out to be quite successful however they still scale too well too quickly for a low price so we’re bringing that down more.</p>\n<ul>\n<li>5xx Flagship new homing style</li>\n<li>x5x Pirate Lord $21,000 -&gt; 26,000</li>\n<li>xx5 Trade Empire benefit to xx3's reduced from $15 &gt; 10</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Sky Shredder has a higher skill ceiling than most towers so has evaded many nerfs, but is still too good for what it offers so is finally seeing a slight price increase. Same as mentioned above for the flagship, we are experimenting with new homing changes for the Spectre &amp; Flying Fortress to improve their feeling. Users have noticed that Goliath Doomship's ability overall has far less pierce than the T4 ability, while this rarely matters at all the pierce value downgrading by that much was not an intended reduction, so we are bumping up each of those ability bombs to bring the total pierce up.</p>\n<ul>\n<li>5xx Sky Shredder price increased from $40,000 &gt; 41,500</li>\n<li>xx4 Spectre new homing style</li>\n<li>Goliath Doomship carpet-bomb pierce increased 50 -&gt; 150</li>\n</ul>\n<p>Mortar Monkey</p>\n<p>The recent Mortar 5xx rework significantly devalued 502 crosspath, undermining the work we previously put into trying to balance that choice, likewise 205 Mortar is not often used as base damage isn't relevant for Blooncineration compared to attack speed, following along with the idea of Top Path improving burny stuff damage in addition to base hit damage both of these paths will now benefit from increase burn DoT in such a way.</p>\n<ul>\n<li>502 The Biggest One DoT damage increased 25 &gt; 45</li>\n<li>204 Shattering Shells DoT damage increased 5 &gt; 8</li>\n<li>205 Blooncineration DoT damage increased 5 &gt; 8</li>\n<li>205 Blooncineration MOAB DoT damage increased 100 &gt; 150</li>\n</ul>\n<p>Dartling Gunner</p>\n<p>Laser Cannon feels it needs a small price buff. BADS on the bottom currently feels like it brings far too much power to carry the midgame for cheap so price is being shifted around from the T5 down into the T4.</p>\n<ul>\n<li>3xx Laser Cannon price reduced from $4250 -&gt; $3750</li>\n<li>xx4 BADS cost $12000 -&gt; $16000</li>\n<li>xx5 BEZ cost $58000 -&gt; $54000</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Wizard Archmage currently doubles the attack speed of the main attack along with adding a sizable MOAB damage bonus, but these benefits are not applied to the extra attacks that it gains as a 533 tower, which specifically makes the 520 crosspath benefits feel disappointing and the base dragon's breath it gains quite insignificant to the main tower. Phoeniis still far too strong for an extremely cheap T4, so cost is being shifted from the T5 down.</p>\n<ul>\n<li>510 Archmage's Fireball damage increased to match x3x bonus fireball damage 1 &gt; 9 </li>\n<li>5xx Archmage base attack rate increases now applies to secondary attacks</li>\n<li>510 Fireball rate 2.2 &gt; 1.1</li>\n<li>520 WoF rate 6.5 &gt; 3.25</li>\n<li>5xx Dragon's Breath rate 0.1 &gt; 0.05</li>\n<li>5xx Shimmer rate 2.5 &gt; 1.25</li>\n<li>5xx Archmage now also adds bonus MOAB damage to extra attacks</li>\n<li>500 Dragon's Breath MOAB bonus added +2 </li>\n<li>510 Fireball MOAB bonus added +9</li>\n<li>520 Wall of Fire MOAB bonus added +1</li>\n<li>x4x Summon Phoenix price increased from $4500 &gt; 6000</li>\n<li>x5x Wizard Lord Phoenix price reduced from 54,000 &gt; 52,500</li>\n</ul>\n<p>Super Monkey</p>\n<p>Tech Terror's ability runs into niche issues before r100 with some cases causing it to break BFBs into ceramic rushes instead of destroying them entirely, we found a very small damage buff resolves this up to r100, solving this problem for the base game modes, and while we were here added for the possibility for the ability to also deal consistant critical hits.</p>\n<ul>\n<li>x4x Tech Terror ability damage increased from 2500 &gt; 2600</li>\n<li>x5x Anti Bloon ability damage increased from 5000 &gt; 5200</li>\n<li>x4x Tech Terror every 3rd ability use crits for +50%</li>\n</ul>\n<p>Druid</p>\n<p>Druid’s vine brambles are very bottom-heavy in power, with high performance leading into a comparably small T4 increase, so some of the pierce is being moved up into the T4.</p>\n<ul>\n<li>x3x Druid of the Jungle brambles pierce reduced from 30 &gt; 20</li>\n<li>x4x Jungle's Bounty brambles pierce increased from 30 &gt; 40</li>\n</ul>\n<p>Banana Farm</p>\n<p>Bank is a little too much more efficient than any other Banana Farm option, this price nerf should leave it so it really somewhat still is but not so far ahead.</p>\n<ul>\n<li>x3x Monkey Bank price increased from $3500 &gt; 3800</li>\n</ul>\n<p>Engineer</p>\n<p>Overclock's considerable longer duration benefit on lower tiers currently serves little purpose and only leads to weirdness in upgrading boosted towers, so for now we’d rather minimize this on the early cases that don’t serve much purpose .</p>\n<ul>\n<li>x4x Overclock buff to T0 reduced 1.75x &gt; 1</li>\n<li>x4x Overclock buff to T1 reduced 1.5x &gt; 1</li>\n<li>x4x Overclock buff to T2 reduced 1.25x &gt; 1</li>\n</ul>\n<p>Quincy</p>\n<p>Quincy is a fairly average jack of all trades early on and does what’s required of him there fine, and while he’s an entry level hero that is very much meant to embody that jack of all trades but master of none feeling we’d like to add a little later end-game performance boost to his currently weak lv19 so he doesn’t drop off as much.</p>\n<ul>\n<li>Lv19 Quincy gains projectiles 2 &gt; 3</li>\n</ul>\n<p>Obyn Greenfoot</p>\n<p>Obyn’s Wall of Trees increase at level 20 feels like it can be a bit more of an increase, to assist him in his cleanup duty of end game super ceramics more effectively.</p>\n<ul>\n<li>Lv20 Obyn Wall of Trees pierce increased from 5000 &gt; 9001</li>\n</ul>\n<p>Benjamin</p>\n<p>Some players don’t want their Trojan to activate until a certain point, or at all. The Trojan is as it is by design, however since currently Ben’s location doesn’t seem to matter much we feel that by limiting the Trojan to not target through walls this will allow that strategic use to be made if chosen via clever positioning depending on the map.</p>\n<ul>\n<li>Ben Lv7 Bloon Trojan can no longer attack through walls</li>\n</ul>\n<p>Geraldo</p>\n<p>Geraldo's Sharpening Stone still stands out as extremely powerful for such a low cost, and how early he can be placed as a fast leveling hero allows for extremely easy power ramping from early on.</p>\n<ul>\n<li>Lv1 Geraldo placement cost increased from $600 &gt; $700</li>\n<li>Lv5 Sharpening stone duration reduced 15 &gt; 10 rounds</li>\n</ul>\n<p>Relic Balance</p>\n<p>A small list of number changes have been changed up for CT Relic Knowledge. We are mainly here hoping to create a standout use-case difference for Restoration &amp; Regeneration rather than one being purely better in every way.</p>\n<ul>\n<li>MOAB Clash: reduced from +3 &gt; 2</li>\n<li>Regeneration: restore lives/round (up to starting lives) 10 &gt; 20</li>\n<li>Restoration: restore lives/round (up to starting lives +200) 20 &gt; 10</li>\n<li>Starting Cash: starting cash bonus reduced from $300 -&gt; $250</li>\n<li>Air and Sea: discount amount reduced from 10% &gt; 5%</li>\n<li>Box of Monkey: free tower cost limit reduced from $500 -&gt; $400</li>\n<li>Primary Primates: Primary Monkeys discount 10% -&gt; 8%</li>\n<li>Military Monkeys: Military discount 10% -&gt; 8%</li>\n<li>Magic Monkeys: Magic discount 10% -&gt; 8%</li>\n<li>Monkey Tycoon: All Monkeys discount 5% -&gt; 4%</li>\n<li>Heartless: regrow rate reduction 25% &gt; 50%</li>\n</ul>\n<p>Sauda</p>\n<p>Saving this for last, as it is the biggest rework here with the most to say. There was too much already changed to include even further changes with her all at once, but we want to take this rework further after seeing your feedback, so Sauda fans please take your time over the holidays to really get a feel for how this changes things.</p>\n<p>At first this looks like a lot of numbers going down, but that is not our only intention with the changes, Sauda’s feeling is far too much of a ‘set and forget’ play, leading her to be extremely overvalued on simple maps but have a highly lackluster feeling on many difficult ones that require further interaction. To steer away from this her base power is being lowered at a number of points, with some tweaks to both her abilities overall improving their power mainly with a huge buff to her level 7 &amp; 11 Bloon Weakness debuffs now benefitting her abilities with CONSIDERABLY more damage than previously (previously +2 regardless of the ability damage)</p>\n<ul>\n<li>Lv2 pierce reduced from 6 &gt; 5</li>\n<li>Lv3 Leaping Sword DoT damage increased from 1 &gt; 2</li>\n<li>Lv3 Leaping Sword DoT duration increased from 5 &gt; 6.5</li>\n<li>Lv3 Leaping Sword DoT duration now increased by +0.5 for each level</li>\n<li>(Lv20 Leaping Sword DoT duration from this is increased 10 &gt; 15)</li>\n<li>Lv3 Leaping Sword pierce increased from 20 &gt; 30</li>\n<li>Lv10 Sword Charge damage increased from 20 &gt; 30</li>\n<li>Lv12 Leaping Sword Bonus impact bonus damage to MOABs increased from 130 &gt; 160</li>\n<li>Lv12 Leaping Sword DoT damage increased from 1 &gt; 3</li>\n<li>Lv15 Leaping Sword DoT damage increased from 1 &gt; 4</li>\n<li>Lv20 Leaping Sword DoT damage reduced from 16 &gt; 6</li>\n<li>Lv12 Leaping Sword damage reduced from 70 &gt; 40</li>\n<li>Lv15 Leaping Sword damage increased from 70 &gt; 80</li>\n<li>Lv20 Leaping Sword damage reduced from 570 &gt; 400</li>\n</ul>\n<p>Bloon Weakness Lv7 &amp; Lv11 much larger bonus to abilities, potentially doubling total damage.</p>\n<ul>\n<li>Lv7+ Leaping Sword impact bonus to Stunned Bloons 2 &gt; leaping sword damage/2 (10)</li>\n<li>Lv7+ Leaping Sword impact bonus to Stunned MOABs 2 &gt; leaping sword damage (20)</li>\n<li>Lv7+ Leaping Sword DoT bonus to Stunned Bloons 2 &gt; leaping sword DoT damage (2)</li>\n<li>Lv7+ Leaping Sword DoT bonus to Stunned MOABs 20 &gt; 10 + leaping sword DoT damage * 5 (20)</li>\n<li>Lv10+ Sword Charge bonus to Stunned Bloons 2 &gt; sword charge damage / 2 (15)</li>\n<li>Lv10+ Sword Charge bonus to Stunned MOABs 2 &gt; sword charge damage (30)</li>\n<li>Lv11+ Same bonuses applied to all cases for Sauda's Lv11 Bloon weakness bonus</li>\n<li>These changes carry up through all levels with all damage increases to Leaping Sword and Sword Charge (Levels 12, 15, 20 increase leaping sword damage, Levels 16, 20 increase Sword Charge damage)</li>\n</ul>\n<h1>Looking Forward</h1>\n<p>While we need to look at our planning overall and learn from the places where we bit off more than we could chew, we’re still planning on incredible updates for next year!</p>\n<ul>\n<li>Console: we’ve made great progress on the Xbox and Playstation versions of BTD6, and we will have these released as early next year as possible given the approval process on these platforms; we’ll update on this as we have meaningful news but we can tell you that 4 player couch co-op is truly awesomer!</li>\n<li>Update 35: we need these first updates of the year to be smaller so the team can rest and relax over the holidays, but we will have Dark Dungeon and as much extra as we can squeeze in</li>\n<li>Update 36: we’ll be pushing to have Beast Handler ready for this update but we’ll continue to hold it until it’s ready; there will be extra awesome here as well but still juggling whether that would be a Paragon or Boss</li>\n<li>Key Goals: we’re still brainstorming and pitching ideas for next year so there will be more than the list below but these are areas where we are excited to build new awesome</li>\n<li>Quests: both as events and as a player-paced progression system, we’re already underway with a system to support multiple linked games with short narratives and special rewards</li>\n<li>New Heroes, Paragons, and Bosses: with particular focus on new mechanics, challenge variety, and exciting visuals</li>\n<li>New Team Events and Features: more ways for Teams to play, compete, and have fun together, focusing on skill rather than grind, as well as new Team tools to help find like-minded players and safely communicate</li>\n<li>Creators: improved coordination around releases, creator events, and expanding the creator code program</li>\n<li>Map Editor and Player Creators: a fully functional in-game map creation tool with a curation pipeline is a huge goal; we’ll attempt to build this in stages so we can get more frequent community feedback about what should come next</li>\n<li>2023 and Beyond: we’ll start working on these pieces in 2023 but we’re not sure whether they will land in 2023 or after</li>\n<li>Mod support: whether via direct support or 3rd party tools, we’ll be developing better ways for modders to have fun with the game while improving the tracking and compartmentalizing of mod-based play to alleviate friction with accounts, main game progress, and fair competitive play</li>\n<li>Tower &amp; Bloon Editor: potentially overlapping with mod support, we’ll continue working on ways to play and have fun tweaking existing Monkey Towers and Bloons, and ultimately create a safely curated pipeline for new Tower and Bloon ideas</li>\n<li>Player Creator payback: a challenge on the technical, legal, and financial fronts, we still think that it’s important to share back with player creators if they help create valuable content for others. We love the idea that someone might get into game design and development because of the work they started in BTD6 or that others might be able to make a little bit of extra money and make their lives better by playfully working on a game they already enjoy. This is a massive challenge but we like the old wisdom that rising tides should lift all boats, and we know Admiral Brickell agrees.</li>\n</ul>\n<p>And finally, Happy Holidays! We absolutely love this game and working together as a team on it. We are so thankful to our players, our community, the content creators and the added entertainment they create, the player creators who push gameplay even further, and the amazing fan art, ideas, and questions that inspire us to do our best. We have huge plans for where to take Bloons TD 6 and we hope you all will keep playing and have fun helping us get there. Let’s all plan on having a very happy 2023 together as we look for more ways to involve the community in our vision and plans for where we go next, and until then please know that everyone at Ninja Kiwi wishes you the absolute best for a restful and playful holiday season!</p></div>",
            "date_published": "2022-12-06T23:26:53+00:00",
            "authors": [
                {
                    "name": "savnk",
                    "url": "https://www.reddit.com/user/savnk"
                }
            ]
        },
        {
            "id": "ykozkt",
            "url": "/r/btd6/comments/ykozkt/bloons_td_6_update_notes_version_333/",
            "external_url": "https://www.reddit.com/r/btd6/comments/ykozkt/bloons_td_6_update_notes_version_333/",
            "title": "Bloons TD 6 - Update Notes! Version 33.3",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/ykozkt/bloons_td_6_update_notes_version_333/'>Reddit</a></caption><div><br></div><div><p>https://preview.redd.it/74ly4tsw5nx91.png?width=296&amp;format=png&amp;auto=webp&amp;s=ce0e64b1fb8dbad9b667791642fc6ca4f5de6f6e</p>\n<h1>Bloons TD 6 v33.3 - Update Notes!</h1>\n<p>Additional links to most recent update notes: <a href=\"https://www.reddit.com/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/\">Update 33.0</a> - <a href=\"https://www.reddit.com/r/btd6/comments/y99tvi/bloons_td_6_update_notes_version_331/\">Update 33.1</a> - <a href=\"https://www.reddit.com/r/btd6/comments/yf6htb/update_bloons_td_6_v332_patch_notes/\">Update 33.2</a></p>\n<h1>Changes</h1>\n<ul>\n<li>~~Paragon limit was planned to be removed from base gameplay in this update but unfortunately, we have had a bug with this and the limit is still in place. This will be coming in 33.3!~~ <a href=\"https://new.reddit.com/r/btd6/comments/ydeqp2/paragon_limit_update/\">Read more about this reasoning over here</a>. Now actually removed!</li>\n</ul>\n<h1>Fixes</h1>\n<ul>\n<li>Resolved a crash that could occur when loading into the Contested Territory world and closing the daily reward popup before the world has finished loading</li>\n<li>Special Halloween game icon has now been changed back to the Dartling Gunner icon</li>\n<li>Resolved a bug that could occur preventing some relics from being selected when too many are owned</li>\n<li>Resolved a crash that occurred sometimes when entering the CT menu and attempting to view teams</li>\n<li>Resolved an issue where entering the CT team store would sometimes display white squares instead of the first icon in the page</li>\n</ul></div>",
            "date_published": "2022-11-03T01:50:12+00:00",
            "authors": [
                {
                    "name": "savnk",
                    "url": "https://www.reddit.com/user/savnk"
                }
            ]
        },
        {
            "id": "y99tvi",
            "url": "/r/btd6/comments/y99tvi/bloons_td_6_update_notes_version_331/",
            "external_url": "https://www.reddit.com/r/btd6/comments/y99tvi/bloons_td_6_update_notes_version_331/",
            "title": "Bloons TD 6 - Update Notes! Version 33.1",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/btd6/comments/y99tvi/bloons_td_6_update_notes_version_331/'>Reddit</a></caption><div><br></div><div><p>https://preview.redd.it/ky4hl8iky0v91.png?width=350&amp;format=png&amp;auto=webp&amp;s=951bd10f2fefd931b983d6ea2f77ebac2bf35a5c</p>\n<h1>Bloons TD 6 v33.1 - Update Notes!</h1>\n<p>For a full list of 33.0 Changes you can <a href=\"https://www.reddit.com/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/\">find the update notes here.</a></p>\n<h1>Changes</h1>\n<ul>\n<li>Base game paragon count restriction increased to 4 in response to feedback that with a restriction having support for 4 player co-op to each push for a paragon is more fair</li>\n<li>We have heard even more clearly from the community that this was a frustrating change, even for players who didn’t push for multiple paragons. We’re certainly not happy that our balance-focused decision has created such concern, and we certainly don’t want nerf-blaster toting giant head monkes showing up at our doors.</li>\n<li>Superceding the 33.0 notes, we are planning for 34.0:<ul>\n<li>Continued review of the use of Paragons and discussion with community and creators around Paragon limits overall</li>\n<li>Maintain a default of 4 Paragons in Boss Events and CT, but allow this to be edited per event, consistent with the Content Browser feature below</li>\n<li>Provide the Content Browser feature previously discussed, to allow individual Paragons to be excluded and total Paragon limits to be edited for maximum challenge creation flexibility</li>\n</ul>\n</li>\n<li>Intro animation for CT will no longer play together with the \"Daily Bonus\" popup</li>\n<li>Added Tile Recap title &amp; pop-up to recap mode in Contested Territory</li>\n</ul>\n<h1>Fixes</h1>\n<ul>\n<li>Resolved an issue with Sentries not placing on Covered Gardens</li>\n<li>Resolved visual issues related to disconnecting and rejoining a co-op game on Covered Garden</li>\n<li>Resolved visual issues related to modified starting round on Covered Garden challenges</li>\n<li>Resolved an issue with xx4 Buccaneers receiving a small income buff from the Navarch Paragon</li>\n<li>Resolved an issue with x3x Bomber Ace bombs exploding instantly on Covered Garden with no fall animation</li>\n<li>Resolved a crash loading a save using a Goliath Doomship set to wingmonkey</li>\n<li>Resolved some cases in which CT Building 3D elements would carry over into other parts of the game or become duplicated visually</li>\n<li>Resolved a crash that could occur when adding Geraldo to your Odyssey crew</li>\n<li>Resolved a crash that could occur when entering and backing out of the CT menu too quickly</li>\n<li>Resolved a crash that could occur on android devices that did not have google play installed</li>\n</ul></div>",
            "date_published": "2022-10-20T21:00:43+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "y5r2ww",
            "url": "/r/btd6/comments/y5r2ww/bloons_td_6_update_notes_version_340/",
            "external_url": "https://www.reddit.com/r/btd6/comments/y5r2ww/bloons_td_6_update_notes_version_340/",
            "title": "Bloons TD 6 - Update Notes! Version 34.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/y5r2ww/bloons_td_6_update_notes_version_340/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/y5r2ww/bloons_td_6_update_notes_version_340/'>Apollo</a></caption> <div><h1>New Awesome</h1>\n<p>- Fuck all of you the paragon limit is 1 now</p></div>",
            "date_published": "2022-10-16T20:32:24+00:00",
            "authors": [
                {
                    "name": "EggWasFirstYouIdiots",
                    "url": "https://www.reddit.com/user/EggWasFirstYouIdiots"
                }
            ]
        },
        {
            "id": "y1rbkv",
            "url": "/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/",
            "external_url": "https://www.reddit.com/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/",
            "title": "Bloons TD 6 - Update Notes! Version 33.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/y1rbkv/bloons_td_6_update_notes_version_330/'>Apollo</a></caption> <div><p>https://preview.redd.it/hpps65t3aat91.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=59c4b6ad7475d9aa11f732c2be17f9766bb35e54</p>\n<h1>Bloons TD 6 v33.0 - Update Notes!</h1>\n<h1>New Awesome</h1>\n<ul>\n<li>New Paragon Tower - the Monkey Ace Goliath Doomship!</li>\n<li>Endless jokes about big planes aside, we’ve been very excited to build and balance the first air Paragon!</li>\n<li>While we resist thinking about Paragons as 5/5/5+ Monkey Towers, the Goliath Doomship did allow for logical blending of features from all 3 paths, plus we included a powerful activated ability that adds further tactical control that plays out usefully across various map shapes</li>\n<li>At $800k cash, you will have to make sure your eco game is strong but Doomship’s power is balanced to that lofty setup cost</li>\n<li>New Halloween game icon</li>\n<li>Your eyes are not failing, nor is your screen - our icon is simply celebrating the ghoulish colors of Halloween!</li>\n<li>New Maps</li>\n<li>Advanced Map - Midnight Mansion</li>\n<li>Intermediate Community designed map - Covered Garden from <a href=\"https://www.reddit.com/user/SuperPsou/\">u/SuperPsou</a></li>\n<li>New Trophy Store Items</li>\n<li>Heroes: Joan of Arc Adora - Dragon Pet</li>\n<li>Monkeys: Monkey Ace - Dragonfly Pet</li>\n<li>Co-op: Psigh emote</li>\n<li>Game &amp; UI: Banana Farmer - Banana Costume, Glue Trap - Honey Bee skin, Profile Banner - Patchwork, Profile Banner-  Sun Rays, Profile Banner - Star Burst </li>\n<li>Banner winner by DREAD_LEAD (Engineer Foam)</li>\n<li>Banner winner by LordTeddington (Grand Master Ninja)</li>\n<li>New Limited Time Items: DDT Bloon Skin - Spider, Avatar - The Scream , Avatar - Monkey Brains.</li>\n<li>New CT Team Store Items</li>\n<li>Building Prop: Fortified Castle</li>\n<li>Base Props: Refracting Telescope, Pirate Crew</li>\n<li>Water Prop: Mini Pirate Boat</li>\n<li>Flying Prop: Moon Rabbit</li>\n<li>Team Banners: Pet Frenzy banner, Contested Territory banner</li>\n<li>Icons: Kung Fu Kiwi icon, All-Seeing Eyecon</li>\n<li>Frames: Cognition frame, Ninja Scroll frame</li>\n</ul>\n<h1>Game Changes / Additions</h1>\n<ul>\n<li>New Languages - Polish and “Monkelish” are now supported</li>\n<li>Team Browser - Added more intuitive UI to the \"Advanced Search\" panel</li>\n<li>Paragon tower placement restrictions</li>\n<li>We’ve set a maximum of 3 per game in 33.0, as we now have a baseline of general purpose DPS paragons and want to move into more synergies and interesting mechanical interactions between them, which become more interesting when choices need to be made</li>\n<li>We have heard the clear feedback from the community about this general restriction based on the preview notes and now plan to do the following in future major updates, or minor ones if feasible:<ul>\n<li>Increase the limit to 4, based on feedback about 4 player co-op in particular</li>\n<li>Include a Content Browser editor function that allows players to set higher limits or unrestricted in player-created Content Browser games</li>\n</ul>\n</li>\n<li>Contested Territory</li>\n<li>The number of steps required to use Relics felt like too many, so we’ve removed Relic Voting from the team store. Now, when viewing any tile players will be able to pop up a full list of their available relics to personally select from.</li>\n<li>To improve active team coordination we have allowed Vice-Mayors to also set focus markers on the CT map.</li>\n<li>The total number of focus markers each team can set in CT has been increased from 1 to 4, to allow for diverse preference and strategies.</li>\n<li>Contested Territory matchmaking improved for better groupings based on activity &amp; overall rank.</li>\n<li>Added a Daily Reward to welcome back players entering the Contested Territory event.</li>\n<li>The Main Menu CT Icon now shows a pip displaying available tickets.</li>\n<li>Tidied the CT Info panel up for much clearer readability.</li>\n<li>Added a spooky Seasonal Theme to CT screens, in preparation for Halloween!</li>\n<li>Added Discord &amp; Steam Rich Presence for Contested Territory.</li>\n<li>Team Banners can now be set on personal profiles, as long as your team owns that banner.</li>\n<li>Over 32.4 to 33.0 we made general constant improvements to the balance of Banner/Relic tile distribution over the CT map. </li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Team Island should correctly reflect your Team Color in CT</li>\n<li>Resolved an issue where loading a save and restarting would not allow you to earn a Black Border from that run</li>\n<li>Resolved a number of background errors in CT</li>\n<li>Changed team permissions so that Mayors can only only transfer leadership to members who have already been promoted to Vice-Mayors</li>\n<li>Changing search filters in Team Browser will now trigger a search</li>\n<li>Resolved an issue where disabling friend requests would not save</li>\n<li>Resolved a number of map specific placement issues</li>\n<li>Loading a profile from the cloud will no longer keep boss event saves</li>\n<li>Resolved a crash on using boss checkpoints</li>\n<li>Resolved an issue preventing some challenge codes from being searched</li>\n<li>Resolved an issue where powers could be disabled in unranked co-op Bosses</li>\n<li>Paragon towers should be correctly sold when their supporting arctic wind platform is removed</li>\n<li>Resolved an issue with the CT event main menu banner appearing prior to level 30</li>\n<li>Improvements made to camera zoom in CT</li>\n<li>Large texture cleanup for all Paragon towers</li>\n<li>Resolved an issue with logging out of accounts on some devices</li>\n<li>General cleanup and optimizations of the Team Store</li>\n<li>A number of localization issues resolved</li>\n<li>Resolved an issue where players could add duplicate entries to their Friends List</li>\n<li>Resolved an issue withy friends showing 'default' avatar for their highscores on maps</li>\n<li>Resolved a number of issues around joining and leaving Teams</li>\n<li>Resolved a number of cases in which the background for some menus would show entirely black </li>\n<li>Optimizations made to a number of large textures</li>\n<li>Team/Friends - Popup dialogs can no longer appear off screen</li>\n<li>Team Trophy balance now correctly updates visually upon purchase</li>\n<li>Resolved a minor graphical glitch on Frozen Over map when Cave Monkey is released</li>\n<li>Resolved an issue with heroes gaining more than one level at a time counting as tiers purchased with the least tiers ruleset</li>\n<li>Resolved an issue with missing or wrong badges displaying on CT leaderboards</li>\n<li>Resolved an issue with Team Search not allowing Space entries</li>\n<li>Resolved low quality splash screen issues</li>\n<li>Heroes are now purchasable from the upgrades menu in-game</li>\n</ul>\n<p>Ice Monkey</p>\n<ul>\n<li>5xx Embrittlement now slows MOABs the correct amount with permafrost</li>\n<li>250 Absolute Zero now slows MOABs the correct amount with permafrost</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>xx4 Relentless Glue no longer targets Bosses/BADs</li>\n<li>104 Glue Gunner should no longer sometimes apply green glue assets</li>\n</ul>\n<p>Monkey Sub</p>\n<ul>\n<li>3xx Submerge subs should now submerge correctly on Quarry</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<ul>\n<li>Buccaneer paragon should no longer mis-align its platforms if upgraded from the trade empire</li>\n</ul>\n<p>Super Monkey</p>\n<ul>\n<li>025 Legend of the Night now correctly gains crosspath pierce</li>\n</ul>\n<p>Pat Fusty</p>\n<ul>\n<li>Highlighting on Snowman Pat Fusty no longer disappears at Lv3</li>\n<li>Pat’s legs should no longer sometimes not sink into water when taking a dip</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>No longer clips into ship badly at Lv12</li>\n</ul>\n<p>Psi</p>\n<ul>\n<li>Psi is now able to target Leads when the Alchemist Touch relic knowledge is equipped</li>\n</ul>\n<p>Geraldo</p>\n<ul>\n<li>Description spelling errors resolved</li>\n<li>When fitting multiple sentry items on top of a flagship platform, these will now correctly relocate when creating the Paragon</li>\n<li>Rejuvenation Potion will no longer reset Paragon cooldowns</li>\n</ul>\n<h1>Desktop Version</h1>\n<ul>\n<li>Added Linking Codes to Epic clients</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Freeplay</p>\n<p>To encourage challenge diversity using the new extended list of preset rounds in freeplay, we have decided to make a tweak to freeplay income tax to drop it off slightly slower and allow a little more cash to be earned naturally in this range.</p>\n<ul>\n<li>Round 101+ natural income generation increased from 2% -&gt; 5%</li>\n<li>Round 121+ natural income generation remains at 2%</li>\n</ul>\n<p>Dart Monkey</p>\n<p>As Sharpshooter’s crit occurrence didn’t feel frequent enough the overall attack rate has been increased also just to lead better into the T5’s already high rate of fire. Along with this all Crossbow criticals have been standardized, overall with T5 criticals occurring more frequently in exchange for a slight reduction in base pierce to improve Sharp Shot crosspath value. Apex Plasma Master excels generally for the cheapest paragon &amp; how easy it is to start scaling early degrees so is seeing a rate decrease.</p>\n<ul>\n<li>xx4 Sharpshooter attack cooldown reduced from 0.75 &gt; 0.6</li>\n<li>xx5 Crossbow Master attack cooldown unchanged</li>\n<li>xx4 Sharpshooter crit rate changed from 8-12 shots to every 10th</li>\n<li>xx5 Crossbow Master crit rate changed from 4-8 shots to every 5th</li>\n<li>xx5 Crossbow Master pierce reduced from 10 &gt; 8</li>\n<li>Apex Plasma Master attack cooldown increased from 0.3 &gt; 0.35</li>\n</ul>\n<p>Tack Shooter</p>\n<p>The Tack Zone’s all-purpose high single target &amp; grouped DPS plus cleanup utility scales too well with so many options, as this is primarily intended to be the single-target damage path. To reinforce this we have traded off damage for a bonus to MOABs in order to nerf its unbuffed cleanup potential, so watch out for cluster and Super Ceramics now. Ring of Fire should pick up in that area for cleanup use &amp; general destruction but it has more pierce than it really needs in most scenarios with other important stats sitting lower to compensate for high pierce, so we have shifted this high pierce more into requiring the pierce crosspath in exchange for more base power and an overall buff. Inferno Ring’s meteor will now also follow target priority since that was a fun idea that was worth adding.</p>\n<ul>\n<li>xx5 Tack Zone damage reduced from 2 &gt; 1</li>\n<li>xx5 Tack Zone gains bonus damage to MOABs +1</li>\n<li>4xx Ring of Fire attack cooldown reduced 0.4725 &gt; 0.315 (buff of +25 &gt; 50%)</li>\n<li>4xx Ring of Fire pierce reduced from 60 &gt; 40</li>\n<li>4xx Ring of Fire damage increased from 3 &gt; 5</li>\n<li>5xx Inferno Ring damage increased from 4 &gt; 8</li>\n<li>5xx Inferno Ring MOAB bonus reduced from 6 &gt; 4</li>\n<li>5xx Inferno Ring attack speed unchanged</li>\n<li>5xx Inferno Ring Meteor now follows Target Priority</li>\n</ul>\n<p>Ice Monkey</p>\n<p>Arctic Wind hardly gets used for its actual basic intended purpose, which would be cool to see used for more than just causing ice platform bug reports.</p>\n<ul>\n<li>Arctic Wind aura slow amount increased from 40 &gt; 60%</li>\n</ul>\n<p>Glue Gunner</p>\n<p>We want to achieve an effect with Bloon Solver’s acid burning through the layers quickly but not instantly, though we haven’t so far achieved a good balance of this along with eliminating Super Ceramics in a timely manner, causing it to be disappointing or impractical on shorter maps. To solve this while retaining the vision we have boosted the ceramic bonus up significantly along with preventing this bonus from overflowing into the children layers.</p>\n<ul>\n<li>5xx Bloon Solver DoT's Ceramic bonus damage increased from 2 -&gt; 8</li>\n<li>5xx Bloon Solver DoT’s increased Ceramic damage will not skip through extra children layers upon breaking the ceramic layer</li>\n</ul>\n<p>Sniper Monkey</p>\n<p>After the lower tier nerfs Elite Sniper still remains just a bit too good even without considering its cash production.</p>\n<ul>\n<li>x5x Elite Sniper price increased from $13,000 &gt; 14,500</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>Monkey Pirates is great for the first couple MOABs but with the long ability cooldown it very quickly falls off after that point, we have pushed it and Pirate Lord’s base stats up to feel more competitive especially with possible Brickell synergy. Trade Empire farming power even with the water requirement feels like it takes off too easily, so the bonus cash it provides will now require T4 Favored Trades for the full benefit.</p>\n<ul>\n<li>x4x Monkey Pirates Grapes damage increased 1 &gt; 2</li>\n<li>x4x Monkey Pirates Grapes ceramic bonus increased 1 &gt; 2</li>\n<li>x4x Monkey Pirates Cannonball explosion damage increased 2 &gt; 3</li>\n<li>x4x Monkey Pirates Cannonball explosion moab bonus increased 0 &gt; 6</li>\n<li>x4x Monkey Pirates price increased $4500 &gt; 4900</li>\n<li>x5x Pirate Lord Grapes damage increased 5 &gt; 10</li>\n<li>x5x Pirate Lord Grapes ceramic bonus increased 5 &gt; 10</li>\n<li>x5x Pirate Lord Grapes burn damage increased 1 -&gt; 9</li>\n<li>x5x Pirate Lord Cannonball explosion damage increased 2 -&gt; 5</li>\n<li>x5x Pirate Lord Cannonball explosion moab bonus increased 0 -&gt; 10</li>\n<li>x5x Pirate Lord Cannonball frags damage increased 1 -&gt; 10</li>\n<li>x5x Pirate Lord Cannonball frags moab bonus increased 0 -&gt; 5</li>\n<li>xx5 Trade Empire cash per round per merchant when applied to xx3 Merchantmen reduced $20 -&gt; $15</li>\n<li>xx5 Trade Empire cash per round per merchant when applied to xx4 Favored Trades remains at $20</li>\n</ul>\n<p>Monkey Ace</p>\n<p>To help you work towards the new Ace Paragon we have reduced Spectre’s lategame ceramic weakness with improved targeting for the bomb projectiles &amp; a large increase to their bonus Ceramic damage to help out later on, to change focus on these projectiles we have also shifted damage around for the darts to deal single target with the bombs providing ceramic AoE cleanup. Flying Fortress’s value drops off by the lategame when you can realistically afford it, so following on with this dart single target focus change at T4 we have added a large MOAB damage bonus to Flying Fortress darts.</p>\n<ul>\n<li>xx4 Spectre darts &amp; bombs now both have a weaker homing effect</li>\n<li>xx4 Spectre dart damage increased from 2 &gt; 3</li>\n<li>xx4 Spectre bomb damage reduced from 3 &gt; 2</li>\n<li>xx4 Spectre bomb ceramic bonus increased from 2 &gt; 4</li>\n<li>xx5 Flying Fortress darts now deal bonus damage to MOABs +10</li>\n</ul>\n<p>Heli Pilot</p>\n<p>Heli’s Razor Rotors don’t scale with higher tiers so improvements have been made specifically to that attack for Dartship &amp; Apache Prime. Support Chinook use is too niche outside of farming for the high cost, so the upgrade cost along with that effective cash gain amount from ability usage has been lowered to retain the same farming while improving niche use. Downdraft has more general use throughout the game and scales better than the more expensive MOAB Shove upgrade though they both see use, so the price of these upgrades has been swapped around. Faster Darts xx1 upgrade will now increase the attack distance of Heli Dart attacks in order to assist with cluttering issues where large numbers of Helis will push each other away from nearby targets.</p>\n<ul>\n<li>4xx Apache Dartship rotors damage increased 2 &gt; 4</li>\n<li>4xx Apache Dartship rotors pierce increased 10 -&gt; 20</li>\n<li>5xx Apache Prime rotors damage increased 2 &gt; 8</li>\n<li>5xx Apache Prime rotors pierce increased 10 -&gt; 40</li>\n<li>x4x Support Chinook price reduced 12,000 -&gt; 10,500</li>\n<li>x4x Support Chinook crate cash reduced $1800 -&gt; 1650</li>\n<li>x3x Downdraft price increased 3000 -&gt; 3500</li>\n<li>xx3 MOAB Shove price reduced 3500 -&gt; 3000</li>\n<li>xx1 Faster Darts also increases attack distance of dart attacks by +30%</li>\n</ul>\n<p>Mortar Monkey</p>\n<p>It has been hard for The Bloon Solver &amp; The Biggest One to exist so close in the same price range when they fill the same role but with The Biggest One being simply better and more versatile, so we have ramped The Biggest One to fill a better role but for a higher cost. Artillery Battery’s special stun bonus is completely ineffective against targets which are impossible to stun, so it is receiving a small damage bonus to these targets to compensate. Other similarly priced decamo options are able to decamo DDTs, so Signal Flare feels like a far lesser choice here having this basic decamo utility locked behind Monkey Knowledge, so that’s being freed up.</p>\n<ul>\n<li>4xx The Big One shockwave gains bonus to ceramic +1</li>\n<li>5xx The Biggest One price increased from $28,000 -&gt; $36,000</li>\n<li>5xx The Biggest One can now stun MOAB Class Bloons at a reduced rate</li>\n<li>MOAB 0.3s, BFB/DDT 0.2s, ZOMG 0.1s</li>\n<li>x4x Artillery Battery deals bonus dmg to BADs &amp; Bosses targets &gt; 4</li>\n<li>x5x Pop &amp; Awe deals bonus dmg to BADs &amp; Bosses targets &gt; 10</li>\n<li>x5x Pop &amp; Awe grants all other x4x mortars bonus dmg to BADs &amp; Bosses &gt; 6</li>\n<li>xx3 Signal Flare can now decamo DDTs</li>\n<li>Paint Stripper MK now instead allows xx4 Shattering Shells to remove Fortification from DDT's</li>\n<li>xx4 Shattering Shells DoT damage per tic increased 1 &gt; 5</li>\n<li>xx5 Blooncineration DoT damage per tic remains at 5</li>\n</ul>\n<p>Dartling Gunner</p>\n<p>Rocket Storm being cheaper than its T3 when the T3 is more of a decent stepping stone into the good T4 didn’t quite sit right, so these prices have just been swapped. Buckshot pierce has been increased to help make its attacks cut through more for a chunkier hit. Focused Firing’s distance bonus on 203 due to how it is setup with projectile speed dropoff was a bit less than this written ‘25%’ realistically closer to 18.75%, so this number has been increased enough to give it roughly a true 30% increase in distance.</p>\n<ul>\n<li>x3x Hydra Rockets price reduced from $5250 &gt; 5100</li>\n<li>x4x Rocket Storm price increased from $5100 &gt; 5250</li>\n<li>xx3 Buckshot dartling pierce increased 4 -&gt; 6</li>\n<li>xx5 Bloon Exclusion Zone pierce remains at 6</li>\n<li>203 Focused Firing distance bonus 25% &gt; 40%</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Wall of Fire’s exceptional T2 power needs to be moved around for improved crosspathing, along with a slight nerf to Phoenix as it is currently performing too well, and both of these upgrades are shifting some of their power into Dragon’s Breath so it can stand out as more than just a buff to WoF &amp; a stepping stone to Phoenix. Shimmer is prone to missing a lot of camo Bloons due to the low attack rate, we do want it to be slower than other decamos to account for the larger radius and better T5 so we are making the radius benefit more noticable and lowering price</p>\n<ul>\n<li>020 Wall of Fire pierce per tic reduced from 15 -&gt; 10</li>\n<li>021 Wall of Fire pierce per tic reduced from 19 -&gt; 15</li>\n<li>020 Wall of Fire damage Tic rate reduced 0.1 -&gt; 0.15</li>\n<li>020 Wall of Fire wall spawn rate reduced 5.5 -&gt; 6.5</li>\n<li>120 Wall of Fire duration increased 4.5 -&gt; 5.5</li>\n<li>120 Wall of Fire no longer auto-targets but gains a target marker (like x3x Engineer)</li>\n<li>030 Dragon's Breath base damage increased 1 &gt; 2</li>\n<li>030 Dragon's Breath WoF damage Tic rate remains 0.1</li>\n<li>030 Dragon's Breath WoF pierce per tic increased 15 -&gt; 20</li>\n<li>x4x Summon Phoenix price increased $4000 -&gt; 4500</li>\n<li>x4x Summon Phoenix pierce reduced 10 &gt; 8</li>\n<li>xx3 Shimmer radius increased 70 &gt; 80</li>\n<li>xx3 Shimmer price reduced $1700 &gt; 1500</li>\n</ul>\n<p>Super Monkey</p>\n<p>Ultravision is a lackluster crosspath with so many other ways to get camo detection cheaper &amp;/or for more towers. The Anti-Bloon is expensive but as a quite underused tower feels it doesn’t live up to the super monkey name for that cost, for now the ability is seeing a cooldown decrease. We feel Legend of the Night’s base tower is more usable now after recent buffs, so without a total need to lean entirely on the passive ability for use we are increasing this cooldown to prevent some issues.</p>\n<ul>\n<li>x5x The Anti Bloon ability cooldown reduced 45 -&gt; 30s</li>\n<li>xx2 Ultravision grants bonus damage to camo bloons +1</li>\n<li>xx5 Legend of the Night cooldown increased 120 &gt; 180s</li>\n</ul>\n<p>Ninja Monkey</p>\n<p>Sticky Bomb feels like it is in a very strong point right now in a lot of situations, though flash bomb isn’t good enough without a great deal of support leading into it, this shift should open up for challenge viability especially in Alternate Bloon Rounds games.</p>\n<ul>\n<li>xx3 Flash Bomb price reduced $2750 &gt; 2250</li>\n<li>xx4 Sticky Bomb price increased $4500 &gt; 5000</li>\n</ul>\n<p>Alchemist</p>\n<p>Transforming Tonic has always had a large struggle with pierce, rather than directly throwing onto the base pierce we have added crosspathing pierce &amp; rate benefits for transformation enjoyers to now choose between. Acidic Mixture Dip stacking from multiple alchemists / stalling tactics too effectively lowered use of other lead counter options in a way we didn’t like, so the maximum stacks here without Permabrew has been reduced considerably.</p>\n<ul>\n<li>140 Transforming Tonic monster pierce increased 6 -&gt; 9</li>\n<li>041 Transforming Tonic attack speed increased 0.03 -&gt; 0.024s</li>\n<li>2xx Acidic Mixture Dip max number of stacks reduced 200 -&gt; 40</li>\n</ul>\n<p>Druid</p>\n<p>Top path Heart of Thunder doesn’t scale well with tiers for an upgrade with such niche use &amp; generally feels lacking, so it is seeing general power improvements across the board to upgrades that incorporate this attack. Druid of the Jungle’s vines feel too strong already for this, but for quality of life the T4 Jungle’s Bounty Druid will now gain targeting options for the global vine attack, which we hope will make all players as well as Druid fans happy.</p>\n<ul>\n<li>2xx Heart of Thunder damage increased from 1 &gt; 2</li>\n<li>4xx Ball Lightning (HoT) damage increased from 1 &gt; 3</li>\n<li>4xx Ball Lightning (Ball) damage increased from 2 &gt; 3</li>\n<li>5xx Superstorm (HoT) damage increased from 3 &gt; 10</li>\n<li>5xx Superstorm (Ball) damage increased from 5 &gt; 10</li>\n<li>205 Avatar of Wrath applies its full RBE damage bonus scaling to Heart of Thunder</li>\n<li>x4x Jungle's Bounty vine can now follow tower Target Priority</li>\n</ul>\n<p>Spike Factory</p>\n<p>Spike Factory 4xx feels it needs a small boost in order to really start feeling worth upgrading to rather than getting multiple T3s in the lategame due to the improved Spiked Mines pierce not being as needed for Super Ceramics.</p>\n<ul>\n<li>4xx Spiked Mines spikes bonus to fortified increased 1 &gt; 3</li>\n<li>4xx Spiked Mines explosions bonus to fortified increased 1 &gt; 3</li>\n</ul>\n<p>Engineer</p>\n<p>The MOAB offense of top path lacks for a mainly dps tower that is quite complex to use, T3 Sprockets already feels underwhelming so is seeing a buff here carrying up to T4, and the 320 crosspath will now be able to double dip on the Fortified &amp; MOAB damage bonuses that it gains. Cleansing Foam is only seeing a slight tweak to help it be more viable if you want to attempt it as 'main camo detection’, and this mainly fixes some issues in ABR games allowing it to catch quick initial camo spawns.</p>\n<ul>\n<li>3xx Sprockets buff amount to sentry rate &amp; deployment increased 40 &gt; 50%</li>\n<li>120 Sentries can now benefit from both of the moab and fort damage bonuses on one target if that target is a fortified moab</li>\n<li>x3x Cleansing Foam attack gains 1s of 4x rate on round start</li>\n</ul>\n<p>Gwendolin</p>\n<p>As she’s a little average all around these days with other heroes overtaking in the past years, Gwendolin is seeing some improved quality of life, synergization, and extra juice to the initial hit of Firestorm since currently the ability is, well,  not heroic enough and the first impact does very little compared to the DoT.</p>\n<ul>\n<li>lv3 Cocktail of Fire gains a target selection point</li>\n<li>Lv5 Pyrotechnics Expert: All Ring of Fire, Signal Flare &amp; Dragon's Breath gain 10% rate &amp; radius (This follows normal buff rules, applying to higher tiers, but not subtowers)</li>\n<li>Lv18 Pyrotechnics Master: Ring of Fire, Signal Flare &amp; Dragon's Breath buff increased from 10% to 20%</li>\n<li>Lv10 Firestorm initial damage increased 2 -&gt; 5</li>\n<li>Lv10 Firestorm initial moab damage increased 2 -&gt; 20</li>\n<li>Lv20 Firestorm initial damage increased 5 -&gt; 10</li>\n<li>Lv20 Firestorm initial moab damage increased 5 -&gt; 50</li>\n</ul>\n<p>Ezili</p>\n<p>Ezili’s niche use is in an extremely strong spot right now so we shouldn’t really buff her, but anyway Heartstopper &amp; Sacrificial Totem both feel too limited in total possible synergies, these are having quality of life improved and Heartstopper will additionally allow all towers to damage Purple Bloons to open up more combination options and give more reason to use it.</p>\n<ul>\n<li>Lv3 Heartstopper can now activate if there are Purple Bloons spawned regardless of if they are regrow or not</li>\n<li>Lv3 Heartstopper now also removes Purple Bloon immunity for duration</li>\n<li>Lv3 Heartstopper duration increased 6 -&gt; 10s</li>\n<li>Lv3 Heartstopper cooldown reduced 60 -&gt; 45s</li>\n<li>Lv7 Sacrificial Totem now gains a targeting option for spawn</li>\n<li>Lv7 Sacrificial Totem grants an additional pierce to Wizards 1 &gt; 2</li>\n<li>Lv7 Sacrificial Totem grants an additional attack speed to Wizards 15 &gt; 20</li>\n<li>Lv12 Heartstopper cooldown reduced 45 -&gt; 40</li>\n</ul>\n<p>Adora</p>\n<p>Adora feels like the perfect target to fill a current hole heroes have, we so far have no real dedicated ‘Fortification Buster’ among us in the hero lineup so giving this to Adora will hopefully allow for new unique use cases that the others don’t fill.</p>\n<ul>\n<li>Lv3 Long arm of the Light cooldown reduced from 45 -&gt; 35s</li>\n<li>Lv9 Main attack gains increased damage to fortified Bloons +2</li>\n<li>Lv13 Main ඞttack fortified damage bonus increased to +3</li>\n<li>Lv19 Main attack fortified damage bonus increased to +4</li>\n<li>Lv10 Ball of Light gains increased damage to fortified Bloons +3</li>\n<li>Lv15 Ball of Light fortified damage bonus increased to +5</li>\n<li>Lv20 Ball of Light fortified damage bonus increased to +20</li>\n</ul>\n<p>Admiral Brickell</p>\n<p>We had people request a specific funny use case of Brickell on Ravine, which we respect and approve, and overall we wanted to scale her main revolver attack better into late game, so she is seeing slight and slightly experimental improvements.</p>\n<ul>\n<li>lv10 Mega Mine explosion no longer blocked by map line of sight</li>\n<li>Lv12 main handgun damage increased 7 -&gt; 8</li>\n<li>Lv15 main handgun damage increased 9 -&gt; 12</li>\n<li>Lv17 main handgun damage increased 11 -&gt; 18</li>\n</ul>\n<p>Contested Territory - Relic Knowledge</p>\n<p>Most balance time this update was dedicated to actual towers, but a few Relic Knowledge points in CT stood out to us as far too strong or weak &amp; are seeing the numbers update below. In future updates we will be taking a closer look at top &amp; bottom performing relic points, so if you want to have your voice heard on that matter the next month will be the time.</p>\n<ul>\n<li>Camo Trap: Number provided reduced from 2 &gt; 1</li>\n<li>Flint Tips: DoT tic rate reduced 2 &gt; 2.5s (4 &gt; 5s total)</li>\n<li>Camo Flogged: Bonus damage to Camo increased from 1 &gt; 3</li>\n<li>Hero Boost: Increased XP value increased 10 &gt; 15%</li>\n<li>Going the Distance: Range bonus increased from 10 &gt; 20%</li>\n<li>Bigger Bloon Sabotage: It goes without saying the Bigger Bloon Sabotage relic was not intended to apply to Boss Bloons and this has been resolved. This was a bug resolved in 32.2 but deserves mentioning here with the rest of the changes</li>\n</ul>\n<p><strong>Looking Forward</strong></p>\n<p>We said a lot in 32.0 notes so not as much new-new news here but we restate our commitment to keeping players updated and looking for more ways to get the community involved in future development directions, so your feedback is encouraged, respected, and appreciated.</p>\n<ul>\n<li>34.0</li>\n<li>Heads down on Beast Handler - from the look to the variety of each path, we are putting great effort into making this all new BTD tower something special. While we’re excited to preview, we have to set realistic expectations that the work involved may not leave much time before the update for sneak peaks, but we’ll do what we can!</li>\n<li>More Maps - still aiming for 2 new maps to make sure there is plenty of new badges to grab over the holidays</li>\n<li>Creators</li>\n<li>Huge thanks to these creators for supporting the early partnership with Nexus.gg and figuring out the ins and outs of the system:<ul>\n<li>Tewtiy: <a href=\"https://www.youtube.com/channel/UCh_qU1GUf4FcNtV4-fJm3MA\">https://www.youtube.com/channel/UCh_qU1GUf4FcNtV4-fJm3MA</a></li>\n<li>Ethan Reid: <a href=\"https://www.youtube.com/channel/UCbdbgaxLYyqYiSyGT3uDlFg\">https://www.youtube.com/channel/UCbdbgaxLYyqYiSyGT3uDlFg</a></li>\n<li>TrippyPepper: <a href=\"https://www.youtube.com/channel/UCBczY8q9siLYhV_kP92JpmA\">https://www.youtube.com/channel/UCBczY8q9siLYhV_kP92JpmA</a></li>\n<li>SJB: <a href=\"https://www.youtube.com/channel/UCzIVHVDqZmvqFiTud7cILnw\">https://www.youtube.com/channel/UCzIVHVDqZmvqFiTud7cILnw</a></li>\n<li>ISAB: <a href=\"https://www.youtube.com/channel/UC7WQH4kpgxXJYHp8r9IAO-Q\">https://www.youtube.com/channel/UC7WQH4kpgxXJYHp8r9IAO-Q</a> &amp; <a href=\"https://www.twitch.tv/btdisab\">https://www.twitch.tv/btdisab</a></li>\n<li>Boltrix: <a href=\"https://www.youtube.com/channel/UClGJXPEYFjjhsvPN0WgBD-A\">https://www.youtube.com/channel/UClGJXPEYFjjhsvPN0WgBD-A</a></li>\n<li>Aidanz: <a href=\"https://www.youtube.com/channel/UCxpyUFmh0jT5TZd7Y5ZgpoQ\">https://www.youtube.com/channel/UCxpyUFmh0jT5TZd7Y5ZgpoQ</a></li>\n<li>Dabloon: <a href=\"https://www.youtube.com/channel/UC-dsyRY8AXvoLqKPiSeRf4g\">https://www.youtube.com/channel/UC-dsyRY8AXvoLqKPiSeRf4g</a></li>\n<li>Alukian: <a href=\"https://www.youtube.com/channel/UCkKjISVs-Th9kGc5mLFmk8w\">https://www.youtube.com/channel/UCkKjISVs-Th9kGc5mLFmk8w</a></li>\n<li>Hbomb: <a href=\"https://www.youtube.com/channel/UCMV2-8sFDZmyqY48ysw5iEQ\">https://www.youtube.com/channel/UCMV2-8sFDZmyqY48ysw5iEQ</a> &amp; <a href=\"https://www.twitch.tv/smackdaddyjosh\">https://www.twitch.tv/smackdaddyjosh</a></li>\n<li>Sensation: <a href=\"https://www.youtube.com/channel/UCDxfRwPvQX4p-JGFfr2z_Cg\">https://www.youtube.com/channel/UCDxfRwPvQX4p-JGFfr2z_Cg</a></li>\n<li>JeromeASF: <a href=\"https://www.youtube.com/channel/UCrYnLkVfvVf0Qy0YOUQdk2A\">https://www.youtube.com/channel/UCrYnLkVfvVf0Qy0YOUQdk2A</a></li>\n<li>Tewbre: <a href=\"https://www.youtube.com/channel/UCCCOyUvlbt1YagerVgbwopQ\">https://www.youtube.com/channel/UCCCOyUvlbt1YagerVgbwopQ</a></li>\n</ul>\n</li>\n<li>We’re still working with Nexus on improvements and tools and hope to include more creators by the end of this year. Stay tuned!</li>\n<li>Console</li>\n<li>We are still pushing hard to get BTD6 submitted for PlayStation and Xbox this year. 4 player couch co-op is so much fun and we can’t wait to share it, but we cannot speak to a launch date, or even whether it’s late this year or early next. As soon as we can update you on release targets, we will!</li>\n</ul></div>",
            "date_published": "2022-10-12T02:12:03+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "y02bmf",
            "url": "/r/btd6/comments/y02bmf/bloons_td_6_update_notes_version_330/",
            "external_url": "https://www.reddit.com/r/btd6/comments/y02bmf/bloons_td_6_update_notes_version_330/",
            "title": "Bloons TD 6 - Update Notes! Version 33.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/y02bmf/bloons_td_6_update_notes_version_330/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/y02bmf/bloons_td_6_update_notes_version_330/'>Apollo</a></caption> <div><p>Update: Bloons TD 6 v33.0 - Update Notes!</p>\n<p>Now rolling out on iOS, Android, Steam. Please restart your storefront or be patient if it does not appear for you, these updates can take some time to be rolled out to every region due to how the storefronts are set up.</p>\n<h1>New Awesome</h1>\n<ul>\n<li><strong>New Paragon tower, the Monkey Ace Goliath Doomship</strong></li>\n<li>The BIGGEST, baddest plane is finally done with construction, just in time to spook the Bloons for Halloween. The bloons will never see the light of day ever again.</li>\n<li>Comes equipped with rapid fire long range fast seeking darts and bombing runs sure to pack a punch to MOAB-class and boss bloons.</li>\n<li>Ability destroys all bloon below BADs and deals immense damage to bosses!</li>\n<li>Pushing for higher Paragon degrees improves dart attacks, bomb attacks, and ability cooldowns</li>\n<li>Goliath Doomship is the most expensive paragon out of the bunch, so farm hard and check the nets if you want methods to practice, like Hbomb’s here: <a href=\"https://www.youtube.com/watch?v=TU5LH-tZiRQ\">The Fastest Way To Farm</a> Or Ethan Reid’s farming comparison here: <a href=\"https://www.youtube.com/watch?v=4SAIPAl5LGQ\">This is the Best Banana Farm in BTD6! (11.4% Return)</a></li>\n<li><strong>New Intermediate Map, Covered Garden</strong></li>\n<li>Now you see them, now you don't! In this new map, only one of four areas under the greenhouse is accessible at all times.</li>\n<li><strong>New Bloon Boss - Dreadbloon, Armored Behemoth!</strong></li>\n<li>This boss comes with more than just a rock solid heart, or rather the lack thereof, as it will be immune to a certain tower class each time it reaches a skull!</li>\n<li>The drill bit is immune to sharp attacks, other damage types are less effective. Focus on the back line!</li>\n<li>Periodically regenerates its shield, which gets stronger as more damage is dealt to it.</li>\n<li>A fine balance of tower diversity and strategic tower placements are key to victory - good luck!</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>Added Time Attack to the Special Conditions tab in the Challenge Editor. Shared races are automatically sent to us so your race may be picked next!</li>\n<li>Status updates on challenges and odysseys, you can now see if your challenge/odyssey has been reviewed, in the process of being reviewed, or accepted to run in the challenge/odyssey roster in the near future! Restrictions apply, and space is limited.</li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved some issues with navigating between certain menus causing the background to turn black or blurry</li>\n<li>Resolved a number of minor crashes</li>\n<li>Resolved a number of localisation issues</li>\n<li>Resolved various minor map specific issues</li>\n<li>Elite bosses no longer take more damage than their normal counterparts do.</li>\n<li>Perma-charge now gains permanent camo detection with the Bionic Augmentation</li>\n</ul>\n<p>Dart Monkey</p>\n<ul>\n<li>Ultra-Juggernaut's mini juggernauts now receive the knockback and damage buffs that the Juggernaut received</li>\n</ul>\n<p>Boomerang Monkey</p>\n<ul>\n<li>MOAB Domination's special kylie attack explodes if it hits its pierce cap before it expires</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>The top path has been in a strange spot for a long time now, even with some recent buffs the attack speed and range have been ignored and may warrant a change now.</p>\n<ul>\n<li>3xx Spike-o-pult attack cooldown reduced from 1.15s -&gt; 0.95s</li>\n<li>4xx Juggernaut attack cooldown reduced from 1s -&gt; 0.95s</li>\n<li>5xx Ultra-Juggernaut attack cooldown reduced from 1s -&gt; 0.95s</li>\n<li>3xx Spike-o-pult range increased from 32 -&gt; 36.8 (same as 4xx and 5xx currently)</li>\n</ul>\n<p>Boomerang Monkey</p>\n<p>Bionic Boomerang doesn't synergize that well with bottom path currently. MOAB Domination is also a tad pricey for what it does.</p>\n<ul>\n<li>032 Bionic Boomerang gives +2 MOAB damage</li>\n<li>042 Turbo Charge gives +3 MOAB damage</li>\n<li>052 Perma-Charge gives +4 MOAB damage</li>\n<li>xx5 MOAB Domination price reduced from $60000 -&gt; 50000</li>\n</ul>\n<p>Tack Shooter</p>\n<p>Needs an all rounder overhaul so that each crosspath has its unique usage.</p>\n<ul>\n<li>2xx Faster Shooting attack speed buff reduced from 40% -&gt; 25%</li>\n<li>4xx Ring of Fire attack cooldown decreased from 0.4725s -&gt; 0.33s</li>\n<li>410 Ring of Fire pierce decreased from 70 -&gt; 80</li>\n<li>420 Ring of Fire pierce decreased from 80 -&gt; 100</li>\n<li>510 Inferno Ring meteor pierce increased from 10 -&gt; 15</li>\n<li>520 Inferno Ring meteor pierce increased from 10 -&gt; 20</li>\n<li>501 Inferno Ring meteor damage increased from 700 -&gt; 1000</li>\n<li>502 Inferno Ring meteor damage increased from 1000 -&gt; 1300</li>\n<li>x3x Blade Shooter attack speed buff reduced from 15% -&gt; 10%</li>\n<li>040 Blade Maelstrom ability pierce reduced from 200 -&gt; 100</li>\n<li>140 Blade Maelstrom ability pierce reduced from 200 -&gt; 150</li>\n<li>042 Blade Maelstrom damage increased from 1 -&gt; 2</li>\n<li>040 Super Maelstrom ability pierce reduced from 500 -&gt; 250</li>\n<li>140 Super Maelstrom ability pierce reduced from 500 -&gt; 375</li>\n<li>051 Super Maelstrom damage increased from 2 -&gt; 3</li>\n<li>052 Super Maelstrom damage increased from 2 -&gt; 4</li>\n<li>xx3 Tack Sprayer attack speed buff increased from 25% -&gt; 30%</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Fighter Plane path quickly tapers off in usability in favor of other towers with extra MOAB-class damage. In preparation for the paragon tower the Spectre's attacks have also been overhauled.</p>\n<ul>\n<li>1xx increases projectile speed by 50%</li>\n<li>3xx Fighter Plane missile damage increased from 18 -&gt; 30</li>\n<li>4xx Operation: Dart Storm missile damage increased from 24 -&gt; 30</li>\n<li>5xx Sky Shredder missile damage increased from 150 -&gt; 200</li>\n<li>xx3 Neva Miss Targeting projectile speed reduced from 180 -&gt; 120</li>\n<li>xx3 Neva Miss Targeting and above darts rehit bloons after 1 second.</li>\n<li>xx3 Neva Miss Targeting dart seeking changed from Moderate -&gt; Strong</li>\n<li>xx4 and xx5 Spectre bomb and dart attacks no longer alternate with each other</li>\n<li>xx4 and xx5 Spectre attack cooldown set to 0.12 for bomb and dart attacks</li>\n<li>xx4 and xx5 Spectre dart seeking changed from Very Weak -&gt; Very Strong</li>\n<li>xx4 and xx5 Spectre dart projectile speed reduced from 400 -&gt; 300</li>\n<li>xx4 and xx5 Spectre bomb projectile speed reduced from 300 -&gt; 225</li>\n<li>xx4 Spectre dart ceramic damage increased from 2 -&gt; 10</li>\n<li>xx4 Spectre bomb ceramic damage increased from 2 -&gt; 15</li>\n<li>xx5 Flying Fortress dart damage increased from 4 -&gt; 5</li>\n<li>xx5 Flying Fortress dart ceramic damage increased from 2 -&gt; 25</li>\n<li>xx5 Flying Fortress bomb damage increased from 5 -&gt; 8</li>\n<li>xx5 Flying Fortress bomb ceramic damage increased from 2 -&gt; 25</li>\n<li>014 and 015 Spectre no longer adds pineapple attack, instead adds an additional bomb attack with Elite targeting</li>\n<li>204 and 205 Spectre no longer adds extra pierce, instead adds an additional dart attack with Elite targeting</li>\n</ul>\n<p>Monkey Village</p>\n<p>The Monkeyopolis ‘space saving’ farm absorption is too much of a downgrade in most cases with the recent nerf.</p>\n<ul>\n<li>xx5 Monkeyopolis generation per $2000 increased $200 -&gt; 250</li>\n</ul>\n<p>Quincy</p>\n<p>Quincy needs a few buffs where they're lacking currently</p>\n<ul>\n<li>Base Cost $540 -&gt; $500</li>\n<li>Lv4 range increased from 52 -&gt; 55</li>\n<li>Lv12 pierce increased from 7 -&gt; 8</li>\n<li>Lv13 range increased from 54 -&gt; 60</li>\n<li>Lv14 MOAB damage increased from +1 -&gt; +2</li>\n</ul>\n<p>Adora</p>\n<p>Adora struggles to get over the midgame hump, so these changes should help ease that transition.</p>\n<ul>\n<li>XP Multiplier 1.71x -&gt; 1.5x</li>\n<li>Lv3 Long Arm of Light ability duration reduced from 15s -&gt; 13.5s</li>\n<li>Lv3 Long Arm of Light ability duration increases 0.5s per level</li>\n</ul>\n<p>Bosses</p>\n<p>When we increased the Stun Radius of Vortex in later tiers, it was met by backlash from most of the community. While we feel that this move was justified, the stun duration has gone quite overboard so we've tapered those values instead.</p>\n<ul>\n<li>Normal Vortex tier 1 Stun Duration reduced from 16 -&gt; 7</li>\n<li>Normal Vortex tier 2 Stun Duration reduced from 16 -&gt; 9</li>\n<li>Normal Vortex tier 3 Stun Duration reduced from 20 -&gt; 11</li>\n<li>Normal Vortex tier 4 Stun Duration reduced from 25 -&gt; 13</li>\n<li>Normal Vortex tier 5 Stun Duration reduced from 30 -&gt; 15</li>\n<li>Eilte Vortex tier 1 Stun Duration reduced from 20 -&gt; 14</li>\n<li>Elite Vortex tier 2 Stun Duration reduced from 25 -&gt; 18</li>\n<li>Elite Vortex tier 3 Stun Duration reduced from 30 -&gt; 22</li>\n<li>Elite Vortex tier 4 Stun Duration reduced from 36 -&gt; 26</li>\n<li>Elite Vortex tier 5 Stun Duration reduced from 40 -&gt; 30</li>\n</ul>\n<h1>Looking Forward</h1>\n<ul>\n<li>Update 34</li>\n<li>Last update for the year!</li>\n<li>New Tower - Beast Handler: we’re not saying anything but the name for this one, and we look forward to all of the speculation</li>\n<li>2 more maps - we’re sensitive to community feedback about wanting more maps, so wanting to get another two in for end of year holidays</li>\n<li>More quality of life, balance changes, and improvements</li>\n<li>Further Out</li>\n<li>Console: We still have plans to release BTD6 on PlayStation and Xbox this year. Taking heaps of work to make it feel as native as possible but we really want to make 4 player couch co-op happen! Switch is not in production but we will consider after PlayStation and Xbox.</li>\n<li>Mods: Another huge amount of work to get this right, so we have to delay this until next year to get this right. The goal is to allow stat and visual changes to existing towers for even more fun and flexibility with visuals, memes, and Content Browser submissions</li>\n<li>Map Editor: Not sure if we can pull off both Mods and Map Editor in 2023 but we will go for it. In game tools to create and submit maps will be a huge avenue for community creativity that we want to open up!</li>\n<li>Bosses, Paragons, Towers, and Maps: Even with big features planned we will not forget about the core game and will continue to bring out fun and challenging new gameplay all year.</li>\n<li>Teams+: Contested Territories is just the beginning of what we can do together as Teams, so look for more ways to play with Friends, even as we continue to be dedicated to awesome single-player, offline gameplay as always</li>\n</ul>\n<p>Disclaimer: Not official patch notes, and I don't have insider information :(</p></div>",
            "date_published": "2022-10-10T01:47:25+00:00",
            "authors": [
                {
                    "name": "JrMonkey15184",
                    "url": "https://www.reddit.com/user/JrMonkey15184"
                }
            ]
        },
        {
            "id": "x65qwe",
            "url": "/r/btd6/comments/x65qwe/bloons_td_6_update_notes_version_323/",
            "external_url": "https://www.reddit.com/r/btd6/comments/x65qwe/bloons_td_6_update_notes_version_323/",
            "title": "Bloons TD 6 - Update Notes! Version 32.3",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/x65qwe/bloons_td_6_update_notes_version_323/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/x65qwe/bloons_td_6_update_notes_version_323/'>Apollo</a></caption> <div><p>https://preview.redd.it/7zufbczllyl91.png?width=350&amp;format=png&amp;auto=webp&amp;s=65e95ff856d5383634da1b3e543fbbcec8daeea5</p>\n<h1>Update: Bloons TD 6 v32.3 - Update Notes!</h1>\n<p>Additional links to most recent update notes - <a href=\"https://www.reddit.com/r/btd6/comments/wvfy1y/bloons_td_6_update_notes_version_322/\">Update 32.2</a> - <a href=\"https://www.reddit.com/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/\">Update 32.1</a> - <a href=\"https://www.reddit.com/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/\">Update 32.0</a></p>\n<h1>Changes</h1>\n<ul>\n<li>Resolved an issue with the El Dorado relic not applying correctly</li>\n<li>Resolved an issue in CT where players could be sent back 2 checkpoints instead of 1 if they tried to return home after continuing</li>\n<li>Resolved a game crash that could occur when attempting to join an existing team via Quick Join</li>\n<li>Resolved an issue with 502 Bomb Shooter not correctly recieving bonus frag ceramic damage</li>\n<li>Resolved an issue where 205 boomerang crosspath reduced the pierce of the xx5 explosion</li>\n<li>Resolved an issue with CT Banner Tile income showing incorrectly</li>\n<li>Added individual Player Ecos to CT Team Roster</li>\n<li>Resolved an issue with friends button sometimes being clickable when they should not be</li>\n<li>Teams that you are not allowed to join currently will now correctly have their join buttons grayed out</li>\n<li>Searching for a team code should now show the team if it exists regardless of filters</li>\n<li>Resolved some minor errors with Team Messages</li>\n<li>Resolved an iOS crash with too much information when viewing global CT leaderboard</li>\n<li>Resolved some CT map lockup button issues</li>\n<li>Resolved Nexus Creator codes being case-sensitive when they shouldn't be</li>\n<li>Added Teams screen \"invite member\" option to insert player friend codes for invites</li>\n<li>Resolved some locs issues with Team Tickets</li>\n<li>Resolved some minor UI issues with messenger popups related to Teams menus</li>\n<li>Added more messaging to why some options around teams are not available when you are not in a team</li>\n<li>Resolved rare cases with incorrect team member count displays</li>\n<li>Resolved a Minor display inconsistency in CT</li>\n<li>Resolved an issue where Team buttons always display \"Teams\" rather than \"My Team\" at first when the game is launched</li>\n<li>Team Browser should no longer list the teams of friends that have not accepted your friend request in the Friend’s Team’s search</li>\n<li>Added ‘Hide Team Code’ option to the Teams menu</li>\n<li>Navigating into a teams UI and out should now resume from correct page/tab </li>\n<li>Resolved some niche case crashes &amp; softlocks</li>\n</ul></div>",
            "date_published": "2022-09-05T03:29:17+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "wvfy1y",
            "url": "/r/btd6/comments/wvfy1y/bloons_td_6_update_notes_version_322/",
            "external_url": "https://www.reddit.com/r/btd6/comments/wvfy1y/bloons_td_6_update_notes_version_322/",
            "title": "Bloons TD 6 - Update Notes! Version 32.2",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/wvfy1y/bloons_td_6_update_notes_version_322/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/wvfy1y/bloons_td_6_update_notes_version_322/'>Apollo</a></caption> <div><p>https://preview.redd.it/inkzfow6cej91.jpg?width=1680&amp;format=pjpg&amp;auto=webp&amp;s=b768e29d28ff8fa0caa87f0f3537ec00a09aab13</p>\n<h1>Update: Bloons TD 6 v32.2 - Update Notes!</h1>\n<p><a href=\"https://www.reddit.com/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/\">Link to 32.1 changes</a></p>\n<p><a href=\"https://www.reddit.com/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/\">Link to 32.0 changes</a></p>\n<h1>Upcoming CT Event Settings Changes for 2nd event</h1>\n<p>In response to internal review and community feedback on the first Contested Territories (CT) event, we have made several changes that will be in effect for the next CT event. We will also share a roadmap soo for other CT changes planned for future updates.</p>\n<ul>\n<li>CT Event #2 will run for 7 days - everyone agreed the first one was too long, so we will now try 7 days on, 7 days off and be open to future duration tweaks</li>\n<li>Degradation back to neutral timer increased from 24 to 28 hours - coming back the next day at a similar time and seeing your owned tiles neutral if not captured was disheartening. We increased to 28 hours so there is a window of overlap that will not throw off point balance too much. We want to make small, iterative changes here as there are many balance consequences.</li>\n<li>Degradation curve changed to maintain the challenge of beating the new best score for longer - tiles will now not degrade at all for 4 hours, then degrade more slowly from there and not reach such high values at the end of the curve</li>\n<li>Team creation cost will be increased significantly - we elected to have generous Team creation with the low 200MM cost and that helped generate a lot of Teams, but many players seemed to create Teams and join an instance only to not participate. By increasing this cost to 2000MM we are making Team creation a more considered decision, which we hope will direct more casually interested players to join already created public Teams</li>\n<li>Added 3 buckets of matchmaking to pool teams together with others of similar activity - we’re not giving much detail here intentionally, as it is complex and iterative but the intent is to connect similarly motivated Teams together</li>\n</ul>\n<h1>Additions</h1>\n<ul>\n<li>Added CT event prop to main menu to indicate live events</li>\n<li>Added more detail to tile capture messages in the team feed</li>\n<li>Added visual feedback for Master Builder’s self boosting effect</li>\n<li>Added popup for unlocking Team Flair items</li>\n<li>Added hover info to ‘kick pending’ in teams</li>\n<li>Added a “score eco” stat to local Teams score UI, which displays the current expected score increase when scores are added to the leaderboards - intended to clarify the relative rate of earning for each Team and inform tactical decisions about which tiles and ownerships to go after</li>\n<li>Added player Online status settings for friends &amp; teams, with Invisibility settings for privacy</li>\n<li>Added player restrictions preventing team hopping during active CT events</li>\n<li>Added pages to Friend’s Teams tab for better organization</li>\n<li>CT Tile Victory will no longer display rewards that you didn’t earn (CT Points/Relics) if you beat the map but did not beat the capture score</li>\n<li>Technical integration of Nexus.gg to enable curator codes - we will share more information about this separately when sign-up pages are ready</li>\n</ul>\n<h1>Fixes</h1>\n<ul>\n<li>Purchasing Hero Booster from the upgrades page now refreshes the UI correctly to display the new level</li>\n<li>042 Dartling Gunner no longer loses lead popping on the ability</li>\n<li>Resolved an issue where the save state of ultraboost stacks would be forgotten after creating Master Builder</li>\n<li>Resolved an issue where camo trap could miss DDTs if another Bloon passed over it at the same time</li>\n<li>Resolved an issue where selling an IMF Loan at the same time and taking a loan would not immediately try to pay back the loan with that tower’s sellback</li>\n<li>Resolved Bloon Traps re-placing within the map terrain after reloading a save</li>\n<li>Resolved xx2 Spike Factory buff applying to other towers &amp; allowing extra buffs to be applied</li>\n<li>Some Master Builder Sentries will no longer see but fail to hit Camos</li>\n<li>Resolved a crash that could occur with xx4 Necromancer</li>\n<li>Royal Treatment relic now allows Psi to target Purple Bloons</li>\n<li>Bigger Bloons Sabotage no longer also applies to Boss Bloons</li>\n<li>Relic related Life/Shield regeneration functions should no longer interfere with Mana Shield</li>\n<li>Resolved a crash related to restarts in Monkey Teams</li>\n<li>Fixed some UI softlock scenarios</li>\n<li>Local co-op lobby once again shows cosmetics of the lobby host</li>\n<li>Team Vice Mayors can have leadership transferred to them without having to first be demoted again</li>\n<li>Resolved some CT messages not displaying through into Team Feed</li>\n<li>Resolved an error that could occur removing team members</li>\n<li>Resolved some incorrect localizations with Teams &amp; CT</li>\n<li>Resolved a common crash on the CT Base Island menu</li>\n<li>Resolved a crash that could occur when returning to main menu from a race defeat</li>\n<li>Resolved a crash that could occur when leaving menu after joining a guild</li>\n<li>Resolved issues with ghost notifications in the team inventory tab</li>\n<li>Resolved Team Join button sometimes failing to work &amp; a few other Team Join related issues</li>\n<li>Resolved a crash that could occur logging out on Android devices</li>\n<li>Resolved an issue introduced in 32.1 that would cause some players to see an empty ‘global teams’ field in their CT rewards</li>\n</ul></div>",
            "date_published": "2022-08-23T05:10:55+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "wlbwm2",
            "url": "/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/",
            "external_url": "https://www.reddit.com/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/",
            "title": "Bloons TD 6 - Update Notes! Version 32.1",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/wlbwm2/bloons_td_6_update_notes_version_321/'>Apollo</a></caption> <div><p>https://preview.redd.it/wwjpkrydyyg91.png?width=350&amp;format=png&amp;auto=webp&amp;s=b48720413b9969a8dbc652694e6018e8a0f5ea59</p>\n<h1>Update: Bloons TD 6 v32.1... GO - Update Notes!</h1>\n<h1>Fixes</h1>\n<ul>\n<li>Resolved a number of issues with Contested Territory  ticket assignment and generation</li>\n<li>Resolved an issue where Teams Roster page was not showing player point earnings</li>\n<li>Resolved an issue where the Master Builder’s Sentry ability would not snap placement to your next tap on mobile</li>\n<li>Resolved an error when attempting to re-capture a tile with no surrounding tiles in CT</li>\n<li>Updated UI around member removal / promotions on team pages</li>\n<li>Resolved a rare crash on rejecting a team invite</li>\n<li>Resolved UI alignment issues on certain screen resolutions around CT</li>\n<li>A number of optimizations &amp; fixes made to team messages </li>\n<li>Prevented some team browser errors from popping up multiple times in a row</li>\n<li>Resolved an issue where Ice towers buffed by the Camo Flogged Relic would not freeze camo bloons</li>\n<li>My Teams button should now read \"Teams\" if not in a team</li>\n<li>Engineer's 032 Cleansing Foam slow no longer stacks on a single target</li>\n<li>Resolved an issue where CT Teammate's score was not loaded correctly when restarting/checkpoint loading a point before their score was set</li>\n<li>\"Tile Degraded\" should no longer show when a teammate sets a better score on a tile in CT</li>\n<li>x5x Ultraboost ability limited to 3 uses per round</li>\n<li>150 Absolute Zero ability no longer applies an excessively strong permafrost effect</li>\n<li>Resolved an issue where \"Team mate set better score\" would show in the background behind victory screen in CT</li>\n<li>Resolved an issue with Boss checkpoint costs being pulled down causing T5 boss checkpoint to be free</li>\n<li>Resolved art issues with the x3x Druid vine attack</li>\n<li>Resolved an issue with selecting more than 4 relics in CT</li>\n<li>Resolved a number of incorrect damage type issues</li>\n<li>Resolved an issue preventing Quick Join teams from working correctly</li>\n<li>Resolved a game crash that could occur when exiting from CT</li>\n<li>Fixed a number of locs issues</li>\n<li>Resolved an issue where full teams would still display at the top of the team browser list</li>\n<li>Closed Teams are now called “invite only teams”</li>\n<li>Resolved some pixel line errors that could occur on team emblems on certain resolutions</li>\n<li>Resolved a number of leaderboard load issues</li>\n<li>Resolved a number of issues with Team Browser filter search results</li>\n<li>Resolved a number of edge cases crashes related to UI / HUD updates</li>\n<li>Resolved a number of ‘missing background’ scenarios</li>\n</ul></div>",
            "date_published": "2022-08-10T23:17:13+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "wfnm5s",
            "url": "/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/",
            "external_url": "https://www.reddit.com/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/",
            "title": "Bloons TD 6 - Update Notes! Version 32.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/wfnm5s/bloons_td_6_update_notes_version_320/'>Apollo</a></caption> <div><p>https://preview.redd.it/0nlz3qniukf91.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=d7ee7f42df16e973fc51b33f31cefc2a3f59853b</p>\n<h1>Update: Bloons TD 6 v32.0 - Update Notes!</h1>\n<p>Now rolling out on iOS, Android, Steam. Please restart your storefront or be patient if it does not appear for you, these updates can take some time to be rolled out to every region due to how the storefronts are set up.</p>\n<h1>Key New Features</h1>\n<ul>\n<li>Massive new Event system - Contested Territories!</li>\n<li>We set out to make this big, inspired by Bloons Monkey City’s instanced six player, single challenge framework but pushing it to be truly next level for BTD6. Big was an understatement - we’ve made a whole new game inside the game!</li>\n<li>Now with 90 players per instance across six player-selected Teams (see below), Contested Territories combines a massive map of 150+ unique PvE challenge-based tiles with the PvP competition of vying for the best score</li>\n<li>With a range of difficulties that increase across Regular, Relic, and Banner tiles, the intent is to allow all player levels and styles to participate. Less experienced players can concentrate on Regular tiles, while more competitive players can duke it out over Relic and Banner tiles. Regular tiles give balanced rewards, Relic tiles give more Team Trophies and Relic Knowledge, and Banner tiles give the most points for the competitive leaderboards.</li>\n<li>More details available on our preview reddit post below, as well as the in-event info button: <a href=\"https://www.reddit.com/r/btd6/comments/va7jwc/contested_territory_overview_sneak_peek/\">Link</a></li>\n<li>We’ve spent extra time polishing and balancing this huge new system, so thank you for your patience! As always: feedback welcome on reddit and Discord.</li>\n<li>All new player-selected Teams feature!</li>\n<li>To support Contested Territories and other future features, we’ve added a guilds/clans system called Teams</li>\n<li>Up to 15 players can join together, manage membership, set tactical targets, unlock CT-specific boosts, and unlock a range of cosmetic items to customize your Team</li>\n<li>Closely linked with the Friends system to make it easier to invite or join up with in-game Friends</li>\n<li>Earn Team Trophies from Contested Territory to spice up your Player Teams with cosmetics including Team Banners, Icons &amp; Frames to decorate your team page plus all sorts of 3D items to customize your Team Base Tile</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Paragon tower, the Engineer Master Builder</li>\n<li>Yes, your Sentry Paragon is back! We ultimately chose Master Builder for the name as it represents the range of abilities better and relates more closely to the awesome construction exo suit that the art team had fun designing</li>\n<li>Deploying 3 powerful activated sentry types that explode on sell and deploy their own sub sentries, the Master Builder maintains its own powerful nail attack that overclocks itself every round</li>\n<li>Pushing for higher Paragon degrees improves nail gun attacks, activated sentry attacks, and activated sentry explosions on sell</li>\n<li>Master Builder is very expensive, almost as much as the Ascended Shadow, so farm hard and check the nets if you want methods to practice, like Hbomb’s here: <a href=\"https://www.youtube.com/watch?v=TU5LH-tZiRQ\">The Fastest Way To Farm</a> <br />\nOr Ethan Reid’s farming comparison here: <a href=\"https://www.youtube.com/watch?v=4SAIPAl5LGQ\">This is the Best Banana Farm in BTD6! (11.4% Return)</a></li>\n<li>New Intermediate Map, Quarry</li>\n<li>Digging deep into mother Earth usually leads to trouble, and the same is true in the Monkeyverse! Quarry’s zig zag path may look long, but the Bloons move faster on those downslope water channels. Expect the unexpected!</li>\n<li>New Hero Skin, Voidora</li>\n<li>Reaching us from the Great Beyond, Voidora makes playing the Adora Hero powerset an otherworldly experience of sight and sound</li>\n<li>New Contested Territory Achievements</li>\n<li>Conquested Territory | Capture 5 tiles off other players</li>\n<li>Stage of Empires | Capture 50 tiles</li>\n<li>Territory Sampler | Capture 1 of each: Boss, Time Attack, Least Tiers and Least Cash tiles</li>\n<li>New Trophy Store Items</li>\n<li>Heroes: Mountain Obyn - Balfrog Pet</li>\n<li>Monkeys: Monkey Village - Pride Flag  </li>\n<li>Co-op: Rainbow fullscreen emote, Need More! emote,</li>\n<li>Game &amp; UI: Avatar 61 - Dart monkey, Avatar 62 - Geraldo, Music Track - Tribes Jaloon Mix</li>\n<li>Competition winners<ul>\n<li>Banner winner by LordTeddington(OG btd style)</li>\n<li>Banner winner by tricky999tricky (Druid)</li>\n</ul>\n</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>Added a Hero counter to the new Hero Screen as well as a total count to the Achievements Screen for the collectionists</li>\n<li>Big behind the scenes refactoring to Monkey Knowledge to improve load time &amp; memory, this includes a number of bug fixes and resolutions to some minor quirks in functionality. Current enabled Monkey Knowledge for a save game will now be locked upon creation of that game</li>\n<li>Behind the scenes refactoring to Hero Skin Data to improve load time &amp; memory</li>\n<li>Changes to Boss auto-play behavior, if a Boss or its spawn are on screen the game &amp; next round always starts immediately. If a Boss is not on screen then the game does not start automatically, play button is shown, &amp; if you have auto-start toggled off then the game will stop between rounds.</li>\n<li>Added a new checkpoint at round 20 for boss events</li>\n<li>Restart functionality added to the pause menu in Race modes</li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Fixed the bug where v32.0 was not yet released</li>\n<li>Resolved an issue where some heroes were not adding their category to your profile to display recorded hero stats</li>\n<li>Setup \"Add Friend\" buttons to player profiles &amp; some general improvements &amp; fixes to friends online status/notifications</li>\n<li>Resolved an issue with Lych’s Soul having health and speed ramped up via freeplay scaling after round 80</li>\n<li>Resolved an issue with Fortified Golden Bloons causing lives to be leaked</li>\n<li>Resolved Audio slider sounds persisting on loop forever if you really specifically tried to go out of your way to break them</li>\n<li>Playing challenges from the browser should no longer add attempts to your games played stat</li>\n<li>Resolved a UI issue that could occur when returning from buying a hero booster from the fullscreen hero page</li>\n<li>Resolved some minor inconsistent UI font size issues across different screens.</li>\n<li>Resolved player name not displaying on main menu on first launch of the game on Apple Arcade</li>\n<li>Removed \"i\" info button from sub tower's tower portrait panels</li>\n<li>Resolved Ravine easter egg animation issues on some android devices</li>\n<li>Resolved incorrect Boss menu UI visuals when viewed from play social menu</li>\n<li>Resolved Adoras temple map no longer animating on game start</li>\n<li>Resolved an issue allowing players to open a broken boss menu while no boss event was active</li>\n<li>Resolved issues where one paragon’s UI could be used to create different paragon</li>\n<li>Resolved an issue in which some activated abilities upon being sold could block usage of other newly purchased activated abilities</li>\n<li>Resolved currently selected hero upgrade on the heroes upgrade menu being lost when navigating to a skin UI and returning.</li>\n<li>Resolved a crash that could occur when logging out of an account</li>\n<li>Deleted Accounts will no longer appear on your friends list</li>\n<li>Paragon upgrade audio no longer plays on loading a save with a paragon</li>\n<li>Resolved some issues with navigating between certain menus causing the background to turn black or blurry</li>\n<li>Resolved a number of minor crashes</li>\n<li>Resolved a number of localisation issues</li>\n<li>Scottish flag is no longer called the New Zealand flag when playing in German</li>\n<li>Resolved various minor map specific issues</li>\n</ul>\n<p>Dart Monkey</p>\n<ul>\n<li>Optimisations made to dart paragon lightning effects</li>\n<li>Resolved some inconsistency in Paragon degree results related to the Master Double Cross MK</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>Resolved overlays from xx4 relentless glue’s track puddles using green glue assets instead of pink</li>\n<li>xx5 Super Glue new art assets added for Glue DoT</li>\n</ul>\n<p>Monkey Sub</p>\n<ul>\n<li>x5x Pre-emptive Strike sub passive attack animation should no longer break on crosspath</li>\n</ul>\n<p>Monkey Ace</p>\n<ul>\n<li>xx4 Spectre no longer missing bonus ceramic damage on darts</li>\n</ul>\n<p>Dartling Gunner</p>\n<ul>\n<li>Optimisations made to some dartling lightning effects</li>\n<li>Resolved some projectile eject marker inconsistencies across Bottom Path</li>\n</ul>\n<p>Engineer</p>\n<ul>\n<li>Resolved some Invalid engineer foam targeting related to height</li>\n</ul>\n<p>Gwendolin</p>\n<ul>\n<li>Resolved an issue with Gwendolin’s Lv3 ability not playing it’s voiceline</li>\n<li>Resolved the initial hit from Gwendolin’s firestorm not keeping improved value at level 20</li>\n</ul>\n<p>Captain Churchill</p>\n<ul>\n<li>Resolved an issue where upon reaching level 20 Sentai Churchill would play 2 voice lines at once</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>Resolved a voice-line conflict on Admiral Brickell when attempting to place her level 10 Mega Mine, where it would also attempt to play a selection voice line.</li>\n</ul>\n<p>Geraldo</p>\n<ul>\n<li>Resolved placing some items from Geraldo's shop into play, only playing Geraldo's voiceline instead of item placement</li>\n<li>Resolved Geraldo's Bunny not rotating and getting stuck on rotating platforms</li>\n<li>Resolved closing Geraldo's shop via the hotkey not adding back the 'button' to open it again</li>\n<li>When Geraldo reaches level 18 his Genie Bottle description now updates from \"Blue Bottle\" to Gold.</li>\n<li>Resolved a crash that could occur when reassigning Geraldo’s action figure in coop</li>\n</ul>\n<h1>Desktop Version</h1>\n<ul>\n<li>Added GlueRatJam emote to the discord server</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Boomerang Monkey</p>\n<p>A small price increase to MOAB Press as combinations of this tower with others slows or spam with more of itself is very strong.</p>\n<ul>\n<li>xx4 MOAB Press price increased from $2200 -&gt; 2400</li>\n</ul>\n<p>Bomb Shooter</p>\n<p>Has been a standout tier 3 for long enough, T4 remaining unchanged to still encourage more focussed use over low tier spam.</p>\n<ul>\n<li>x3x MOAB Mauler bonus MOAB damage 18 -&gt; 15</li>\n<li>x4x MOAB Assassin damage unchanged</li>\n</ul>\n<p>Ice Monkey</p>\n<p>Ice monkey Enhanced Freeze is too good at low tiers, allowing full stunlock of ceramics for very cheap, as the fire rate increase alone of this Enhanced Freeze is a powerful addition most of the increased freeze duration has been moved up as it makes more sense to have duration with the currently less desirable T2 Deep Freeze. Permafrost was previously reduced to a lower price than we’d like to try increase desirability of this crosspath, but as the reworks to metal freeze have had more success there in pulling this path ahead we want to add a little back on here. Cryo Cannon has now been overperforming compared to any towers that perform similar roles with either of these crosspaths so is also seeing a general reduction.</p>\n<ul>\n<li>010 Enhanced Freeze freeze duration reduced from 2.2 -&gt; 1.75</li>\n<li>020 Deep Freeze freeze duration remains at 2.2</li>\n<li>1xx Permafrost price increased from $100 -&gt; $150</li>\n<li>xx3 Cryo Cannon attack delay increased from 1s -&gt; 1.2</li>\n<li>xx3 Cryo Cannon price increased from $1950 -&gt; 2250</li>\n</ul>\n<p>Sniper Monkey</p>\n<p>Sniper middle path is too strong for how easy to use it is, while having infinite range &amp; cash production as well. We have removed the free +1 pierce increase shrapnel gains at T3 in addition to the added bounce. Maim MOABs grouped stun potential when crosspathed with Shrapnel feels it is overperforming too much so the shrapnel will now have a reduced stun amount compared to the initial target hit</p>\n<ul>\n<li>x3x Bouncing Bullet shrapnel pierce reduced from 3 -&gt; 2</li>\n<li>x4x Supply Drop shrapnel pierce reduced from 6 -&gt; 5</li>\n<li>420 Maim MOAB's shrapnel stun reduced by about 33% effectiveness</li>\n<li>MOAB 3s -&gt; 2</li>\n<li>BFB 1.5s -&gt; 1</li>\n<li>ZOMG 0.75s -&gt; 0.5</li>\n<li>520 Cripple MOAB Shrapnel stun/debuff duration reduced</li>\n<li>MOAB 7s -&gt; 4.5</li>\n<li>BFB 6s -&gt; 4</li>\n<li>ZOMG 3s -&gt; 2</li>\n<li>DDT 4s -&gt; 2.5</li>\n<li>BAD 0.75s -&gt; 0.5</li>\n</ul>\n<p>Monkey Sub</p>\n<p>Similar types of camo reveal like Shimmer/Signal Flare/Embrittlement are all pierce limited, but the Submerge sub has practically infinite pierce while also being extremely cheap with a very fast rate and a T4 that is far better at camo removal than those other towers can reach. Giving this upgrade a more reasonable pierce value brings these more in line and allows for the pierce crosspath to have some potential meaning.</p>\n<ul>\n<li>3xx Submerge and Support camo pulse pierce reduced to -&gt; 100</li>\n<li>310 Submerge and Support camo pulse pierce reduced to -&gt; 120</li>\n<li>320 Submerge and Support camo pulse pierce reduced to -&gt; 150</li>\n<li>500 Energizer camo pulse pierce reduced to -&gt; 1000</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>Navarch Paragon feels too dominant over other expensive paragons, as such a powerful choice it feels overused even on many low water volume maps</p>\n<ul>\n<li>Navarch paragon price increased from $500,000 -&gt; 550,000</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Neva-Miss has been generally over performing for quite a cheap T3, increasing price here slightly but not carrying that increase up through higher tiers.</p>\n<ul>\n<li>xx3 Neva-Miss Targeting price increased from $2200 -&gt; 2800</li>\n<li>xx4 Spectre price reduced from $24,000 -&gt; 23,400</li>\n</ul>\n<p>Heli Pilot</p>\n<p>Heli’s blowback has always been extremely effective from early on, and as players have become more knowledgeable the use into lategame as well only seems to go up especially moving into Super Ceramics. This change shouldn’t really have as large an impact at higher level gameplay as total map length is so much shorter you will often still be blowing back the entire track, but the blowback range has been reduced at T3 leading back into the old value at T4</p>\n<ul>\n<li>x3x Downdraft blowback distance reduced from 32-300 to 32-150</li>\n<li>x4x Support Chinook blowback distance remains at 32-300</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Polishing some crosspaths, 130 Dragons Breath is the only crosspath for Guided Magic that doesn't yet attack through walls, and 011 Fireball also does not benefit from having the pierce crosspath</p>\n<ul>\n<li>130 Dragons Breath now target through walls from Guided Magic</li>\n<li>011 Wizard Fireball pierce increased from 15 -&gt; 20</li>\n</ul>\n<p>Super Monkey</p>\n<p>Legend of the Night outside of very specific niche challenges isn’t worth the cost as any more than VTSG fodder</p>\n<ul>\n<li>005 Legend of the Night damage increased 5 -&gt; 10</li>\n<li>005 Legend of the Night ceramic bonus increased 2 -&gt; 4</li>\n<li>005 Legend of the Night moab bonus increased 3 -&gt; 8</li>\n</ul>\n<p>Druid</p>\n<p>More needed crosspath reworking for the new 1xx Hard Thorns upgrade, as it now upgrades the druid from sharp to normal damage it doesn't make sense for the track brambles on 030 to not require this crosspath for lead popping. Spirit of the Forest's base attack has also had a simple damage increase as it contributes very little to the power of the tower by T5 and the tower lacks in single target.</p>\n<ul>\n<li>030 Druid of the Jungle bramble piles dmg type Normal -&gt; Sharp</li>\n<li>130 Druid of the Jungle bramble piles dmg type back to Normal</li>\n<li>050 Spirit of the Forest base attack damage increased 2 -&gt; 20</li>\n</ul>\n<p>Spike Factory</p>\n<p>Super Mines DoT damage is entirely insignificant for the price range of this tower.</p>\n<ul>\n<li>5xx Super Mines DoT damage per tic of damage increased 1 -&gt; 500</li>\n</ul>\n<p>Monkey Village</p>\n<p>The Monkeyopolis ‘space saving’ farm absorption shows to be far too much more efficient than the absorbed farms.</p>\n<ul>\n<li>xx5 Monkeyopolis generation per $2000 reduced $300 -&gt; 200</li>\n</ul>\n<p>Adora</p>\n<ul>\n<li>Lv20 True Adora buff increases Ball of Light Ability pierce from 43 -&gt; 48</li>\n<li>Lv20 True Adora buff increases Ball of Light Ability damage to 100</li>\n</ul>\n<p>Geraldo</p>\n<p>Many of Geraldo's items are too strong for the required maintenance, Geraldo SHOULD be a top level hero, he is literally designed to be so as the most rewarding for your player knowledge and reaction to moment to moment gameplay, but too many items reward spammable gameplay over these knowledge &amp; reactions so we are targeting a lot of durations/stock amounts with minimal price increases where it feels necessary. These are clearly a lot of small steps, as we did not want to do too many big changes from multiple angles all at once.</p>\n<ul>\n<li>Lv1 Jar of Pickles: Price increased from $50 -&gt; 100</li>\n<li>Lv1 Jar of Pickles: Duration reduced from 8 -&gt; 5</li>\n<li>Lv3 Invisibility Potion: Can no longer target a number of towers that have no attacks</li>\n<li>Lv4 Glue Trap: Now expires from the track after 4 rounds</li>\n<li>Lv4 Glue trap: Pierce reduced from 300 -&gt; 100</li>\n<li>lv5 Sharpening Stone: Now expires after 15 rounds </li>\n<li>Lv7 Maelstrom: Max stock reduced 5 to 3</li>\n<li>Lv7 Maelstrom: Price increased from $500 -&gt; $650</li>\n<li>Lv12 Genie: Duration reduced from 3 -&gt; 2 rounds</li>\n<li>Lv15 Super Maelstrom: No longer increases duration of the maelstrom</li>\n<li>Lv11 Rejuv Potion: Price increased from $1000 -&gt; 2000</li>\n<li>Geraldo's Moustache will no longer contain hidden Glue Rats</li>\n</ul>\n<p>Bosses</p>\n<p>Vortex’s Stun radius has proved to be a little too small allowing for some cheesier strategies than intended, but instead of a flat increase at all tiers we have decide to trial a slight increase up throughout each tier.</p>\n<ul>\n<li>Vortex tier 2 Stun Radius increased from 60 -&gt; 65</li>\n<li>Vortex tier 3 Stun Radius increased from 60 -&gt; 70</li>\n<li>Vortex tier 4 Stun Radius increased from 60 -&gt; 75</li>\n<li>Vortex tier 5 Stun Radius increased from 60 -&gt; 80</li>\n</ul>\n<h1>Looking Forward</h1>\n<p>Thanks again for reading to the end. We did a looking forward message in Update 30 where we announced work on new Bosses and Paragons, Contested Territories, and an in-game Mods system. We’ll continue that effort to keep the player community updated on our plans at least a couple times a year, and since Contested Territories has been such a huge feature to complete it’s now that time!</p>\n<p>We’ll keep this caveat in place each time. Unless otherwise noted, what we discuss in this section are plans, and we need to be able to make adjustments to these, as we’ve had to this year based on how much time and effort we put into the Geraldo Hero and Contested Territories. We’ll do our best to give context when we make changes, and as always we appreciate your patience, understanding, and support!</p>\n<ul>\n<li>Game Size and Value:</li>\n<li>We celebrated BTD6’s 4th anniversary this past June, and we took a look back on the volumes of work that we’ve added to the game since launch.</li>\n<li>INFOGRAPHIC HERE</li>\n<li>By any and all means of comparison, BTD6 is far bigger and stronger than it was 4 years ago, and all that time we have not changed (outside of currency exchange rates applied by storefronts) purchase price, IAP prices, or introduced any paid DLC. Recently when we compared the current size and value of BTD6 with other games, we concluded that we were underpriced.</li>\n<li>While we do not intend to add paid DLC or change IAP prices, we have decided to raise the purchase price by US$2 on mobile platforms and US$4 on desktop platforms. We feel this change is the best way to reflect the current value of the game while still respecting the past purchases of all existing owners of the game by not changing pricing for them.</li>\n<li>We plan to make these price changes on August 18th, two weeks following this update, so that any of your friends and family or wishlist holders still have time to get the game at the current price. As we understand the current state of inflation and that all households around the world are not equal, we will continue to run periodic sales to give everyone a chance to play Bloons TD 6.</li>\n<li>Creators</li>\n<li>We almost got Nexus.gg Creator code support in Update 32; we’re taking more time with it and will release it with a 32.x update - this will allow viewers to add codes to the game that will share part of any IAP revenue with their favorite Creator.</li>\n<li>The Nexus.gg folks have been amazing to work with and we truly hope this will allow a virtuous cycle between player, Creator, and game developer. Ninja Kiwi doesn’t think that paid sponsorships is good for the game-Creator-viewer/player ecosystem, but we think that Nexus.gg and Creator codes can be.</li>\n<li>Stay tuned to our socials for more information. The program will start with a selected group of Creators that we’re already working with for previews and feedback, but Nexus.gg will have a signup page for other Creators who are interested. More news soon!</li>\n<li>Update 33</li>\n<li>Ace Paragon: Rounding out the land, sea, and air equation, we’re eager to reveal what could be bigger than the BIG plane.</li>\n<li>New Boss - Dreadbloon: Inspired by the Monkey City boss and even more deadly in BTD6, with damage reduction, recurring shields, and rotating immunity to whole tower categories!</li>\n<li>2 new maps, pushing for one from the Reddit contest winners</li>\n<li>Quality of life, balance changes, bug fixes, and other improvements we can make</li>\n<li>Update 34</li>\n<li>Last update for the year!</li>\n<li>New Tower - Beast Handler: we’re not saying anything but the name for this one, and we look forward to all of the speculation</li>\n<li>2 more maps - we’re sensitive to community feedback about wanting more maps, so wanting to get another two in for end of year holidays</li>\n<li>More quality of life, balance changes, and improvements</li>\n<li>Further Out</li>\n<li>Console: We still have plans to release BTD6 on PlayStation and Xbox this year. Taking heaps of work to make it feel as native as possible but we really want to make 4 player couch co-op happen! Switch is not in production but we will consider after PlayStation and Xbox.</li>\n<li>Mods: Another huge amount of work to get this right, so we have to delay this until next year to get this right. The goal is to allow stat and visual changes to existing towers for even more fun and flexibility with visuals, memes, and Content Browser submissions</li>\n<li>Map Editor: Not sure if we can pull off both Mods and Map Editor in 2023 but we will go for it. In game tools to create and submit maps will be a huge avenue for community creativity that we want to open up!</li>\n<li>Bosses, Paragons, Towers, and Maps: Even with big features planned we will not forget about the core game and will continue to bring out fun and challenging new gameplay all year.</li>\n<li>Teams+: Contested Territories is just the beginning of what we can do together as Teams, so look for more ways to play with Friends, even as we continue to be dedicated to awesome single-player, offline gameplay as always</li>\n</ul></div>",
            "date_published": "2022-08-04T01:05:11+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "ujdelm",
            "url": "/r/btd6/comments/ujdelm/bloons_td_6_update_notes_version_312/",
            "external_url": "https://www.reddit.com/r/btd6/comments/ujdelm/bloons_td_6_update_notes_version_312/",
            "title": "Bloons TD 6 - Update Notes! Version 31.2",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/ujdelm/bloons_td_6_update_notes_version_312/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/ujdelm/bloons_td_6_update_notes_version_312/'>Apollo</a></caption> <div><p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/ulmmzmy4orx81.jpg?width=800&amp;format=pjpg&amp;auto=webp&amp;s=00dcca22b3c62fd3df0d580dde3f1c5dd876d0d1\">v31 is pretty cool ngl</a></p>\n<h1>Bloons TD 6 v31.2 - Fixes</h1>\n<h1>Bug Fixes</h1>\n<ul>\n<li>Resolved an issue with Extreme odyssey not counting down available placements correctly</li>\n<li>Resolved an issue with Cash Display rounding decimals up instead of down</li>\n<li>Resolved an issue with Fortified Bloons not leaking the correct number of lives</li>\n<li>Vortex deflection shield should now save in saves</li>\n<li>Resolved a crash in co-op with the host quickly starting a game after closing the last slot.</li>\n<li>Resolved a specific case of game softlock when updating to a new version between different platforms</li>\n<li>Resolved a crash that could occur with update prompts</li>\n<li>Resolved an issue with least tiers counter not saving correctly</li>\n<li>Geraldo’s base attack damage reduced from 2 -&gt; 1. We know this is a fundamental change soon after release but after review in live games and more time playing ourselves, we feel the start is too strong to remain as is relative to other heroes of similar cost. Fair warning you’ll see other Geraldo balance in update 32!</li>\n<li>Resolved an issue with Permafrost being applied to MOABs on 140 Snowstorm</li>\n</ul>\n<h1>Bloons TD 6 v31.1 - Fixes</h1>\n<h1>Bug Fixes</h1>\n<ul>\n<li>Resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n<li>Resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n<li>Resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n<li>Resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n<li>In case anyone was thinking about reporting it just one more time, resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n<li>Resolved a remote save conflict save crash issue that was affecting some players</li>\n<li>Resolved a crash for non logged-in players trying to view challenge stats</li>\n<li>Resolved a crash for non logged-in players starting a daily challenge</li>\n<li>Resolved a crash for non logged-in players attempting to view user profiles of others</li>\n<li>Resolved a crash with the Monkey Teams event affecting some players</li>\n<li>Resolved a issue with the Monkey Teams event rules on loading saves</li>\n<li>Resolved some significant inconsistency with certain buffs</li>\n<li>Resolved a crash occurring for some players on the Google Play Games button in the Achievements menu</li>\n<li>Resolved some background issue with viewing boss leaderboards when not every category has at least one recorded score yet</li>\n<li>Resolved an issue that could crash some players when unlocking a new map</li>\n<li>Resolved some lag that could occur on the maps page that was affecting a small number of users with too many friends</li>\n<li>Resolved an issue where input spam could trigger multiple rounds to be sent at once in singleplayer</li>\n<li>Resolved some incorrect text strings shown on the heroes menu for users under level 20</li>\n<li>Resolved an issue with chinook trying to move towers off of ice platforms. But really you should just never be trying this in the first place</li>\n<li>Resolved an inconsistency with the upgrade cost of Monkeyopolis</li>\n<li>Resolved a co-op lobby crash</li>\n<li>Resolved shader issue with Vortex on some Android devices</li>\n<li>Resolved Vortex info being cut off in some resolutions for non-English languages</li>\n<li>Resolved an issue where installing over an old version shows I've Played Before not your logged in username</li>\n<li>Resolved an issue with Strong not always prioritizing Fortified</li>\n<li>Resolved an issue with Lotus Flowers not applying a stun visual</li>\n<li>Resolved a crash on launch affecting some iOS players</li>\n<li>Resolved some Vortex Locs issues</li>\n<li>Resolved an issue with Legend of the Night not actually preventing life loss</li>\n<li>Resolved some inconsistencies with buffs applied to Geraldo’s placeable items</li>\n<li>Resolved some issues with buffs on dart monkeys carrying over to Geraldo’s converted Supers</li>\n<li>032 Engineer Cleansing Foam now works correctly on all MOAB Class targets - hope you enjoyed that temporary treat</li>\n<li>Resolved an issue with Geraldo’s Sharpening stone double dipping and increasing the max number of bounces of Bouncing Bullet sniper as well as the shrapnel pierce</li>\n<li>Resolved an issue with Geraldo’s Glue stacking with 003 MOAB Glue</li>\n<li>Resolved an issue where Geraldo’s Quincy Action Figure wouldn’t update it’s new sell value while the panel is open</li>\n<li>Resolved an issue where Geraldo’s Lv18 genie was not gaining it’s full damage buff on both projectiles</li>\n<li>Geraldo’s Lv11 and Lv16 Jar of Pickles now function as described</li>\n<li>Geraldo’s Genie can no longer be sold for a partial refund</li>\n<li>Resolved an issue with Geraldo’s Paragon Totems not being absorbed from the top of Navarch’s placeable platforms</li>\n<li>Resolved an issue with Geraldo’s Lv19 camo potion not granting bonus damage to camo</li>\n<li>Resolved an issue where Impoppable prices were not being applied to Geraldo’s shop</li>\n<li>Geraldo is now limited to one Lv20 restock per game - this is not a nerf, but to address an exploit that was counter to the design intent of only one restock</li>\n<li>Geraldo’s Lv20 paragon totem reworked to give 33% more paragon power but at an equally increased price</li>\n<li>Resolved an issue with many Geraldo items having a non-functional info button</li>\n<li>Some Geraldo Locs updates</li>\n<li>Resolved ‘Freeplay’ - seriously, we did ghost some rounds; no more mid 100s cruising anymore</li>\n<li>Resolved an issue with ALT+Tabbing out of the game causing hotkeys to stop working</li>\n</ul>\n<h1>Bloons TD 6 v31.0 - Update Notes!</h1>\n<p>Rolling out across iOS, Steam, Android. Please restart your storefront or be patient if it does not appear for you, these updates can take some time to be rolled out to every region due to how the storefronts are set up.</p>\n<h1>Key New Features</h1>\n<ul>\n<li><strong>New Hero, Geraldo the Mystic Shopkeeper!</strong></li>\n<li>A bold adventurer and seeker of fine things, Geraldo has explored the distant, mysterious reaches of the Monkey world to assemble his signature collection</li>\n<li>Geraldo is almost nothing without his shop, so select the “Shop” icon next to Geraldo’s portrait when he is selected; the shop will remember its open or closed state for easy access &amp; can be toggled open/closed for PC users with the Monkey Special hotkey (PageDown)</li>\n<li>Shop items have a variety of uses - some place on the map, some on the track, others target Monkeys or subtowers; they all must be pulled from the shop to the playfield</li>\n<li>Get ready for a wild ride, as Geraldo is intended to be a “build” hero, supporting a variety of strategies that are designed to scale; heaps of dev and balance time behind this one - we hope you enjoy the mysteries!</li>\n<li><strong>New Bloon Boss - Vortex, Deadly Master of Air!</strong></li>\n<li>Affectionately known as speedy boi, but it may be some time before you feel any affection for this incredibly tough boss</li>\n<li>Spawns with a temporary shield of wind that for a short time blows away all projectiles that are too slow to pass through it</li>\n<li>Natural Bloon spawns are buffed by Vortex’s slipstream, moving at incredible speeds until they catch up</li>\n<li>On Skulls Vortex stuns all nearby towers with a burst of lightning, activates its storm shield, and retreats a short distance</li>\n<li>Periodically triggers a storm wave that destroys all projectiles in a large radius</li>\n<li>Distributed placements and ranged attacks are key to victory - good luck!</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Beginner Map, Scrapyard!</li>\n<li>Old cars and other scrap go to die in places off the beaten track, but the Bloons have even found this remote location; defend the derelicts and don’t forget to play with the heavy machinery!</li>\n<li>Sorry to the players who submitted similar ideas during the competition, but we already had our own idea in the works for a while now</li>\n<li>New Trophy Store Items</li>\n<li>Bloons: Cat Ear Bloons, Disguise Glasses</li>\n<li>Co-op: Pat Flex emote, Mind Blown emote</li>\n<li>Game &amp; UI: Sunshine Serenade - Fiesta Mix music track, 2 New Avatars - Super Monkey &amp; Striker Jones</li>\n<li>Reddit Banner Competition winners<ul>\n<li>Banner winner (Arrival) - by betapotata</li>\n<li>Banner winner (Beneath the Waves) - by Cyliia</li>\n</ul>\n</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>New Special Conditions for Custom Challenge victory</li>\n<li>Least Cash has no limits on earning cash &amp; allows all forms of income generation, but rewards victory only if a player remains below a chosen cash spent threshold<a href=\"https://join.btd6.com/Challenge/ZMBUSEB\">We've created a challenge for you to try this new condition out</a></li>\n<li>Least Tiers limits victory to staying under a chosen value of tiers which increments for every tower/ upgrades/ hero/ level purchased</li>\n<li>We added these special conditions for victory as we thought they would be fun on their own, but we also have them in mind for the Contested Territory update coming later this year, as a variety of victory conditions will make the team dynamics needed to capture and hold a range of territory more interesting</li>\n<li>Updated Heroes Screen</li>\n<li>We’ve been wanting to update the Heroes screen for awhile, so with the addition of our 14th Hero, Geraldo, we made that happen</li>\n<li>Hopefully you will enjoy the full rework - making it easier to see all Heroes, allowing side by side comparisons of Heroes’ powers, and surfacing the visual changes that accompany various upgrades</li>\n<li>Structural and performance reworks to Bloons and the Bloon overlay system. All in the interest of tighter code and more flexibility for future updates.</li>\n<li>Added commas to Cash, Damage Numbers, &amp; Income for increased visibility and slightly delayed visits to your respective optometrists</li>\n<li>Large changes to backend co-op game communication between clients for increased stability</li>\n<li>Facebook friends’ scores has been replaced with LiNK Friends scores so that we have more reliable control of score sharing; please note your Facebook friends will not autopopulate into your LiNK Friends - you will have to reestablish any Friend connections manually</li>\n<li>Due to demand over the years, we have added a Logout option to our in game webview. Since we recommend players using another account for their modded games, it’s nice to support doing that a little better.</li>\n<li>To prevent event games running past the final cutoff on score submission time for ranked events, there will now be a short break in the final moments of competitive events in which the event is still active but no further games can be started. <em>\\</em>Note this will only be in place for ranked events, meaning that Boss events will allow you to create games still so long as you swap back to non-ranked mode*</li>\n<li><em>Example: there is a 24h event, with a 1hour cutoff (the cutoff can be set to any value, bosses will have a longer one but races wont need so much)</em></li>\n<li><em>When the event first starts it will display 23h remaining not 24</em></li>\n<li><em>After those 23 hours once the timer ends it begins a new timer with 1h remaining</em></li>\n<li><em>During this final hour you cannot start a new game or continue an existing game on ranked mode, but you can finish off one that is already started and open</em></li>\n<li><em>If you quit out of a run that has already started, that's it, you will not be able to enter the play menu to load that save again.</em></li>\n<li><em>In the case of bosses, you can swap back to non-ranked mode and create as many games as you want as normal during this final hour to finish off your milestones if you have not done them</em></li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved an issue with Custom Odyssey title/description being reset</li>\n<li>Changed how boss bloon status overlays are applied to look better</li>\n<li>Resolved an issue with Techbot ignoring hard limits on ability use in custom challenges in regards to overlap, causing laggy animation loops</li>\n<li>Resolved players getting booted out of co-op sessions on some low end devices due to being timed out from a long desync</li>\n<li>Optimizations made to freeplay roundsets</li>\n<li>Resolved some low quality animation issues</li>\n<li>Using Thrive right before defeat, and restarting should no longer break the animation</li>\n<li>Fixed some incorrect medal displays on leaderboards</li>\n<li>Resolved some specific cases causing the pause penalty on races to carry over onto the next attempt</li>\n<li>Join Match button in play social now checks if you have internet again on press to prevent some edge case creation of broken lobbies requiring a game restart</li>\n<li>Map Area data converted to a new System which should improve performance &amp; allow for more complex shapes</li>\n<li>Rocket Storm ability is now grayed out between rounds</li>\n<li>Add new localization for all hero skins to remove ‘skin’ from their names on player profiles.</li>\n<li>Resolved some issues with retry last round in challenge editor</li>\n<li>Resolved some issues with hero skins changing when changing owner in co-op</li>\n<li>Resolved a number of rare crashes</li>\n<li>Added a new icon for the ‘Create Challenge’ button</li>\n<li>Fixed Water Textures on Cargo map</li>\n<li>A number of minor UI fixes</li>\n<li>Resolved some issues with UI animation speed</li>\n<li>Resolved a number of map specific height and placement issues</li>\n<li>Added in fixes in a number of places to prevent the game from crashing due to certain server issues or loading broken challenges</li>\n<li>Resolved an edge case crash on the data conflict screen</li>\n<li>Resolved a crash with Lych Soul being saved on multi-path maps</li>\n<li>Investigation success</li>\n</ul>\n<p>Boomerang Monkey</p>\n<ul>\n<li>5xx Boomerang glaives again crosspath correctly with xx2</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<ul>\n<li>Resolved Buccaneer showing wrong upgrade text after upgrading a ninja</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>104 Heli's Mini Comanche now correctly fire 5 darts at a time</li>\n<li>xx5 Comanche Commander's damage has been corrected with crosspaths</li>\n</ul>\n<p>Mortar Monkey</p>\n<ul>\n<li>502 Mortar now applies burn to DDTs without MIB so long as they circumvent the camo</li>\n</ul>\n<p>Dartling Gunner</p>\n<ul>\n<li>x5x MAD height inconsistencies compare to x4x Rocket Storm have been resolved</li>\n</ul>\n<p>Wizard Monkey</p>\n<ul>\n<li>042 Summon Phoenix should now correctly interact with camo prio</li>\n</ul>\n<p>Ninja Monkey</p>\n<ul>\n<li>Resolved an issue with Master Bomber Stickies sometimes hitting regular Bloons instead of MOABs</li>\n</ul>\n<p>Druid</p>\n<ul>\n<li>5xx Superstorm now benefits from Ball Lightning 25% freeze chance regardless of crosspath</li>\n<li>Resolved an issue with the Cold Front MK not always showing ice overlays on Bloons</li>\n</ul>\n<p>Monkey Village</p>\n<ul>\n<li>Resolved some inconsistencies with top path farm buff icons</li>\n</ul>\n<p>Engineer</p>\n<ul>\n<li>xx4 Bloon Trap issue resolved on Sunken Columns with Bloontraps falling under the map in certain locations</li>\n<li>014 Bloon Trap issue resolved with certain conditions causing Bloontraps to repeatedly auto-collect even while empty</li>\n</ul>\n<p>Adora</p>\n<ul>\n<li>Adora sacrifice buff should now apply to Mini Sun Avatars from Temples</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>Resolved an issue with Admiral Brickell's Mega Mine sometimes not showing stun effects</li>\n</ul>\n<h1>Desktop Version</h1>\n<ul>\n<li>If you have already placed your hero, your ‘Hero hotkey’ (U by default) will now swap to instead ‘select your hero’ wherever it is. If you have more than one hero this will cycle through them</li>\n<li>Resolved an issue with using hotkeys during loading screens causing some tower portraits to become faded out</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>To add a little more synergetic crosspath use for the Juggernaut 402 crosspath, xx2 will now also grant bonus projectile lifespan, this applies to any use of that crosspath though we feel it will in particular pair nicely with the ricocheting projectiles. Juggernaut in general is also seeing a small utility knockback buff to help it carry on a little longer into the game.</p>\n<ul>\n<li>xx1 Long Range Darts also increases projectile lifespan +15%</li>\n<li>xx2 Enhanced Eyesight also increases projectile lifespan +20%</li>\n<li>4xx Juggernaut gains a slight Bloon knockback (Same as xx3 dartling, but half duration)</li>\n</ul>\n<p>Bomb Shooter</p>\n<p>The Frags crosspath for top path Bomb Shooter has always been quite a poor choice, trying to compete with attack speed as a benefit for stun utility isn’t going to ever work out so we have instead gone the route of turning the frags crosspath into a DPS/Stun hybrid with a lot of small buffs to frag power.</p>\n<ul>\n<li>302 Really Big Bombs frag damage increased 1 -&gt; 3</li>\n<li>302 Really Big Bombs gains more frags 8 -&gt; 12</li>\n<li>402 Bloon Impact frag pierce increased +1</li>\n<li>402 Bloon Impact frag damage increased 2 -&gt; 3</li>\n<li>402 Bloon Impact gains even more frags 8 -&gt; 16</li>\n<li>502 Bloon Crush remains at frag damage 12</li>\n<li>502 Bloon Crush frags gain bonus to ceramic +12</li>\n<li>502 Bloon Crush gains frag pierce 3 -&gt; 20</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>2xx Corrosive Glue DoT rate increased 2.3s -&gt; 2</li>\n<li>3xx Bloon Dissolver DoT ceramic bonus increased 0 -&gt; 1</li>\n<li>4xx Bloon Liquifier DoT ceramic bonus unchanged</li>\n<li>5xx The Bloon Solver bonus moab damage increased 3 -&gt; 5</li>\n</ul>\n<p>Monkey Sub</p>\n<p>Energizer upgrade offers nothing extra to the reactor sub aside from niche utility buffs, so we have increased the lategame cleanup potential by a large amount to help deal with Super Ceramics.</p>\n<ul>\n<li>5xx Energizer damage increased 3 -&gt; 5</li>\n<li>5xx Energizer now adds bonus damage to ceramics +5</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>The base Grape attack of T4 MOAB Takedown has had a ceramic bonus added to lead up to the T5 a little better.</p>\n<ul>\n<li>x4x MOAB Takedown grapeshot ceramic bonus added +1</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Spy Plane is always a lesser crosspath aside from specific challenges that call for camo detection. It has a similar vibe to Night Vision sniper so we have given it a similar buff.</p>\n<ul>\n<li>x2x Spy Plane grants attacks bonus damage to camos +1</li>\n</ul>\n<p>Heli Pilot</p>\n<p>Previously Razor Rotor’s used to make the heli pursue for a further distance &amp; this caused it to often fail to reach Lead Bloons with the rotor attack that could pop them. This overall seemed like a design flaw so that back-off distance has been moved up to the T4 instead. Apache Dartship has also fallen off over time as a viable saveup for prime, though it is meant to be reasonably difficult some changes have made this a little more difficult than it probably should be so we have increased the pierce of the machinegun attack.</p>\n<ul>\n<li>3xx Razor Rotor’s pursuit no longer backs so far away from Leads that it can’t hit them</li>\n<li>4xx Apache Dartship pursuit distance increase now occurs here</li>\n<li>4xx Apache Dartship Machinegun pierce increased 5 -&gt; 7</li>\n<li>5xx Apache Prime Machinegun pierce unchanged</li>\n</ul>\n<p>Dartling Gunner</p>\n<p>Ray of Doom suffers from the downsides of being designed as a high piercing tower, for the price this makes it feel far too weak against the round 100 BAD if you invest in it too early without some other forms of single target, to bring back a little of the interesting sort of targeting that the T4 has and help with this single target problem it will now deal a massive damage bonus to the first target hit along the beam’s path.</p>\n<ul>\n<li>5xx Ray of Doom now deals bonus damage to the first target hit +55</li>\n<li>3xx Laser Cannon pierce increased from 4 -&gt; 6</li>\n<li>302 Laser Cannon pierce increased from 6 -&gt; 9</li>\n<li>xx2 Powerful Darts now also gives 'larger projectiles' as a crosspath</li>\n<li>002 Powerful Darts normal projectile size increased from 2 -&gt; 3</li>\n<li>032 Hydra Rocket Pods explosion size increased from 8 -&gt; 12</li>\n<li>402 Plasma Accelerator focal point size increased from 4 -&gt; 6</li>\n<li>402 Plasma Accelerator beam width increased from 2 -&gt; 3</li>\n<li>502 Ray of Doom beam width increased from 6 -&gt; 9</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Arcane Blast's benefit to the base tower is quite small for the price and also doesn't carry on well as a crosspath to the other T3s since they add new attacks instead of buffing the base attack, the price has been reduced to add a little more value here along with more MOAB damage at the T5 to give it a little more value over Arcane Spikes. As we somewhat expected the last Prince of Darkness rework didn’t end up really nerfing it so much, so we are now following up with a small price nerf.</p>\n<ul>\n<li>2xx Arcane Blast price reduced $600 -&gt; $450</li>\n<li>5xx Archmage bonus damage to MOABs 17 -&gt; 19</li>\n<li>xx5 Prince of Darkness price increased from $24,000 -&gt; 26,500</li>\n</ul>\n<p>Super Monkey</p>\n<p>Robo didn't need to lose pierce in the last Super Monkey T2 rework, and Dark Knight feels like it has too much pierce without ever considering the pierce crosspath. So to balance these together we’ve taken out pierce from Dark Knight and added it back into x2x carrying up into Robo Monkey. Dark Champion pierce is increased rather than decreased to push it further ahead of Dark Knight.</p>\n<ul>\n<li>x2x Epic Range increases pierce further 3 -&gt; 4</li>\n<li>xx3 Dark Knight pierce decreased 5 -&gt; 4</li>\n<li>xx4 Dark Champion pierce increased 7 -&gt; 8</li>\n</ul>\n<p>Ninja Monkey</p>\n<p>Grand Sabotage is extremely powerful in freeplay, but really boring outside of that one scaling mechanic. For a little more flavour with the shinobi mechanic, the T5 will now boost the potential of your shinobi army.</p>\n<ul>\n<li>x5x Grand Sabotage ability grants all your Shinobi on screen +5 range</li>\n<li>x5x Grand Sabotage ability grants all Shinobi +1 damage to MOABs</li>\n</ul>\n<p>Banana Farm</p>\n<p>Partially to help a little with tedious endgame farm collection in ranked boss events, or any other use you may desire for it, we have added a non-power form of easy banana collection. However we do not want to trivialize the intended downside of opting for a more micro intensive farm path too much, so this is still restricted behind a low-range tier 5 upgrade.</p>\n<ul>\n<li>xx5 Monkey Wall Street now collects nearby bananas/crates as a Monkey Farmer would</li>\n</ul>\n<p>Spike Factory</p>\n<p>To help make the tradeoff of building one T5 over multiple T4 not be as hard a choice, the basic attack on Carpet of Spikes has had power increased significantly over rate, range &amp; damage.</p>\n<ul>\n<li>x5x Carpet of Spikes range increased from 34 -&gt; 50</li>\n<li>x5x Carpet of Spikes main damage increased from 3 -&gt; 4</li>\n<li>x5x Carpet of Spikes main attack delay reduced 0.98s -&gt; 0.33</li>\n</ul>\n<p>Monkey Village</p>\n<p>Call to Arms ability suffers from uptime, for such an expensive upgrade which is such low range and purely support this makes it hard to use, so duration has now been increased to push it up to a 1/3rd uptime threshold</p>\n<ul>\n<li>x4x Call To Arms ability duration increased 12 -&gt; 15</li>\n<li>x5x Homeland duration remains unchanged</li>\n</ul>\n<p>Engineer</p>\n<p>Sentry Expert really needed some logic fixes to get more of the actual correct sentries placed at the right times, it has also received a number of power buffs across the board to the special sentries at T4 complimenting the new logic reworking. Cleansing Foam has had some extra crosspath utility added at the cost of a small price increase and a large decrease to Ultraboost price.</p>\n<ul>\n<li>4xx Sentry Expert logic has been reworked to evaluate threat levels based on Bloon types that it can counter, Bloon types that counter the sentries that it wants to spawn, and which of the current threats on screen is the greatest. Distribution of sentry types should scale based on how much one Bloon threat is more of a threat than another.</li>\n<li>4xx Sentry Expert Crush Sentry ceramic damage bonus increased from 1 -&gt; 4</li>\n<li>4xx Sentry Expert Crush Sentry damage type changed from Sharp -&gt; Shatter</li>\n<li>4xx Sentry Expert Bomb Sentry damage increased 2 -&gt; 4</li>\n<li>4xx Sentry Expert Cold Sentry pierce increased from 15 -&gt; 25</li>\n<li>4xx Sentry Expert Cold Sentry radius increased from 12 -&gt; 18</li>\n<li>4xx Sentry Expert Energy Sentry gain moab damage bonus of +2</li>\n<li>x3x Cleansing Foam price increased from 800 -&gt; 850</li>\n<li>032 Pin allows Cleansing Foam to slow Bloons 50% briefly</li>\n<li>130 Foam makes Sentries shoot Foamy nails that strip properties</li>\n<li>x5x Ultraboost price decreased from $120,000 -&gt; 105,000</li>\n</ul>\n<p>Gwendolin</p>\n<p>Gwendolin’s Firestorm damage doesn’t carry well into the endgame so has been buffed at a later level.</p>\n<ul>\n<li>Lv16 Firestorm base damage tic increases from 1 &gt; 5</li>\n<li>Lv16 Firestorm MOAB damage tic increases from 10 &gt; 15</li>\n</ul>\n<p>Pat Fusty</p>\n<p>Pat Fusty was initially given a smaller footprint than it felt he should have due to concerns about balance with his small radius, but actually has been extremely powerful for a long time despite these radius issues. We feel like now giving him back the footprint size that he always should have had similar to Churchill will add a reasonable lategame downside to consider without harming his early use so badly.</p>\n<ul>\n<li>Pat Fusty footprint increased from 7 -&gt; 8</li>\n</ul>\n<p>Admiral Brickell</p>\n<p>The Sea Mines delay that was added back in 29 has done well for reducing some of Brickells weaknesses, but as we expected somewhat does add in new weaknesses to rush rounds of Bloons that can now sneak past before all of her mines have been able to acquire a target. To help lessen this new issue she has gained a brand new ability that will allow more Sea Mines to rapidly deploy and find a target over a short duration.</p>\n<ul>\n<li>Lv7 Blast Chain utility ability added for Admiral Brickell. For 10 seconds all sea mines have their delay halved (the new one added in 29), &amp; their projectile speed doubled</li>\n</ul>\n<p>Psi</p>\n<p>We felt that Psi’s early game too easily carried into some extremely powerful endgame setups. These setups were overperforming due to certain cooldown interactions with stalling out cooldown, however in an effort to try to avoid nerfing the cooldown for the average player we decided to make that stalling synergy harder to pull off instead.</p>\n<ul>\n<li>Psi base price increased $800 -&gt; 1000</li>\n<li>Lv10 Psionic Scream ability 'speed of blow back' increased from bloon speed 300% -&gt; 600%</li>\n</ul>\n<p>Glue Rat</p>\n<p>Glue Rat pet has been overperforming in all game modes for a while now without any apparent weakness or strategic downsides.</p>\n<ul>\n<li>Base movement speed ramping level endures persistently</li>\n<li>Max level goggle tightness loosened from Max -&gt; Sam</li>\n</ul></div>",
            "date_published": "2022-05-06T02:29:24+00:00",
            "authors": [
                {
                    "name": "rohan_spibo",
                    "url": "https://www.reddit.com/user/rohan_spibo"
                }
            ]
        },
        {
            "id": "u2ehaq",
            "url": "/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/",
            "external_url": "https://www.reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/",
            "title": "Bloons TD 6 - Update Notes! Version 31.0",
            "content_html": "<caption>Open in: <a href='https://reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/'>Reddit</a> | <a href='apollo://reddit.com/r/btd6/comments/u2ehaq/bloons_td_6_update_notes_version_310/'>Apollo</a></caption> <div><p>https://preview.redd.it/vksm1nfb67t81.png?width=800&amp;format=png&amp;auto=webp&amp;s=97f44e4e548dfa5beb46dfc510ef0e964616d140</p>\n<h1>Bloons TD 6 v31.0 - Update Notes!</h1>\n<p>Rolling out across iOS, Steam, (Android still a few hours away). Please restart your storefront or be patient if it does not appear for you, these updates can take some time to be rolled out to every region due to how the storefronts are set up.</p>\n<h1>Key New Features</h1>\n<ul>\n<li><strong>New Hero, Geraldo the Mystic Shopkeeper!</strong></li>\n<li>A bold adventurer and seeker of fine things, Geraldo has explored the distant, mysterious reaches of the Monkey world to assemble his signature collection</li>\n<li>Geraldo is almost nothing without his shop, so select the “Shop” icon next to Geraldo’s portrait when he is selected; the shop will remember its open or closed state for easy access &amp; can be toggled open/closed for PC users with the Monkey Special hotkey (PageDown)</li>\n<li>Shop items have a variety of uses - some place on the map, some on the track, others target Monkeys or subtowers; they all must be pulled from the shop to the playfield</li>\n<li>Get ready for a wild ride, as Geraldo is intended to be a “build” hero, supporting a variety of strategies that are designed to scale; heaps of dev and balance time behind this one - we hope you enjoy the mysteries!</li>\n<li><strong>New Bloon Boss - Vortex, Deadly Master of Air!</strong></li>\n<li>Affectionately known as speedy boi, but it may be some time before you feel any affection for this incredibly tough boss</li>\n<li>Spawns with a temporary shield of wind that for a short time blows away all projectiles that are too slow to pass through it</li>\n<li>Natural Bloon spawns are buffed by Vortex’s slipstream, moving at incredible speeds until they catch up</li>\n<li>On Skulls Vortex stuns all nearby towers with a burst of lightning, activates its storm shield, and retreats a short distance</li>\n<li>Periodically triggers a storm wave that destroys all projectiles in a large radius</li>\n<li>Distributed placements and ranged attacks are key to victory - good luck!</li>\n</ul>\n<h1>New Awesome</h1>\n<ul>\n<li>New Beginner Map, Scrapyard!</li>\n<li>Old cars and other scrap go to die in places off the beaten track, but the Bloons have even found this remote location; defend the derelicts and don’t forget to play with the heavy machinery!</li>\n<li>Sorry to the players who submitted similar ideas during the competition, but we already had our own idea in the works for a while now</li>\n<li>New Trophy Store Items</li>\n<li>Bloons: Cat Ear Bloons, Disguise Glasses</li>\n<li>Co-op: Pat Flex emote,  Mind Blown emote</li>\n<li>Game &amp; UI: Sunshine Serenade - Fiesta Mix music track, 2 New Avatars - Super Monkey &amp; Striker Jones</li>\n<li>Reddit Banner Competition winners<ul>\n<li>Banner winner (Arrival) - by betapotata</li>\n<li>Banner winner (Beneath the Waves) - by Cyliia </li>\n</ul>\n</li>\n</ul>\n<h1>Big Changes / Additions</h1>\n<ul>\n<li>New Special Conditions for Custom Challenge victory</li>\n<li>Least Cash has no limits on earning cash &amp; allows all forms of income generation, but rewards victory only if a player remains below a chosen cash spent threshold</li>\n<li>Least Tiers limits victory to staying under a chosen value of tiers which increments for every tower/ upgrades/ hero/ level purchased</li>\n<li>We added these special conditions for victory as we thought they would be fun on their own, but we also have them in mind for the Contested Territory update coming later this year, as a variety of victory conditions will make the team dynamics needed to capture and hold a range of territory more interesting</li>\n<li>Updated Heroes Screen</li>\n<li>We’ve been wanting to update the Heroes screen for awhile, so with the addition of our 14th Hero, Geraldo, we made that happen</li>\n<li>Hopefully you will enjoy the full rework - making it easier to see all Heroes, allowing side by side comparisons of Heroes’ powers, and surfacing the visual changes that accompany various upgrades</li>\n<li>Structural and performance reworks to Bloons and the Bloon overlay system. All in the interest of tighter code and more flexibility for future updates.</li>\n<li>Added commas to Cash, Damage Numbers, &amp; Income for increased visibility and slightly delayed visits to your respective optometrists</li>\n<li>Large changes to backend co-op game communication between clients for increased stability</li>\n<li>Facebook friends’ scores has been replaced with LiNK Friends scores so that we have more reliable control of score sharing; please note your Facebook friends will not autopopulate into your LiNK Friends - you will have to reestablish any Friend connections manually</li>\n<li>Due to demand over the years, we have added a Logout option to our in game webview. Since we recommend players using another account for their modded games, it’s nice to support doing that a little better.</li>\n<li>To prevent event games running past the final cutoff on score submission time for ranked events, there will now be a short break in the final moments of competitive events in which the event is still active but no further games can be started. <em>*Note this will only be in place for ranked events, meaning that Boss events will allow you to create games still so long as you swap back to non-ranked mode</em></li>\n<li><em>Example: there is a 24h event, with a 1hour cutoff (the cutoff can be set to any value, bosses will have a longer one but races wont need so much)</em></li>\n<li><em>When the event first starts it will display 23h remaining not 24</em></li>\n<li><em>After those 23 hours once the timer ends it begins a new timer with 1h remaining</em></li>\n<li><em>During this final hour you cannot start a new game or continue an existing game on ranked mode, but you can finish off one that is already started and open</em></li>\n<li><em>If you quit out of a run that has already started, that's it, you will not be able to enter the play menu to load that save again.</em></li>\n<li><em>In the case of bosses, you can swap back to non-ranked mode and create as many games as you want as normal during this final hour to finish off your milestones if you have not done them</em></li>\n</ul>\n<h1>Bug Fixes &amp; General Changes</h1>\n<ul>\n<li>Resolved an issue with Custom Odyssey title/description being reset</li>\n<li>Changed how boss bloon status overlays are applied to look better</li>\n<li>Resolved an issue with Techbot ignoring hard limits on ability use in custom challenges in regards to overlap, causing laggy animation loops</li>\n<li>Resolved players getting booted out of co-op sessions on some low end devices due to being timed out from a long desync</li>\n<li>Optimizations made to freeplay roundsets</li>\n<li>Resolved some low quality animation issues</li>\n<li>Using Thrive right before defeat, and restarting should no longer break the animation</li>\n<li>Fixed some incorrect medal displays on leaderboards</li>\n<li>Resolved some specific cases causing the pause penalty on races to carry over onto the next attempt</li>\n<li>Join Match button in play social now checks if you have internet again on press to prevent some edge case creation of broken lobbies requiring a game restart</li>\n<li>Map Area data converted to a new System which should improve performance &amp; allow for more complex shapes</li>\n<li>Rocket Storm ability is now grayed out between rounds</li>\n<li>Add new localization for all hero skins to remove ‘skin’ from their names on player profiles.</li>\n<li>Resolved some issues with retry last round in challenge editor</li>\n<li>Resolved some issues with hero skins changing when changing owner in co-op</li>\n<li>Resolved a number of rare crashes</li>\n<li>Added a new icon for the ‘Create Challenge’ button</li>\n<li>Fixed Water Textures on Cargo map</li>\n<li>A number of minor UI fixes</li>\n<li>Resolved some issues with UI animation speed</li>\n<li>Resolved a number of map specific height and placement issues</li>\n<li>Added in fixes in a number of places to prevent the game from crashing due to certain server issues or loading broken challenges</li>\n<li>Resolved an edge case crash on the data conflict screen</li>\n<li>Resolved a crash with Lych Soul being saved on multi-path maps</li>\n<li>Investigation success</li>\n</ul>\n<p>Boomerang Monkey</p>\n<ul>\n<li>5xx Boomerang glaives again crosspath correctly with xx2</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<ul>\n<li>Resolved Buccaneer showing wrong upgrade text after upgrading a ninja</li>\n</ul>\n<p>Heli Pilot</p>\n<ul>\n<li>104 Heli's Mini Comanche now correctly fire 5 darts at a time </li>\n<li>xx5 Comanche Commander's damage has been corrected with crosspaths</li>\n</ul>\n<p>Mortar Monkey</p>\n<ul>\n<li>502 Mortar now applies burn to DDTs without MIB so long as they circumvent the camo</li>\n</ul>\n<p>Dartling Gunner</p>\n<ul>\n<li>x5x MAD height inconsistencies compare to x4x Rocket Storm have been resolved</li>\n</ul>\n<p>Wizard Monkey</p>\n<ul>\n<li>042 Summon Phoenix should now correctly interact with camo prio</li>\n</ul>\n<p>Ninja Monkey</p>\n<ul>\n<li>Resolved an issue with Master Bomber Stickies sometimes hitting regular Bloons instead of MOABs</li>\n</ul>\n<p>Druid</p>\n<ul>\n<li>5xx Superstorm now benefits from Ball Lightning 25% freeze chance regardless of crosspath</li>\n<li>Resolved an issue with the Cold Front MK not always showing ice overlays on Bloons</li>\n</ul>\n<p>Monkey Village</p>\n<ul>\n<li>Resolved some inconsistencies with top path farm buff icons</li>\n</ul>\n<p>Engineer</p>\n<ul>\n<li>xx4 Bloon Trap issue resolved on Sunken Columns with Bloontraps falling under the map in certain locations</li>\n<li>014 Bloon Trap issue resolved with certain conditions causing Bloontraps to repeatedly auto-collect even while empty</li>\n</ul>\n<p>Adora</p>\n<ul>\n<li>Adora sacrifice buff should now apply to Mini Sun Avatars from Temples</li>\n</ul>\n<p>Admiral Brickell</p>\n<ul>\n<li>Resolved an issue with Admiral Brickell's Mega Mine sometimes not showing stun effects</li>\n</ul>\n<h1>Desktop Version</h1>\n<ul>\n<li>If you have already placed your hero, your ‘Hero hotkey’ (U by default) will now swap to instead ‘select your hero’ wherever it is. If you have more than one hero this will cycle through them</li>\n<li>Resolved an issue with using hotkeys during loading screens causing some tower portraits to become faded out</li>\n</ul>\n<h1>Balance Changes</h1>\n<p>Dart Monkey</p>\n<p>To add a little more synergetic crosspath use for the Juggernaut 402 crosspath, xx2 will now also grant bonus projectile lifespan, this applies to any use of that crosspath though we feel it will in particular pair nicely with the ricocheting projectiles. Juggernaut in general is also seeing a small utility knockback buff to help it carry on a little longer into the game.</p>\n<ul>\n<li>xx1 Long Range Darts also increases projectile lifespan +15%</li>\n<li>xx2 Enhanced Eyesight also increases projectile lifespan +20%</li>\n<li>4xx Juggernaut gains a slight Bloon knockback (Same as xx3 dartling, but half duration)</li>\n</ul>\n<p>Bomb Shooter</p>\n<p>The Frags crosspath for top path Bomb Shooter has always been quite a poor choice, trying to compete with attack speed as a benefit for stun utility isn’t going to ever work out so we have instead gone the route of turning the frags crosspath into a DPS/Stun hybrid with a lot of small buffs to frag power.</p>\n<ul>\n<li>302 Really Big Bombs frag damage increased 1 -&gt; 3</li>\n<li>302 Really Big Bombs gains more frags 8 -&gt; 12</li>\n<li>402 Bloon Impact frag pierce increased +1</li>\n<li>402 Bloon Impact frag damage increased 2 -&gt; 3</li>\n<li>402 Bloon Impact gains even more frags 8 -&gt; 16</li>\n<li>502 Bloon Crush remains at frag damage 12</li>\n<li>502 Bloon Crush frags gain bonus to ceramic +12</li>\n<li>502 Bloon Crush gains frag pierce 3 -&gt; 20</li>\n</ul>\n<p>Glue Gunner</p>\n<ul>\n<li>2xx Corrosive Glue DoT rate increased 2.3s -&gt; 2</li>\n<li>3xx Bloon Dissolver DoT ceramic bonus increased 0 -&gt; 1</li>\n<li>4xx Bloon Liquifier DoT ceramic bonus unchanged</li>\n<li>5xx The Bloon Solver bonus moab damage increased 3 -&gt; 5</li>\n</ul>\n<p>Monkey Sub</p>\n<p>Energizer upgrade offers nothing extra to the reactor sub aside from niche utility buffs, so we have increased the lategame cleanup potential by a large amount to help deal with Super Ceramics.</p>\n<ul>\n<li>5xx Energizer damage increased 3 -&gt; 5</li>\n<li>5xx Energizer now adds bonus damage to ceramics +5</li>\n</ul>\n<p>Monkey Buccaneer</p>\n<p>The base Grape attack of T4 MOAB Takedown has had a ceramic bonus added to lead up to the T5 a little better.</p>\n<ul>\n<li>x4x MOAB Takedown grapeshot ceramic bonus added +1</li>\n</ul>\n<p>Monkey Ace</p>\n<p>Spy Plane is always a lesser crosspath aside from specific challenges that call for camo detection. It has a similar vibe to Night Vision sniper so we have given it a similar buff.</p>\n<ul>\n<li>x2x Spy Plane grants attacks bonus damage to camos +1</li>\n</ul>\n<p>Heli Pilot</p>\n<p>Previously Razor Rotor’s used to make the heli pursue for a further distance &amp; this caused it to often fail to reach Lead Bloons with the rotor attack that could pop them. This overall seemed like a design flaw so that back-off distance has been moved up to the T4 instead. Apache Dartship has also fallen off over time as a viable saveup for prime, though it is meant to be reasonably difficult some changes have made this a little more difficult than it probably should be so we have increased the pierce of the machinegun attack.</p>\n<ul>\n<li>3xx Razor Rotor’s pursuit no longer backs so far away from Leads that it can’t hit them</li>\n<li>4xx Apache Dartship pursuit distance increase now occurs here</li>\n<li>4xx Apache Dartship Machinegun pierce increased 5 -&gt; 7</li>\n<li>5xx Apache Prime Machinegun pierce unchanged</li>\n</ul>\n<p>Dartling Gunner</p>\n<p>Ray of Doom suffers from the downsides of being designed as a high piercing tower, for the price this makes it feel far too weak against the round 100 BAD if you invest in it too early without some other forms of single target, to bring back a little of the interesting sort of targeting that the T4 has and help with this single target problem it will now deal a massive damage bonus to the first target hit along the beam’s path.</p>\n<ul>\n<li>5xx Ray of Doom now deals bonus damage to the first target hit +55</li>\n<li>3xx Laser Cannon pierce increased from 4 -&gt; 6</li>\n<li>302 Laser Cannon pierce increased from 6 -&gt; 9</li>\n<li>xx2 Powerful Darts now also gives 'larger projectiles' as a crosspath</li>\n<li>002 Powerful Darts normal projectile size increased from 2 -&gt; 3</li>\n<li>032 Hydra Rocket Pods explosion size increased from 8 -&gt; 12</li>\n<li>402 Plasma Accelerator focal point size increased from 4 -&gt; 6</li>\n<li>402 Plasma Accelerator beam width increased from 2 -&gt; 3</li>\n<li>502 Ray of Doom beam width increased from 6 -&gt; 9</li>\n</ul>\n<p>Wizard Monkey</p>\n<p>Arcane Blast's benefit to the base tower is quite small for the price and also doesn't carry on well as a crosspath to the other T3s since they add new attacks instead of buffing the base attack, the price has been reduced to add a little more value here along with more MOAB damage at the T5 to give it a little more value over Arcane Spikes. As we somewhat expected the last Prince of Darkness rework didn’t end up really nerfing it so much, so we are now following up with a small price nerf.</p>\n<ul>\n<li>2xx Arcane Blast price reduced $600 -&gt; $450</li>\n<li>5xx Archmage bonus damage to MOABs 17 -&gt; 19</li>\n<li>xx5 Prince of Darkness price increased from $24,000 -&gt; 26,500</li>\n</ul>\n<p>Super Monkey</p>\n<p>Robo didn't need to lose pierce in the last Super Monkey T2 rework, and Dark Knight feels like it has too much pierce without ever considering the pierce crosspath. So to balance these together we’ve taken out pierce from Dark Knight and added it back into x2x carrying up into Robo Monkey. Dark Champion pierce is increased rather than decreased to push it further ahead of Dark Knight.</p>\n<ul>\n<li>x2x Epic Range increases pierce further 3 -&gt; 4</li>\n<li>xx3 Dark Knight pierce decreased 5 -&gt; 4</li>\n<li>xx4 Dark Champion pierce increased 7 -&gt; 8</li>\n</ul>\n<p>Ninja Monkey</p>\n<p>Grand Sabotage is extremely powerful in freeplay, but really boring outside of that one scaling mechanic. For a little more flavour with the shinobi mechanic, the T5 will now boost the potential of your shinobi army.</p>\n<ul>\n<li>x5x Grand Sabotage ability grants all your Shinobi on screen +5 range</li>\n<li>x5x Grand Sabotage ability grants all Shinobi +1 damage to MOABs</li>\n</ul>\n<p>Banana Farm</p>\n<p>Partially to help a little with tedious endgame farm collection in ranked boss events, or any other use you may desire for it, we have added a non-power form of easy banana collection. However  we do not want to trivialize the intended downside of opting for a more micro intensive farm path too much, so this is still restricted behind a low-range tier 5 upgrade.</p>\n<ul>\n<li>xx5 Monkey Wall Street now collects nearby bananas/crates as a Monkey Farmer would</li>\n</ul>\n<p>Spike Factory</p>\n<p>To help make the tradeoff of building one T5 over multiple T4 not be as hard a choice, the basic attack on Carpet of Spikes has had power increased significantly over rate, range &amp; damage.</p>\n<ul>\n<li>x5x Carpet of Spikes range increased from 34 -&gt; 50</li>\n<li>x5x Carpet of Spikes main damage increased from 3 -&gt; 4</li>\n<li>x5x Carpet of Spikes main attack delay reduced 0.98s -&gt; 0.33</li>\n</ul>\n<p>Monkey Village</p>\n<p>Call to Arms ability suffers from uptime, for such an expensive upgrade which is such low range and purely support this makes it hard to use, so duration has now been increased to push it up to a 1/3rd uptime threshold</p>\n<ul>\n<li>x4x Call To Arms ability duration increased 12 -&gt; 15</li>\n<li>x5x Homeland duration remains unchanged</li>\n</ul>\n<p>Engineer</p>\n<p>Sentry Expert really needed some logic fixes to get more of the actual correct sentries placed at the right times, it has also received a number of power buffs across the board to the special sentries at T4 complimenting the new logic reworking. Cleansing Foam has had some extra crosspath utility added at the cost of a small price increase and a large decrease to Ultraboost price.</p>\n<ul>\n<li>4xx Sentry Expert logic has been reworked to evaluate threat levels based on Bloon types that it can counter, Bloon types that counter the sentries that it wants to spawn, and which of the current threats on screen is the greatest. Distribution of sentry types should scale based on how much one Bloon threat is more of a threat than another.</li>\n<li>4xx Sentry Expert Crush Sentry ceramic damage bonus increased from 1 -&gt; 4</li>\n<li>4xx Sentry Expert Crush Sentry damage type changed from Sharp -&gt; Shatter</li>\n<li>4xx Sentry Expert Bomb Sentry damage increased 2 -&gt; 4</li>\n<li>4xx Sentry Expert Cold Sentry pierce increased from 15 -&gt; 25</li>\n<li>4xx Sentry Expert Cold Sentry radius increased from 12 -&gt; 18</li>\n<li>4xx Sentry Expert Energy Sentry gain moab damage bonus of +2</li>\n<li>x3x Cleansing Foam price increased from 800 -&gt; 850</li>\n<li>032 Pin allows Cleansing Foam to slow Bloons 50% briefly</li>\n<li>130 Foam makes Sentries shoot Foamy nails that strip properties</li>\n<li>x5x Ultraboost price decreased from $120,000 -&gt; 105,000</li>\n</ul>\n<p>Gwendolin</p>\n<p>Gwendolin’s Firestorm damage doesn’t carry well into the endgame so has been buffed at a later level.</p>\n<ul>\n<li>Lv16 Firestorm base damage tic increases from 1 &gt; 5</li>\n<li>Lv16 Firestorm MOAB damage tic increases from 10 &gt; 15</li>\n</ul>\n<p>Pat Fusty</p>\n<p>Pat Fusty was initially given a smaller footprint than it felt he should have due to concerns about balance with his small radius, but actually has been extremely powerful for a long time despite these radius issues. We feel like now giving him back the footprint size that he always should have had similar to Churchill will add a reasonable lategame downside to consider without harming his early use so badly.</p>\n<ul>\n<li>Pat Fusty footprint increased from 7 -&gt; 8</li>\n</ul>\n<p>Admiral Brickell</p>\n<p>The Sea Mines delay that was added back in 29 has done well for reducing some of Brickells weaknesses, but as we expected somewhat does add in new weaknesses to rush rounds of Bloons that can now sneak past before all of her mines have been able to acquire a target. To help lessen this new issue she has gained a brand new ability that will allow more Sea Mines to rapidly deploy and find a target over a short duration.</p>\n<ul>\n<li>Lv7 Blast Chain utility ability added for Admiral Brickell. For 10 seconds all sea mines have their delay halved (the new one added in 29), &amp; their projectile speed doubled</li>\n</ul>\n<p>Psi</p>\n<p>We felt that Psi’s early game too easily carried into some extremely powerful endgame setups. These setups were overperforming due to certain cooldown interactions with stalling out cooldown, however in an effort to try to avoid nerfing the cooldown for the average player we decided to make that stalling synergy harder to pull off instead.</p>\n<ul>\n<li>Psi base price increased $800 -&gt; 1000</li>\n<li>Lv10 Psionic Scream ability 'speed of blow back' increased from bloon speed 300% -&gt; 600%</li>\n</ul>\n<p>Glue Rat</p>\n<p>Glue Rat pet has been overperforming in all game modes for a while now without any apparent weakness or strategic downsides.</p>\n<ul>\n<li>Base movement speed ramping level endures persistently</li>\n<li>Max level goggle tightness loosened from Max -&gt; Sam</li>\n</ul></div>",
            "date_published": "2022-04-13T01:17:10+00:00",
            "authors": [
                {
                    "name": "NoSneezePlz",
                    "url": "https://www.reddit.com/user/NoSneezePlz"
                }
            ]
        },
        {
            "id": "0",
            "url": "https://www.reddit.com/r/btd6",
            "title": "r/btd6 has been launched!",
            "content_html": "<p>This feed will be populated as posts match the given criteria.</p>"
        }
    ]
}