{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/homeassistant",
    "description": "Home Assistant is open source home automation that puts local control and privacy first. Powered by a worldwide community of tinkerers and DIY enthusiasts. Perfect to run on a Raspberry Pi or a local server. Available for free at home-assistant.io.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/homeassistant.json",
    "icon": "https://styles.redditmedia.com/t5_3bekp/styles/communityIcon_a1sc94rahuob1.png",
    "favicon": "https://styles.redditmedia.com/t5_3bekp/styles/communityIcon_a1sc94rahuob1.png",
    "items": [
        {
            "id": "1q9yd9t",
            "url": "/r/homeassistant/comments/1q9yd9t/hi_everyone_im_clooos_the_bubble_card_developer/",
            "external_url": "https://i.redd.it/5kin6pa5ppcg1.png",
            "title": "Hi everyone! I’m Clooos the Bubble Card developer, and today after 4 months of work, I’ve released v3.1.0, one of the biggest releases I have ever made. This update was a real challenge for many reasons, with many (many) major new features and fixes, making it more customizable, faster, and stable ❤",
            "content_html": "<p>My goal was to release the final version before the end of the year (well... early 2026 seems right as well). The reason is also a very happy one, I spent the last few days at the hospital with my wife for the birth of our second child! Everyone is doing great and I couldn't be happier! ❤️ My development time will be limited for a while, so I worked harder than ever to release the best version of Bubble Card I could, and I truly hope you will love it!</p>\n<p>First, I'm really happy to say that the editor received a massive speed boost and is now up to 100 times faster (for real!) on large dashboards with many pop-ups! This version also brings support for Home Assistant 2026.1, as this update had made it impossible to create new cards in the editor.</p>\n<p>One of the biggest changes is <a href=\"https://github.com/Clooos/Bubble-Card-Tools\">Bubble Card Tools</a>, this is a custom integration for Home Assistant that handles the Bubble Card backend properly. Modules are now stored in individual YAML files, improving stability, reliability, backups, and making the whole system more future-proof, with an easier setup and automatic migration for existing users.</p>\n<p>Sub-buttons have been heavily upgraded with a new slider type! This one allows multiple controls like brightness, temperature, or scenes inside the same card. A brand new “Sub-buttons only” card also makes it easy to create menus, quick actions, or information panels.</p>\n<p>But more importantly, this release finally introduces powerful new layout and customization features! You can now fully design your cards using the editor only, with sub-button groups, new placement options, individual sizing, icon positioning, copy and paste, new slider layout options... All of this gives you full control over your card layout without relying on custom styles or modules! (like in the picture above)</p>\n<p>The changelog is much (much) more longer than that and I invite you to take a look at it (I've added other screenshots as well):</p>\n<p><a href=\"https://github.com/Clooos/Bubble-Card/releases/tag/v3.1.0\">GitHub - Bubble Card 3.1.0</a></p>\n<p>I also want to give a big thank you (again) to everyone who tested the betas, reported issues, gave feedback… and to everyone for your continued support!</p>\n<p>Enjoy this update! 🍻</p><div><br></div><img src=\"https://i.redd.it/5kin6pa5ppcg1.png\" />",
            "date_published": "2026-01-11T12:39:06+00:00",
            "authors": [
                {
                    "name": "Clooooos",
                    "url": "https://www.reddit.com/user/Clooooos"
                }
            ]
        },
        {
            "id": "1q8qm2w",
            "url": "/r/homeassistant/comments/1q8qm2w/sometimes_you_need_an_impossibly_large_touchpanel/",
            "external_url": "https://i.redd.it/63b7r5i9cfcg1.jpeg",
            "title": "Sometimes you need an impossibly large touchpanel",
            "content_html": "<p>For grins I picked up a Tempo Studio (think fitness screen).  It was $125 on FBM and I couldn’t help myself.  Not sure what it will\nend up being (jukebox, arcade, a remote my kids can’t lose).  Specs were surprisingly solid: Asus mini-its board, i5-9500c gtx1650.  I bumped the ram from 8gb to 16gb and swapped in a 500gb SSD to flash to Windows 11.  But for fun tonight I loaded up Home Assistant.</p><div><br></div><img src=\"https://i.redd.it/63b7r5i9cfcg1.jpeg\" />",
            "date_published": "2026-01-10T01:24:14+00:00",
            "authors": [
                {
                    "name": "jbmc00",
                    "url": "https://www.reddit.com/user/jbmc00"
                }
            ]
        },
        {
            "id": "1q6pc0f",
            "url": "/r/homeassistant/comments/1q6pc0f/20261_home_is_where_the_dashboard_is/",
            "external_url": "https://www.home-assistant.io/blog/2026/01/07/release-20261/",
            "title": "2026.1: Home is where the dashboard is 🥂",
            "content_html": "",
            "date_published": "2026-01-07T19:39:00+00:00",
            "authors": [
                {
                    "name": "objektiver_Dritter",
                    "url": "https://www.reddit.com/user/objektiver_Dritter"
                }
            ]
        },
        {
            "id": "1q55lpv",
            "url": "/r/homeassistant/comments/1q55lpv/using_home_assistant_to_be_more_analog_in_2026/",
            "external_url": "https://i.redd.it/jyn0t47pzmbg1.jpeg",
            "title": "Using Home Assistant to be more analog in 2026",
            "content_html": "<p>Trying to avoid looking at my phone immediately when I wake up. I grabbed a used Epson thermal receipt printer for $65, created a simple component to call it from HA, and have a 6:30am automation to print out my daily “newspaper” as my kids call it. Very silly but I like sitting down to read it. I also like not having to deal with printer ink. </p><div><br></div><img src=\"https://i.redd.it/jyn0t47pzmbg1.jpeg\" />",
            "date_published": "2026-01-06T02:03:58+00:00",
            "authors": [
                {
                    "name": "zacs",
                    "url": "https://www.reddit.com/user/zacs"
                }
            ]
        },
        {
            "id": "1pwdlc4",
            "url": "/r/homeassistant/comments/1pwdlc4/automated_ipa_recycling_resin_curing_blinds_and/",
            "external_url": "https://www.reddit.com/gallery/1pwdlc4",
            "title": "Automated IPA Recycling, Resin curing, blinds, and more using the BTN-1 and ZWA-2 in the Apollo Workshop!",
            "content_html": "<p>Happy Holidays from the Apollo team!</p>\n<p>We have been using the recently launched Apollo BTN-1 Macro Deck along with a Home Assistant blueprint and connect ZWA-2 to automate the Apollo workshop! (Thanks to u/jesserockz from ESPHome and u/smarthomesellout from Apollo for the blueprint) </p>\n<p>The BTN-1 gives you four physical buttons to use to automate your smart setup. Each button has a single, double, triple, and hold function to give you 16 different actions. It can be powered with USB-C or an optional battery, and it connects over Wi-Fi to Home Assistant.</p>\n<p>Apollo BTN-1: <a href=\"https://apolloautomation.com/products/btn-1-macro-deck\">https://apolloautomation.com/products/btn-1-macro-deck</a></p>\n<p>Home Assistant BTN-1 Blueprint: <a href=\"https://wiki.apolloautomation.com/products/btn1/examples/blueprint/?h=blueprint\">https://wiki.apolloautomation.com/products/btn1/examples/blueprint/?h=blueprint</a></p>\n<p>Home Assistant Connect ZWA-2: <a href=\"https://apolloautomation.com/products/home-assistant-connect-zwa-2\">https://apolloautomation.com/products/home-assistant-connect-zwa-2</a></p>\n<p><strong>BTN-1 automations so far!</strong></p>\n<p>IPA Recycler</p>\n<ul>\n<li>Automated an Apollo PUMP-1 to pump IPA from the IPA recycling machine into the wash station and vice versa. (<a href=\"https://apolloautomation.com/products/pump-1-fluid-pump\">https://apolloautomation.com/products/pump-1-fluid-pump</a>)</li>\n</ul>\n<p>Resin curing</p>\n<ul>\n<li>Automated the UV light for curing our resin 3D printed parts using a Z-wave smart plug</li>\n</ul>\n<p>Window Blinds</p>\n<ul>\n<li>Automated opening and closing of our Wi-Fi blinds</li>\n</ul>\n<p>Door Locks</p>\n<ul>\n<li>Automated locking and unlocking of our Z-wave door locks</li>\n</ul>\n<p>Lights</p>\n<ul>\n<li>Automated turning on and off our main LED workshop lights using Z-wave smart plugs</li>\n<li>Automated turning on and off our meeting room Wi-Fi lights</li>\n</ul>\n<p>We are still finding things to automate, so let us know if you have any thoughts or suggestions!</p>",
            "date_published": "2025-12-26T20:05:55+00:00",
            "authors": [
                {
                    "name": "ApolloAutomation",
                    "url": "https://www.reddit.com/user/ApolloAutomation"
                }
            ]
        },
        {
            "id": "1pp46jh",
            "url": "/r/homeassistant/comments/1pp46jh/meet_our_new_commercial_partner_apollo_automation/",
            "external_url": "https://newsletter.openhomefoundation.org/meet-our-new-partner-apollo-automation/",
            "title": "Meet our new commercial partner: Apollo Automation",
            "content_html": "",
            "date_published": "2025-12-17T18:32:38+00:00",
            "authors": [
                {
                    "name": "balloob",
                    "url": "https://www.reddit.com/user/balloob"
                }
            ]
        },
        {
            "id": "1pnehhj",
            "url": "/r/homeassistant/comments/1pnehhj/just_started_my_smart_home_journey/",
            "external_url": "https://i.redd.it/ijexi6u3se7g1.jpeg",
            "title": "Just started my smart home journey",
            "content_html": "<p>My wife is not nearly as invested in matching the warmth and brightness of our home to our circadian rhythms at all times. </p><div><br></div><img src=\"https://i.redd.it/ijexi6u3se7g1.jpeg\" />",
            "date_published": "2025-12-15T18:10:36+00:00",
            "authors": [
                {
                    "name": "-kwatz-",
                    "url": "https://www.reddit.com/user/-kwatz-"
                }
            ]
        },
        {
            "id": "1plpry8",
            "url": "/r/homeassistant/comments/1plpry8/brought_a_20_year_old_car_into_home_assistant/",
            "external_url": "https://i.redd.it/ridli8kb207g1.jpeg",
            "title": "Brought a 20+ Year Old car into Home Assistant. (Building Blocks in Comments)",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/ridli8kb207g1.jpeg\" />",
            "date_published": "2025-12-13T16:42:48+00:00",
            "authors": [
                {
                    "name": "NRG1975",
                    "url": "https://www.reddit.com/user/NRG1975"
                }
            ]
        },
        {
            "id": "1pkq695",
            "url": "/r/homeassistant/comments/1pkq695/santa_tracker/",
            "external_url": "https://i.redd.it/wwo23f6fjr6g1.gif",
            "title": "Santa Tracker",
            "content_html": "<p>My second attempt at creating something bespoke (first one was <a href=\"https://www.reddit.com/r/homeassistant/comments/1pkpl87/hiking_weather_outlook/\">Hiking Weather Outlook</a>)...</p>\n<p>This one was a little play using the Google Santa Tracker API. I've not been able to test it yet as its not live until Christmas eve so fingers crossed it wont let me down 🤞</p>\n<p>I also generated about 100 videos using GROK so it gives the feel of CCTV cameras flicking around the north pole randomly. Kids love it and hopefully extends their belief by one more year!</p><div><br></div><img src=\"https://i.redd.it/wwo23f6fjr6g1.gif\" />",
            "date_published": "2025-12-12T12:01:35+00:00",
            "authors": [
                {
                    "name": "Admirable-Permit-452",
                    "url": "https://www.reddit.com/user/Admirable-Permit-452"
                }
            ]
        },
        {
            "id": "1ph2w01",
            "url": "/r/homeassistant/comments/1ph2w01/an_utter_outrage/",
            "external_url": "https://www.home-assistant.io/blog/2025/12/03/release-202512/",
            "title": "An Utter Outrage",
            "content_html": "<p>I have been a dedicated user of this free service for years now.  Not once have I complained about the UI or maintenance, but today a line has been crossed.</p>\n<p>The Dominos Integration has been removed.</p>\n<p>Who on Earth thought this was a good idea?  One of those code dorks with a well-paying and easy job?  Or maybe its the HomeAssistant CEO raking in all the income from this service.  What a greedy parasite, I just wanted to use my free service for free.  But you had to go and change it.</p>\n<p>It was absolutely perfect.</p>\n<p>I wake up, hit the alarm on my Alanzi clock, 30 minutes later I have pizza.\nI turn on my Hue lights, 30 minutes later I have pizza.\nI walk to the bathroom, passing the Aqara motion sensors, 30 minutes later I have pizza.\nI turn on the Moen tap to wash my greasy pizza face,\n30 minutes later I have pizza.\nI sit at my desk and turn on my PC, 30 minutes later I have pizza.\nI have a calendar alert go off for a doctor\"s appointment, 30 minutes later I have pizza.\nI start my Subaru, 30minuteds later I have pizza.\nI sit in the office while this quack rambles on, something about my cholesterol, and I leave.\nI go home and open the (artist formerly known as)Chamberlain garage. The trapped Amazon employee skitters free, and 30 minutes later I have pizza.\nI yell at Alexa to play my favorite slop podcast from Spotify.  That's worth 2 pizzas right there.\nMy Nest thermostat kicks the A/C on, pizza time.\nI watch my favorite anime legally ripped from someone at one time on my Plex server, 30 minutes later I have pizza.\nMy friend tells me to join in on Xbox Live for a totally sick round of Roblox with other totally normal fully grown adults.  30 minutes later, I have pizza.\nAlexa bores me so I yell at my Google Nest to tell me a StarWars™ joke.  30 minutes later, pizza I have.\nThe Rainbird sprinklers start up, 31 minutes later I have pizza.  (Yes I know, completely unacceptable and I am sure to let the lazy delivery driver know through their crocodile tears.  Pathetic, its like they've never heard of the Castle Doctrine. Anyway.)\nThe fridge is opened, 30 minutes later I have pizza.\nThe floors are robo-vaccumed, 30 minutes later I have pizza.\nThe driver rings the doorbell, 30 minutes later I have pizza.\nThe driver rings the doorbell, 30 minutes later I have pizza.\nThe driver rings the doorbell, 30 minutes later I have pizza.\nThe driver activates the motion-sensing porch lights, 30 minutes later I have pizza.</p>\n<p>The blinds are closed, the hot water heater fires up, the microwave is turned om, the weather changes, I blink.\nPizza pizza pizza pizza pizza pizza.</p>\n<p>It was all so easy.  So perfect.  Now what, you expect me to call or use an app, like a neanderthal?  Bet you also think Dominos is \"average to subpar\".  You all disgust me.</p>\n<p>Now if you excuse me, the ambulabce has pulled up for my heart attack, and I need to tell them to slow down so we don't miss my pizza delivery. </p>",
            "date_published": "2025-12-08T04:12:55+00:00",
            "authors": [
                {
                    "name": "Chekhovs_Bazooka",
                    "url": "https://www.reddit.com/user/Chekhovs_Bazooka"
                }
            ]
        },
        {
            "id": "1pfr5ks",
            "url": "/r/homeassistant/comments/1pfr5ks/myq_just_bricked_the_future_so_pray_your_ratgdo/",
            "external_url": "https://www.theverge.com/tech/839294/chamberlain-myq-garage-door-opener-update-blocks-aftermarket-controllers",
            "title": "MyQ just bricked the future, so pray your Ratgdo opener lives forever",
            "content_html": "<p>So MyQ decided to lock down their newest garage openers so hard that even the CIA would say relax a bit. Their shiny new Security Plus 3.0 basically says screw you to Ratgdo, Home Assistant, and anything that isn’t their overpriced, ad-filled ecosystem.</p>\n<p>Translation, if your current opener dies, you’re stuck buying their locked-down junk and begging their cloud to open your own garage. Amazing.</p>\n<p>At this point I’m treating my Ratgdo-compatible opener like a vintage Ferrari. Oil changes, gentle words, maybe a nightly prayer. Because once it dies, MyQ’s prison system is waiting.</p>\n<p>Great job MyQ. Truly the Comcast of garage doors. Until a new brand will give us relief. </p>",
            "date_published": "2025-12-06T14:54:10+00:00",
            "authors": [
                {
                    "name": "Hatarez",
                    "url": "https://www.reddit.com/user/Hatarez"
                }
            ]
        },
        {
            "id": "1pdso94",
            "url": "/r/homeassistant/comments/1pdso94/i_hope_memes_are_allowed/",
            "external_url": "https://i.redd.it/ukhrr71nq45g1.jpeg",
            "title": "I hope memes are allowed",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/ukhrr71nq45g1.jpeg\" />",
            "date_published": "2025-12-04T06:16:36+00:00",
            "authors": [
                {
                    "name": "nahylink",
                    "url": "https://www.reddit.com/user/nahylink"
                }
            ]
        },
        {
            "id": "1pd9ism",
            "url": "/r/homeassistant/comments/1pd9ism/psa_chamberlainliftmaster_up_to_more_shady_things/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1pd9ism/psa_chamberlainliftmaster_up_to_more_shady_things/",
            "title": "PSA: Chamberlain/Liftmaster up to more shady things.  BE AWARE if purchasing a new garage door opener",
            "content_html": "<p>New Garage Door Openers will come with Security+ 3.0.  This is a new protocol aimed at completely locking out third parties from local control.  For those of you that use Konnected or ratgdo devices, new openers <em>will not be compatible</em>.  Apparently, the new protocol uses Bluetooth and whitelisting to ensure that only Chamberlain-\"approved\" devices can be paired with their openers.  Additionally, since it uses bluetooth, this is a physical hardware change and cannot be mitigated with a firmware update.  This is clearly a means to lock you into their ecosystem so they can charge subscription fees for their \"services\".</p>\n<p>Fuck Chamberlain.  I will never purchase another opener from them again.</p>\n<p>Raising this for visibility, but see this other thread for more details: <a href=\"https://www.reddit.com/r/homeassistant/comments/1op65z5/ratgdo_on_new_myq_security_30/\">https://www.reddit.com/r/homeassistant/comments/1op65z5/ratgdo_on_new_myq_security_30/</a></p>\n<p>EDIT: Should clarify that Security+ 3.0 only uses the wires to power the devices.  No data is sent, so theres no real way to \"hack the protocol\".</p>",
            "date_published": "2025-12-03T16:52:58+00:00",
            "authors": [
                {
                    "name": "jgilbs",
                    "url": "https://www.reddit.com/user/jgilbs"
                }
            ]
        },
        {
            "id": "1pbzkix",
            "url": "/r/homeassistant/comments/1pbzkix/amazons_magic_trick_make_a_normal_price_look_like/",
            "external_url": "https://i.redd.it/eurpepzs1q4g1.jpeg",
            "title": "Amazon’s magic trick - make a normal price look like a Cyber Monday deal",
            "content_html": "<p>I was checking out this Reolink Camera on Amazon during the Cyber Monday sale, but the price graph made me realise that the discount is sketchy.</p>\n<p>The price actually went down to $83.99 around early October and stayed there till nov 14 and then right before the Black friday sale the price bumped upto $139. Now during the Cyber Monday sale, it’s sitting at $99.99 with a 29% off tag (Cyber Monday Deal), but technically that’s higher than its recent lowest price which I found using the Buyhatke Chrome extension.</p>\n<p>So now I’m wondering if $99.99 is actually a good deal for reolink or I should choose Tapo TP Link cameras for my home</p><div><br></div><img src=\"https://i.redd.it/eurpepzs1q4g1.jpeg\" />",
            "date_published": "2025-12-02T04:52:10+00:00",
            "authors": [
                {
                    "name": "notion4everyone",
                    "url": "https://www.reddit.com/user/notion4everyone"
                }
            ]
        },
        {
            "id": "1p68ne5",
            "url": "/r/homeassistant/comments/1p68ne5/v400_the_update_that_finally_changes_everything/",
            "external_url": "https://www.reddit.com/gallery/1p68ne5",
            "title": "v4.0.0: The Update That Finally Changes Everything",
            "content_html": "<p>I’ve wrapped up the v4.0.0 upgrade of my Material Design 3 Home Assistant tablet dashboard, and this version changes the workflow in a big way. The dashboard is now built around a much more modular structure, using streamline templates that handle most of the heavy lifting behind the scenes. Instead of digging through long YAML sections, I can map entities through the UI and the cards adapt automatically. It makes setup faster and the whole system far easier to maintain.</p>\n<p>The visual style stays consistent with the MD3 design goals. Dynamic color theming, transparent cards and clean spacing bring everything together, whether it’s lights, climate controls, weather data, security sensors, irrigation or cameras. The entire smart home still feels unified in one polished interface.</p>\n<p>I also added a few smaller improvements along the way. The overview page now includes a dedicated media player, the layout is a bit more balanced and pop-ups are used more intentionally to keep the main view uncluttered.</p>\n<p>I've shared all of the card examples in the <a href=\"https://github.com/ElementZoom/Material-Design-3-Dynamic-Tablet-Dashboard\">Github</a>. I hope it helps!</p>",
            "date_published": "2025-11-25T10:01:21+00:00",
            "authors": [
                {
                    "name": "ElementZoom",
                    "url": "https://www.reddit.com/user/ElementZoom"
                }
            ]
        },
        {
            "id": "1p2ydpy",
            "url": "/r/homeassistant/comments/1p2ydpy/congrats_to_home_assistant_for_once_again_earning/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1p2ydpy/congrats_to_home_assistant_for_once_again_earning/",
            "title": "Congrats to Home Assistant for once again earning the top spot in the list of users' favorite software from this year's Self-Host User Survey!",
            "content_html": "<p>Every year, I facilitate a user survey over at <a href=\"https://selfh.st\">selfh.st</a> to gauge interests, habits, trends, etc. across the self-hosted community and always include a question asking users what their favorite self-hosted software is.</p>\n<p>Home Assistant almost always tops that list, and per this year's results (linked below), it easily took first place with 588 of ~3,700 responses to the question.</p>\n<p>I'm personally a big fan of the platform and developers, so I'm especially excited to see the continued excitement from users.</p>\n<p>Congrats!</p>\n<p><a href=\"https://selfh.st/survey/2025-results/\">2025 Self-Host User Survey Results</a></p>",
            "date_published": "2025-11-21T13:18:22+00:00",
            "authors": [
                {
                    "name": "shol-ly",
                    "url": "https://www.reddit.com/user/shol-ly"
                }
            ]
        },
        {
            "id": "1p1ib2e",
            "url": "/r/homeassistant/comments/1p1ib2e/home_assistant_connect_zbt2_announced/",
            "external_url": "https://www.home-assistant.io/connect/zbt-2",
            "title": "Home Assistant Connect ZBT-2 Announced!",
            "content_html": "",
            "date_published": "2025-11-19T20:08:10+00:00",
            "authors": [
                {
                    "name": "JXRT190",
                    "url": "https://www.reddit.com/user/JXRT190"
                }
            ]
        },
        {
            "id": "1p0git6",
            "url": "/r/homeassistant/comments/1p0git6/zigbee_40_is_out/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1p0git6/zigbee_40_is_out/",
            "title": "Zigbee 4.0 is out",
            "content_html": "<p>What a surprise. We thought that Zigbee is the old and matter will be the future. </p>\n<p>But now Zigbee is back again. Now fighting against Matter or what will happen?</p>\n<p><a href=\"https://csa-iot.org/newsroom/the-connectivity-standards-alliance-announces-zigbee-4-0-and-suzi-empowering-the-next-generation-of-secure-interoperable-iot-devices/\">https://csa-iot.org/newsroom/the-connectivity-standards-alliance-announces-zigbee-4-0-and-suzi-empowering-the-next-generation-of-secure-interoperable-iot-devices/</a></p>",
            "date_published": "2025-11-18T16:30:26+00:00",
            "authors": [
                {
                    "name": "harald4232",
                    "url": "https://www.reddit.com/user/harald4232"
                }
            ]
        },
        {
            "id": "1ot60qk",
            "url": "/r/homeassistant/comments/1ot60qk/i_dont_know_what_to_say/",
            "external_url": "https://i.imgur.com/y6xgGRo.png",
            "title": "I dont know what to say",
            "content_html": "<div><br></div><img src=\"https://i.imgur.com/y6xgGRo.png\" />",
            "date_published": "2025-11-10T05:54:18+00:00",
            "authors": [
                {
                    "name": "specialtoesy21",
                    "url": "https://www.reddit.com/user/specialtoesy21"
                }
            ]
        },
        {
            "id": "1opyegc",
            "url": "/r/homeassistant/comments/1opyegc/ikeas_announces_new_smart_home_collection_of_21/",
            "external_url": "https://www.theverge.com/news/814241/ikea-smart-home-matter-thread-lights-sensors-remote-control",
            "title": "Ikea’s announces new smart home collection of 21 new Matter-over-Thread devices and sensors",
            "content_html": "",
            "date_published": "2025-11-06T13:06:10+00:00",
            "authors": [
                {
                    "name": "fuzzbinn",
                    "url": "https://www.reddit.com/user/fuzzbinn"
                }
            ]
        },
        {
            "id": "1omskh2",
            "url": "/r/homeassistant/comments/1omskh2/my_minimalist_dashboard/",
            "external_url": "https://i.redd.it/650b9d7ypwyf1.jpeg",
            "title": "My minimalist dashboard",
            "content_html": "<p>I'm pretty happy with it (I'm 15 btw)</p><div><br></div><img src=\"https://i.redd.it/650b9d7ypwyf1.jpeg\" />",
            "date_published": "2025-11-02T20:53:22+00:00",
            "authors": [
                {
                    "name": "Uninterested_Viewer",
                    "url": "https://www.reddit.com/user/Uninterested_Viewer"
                }
            ]
        },
        {
            "id": "1omjwmr",
            "url": "/r/homeassistant/comments/1omjwmr/garbage_collection_info_machine/",
            "external_url": "https://www.reddit.com/gallery/1omjwmr",
            "title": "Garbage Collection info \"machine\"",
            "content_html": "<p>I don't have a 3D printer, so I had to cut and drill a plastic box. An ESP32 retrieves the collection schedule information for the garbage bins from the local waste management. HA triggers white LEDs and indicates which bin will be collected the following day,also plays a melody through passive speaker inside the box. Information appears on a display (in a rotating menu): when is the next collection for which garbage bin</p>",
            "date_published": "2025-11-02T15:17:12+00:00",
            "authors": [
                {
                    "name": "dittmeyer",
                    "url": "https://www.reddit.com/user/dittmeyer"
                }
            ]
        },
        {
            "id": "1olmwl6",
            "url": "/r/homeassistant/comments/1olmwl6/i_made_my_coffeemaker_even_smarter/",
            "external_url": "https://www.reddit.com/gallery/1olmwl6",
            "title": "I made my coffeemaker even smarter!",
            "content_html": "<p>Two weeks ago I made my coffeemaker remotely controllable: https://www.reddit.com/r/homeassistant/comments/1oa09xf/i_made_my_coffeemaker_smart/</p>\n<p>Now I reversed engineered the UART-Connection between the LLC and the display to get stuff that the display shows… So now I can see the temperature in HA (MQTT via ESP32) and know when it is heated up!\nAlso everything fits inside the Maschine and it didn’t lost any functionality…</p>\n<p>For those who want to do the same thing and also have a PL81T:\nIt’s a 9600 baud UART connection and the data has to be read encoded (not ASCII) and be synced on the 3F bit… the algorithm to get the temperature is a bit to complicated to describe here, but just DM me if you want to know how it works…</p>",
            "date_published": "2025-11-01T12:45:19+00:00",
            "authors": [
                {
                    "name": "Soft-Program-947",
                    "url": "https://www.reddit.com/user/Soft-Program-947"
                }
            ]
        },
        {
            "id": "1ojdeeu",
            "url": "/r/homeassistant/comments/1ojdeeu/there_are_two_types_of_home_assistant_users_and_i/",
            "external_url": "https://i.redd.it/qmz24adam3yf1.jpeg",
            "title": "There are two types of Home Assistant users,  and I love you all.",
            "content_html": "<p>These lined up in my feed, and I had to share. Mods, if you need to delete, I apologize. </p><div><br></div><img src=\"https://i.redd.it/qmz24adam3yf1.jpeg\" />",
            "date_published": "2025-10-29T19:02:52+00:00",
            "authors": [
                {
                    "name": "gamerspoon",
                    "url": "https://www.reddit.com/user/gamerspoon"
                }
            ]
        },
        {
            "id": "1oedn3q",
            "url": "/r/homeassistant/comments/1oedn3q/vacuum_cleaner_doors_opening_with_knight_rider/",
            "external_url": "https://www.youtube.com/watch?v=SrqpMGikY9g",
            "title": "Vacuum cleaner doors opening with Knight Rider theme",
            "content_html": "<p>Home Assistant integration with Roborock.</p>\n<ul>\n<li>Aqara Roller Shade Driver E1 over Zigbee</li>\n<li>Automatic Cabinet Door Mechanism for Robot Vacuum (IKEA Metod + Aqara E1) - https://www.printables.com/model/1381371-a...</li>\n<li>QuinLED-dig2go - <a href=\"https://quinled.info/quinled-dig2go/\">https://quinled.info/quinled-dig2go/</a></li>\n</ul>",
            "date_published": "2025-10-23T20:06:08+00:00",
            "authors": [
                {
                    "name": "Perfect-Register7216",
                    "url": "https://www.reddit.com/user/Perfect-Register7216"
                }
            ]
        },
        {
            "id": "1ocbebl",
            "url": "/r/homeassistant/comments/1ocbebl/raise_your_hand_if_your_setup_was_unaffected_by/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1ocbebl/raise_your_hand_if_your_setup_was_unaffected_by/",
            "title": "Raise your hand if your setup was unaffected by the AWS outage",
            "content_html": "<p>TBH, I did not know AWS had gone out at all.  Most of my smart devices are Kasa and run locally.</p>\n<p>What about you?</p>",
            "date_published": "2025-10-21T12:19:36+00:00",
            "authors": [
                {
                    "name": "Academic-Swimming919",
                    "url": "https://www.reddit.com/user/Academic-Swimming919"
                }
            ]
        },
        {
            "id": "1obhcot",
            "url": "/r/homeassistant/comments/1obhcot/finally_took_a_shot_at_building_a_interactive/",
            "external_url": "https://i.redd.it/nj109w7yc9wf1.jpeg",
            "title": "Finally took a shot at building a interactive floorplan of my room",
            "content_html": "<p>Hello! I’ve started using home assistant recently, and I’m not really a tech savvy guy. I really liked the idea of building something like this, but I always thought it would be way too complicated for me. Finally took at shot at it and I’m really happy with the results. WAY easier than It looks. Give it a try!</p><div><br></div><img src=\"https://i.redd.it/nj109w7yc9wf1.jpeg\" />",
            "date_published": "2025-10-20T12:11:17+00:00",
            "authors": [
                {
                    "name": "Pstck",
                    "url": "https://www.reddit.com/user/Pstck"
                }
            ]
        },
        {
            "id": "1o9d3aj",
            "url": "/r/homeassistant/comments/1o9d3aj/i_converted_a_busted_chromebook_to_a_custom_3d/",
            "external_url": "https://www.reddit.com/gallery/1o9d3aj",
            "title": "I converted a busted Chromebook to a custom 3D printed HA server",
            "content_html": "<p>I found a Lenovo 500e 1st gen Chromebook on marketplace for really cheap(15EUR). It had a broken keyboard, broken screen, broken trackpad, but it did work... so i took it apart and 3d printed a custom case for it to convert it to a HA server. It has 32gb storage(+ microSD slot), 4gb ram and an Intel Celeron N3450(perfect for an average setup). Also has a battery so it has a built-in UPS :) </p>",
            "date_published": "2025-10-17T21:00:16+00:00",
            "authors": [
                {
                    "name": "tgtassap",
                    "url": "https://www.reddit.com/user/tgtassap"
                }
            ]
        },
        {
            "id": "1nyy1e6",
            "url": "/r/homeassistant/comments/1nyy1e6/absolutely_chuffed_with_my_new_dashboard/",
            "external_url": "https://i.redd.it/idagrl62kctf1.gif",
            "title": "Absolutely chuffed with my new Dashboard!",
            "content_html": "<p>I got board of the generic HA dashboard I had, so took The Weekend to design my own. I sometimes make a mess of doing stuff like this, but I'm really pleased with how it came out; picture is a GIF to show the neat sliding card in action <a href=\"https://emojipedia.org/smiling-face-with-smiling-eyes\">😊</a></p><div><br></div><img src=\"https://i.redd.it/idagrl62kctf1.gif\" />",
            "date_published": "2025-10-05T19:46:11+00:00",
            "authors": [
                {
                    "name": "Medium-Room1078",
                    "url": "https://www.reddit.com/user/Medium-Room1078"
                }
            ]
        },
        {
            "id": "1nvwan7",
            "url": "/r/homeassistant/comments/1nvwan7/found_this_ha_dashboard_at_a_beach_resort/",
            "external_url": "https://www.reddit.com/gallery/1nvwan7",
            "title": "Found this HA dashboard at a beach resort.",
            "content_html": "<p>How do I know it's really HA? The UV Index gauge just went to 'entity not available' for a few seconds 😀</p>",
            "date_published": "2025-10-02T06:28:45+00:00",
            "authors": [
                {
                    "name": "linuxfrickler",
                    "url": "https://www.reddit.com/user/linuxfrickler"
                }
            ]
        },
        {
            "id": "1nu8xon",
            "url": "/r/homeassistant/comments/1nu8xon/v300_is_live_my_dashboard_just_had_a_makeover/",
            "external_url": "https://www.reddit.com/gallery/1nu8xon",
            "title": "✨ v3.0.0 is live – my dashboard just had a makeover! 🚀",
            "content_html": "<p>Hey folks! I’ve been tinkering again and pushed out a fresh update to my Home Assistant dashboard. Here’s what’s new:</p>\n<ul>\n<li>🗂 <strong>New tab navigation</strong> with the Simple Tabs Card – faster, smoother, prettier.</li>\n<li>🎨 <strong>MD3 glow-up</strong> – more consistent look across the board, with polished light/dark modes.</li>\n<li>🌦 <strong>Weather revamp</strong> – forecast split into its own interactive pop-up, plus shiny new combo graphs: rainfall × temperature and wind speed × direction.</li>\n<li>🧹 <strong>Under-the-hood cleanups</strong> – more decluttering_templates, simplified layouts, and overall a cleaner, minimal design.</li>\n</ul>\n<p>Feels way more responsive and polished now. Even the wife gave me a small nod of approval (which is basically a standing ovation in WAF terms 😂).</p>\n<p>If you want to check it out or use parts of it, the code’s up on my <a href=\"https://github.com/ElementZoom/Material-Design-3-Dynamic-Mobile-Dashboard\">GitHub</a>. I can also help design your dashboard if you’d like a custom setup—just send me a chat. And if you’d like to support my work, there’s a Ko-fi link on the GitHub page ☕</p>",
            "date_published": "2025-09-30T09:49:35+00:00",
            "authors": [
                {
                    "name": "ElementZoom",
                    "url": "https://www.reddit.com/user/ElementZoom"
                }
            ]
        },
        {
            "id": "1nqpz2b",
            "url": "/r/homeassistant/comments/1nqpz2b/426_inch_epaper_with_magnet_you_can_stick_them_as/",
            "external_url": "https://www.reddit.com/gallery/1nqpz2b",
            "title": "4.26 inch ePaper with magnet. You can stick them as you like~ What do you think?",
            "content_html": "",
            "date_published": "2025-09-26T02:39:46+00:00",
            "authors": [
                {
                    "name": "Miserable_Bluejay663",
                    "url": "https://www.reddit.com/user/Miserable_Bluejay663"
                }
            ]
        },
        {
            "id": "1nodrsl",
            "url": "/r/homeassistant/comments/1nodrsl/my_ios_inspired_tablet_dashboard/",
            "external_url": "https://www.reddit.com/gallery/1nodrsl",
            "title": "My iOS Inspired Tablet Dashboard",
            "content_html": "<p>Over the past few months (pretty much since 'finishing' my<a href=\"https://www.reddit.com/r/homeassistant/comments/1eyzvlv/my_ios_inspired_dashboard/\"> iOS inspired dashboard</a>) I’ve been designing and refining a custom Home Assistant dashboard for an iPad Pro that lives on our kitchen counter which acts as our central command for glanceable info and (occasional) smart home control. </p>\n<p>The goal was to create something that felt polished, flexible, and easy to use - something that both looks good and is functional. Most of the interface is built using custom:button-card, with dynamic behaviour driven by input_select helpers and templated YAML. </p>\n<p>The design is very much inspired by iOS and Liquid Glass, while the layout is basically an open-source version of the Amazon Echo Show 15.</p>\n<p><strong>Overview</strong></p>\n<p><strong>Header (Top Row)</strong></p>\n<p>The top of the screen shows key conditional info as chips like “Washing Finished”, “Dishwasher has X remaining”, “Garage Door Open”, or how long our one year old has been asleep. These update automatically based on sensor states or automations.</p>\n<p><strong>Footer (Bottom Row)</strong></p>\n<p>The bottom row stays consistent across pages. It provides:</p>\n<ul>\n<li>Quick access to popups (for lights and climate) using custom:bubble-card</li>\n<li>Media now playing in the kitchen/living zone (also has popups to control music / TV)</li>\n<li>Garage door status and control</li>\n<li>A shortcut to launch Assist via voice or text on the tablet</li>\n</ul>\n<p><strong>Swipeable Body (Middle Section)</strong></p>\n<p>The main body of the dashboard is a two-row, four-column layout that swipes between two “pages”. The cards within it dynamically change depending on real-world conditions, using input_select helpers to determine which custom card template to show in each slot.</p>\n<p>For Example:</p>\n<ul>\n<li>If the weather forecast predicts rain, the Weather Radar card will automatically replace the Calendar card.</li>\n<li>If there’s a game on, a live scorecard replaces the Shortcuts card (which is still accessible via the footer).</li>\n<li>If music is playing on the kitchen HomePod, the music tile will move to the first page, swapping with the Shortcuts card.</li>\n</ul>\n<p>Each card is built as a reusable custom:button-card template and saved at the top of my YAML config, making it easy to rearrange or reuse cards elsewhere and minimising the amount of YAML in the actual dashboard itself.</p>\n<p><strong>Hardware / Setup</strong></p>\n<ul>\n<li>The dashboard runs full-screen in the companion app on an iPad Pro (overkill, I know), with Guided Access enabled to lock it in place and prevent exiting the app (which can of course still be done with a password if someone wants to use the iPad as an iPad).</li>\n<li>An invisible push notification (sent from Home Assistant) wakes the screen when motion is detected in the kitchen - making it feel responsive and alive without any interaction.</li>\n</ul>\n<p><strong>What’s Next</strong></p>\n<p>This is still a work in progress and I’m always tweaking and trying to improve it. </p>\n<p>Some ideas include:</p>\n<ul>\n<li>A brief news headline card for real-time traffic and news updates (probably using ChatGPT to figure out which news headlines I actually care about / want to see)</li>\n<li>A way for my wife (and eventually my son) to leave quick written notes, like digital Post-Its</li>\n<li>Displaying family photos via <a href=\"https://immich.app\">Immich</a> running on a Raspberry Pi (when I finally get around to setting it up)</li>\n</ul>\n<p>^(PS You'll notice some of the attached screenshots are from earlier in the year, I've been meaning to post this for a while!)</p>",
            "date_published": "2025-09-23T10:30:34+00:00",
            "authors": [
                {
                    "name": "Pivotonian",
                    "url": "https://www.reddit.com/user/Pivotonian"
                }
            ]
        },
        {
            "id": "1nnkwjj",
            "url": "/r/homeassistant/comments/1nnkwjj/there_is_a_book_about_home_assistant/",
            "external_url": "https://i.redd.it/dibqmeftkpqf1.jpeg",
            "title": "There is a book about home assistant?",
            "content_html": "<p>I just found this book in Germany, Cool lol!</p><div><br></div><img src=\"https://i.redd.it/dibqmeftkpqf1.jpeg\" />",
            "date_published": "2025-09-22T12:19:07+00:00",
            "authors": [
                {
                    "name": "ii3boodi_milke_man",
                    "url": "https://www.reddit.com/user/ii3boodi_milke_man"
                }
            ]
        },
        {
            "id": "1nkaqfc",
            "url": "/r/homeassistant/comments/1nkaqfc/counterstrike_as_a_home_assistant_mqtt_device/",
            "external_url": "https://i.redd.it/pxcedaz3hxpf1.png",
            "title": "Counter-Strike as a Home Assistant MQTT device",
            "content_html": "<h1><a href=\"https://github.com/lupusbytes/cs2mqtt\">cs2mqtt</a></h1>\n<p>Intro:</p>\n<p>In the beginning of 2024, I was searching for Home Assistant integrations to allow me to control my lights and other fun stuff, based on game state in Counter-Strike 2.<br />\nI found <a href=\"https://github.com/lociii/homeassistant-csgo\">homeassistant-csgo</a>, but the developer had marked it as deprecated and asked his users to move on to his Overwolf based integration.<br />\nI do not want to install Overwolf on my PC and I also found that there was much more data available that I wanted to access, but that his integration didn't expose in Home Assistant, so I decided to build my own.</p>\n<p>Enter <strong>cs2mqtt:</strong></p>\n<p>This project has a completely different approach, which is to accept data from the <a href=\"https://developer.valvesoftware.com/wiki/Counter-Strike:_Global_Offensive_Game_State_Integration\">Counter-Strike Game State Integration</a> engine on a high performance API and asynchronously re-transmit the data as MQTT messages on seperate topics and use the <a href=\"https://www.home-assistant.io/integrations/mqtt/#mqtt-discovery\">MQTT discovery protocol</a> to automatically create MQTT devices in Home Assistant, for every connected STEAM account.</p>\n<p><strong>cs2mqtt</strong> is designed to run as docker container and can be hosted on your gaming PC, a separate server such as a Raspberry Pi or just on the same hardware as your Home Assistant server.<br />\nThe container only uses about 70MB RAM and in my benchmarks, on my own server, with simulated data from Counter-Strike, it can handle over 10000 requests per seconds.</p>\n<p>I have been using it myself for over a year now and I'm very happy with, so I decided to share it here with you guys. You can find the code and docs over at <a href=\"https://github.com/lupusbytes/cs2mqtt\">https://github.com/lupusbytes/cs2mqtt</a></p><div><br></div><img src=\"https://i.redd.it/pxcedaz3hxpf1.png\" />",
            "date_published": "2025-09-18T15:03:53+00:00",
            "authors": [
                {
                    "name": "LupusOnFire",
                    "url": "https://www.reddit.com/user/LupusOnFire"
                }
            ]
        },
        {
            "id": "1nifp6c",
            "url": "/r/homeassistant/comments/1nifp6c/they_finally_did_it_samsung_smart_fridge_one_of/",
            "external_url": "https://i.redd.it/foh1lyeypipf1.jpeg",
            "title": "They finally did it - Samsung smart fridge. One of the silliest \"smart\" purchases I've made.",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/foh1lyeypipf1.jpeg\" />",
            "date_published": "2025-09-16T12:11:16+00:00",
            "authors": [
                {
                    "name": "angrycatmeowmeow",
                    "url": "https://www.reddit.com/user/angrycatmeowmeow"
                }
            ]
        },
        {
            "id": "1nhq9cz",
            "url": "/r/homeassistant/comments/1nhq9cz/i_uh_dont_really_know_what_this_means/",
            "external_url": "https://i.redd.it/azsi29mlscpf1.png",
            "title": "I, uh, don't really know what this means",
            "content_html": "<p>It doesnt seem to cause any issues or anything, just thought I'd share this funny bug I ran into. My server travels time, how about yours?</p><div><br></div><img src=\"https://i.redd.it/azsi29mlscpf1.png\" />",
            "date_published": "2025-09-15T16:15:23+00:00",
            "authors": [
                {
                    "name": "elbowe21",
                    "url": "https://www.reddit.com/user/elbowe21"
                }
            ]
        },
        {
            "id": "1nheqq7",
            "url": "/r/homeassistant/comments/1nheqq7/manufacturers_are_now_mandated_to_give_free/",
            "external_url": "https://i.redd.it/428e1zuez9pf1.jpeg",
            "title": "Manufacturers are now mandated to give free access to data in EU",
            "content_html": "<p>Today I learned that European Union's data act came into effect last Friday. One of the effects  is that manufacturers are now mandated to give access to all data collected from machines in EU. According to a news that I read they must give access to real time data feed. Companies are facing up to 4% yearly turnover in penalties if they fail to comply.\nAlso it was said that after 12th September 2026 it is not allowed to sell equipment that does not have compatibility with the new data act.\nI believe this is huge thing for our cause. Please read more, I just made this quick post with few points. I didn't find anything about this here.</p><div><br></div><img src=\"https://i.redd.it/428e1zuez9pf1.jpeg\" />",
            "date_published": "2025-09-15T06:48:14+00:00",
            "authors": [
                {
                    "name": "_not_a_FBI",
                    "url": "https://www.reddit.com/user/_not_a_FBI"
                }
            ]
        },
        {
            "id": "1ncjs02",
            "url": "/r/homeassistant/comments/1ncjs02/found_a_way_to_hide_my_new_zwave_antenna_zwa2/",
            "external_url": "https://i.redd.it/2ckp9beab5of1.jpeg",
            "title": "Found a way to hide my new zwave antenna (ZWA-2) from the wife.",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/2ckp9beab5of1.jpeg\" />",
            "date_published": "2025-09-09T14:02:33+00:00",
            "authors": [
                {
                    "name": "Starfs",
                    "url": "https://www.reddit.com/user/Starfs"
                }
            ]
        },
        {
            "id": "1n79w6d",
            "url": "/r/homeassistant/comments/1n79w6d/i_might_have_a_dashboard_addiction/",
            "external_url": "https://www.reddit.com/gallery/1n79w6d",
            "title": "I might have a dashboard addiction... 😅",
            "content_html": "<p>So… I told myself I’d <em>stop tweaking my Home Assistant dashboard</em> weeks ago.<br />\nFast forward → here I am at 3AM adjusting shadows, animations, and card layouts like my life depends on it.</p>\n<p>I’ll drop some screenshots below (because what’s the point of sleepless nights if not to show off 🤓).<br />\nA full YAML dump will come later once I clean up the chaos and make it shareable. </p>\n<p><strong>TL;DR</strong>:<br />\nIt’s a Material Design 3 inspired dashboard that dynamically adapts with:</p>\n<ul>\n<li>Gesture navigation</li>\n<li>Waterfall cards</li>\n<li>Pop-up cards</li>\n<li>Tabs &amp; swipe cards</li>\n<li>Expanders</li>\n<li>…and probably more things I forgot I added 🙃</li>\n</ul>\n<p>Some of the cards are inspired by awesome people in the community who kindly shared their hard work — I’ll be giving credit and including names in the<a href=\"https://github.com/reylinux/Material-Design-3-Dynamic-Dashboard/blob/main/README.md\"> GitHub repo</a> when I publish it. 💙</p>\n<p>Also worth noting: a few elements are hidden in the screenshots because of conditional rules I’ve set up, so you’re not seeing <em>everything</em> just yet. 😉</p>\n<p>Stay tuned for the <a href=\"https://github.com/reylinux/Material-Design-3-Dynamic-Dashboard/blob/main/README.md\">GitHub repo</a> + YAML! 🚀</p>",
            "date_published": "2025-09-03T09:11:04+00:00",
            "authors": [
                {
                    "name": "ElementZoom",
                    "url": "https://www.reddit.com/user/ElementZoom"
                }
            ]
        },
        {
            "id": "1n4d0wp",
            "url": "/r/homeassistant/comments/1n4d0wp/my_local_computer_store_has_a_shelly_section_now/",
            "external_url": "https://i.redd.it/6902m7w758mf1.jpeg",
            "title": "My local computer store has a Shelly section now",
            "content_html": "<p>I couldn't leave without getting something </p><div><br></div><img src=\"https://i.redd.it/6902m7w758mf1.jpeg\" />",
            "date_published": "2025-08-30T21:24:56+00:00",
            "authors": [
                {
                    "name": "Treypopj",
                    "url": "https://www.reddit.com/user/Treypopj"
                }
            ]
        },
        {
            "id": "1mxax1m",
            "url": "/r/homeassistant/comments/1mxax1m/shelly_they_know_their_audience/",
            "external_url": "https://youtu.be/ROKFXbfm2vo?si=_kx4_X9V5wk-RCou",
            "title": "Shelly. They know their audience...",
            "content_html": "",
            "date_published": "2025-08-22T16:17:55+00:00",
            "authors": [
                {
                    "name": "SuperSmudge90",
                    "url": "https://www.reddit.com/user/SuperSmudge90"
                }
            ]
        },
        {
            "id": "1mspagf",
            "url": "/r/homeassistant/comments/1mspagf/frosted_glass_v12_is_here_cleaner_cards_faster_ui/",
            "external_url": "https://www.reddit.com/gallery/1mspagf",
            "title": "Frosted Glass v1.2 is here: cleaner cards, faster UI, and a new Lite edition ✨",
            "content_html": "<p>Hey everyone!</p>\n<p>When I posted v1, I never expected the response it got. Your feedback, stars, downloads, and coffees absolutely floored me. Huge thank you to everyone who tried the theme and cheered me on. I built <strong>Frosted Glass</strong> for my own dashboard, but your reactions turned my world around and pulled me back into learning to code again. My only “dev” past was making Minecraft mods when I was about 14. Now I’m aiming to make this the theme people talk about and actually use every day.</p>\n<h1>What’s new in v1.2</h1>\n<ul>\n<li><strong>Glassy cards that look cleaner and more consistent</strong> in both Light and Dark</li>\n<li><strong>Smarter internals and small optimizations</strong> for smoother dashboards</li>\n<li><strong>New Lite edition</strong> that keeps the same glassy look without blur</li>\n<li>Designed for wall-mounted tablets and older devices</li>\n<li>Fixes the dropdown misplacement issue caused by blur</li>\n<li>Feels almost identical at a glance since it is still semi-transparent and uses same glassy look</li>\n</ul>\n<p>You can use <strong>Frosted Glass</strong>, <strong>Frosted Glass Light</strong>, <strong>Frosted Glass Dark</strong>, and the matching <strong>Lite</strong> versions.Install:</p>\n<ul>\n<li>Available in <strong>HACS</strong>. Search for <strong>Frosted Glass</strong> and install</li>\n<li>Requires <strong>card-mod</strong></li>\n<li>GitHub with screenshots and details: <a href=\"https://github.com/wessamlauf/homeassistant-frosted-glass-themes\"><code>https://github.com/wessamlauf/homeassistant-frosted-glass-themes</code></a></li>\n</ul>\n<p>I’ll drop a fresh screenshot in the post. If you try the Lite variant on an older tablet, I’d love to hear how it runs. Thanks again for all the support and the coffees. This community is the reason this project exists and keeps getting better. ❤️</p>\n<p>Happy theming!</p>\n<p>Original reddit post:  <a href=\"https://www.reddit.com/r/homeassistant/comments/1lqyodk/a_new_home_assistant_theme_frosted_glass/\">https://www.reddit.com/r/homeassistant/comments/1lqyodk/a_new_home_assistant_theme_frosted_glass/</a></p>",
            "date_published": "2025-08-17T12:12:34+00:00",
            "authors": [
                {
                    "name": "TheMrWessam",
                    "url": "https://www.reddit.com/user/TheMrWessam"
                }
            ]
        },
        {
            "id": "1mrthvg",
            "url": "/r/homeassistant/comments/1mrthvg/no_one_will_notice_i_am_here_sneak_100/",
            "external_url": "https://i.imgur.com/zOCMBL3.jpeg",
            "title": "\"No one will notice I am here, sneak 100\"",
            "content_html": "<div><br></div><img src=\"https://i.imgur.com/zOCMBL3.jpeg\" />",
            "date_published": "2025-08-16T12:12:15+00:00",
            "authors": [
                {
                    "name": "33Fraise33",
                    "url": "https://www.reddit.com/user/33Fraise33"
                }
            ]
        },
        {
            "id": "1mmferf",
            "url": "/r/homeassistant/comments/1mmferf/3d_printed_automatic_cabinet_door_for_a_hidden/",
            "external_url": "https://www.reddit.com/gallery/1mmferf",
            "title": "3D printed automatic cabinet door for a hidden Roborock station",
            "content_html": "<p><a href=\"https://imgur.com/a/mDbMSst\">Video here</a></p>\n<p>I wanted to share my latest 3D print for anyone interested in integrating Home Assistant with their smart home hardware.</p>\n<p>I keep my Roborock S7 MaxV station hidden under an IKEA Metod kitchen cabinet. Unfortunately, the vacuum is just a bit too tall to fit under the door, so I had to come up with a workaround.</p>\n<p>I designed the entire mechanism in Rhino, calculating the exact opening angle so I could also add a kickboard and completely hide the base. For the motor, I went with an Aqara E1, normally meant for smart curtains, because I didn’t want to bother with more complex custom electronics. It still provides more than enough torque to easily swing the door open.</p>\n<p>The door opens automatically based on the robot’s status, and the Aqara is plugged into a smart outlet that turns on depending on the battery level, so it’s only powered when needed.</p>\n<p>I’ll be uploading the STL to Printables soon for anyone who wants to give it a try.</p>",
            "date_published": "2025-08-10T10:45:46+00:00",
            "authors": [
                {
                    "name": "hyper_ganged",
                    "url": "https://www.reddit.com/user/hyper_ganged"
                }
            ]
        },
        {
            "id": "1mkx4uo",
            "url": "/r/homeassistant/comments/1mkx4uo/home_assistant_and_a_20_aqara_sensor_saved_my/",
            "external_url": "https://i.redd.it/wm1x9f0u5thf1.jpeg",
            "title": "Home Assistant and a $20 Aqara sensor saved my brand new house",
            "content_html": "<p>So, two days ago, u/Xibby posted <a href=\"https://www.reddit.com/r/homeassistant/s/tSOohTf1KB\">this PSA</a> about water leak sensors. I'm here to say that they are absolutely right. Gather round, boys and girls, because it's story time!</p>\n<p>Two days ago, we got a water softener installed in our new house. At first, it worked fine, and everything was completely normal - until, it wasn't.</p>\n<p>Last night, Home Assistant sent a notification to my phone that a leak sensor which I had placed next to the water softener had detected moisture. At first, I thought this was a little strange, and that perhaps the sensor was faulty. But, of course, I decided that I'd better go downstairs and investigate anyway.</p>\n<p>No sooner did I reach the basement that all hell broke loose. My utility room (which contains my server rack...thankfully untouched) and our storage room floors were FILLED with water. I still need to call the vendor that installed the water softener, but it appears to be an improper installation.</p>\n<p>Anyway, I went into full blown panic mode...I immediately shut off the water and called my wife, and we had to grab every mop and rag we could find to mop up all the water. And this was about 9pm, so I couldn't even run to Home Depot for...anything.</p>\n<p>Long story short, the leak was mostly contained to two rooms which concrete floors, although there is a wall that will likely need to be ripped open and inspected.</p>\n<p>But here's the kicker - I only installed that Aqara water leak sensor <em>yesterday afternoon</em> (one for the water tank, one for the softener) - about 5 hours before the leak.</p>\n<p>I can only shudder at the thought of how much worse this would have been if I hadn't set up the sensors when I did. Plus, the automation I set up only sent a single notification to my phone, which I only saw 10 minutes after it was sent.</p>\n<p>Before going to bed last night, I realized that if that sensor had been tripped in the middle of the night, things also would have been very different. But then I found a post by u/jpb on <a href=\"https://www.reddit.com/r/homeautomation/comments/xlxqts/i_got_home_assistant_to_use_pagerduty_to_notify_me/\">integrating PagerDuty notifications</a> into Home Assistant. Needless to say, my water leak sensors will now play an announcement on our Alexa speakers, as well as trigger a PD incident that will call and text me and my family repeatedly until we acknowledge the notifications.</p>\n<p>Water leak sensors are worth every penny...and needless to say, I will be buying a heck of a lot more of them. Every sink and toilet in the house is getting one of these!</p>\n<p>I cannot stress this enough - it doesn't matter what kind of house you have, or how old it is. You might think you don't need them, until you do. If you don't have water leak sensors...get them. <strong>Right freaking now.</strong></p><div><br></div><img src=\"https://i.redd.it/wm1x9f0u5thf1.jpeg\" />",
            "date_published": "2025-08-08T14:44:59+00:00",
            "authors": [
                {
                    "name": "Stealth022",
                    "url": "https://www.reddit.com/user/Stealth022"
                }
            ]
        },
        {
            "id": "1mjpzej",
            "url": "/r/homeassistant/comments/1mjpzej/so_visual_llc_is_working_great/",
            "external_url": "https://i.redd.it/9b0ons4dtihf1.jpeg",
            "title": "So…. Visual LLC is working great!!",
            "content_html": "<p>I have visual llm with a quirky prompt integrated using the person trigger from Reolink Poe Doorbell and Eleven Labs for text to speech to announce the response over whole house speakers.</p><div><br></div><img src=\"https://i.redd.it/9b0ons4dtihf1.jpeg\" />",
            "date_published": "2025-08-07T03:57:16+00:00",
            "authors": [
                {
                    "name": "askmeaboutmywenair",
                    "url": "https://www.reddit.com/user/askmeaboutmywenair"
                }
            ]
        },
        {
            "id": "1mj3hjn",
            "url": "/r/homeassistant/comments/1mj3hjn/state_of_this_sub_when_asked_about_how_to_best/",
            "external_url": "https://i.redd.it/ploxbcly8ehf1.jpeg",
            "title": "State of this sub when asked about how to best run HA",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/ploxbcly8ehf1.jpeg\" />",
            "date_published": "2025-08-06T12:36:16+00:00",
            "authors": [
                {
                    "name": "Improved-Liar",
                    "url": "https://www.reddit.com/user/Improved-Liar"
                }
            ]
        },
        {
            "id": "1mi6xne",
            "url": "/r/homeassistant/comments/1mi6xne/ah_recycling_is_this_week/",
            "external_url": "https://i.redd.it/alhh7hw2v6hf1.jpeg",
            "title": "Ah, recycling is this week.",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/alhh7hw2v6hf1.jpeg\" />",
            "date_published": "2025-08-05T11:45:42+00:00",
            "authors": [
                {
                    "name": "deanfourie1",
                    "url": "https://www.reddit.com/user/deanfourie1"
                }
            ]
        },
        {
            "id": "1mh9f19",
            "url": "/r/homeassistant/comments/1mh9f19/now_this_is_why_i_keep_using_ai_notifications/",
            "external_url": "https://i.redd.it/37mk4cxl8zgf1.png",
            "title": "Now THIS is why I keep using AI notifications",
            "content_html": "<p>Every now and again they still give me a nice chuckle </p><div><br></div><img src=\"https://i.redd.it/37mk4cxl8zgf1.png\" />",
            "date_published": "2025-08-04T10:07:05+00:00",
            "authors": [
                {
                    "name": "IRockSnackPacks",
                    "url": "https://www.reddit.com/user/IRockSnackPacks"
                }
            ]
        },
        {
            "id": "1mgm6qv",
            "url": "/r/homeassistant/comments/1mgm6qv/graphite_theme_now_has_eink_variants/",
            "external_url": "https://www.reddit.com/gallery/1mgm6qv",
            "title": "Graphite Theme Now Has E-Ink Variants",
            "content_html": "<p><a href=\"https://my.home-assistant.io/redirect/hacs_repository/?owner=TilmanGriesel&amp;repository=graphite\">https://my.home-assistant.io/redirect/hacs_repository/?owner=TilmanGriesel&amp;repository=graphite</a></p>\n<p><a href=\"https://github.com/TilmanGriesel/graphite\">https://github.com/TilmanGriesel/graphite</a>  </p>\n<p>It is raining the last days in Germany, feels like fall, so I created two new themes: <strong>Graphite E-Ink Light</strong> and <strong>Graphite E-Ink Dark</strong>. Same design language and simplicity of Graphite, but tuned for E-Ink displays. Always wanted to do it, now I finally did. And the best part, the name finally feels spot on.</p>\n<p>It’s the start of the E-Ink branch, so things might not be perfect, but I’d love your feedback to help shape them! The light one already looks great with some basic dashboard on my ONYX BOOX Palma. I think it could also work great on som info dashboards.</p>\n<p>Also gave the Theme Patcher some love, it's now a bit more flexible and robust. If you’re using it, I’d really appreciate any thoughts!</p>",
            "date_published": "2025-08-03T15:32:04+00:00",
            "authors": [
                {
                    "name": "Alarming_Divide_1339",
                    "url": "https://www.reddit.com/user/Alarming_Divide_1339"
                }
            ]
        },
        {
            "id": "1mcgcyf",
            "url": "/r/homeassistant/comments/1mcgcyf/shelly_has_officially_joined_the_works_with_home/",
            "external_url": "https://www.howtogeek.com/shelly-devices-are-getting-home-assistant-certified/",
            "title": "Shelly has officially joined the \"Works with Home Assistant\" program",
            "content_html": "<p>Shelly has officially joined the \"Works with Home Assistant\" program</p>",
            "date_published": "2025-07-29T16:38:31+00:00",
            "authors": [
                {
                    "name": "rubernck21",
                    "url": "https://www.reddit.com/user/rubernck21"
                }
            ]
        },
        {
            "id": "1mav5qj",
            "url": "/r/homeassistant/comments/1mav5qj/i_was_at_the_store_the_other_day_and_heard_a/",
            "external_url": "https://i.redd.it/syeit8c5xgff1.jpeg",
            "title": "I was at the store the other day and heard a massive thunder crack. The cashier pulled out their phone and \"lightning tracker\" app and I thought \"hmm, I could do that!\"",
            "content_html": "<p>Don't mind the fact that it was 1207km away, the storm had passed so I had to expand the range to pick up any lightning for testing. </p>\n<p>I've got it rate limited by a wait command so it doesn't overdo it on API calls to either Google maps (free tier) or the reverse geolocation API. </p><div><br></div><img src=\"https://i.redd.it/syeit8c5xgff1.jpeg\" />",
            "date_published": "2025-07-27T19:26:40+00:00",
            "authors": [
                {
                    "name": "zacharyd3",
                    "url": "https://www.reddit.com/user/zacharyd3"
                }
            ]
        },
        {
            "id": "1lwj0e4",
            "url": "/r/homeassistant/comments/1lwj0e4/after_3_years_of_tinkering_i_discovered_the_one/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1lwj0e4/after_3_years_of_tinkering_i_discovered_the_one/",
            "title": "After 3 years of tinkering, I discovered the one automation that made my wife actually LOVE Home Assistant",
            "content_html": "<p>You know that look. The one your partner gives you when you excitedly explain how you just spent 6 hours getting a temperature sensor to display correctly on your dashboard. Yeah, that look.</p>\n<p>I've been deep in the Home Assistant rabbit hole for 3 years now. Started with a few smart bulbs, now I have 187 entities, 4 ESP32 boards running ESPHome, custom Node-RED flows, and a dashboard that would make Tony Stark jealous. My wife? She just wanted the lights to work when she flipped the switch.</p>\n<p>Everything changed last month when our newborn arrived. Sleep deprivation hit HARD. One night at 3 AM, while stumbling to the nursery for the fifth time, I had an epiphany.</p>\n<p>I created what I call the \"Midnight Parent Mode\" automation. Here's what it does:</p>\n<ul>\n<li>Motion sensor detects movement in our bedroom between 11 PM - 6 AM</li>\n<li>Dims hallway lights to 5% warm white (just enough to see, not enough to wake you fully)</li>\n<li>Nursery door sensor triggers soft amber nightlight</li>\n<li>Temperature automatically adjusts to optimal baby sleep temp (68°F/20°C)</li>\n<li>White noise machine starts at low volume</li>\n<li>After 20 minutes of no motion, everything gradually fades back to off</li>\n</ul>\n<p>The kicker? I added a physical Zigbee button by the bed. One press activates \"feeding mode\" - slightly brighter lights, starts the bottle warmer (smart plug), and even logs the feeding time to a spreadsheet for the pediatrician.</p>\n<p>My wife's reaction? \"Why didn't you build THIS three years ago?!\"</p>\n<p>Now she's asking me to automate more things. ASKING. She even suggested we get presence sensors for the cars so the garage lights turn on automatically when we pull up.</p>\n<p><strong>The real lesson here:</strong> We get so caught up in what's technically possible that we forget to solve actual problems. Your family doesn't care about your perfect YAML or your 300ms response time. They care about things that make life easier.</p>\n<p>What's your \"spouse approval factor\" automation? I'm collecting ideas for Version 2.0 of Parent Mode!</p>",
            "date_published": "2025-07-10T17:40:39+00:00",
            "authors": [
                {
                    "name": "addicted-coffee",
                    "url": "https://www.reddit.com/user/addicted-coffee"
                }
            ]
        },
        {
            "id": "1lvks1s",
            "url": "/r/homeassistant/comments/1lvks1s/after_3_years_of_home_assistant_i_finally_cracked/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1lvks1s/after_3_years_of_home_assistant_i_finally_cracked/",
            "title": "After 3 years of Home Assistant, I finally cracked the code to WAF (Wife Acceptance Factor) - and it only took breaking everything twice",
            "content_html": "<p>You know that moment when your spouse gives you <em>the look</em> after the lights randomly turn on at 3 AM? Yeah, that was me last month. Again.</p>\n<p>I've been deep in the Home Assistant rabbit hole since 2022. Started with a single smart bulb, now running 147 devices across Zigbee, Z-Wave, WiFi, and even some ESP32s I flashed myself. But here's the thing - my family was ready to go back to regular switches after my \"clever\" automations kept failing at the worst times.</p>\n<p>The breaking point came when my presence detection failed during a dinner party. Picture this: 12 guests, fancy dinner, and suddenly the house thinks everyone left. Lights off. Music stops. Thermostat drops to away mode. My mother-in-law literally asked if we forgot to pay the electric bill.</p>\n<p>So I spent the next two weeks rebuilding EVERYTHING with one goal: make it invisible. No more \"hey Google,\" no more explaining why the bathroom fan runs for exactly 7 minutes, no more debugging in front of guests.</p>\n<p>Here's what actually worked:</p>\n<ul>\n<li>Ditched WiFi presence detection for these $12 Aqara FP2 sensors (seriously, mmWave is magic)</li>\n<li>Created \"manual override\" switches that disable automations for 2 hours when toggled</li>\n<li>Built a hidden dashboard showing what automation is controlling each room</li>\n<li>Added a \"guest mode\" that simplifies everything to basic on/off</li>\n<li>Most importantly: every automation now has a 10-second delay before triggering, giving people time to manually override</li>\n</ul>\n<p>The result? My wife now ASKS me to automate things. Last week she said \"can you make the coffee machine turn on when I enter the kitchen in the morning?\" I nearly cried.</p>\n<p>The real secret wasn't better code or fancier sensors. It was accepting that the best automation is the one nobody notices. Your family doesn't care about your perfectly crafted Node-RED flows - they just want the lights to work.</p>\n<p>Anyone else struggle with the WAF challenge? What's your biggest automation fail that taught you something valuable?</p>",
            "date_published": "2025-07-09T14:51:39+00:00",
            "authors": [
                {
                    "name": "addicted-coffee",
                    "url": "https://www.reddit.com/user/addicted-coffee"
                }
            ]
        },
        {
            "id": "1lrijwl",
            "url": "/r/homeassistant/comments/1lrijwl/hi_everyone_im_clooos_the_bubble_card_developer/",
            "external_url": "https://www.reddit.com/gallery/1lrijwl",
            "title": "Hi everyone! I'm Clooos, the Bubble Card developer, and it's been quite a while since I last posted here. Today, after 5 (incredible) months of development and beta testing, I’m finally releasing Bubble Card 3 on HACS, the biggest update I’ve ever released for this project ❤️",
            "content_html": "<p>As you can see in these screenshots, the main new feature is the Module System, which brings something I’ve wanted to include for a long time: better modularity, a smoother setup process, and more tools directly in the editor.</p>\n<p>With the new Module Store and Module Editor, you can now install, update, customize, and even create modules without ever leaving the editor. It makes everything feel much more easier and flexible, whether you're just exploring or building something more advanced. No more copying and pasting styles or templates into every card, now everything can be managed globally.</p>\n<p>You can even add your own form fields in the editor, just like with any Home Assistant feature (e.g. the color picker in one of these screenshots). This means you can now share your modules with anyone, even if they’re not comfortable with code. And to make that even easier, the built-in Module Store lets you browse and install modules in a couple of clicks. Just like any app store!</p>\n<p>The community has already started sharing some amazing modules, and I believe this will really help bring everyone closer and make the whole ecosystem even more advanced.</p>\n<p>This update also introduces a brand new card: a full Calendar Card! Add to that better pop-up creation, smoother sliders, a more polished editor, dozens of improvements, and the fact that most of the code has been rewritten, and you get one of the biggest updates Bubble Card has ever had.</p>\n<p>I won’t go into everything here, since the changelog is much longer. You can check it out here:<br />\n<a href=\"https://github.com/Clooos/Bubble-Card/releases/tag/v3.0.0\"><em>https://github.com/Clooos/Bubble-Card/releases/tag/v3.0.0</em></a></p>\n<p>I also made a short video showing the new features in action, feel free to check it out:<br />\n<a href=\"https://youtu.be/zL-z5GG3p7Y\"><em>https://youtu.be/zL-z5GG3p7Y</em></a></p>\n<p>Most importantly, I want to say thank you to all of you. For the kind words I get almost every day, for your help testing and sharing ideas, and for your support. I'm really proud of how far this release has come, and incredibly grateful for this amazing community.</p>\n<p>Have fun with this new version. I can’t wait for your feedback, to see what you’ll build with it and what new modules will show up in the store!  </p>\n<p>Cheers everyone! 🍻</p>",
            "date_published": "2025-07-04T13:18:43+00:00",
            "authors": [
                {
                    "name": "Clooooos",
                    "url": "https://www.reddit.com/user/Clooooos"
                }
            ]
        },
        {
            "id": "1lqyodk",
            "url": "/r/homeassistant/comments/1lqyodk/a_new_home_assistant_theme_frosted_glass/",
            "external_url": "https://www.reddit.com/gallery/1lqyodk",
            "title": "A New Home Assistant Theme: Frosted Glass ✨",
            "content_html": "<p>I'm pleased to announce the release of a new theme for Home Assistant, Frosted Glass. This theme is the culmination of five months of dedicated work, drawing inspiration from popular themes like Graphite, Material You, and iOS Theme, while incorporating a distinct modern aesthetic.</p>\n<p>My journey into the Home Assistant ecosystem began five months ago, and I've been consistently impressed by the supportive and helpful community. This positive experience, coupled with the desire for a theme that perfectly aligned with my visual preferences, led to the development of Frosted Glass.</p>\n<p>Installation:\nCurrently, the Frosted Glass theme isn't available through HACS directly. However, you can install it via one of two methods:</p>\n<ul>\n<li>\n<p>Custom Repository: Add the theme as a custom repository within HACS.</p>\n</li>\n<li>\n<p>Manual Installation: Download the YAML file directly from the GitHub repository and place it in your /themes folder.</p>\n</li>\n</ul>\n<p>Access the Theme:\nThe Frosted Glass theme is available for review and download on GitHub:</p>\n<p>https://github.com/wessamlauf/homeassistant-frosted-glass-themes</p>\n<p>I welcome your feedback and constructive criticism as I continue to refine and enhance the Frosted Glass theme. ❤️</p>",
            "date_published": "2025-07-03T19:34:16+00:00",
            "authors": [
                {
                    "name": "TheMrWessam",
                    "url": "https://www.reddit.com/user/TheMrWessam"
                }
            ]
        },
        {
            "id": "1lljfh0",
            "url": "/r/homeassistant/comments/1lljfh0/this_is_t800model101s_wife/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1lljfh0/this_is_t800model101s_wife/",
            "title": "This is T800model101's wife.",
            "content_html": "<p>Hi everyone.  This is T800model101's wife.  He left his browser open.  Could you please please please stop giving him ideas about Homeassistant.  He keeps talking about docker pants and having ESP and something about making the toaster react to his presence.  I just need my husband back.  Thank you!  </p>",
            "date_published": "2025-06-27T03:08:22+00:00",
            "authors": [
                {
                    "name": "T850Model101",
                    "url": "https://www.reddit.com/user/T850Model101"
                }
            ]
        },
        {
            "id": "1lj7sjb",
            "url": "/r/homeassistant/comments/1lj7sjb/i_think_i_am_finally_done/",
            "external_url": "https://www.reddit.com/gallery/1lj7sjb",
            "title": "I Think I am Finally Done",
            "content_html": "<p>This isn’t meant to brag—I’ve learned so much from the amazing work shared by others in the community, and I’d love to give back. I've been working on a project that I think some of you might find useful or inspiring. Below are six screenshots showcasing what I’ve built so far.</p>\n<p>As usual, I’ll include all the HACS integrations I’ve used and give full credit to the incredible people whose work made this possible.</p>\n<p>I’m planning to write up a proper GitHub page for it this weekend. If you're interested, here’s the placeholder link: <a href=\"https://github.com/reylinux/Dark-Transparent-Tablet-Dashboard\"><strong>reylinux/Dark-Transparent-Tablet-Dashboard</strong></a></p>\n<p><strong>First Image Details</strong></p>\n<p>This is the homepage where you can find the most important stuffs.</p>\n<ul>\n<li>1st row: clock, date, weather forecast information, and room occupancy toggles (to trigger climate automation). Moving to the right we've got indoor / outdoor temp with climate control for the first tab, and sprinkler control on the other tab. Then we have a media with speaker count, and calendar to fit schedules of mine, wife, and special events, with alarm and a count of notification that links to the notification/weather panel/alarm that I will explain a bit later.</li>\n<li>2nd row: room cards with temp/humidity readings, light switch, a count of open door / windows (when applicable). </li>\n<li>3rd row: four main cameras for quick action. I had an issue with swipe card earlier so currently only displaying four of them.</li>\n</ul>\n<p><strong>Second Image Details</strong></p>\n<p>This is an example of a room. Let's divide this into three sections from left to right.</p>\n<ul>\n<li>Left section: lighting controls. You'll swipe left or right to control the brightness of the lights. And the bottom section is a collapsible card to make it tidy for the lights that we don't usually control.</li>\n<li>Middle section: Temp / Humidity readings with a waterfall card that has a similar hex value on each threshold. My lowest to the highest temperature gradient is deep purple &gt; purple &gt; light blue &gt; green &gt; yellow &gt; orange &gt; red. For humidity there are only red and green.</li>\n<li>Right section: this is only for a pure aesthetic to fill the page nicely and will have a night / day look into it depends on the time.</li>\n</ul>\n<p><strong>Third Image Details</strong></p>\n<p>This is a notification / weather panel. </p>\n<ul>\n<li>Left section: Currently it's only showing 1 speaker playing a music. It has hidden chips for recycle day, dryer / washing, etc.. Below it, will show what lights that currently active.</li>\n<li>Middle section: this area contains weather status, forecast, and warnings if any (currently there's none)</li>\n<li>Right section: an iframe from <a href=\"http://Windy.com\">Windy.com</a> which has plenty of other map variations.</li>\n</ul>\n<p><strong>Fourth Image Details</strong></p>\n<p>This page contains all the cameras. I am using Reolink CX410 / CX810, and E1 Pro. Under each camera, I've assigned the light switches in that area / the closest area for quick action.</p>\n<p><strong>Fifth Image Details</strong></p>\n<p>This page has scenes that I like. It is handled by automation and scripts to only run for hue lights in Living Area (10+ lights). There will be an off button once I run the scene, and it will only switch the lights back to normal where the sensors detect us and turn the rest of it gracefully with 2 seconds delay on each light in an order with 3s transition time.</p>\n<p><strong>Six Image Details</strong></p>\n<p>Last but not least, an Alarmo dedicated page. I've set this recently and it was super fun to turn the lights into red and run the alarm siren sound throughout the living area with 8x Google Minis.</p>",
            "date_published": "2025-06-24T10:43:39+00:00",
            "authors": [
                {
                    "name": "ElementZoom",
                    "url": "https://www.reddit.com/user/ElementZoom"
                }
            ]
        },
        {
            "id": "1lbbxff",
            "url": "/r/homeassistant/comments/1lbbxff/need_help/",
            "external_url": "https://i.redd.it/uh39vh6uzw6f1.jpeg",
            "title": "Need help",
            "content_html": "<p>This item arrived in the mail recently. I've been working to set it up, but I can't seem to connect it to Bluetooth, WiFi, Zigbee or Z-wave. It does hold coffee, so I have made progress there. Is there a HACS or Add On I can use to automate this device?</p><div><br></div><img src=\"https://i.redd.it/uh39vh6uzw6f1.jpeg\" />",
            "date_published": "2025-06-14T15:53:02+00:00",
            "authors": [
                {
                    "name": "getridofwires",
                    "url": "https://www.reddit.com/user/getridofwires"
                }
            ]
        },
        {
            "id": "1l82yf7",
            "url": "/r/homeassistant/comments/1l82yf7/who_manufactures_the_sun/",
            "external_url": "https://i.redd.it/viesuqgqk46f1.jpeg",
            "title": "Who manufactures the sun?",
            "content_html": "<p>Kind of a philosophical question I guess </p><div><br></div><img src=\"https://i.redd.it/viesuqgqk46f1.jpeg\" />",
            "date_published": "2025-06-10T16:18:30+00:00",
            "authors": [
                {
                    "name": "Chemical-Tonight-390",
                    "url": "https://www.reddit.com/user/Chemical-Tonight-390"
                }
            ]
        },
        {
            "id": "1l5lzvc",
            "url": "/r/homeassistant/comments/1l5lzvc/i_recycled_my_iphone_to_make_a_3d_printed_clock/",
            "external_url": "https://i.redd.it/jxz0r1edli5f1.jpeg",
            "title": "I recycled my iPhone to make a 3D printed clock that displays a simple dashboard",
            "content_html": "<p>At that time it displays time, today’s weather and door lock and alarm states. It also shows if plants need to be watered and if it’s garbage and/or recycle day.</p>\n<p>Home modeled and printed stand, with a wireless charger inside. On a Zigbee plug to keep it charged between 25% and 75%.</p>\n<p>I am also waiting for a Zigbee presence sensor to monitor if the screen has to be on or off.</p><div><br></div><img src=\"https://i.redd.it/jxz0r1edli5f1.jpeg\" />",
            "date_published": "2025-06-07T14:23:05+00:00",
            "authors": [
                {
                    "name": "yozzzzzz",
                    "url": "https://www.reddit.com/user/yozzzzzz"
                }
            ]
        },
        {
            "id": "1l1d5ko",
            "url": "/r/homeassistant/comments/1l1d5ko/designed_a_couchfriendly_touch_screen_for_quick/",
            "external_url": "https://i.redd.it/45vxbfsvah4f1.jpeg",
            "title": "Designed a couch-friendly touch screen for quick control of nearby devices",
            "content_html": "<p>Wanted easy access to air con, door lock and volume controls from either side of the couch. I found these cheap round touch screens from Ali Express and programmed them using ESPHome and LVGL to control Home Assistant.</p>\n<p>Super convenient to be able to control:\n    •   Air con\n    •   Both front door and apartment intercom unlock (if someone rings the doorbell I can let them in without moving 😅)\n    •   Volume (faster than 1 notch at a time Apple TV remote)\n    •   Lights (100%, 15%, 0%)</p>\n<p>Means you don’t need to figure out where your phone is and can quickly control this stuff. I’ve got a screen on either side of the couch.</p><div><br></div><img src=\"https://i.redd.it/45vxbfsvah4f1.jpeg\" />",
            "date_published": "2025-06-02T08:58:10+00:00",
            "authors": [
                {
                    "name": "Samywamy10",
                    "url": "https://www.reddit.com/user/Samywamy10"
                }
            ]
        },
        {
            "id": "1kvtoqx",
            "url": "/r/homeassistant/comments/1kvtoqx/home_assistant_community_day_in_darmstadt_germany/",
            "external_url": "https://www.reddit.com/gallery/1kvtoqx",
            "title": "Home Assistant Community Day in Darmstadt Germany",
            "content_html": "<p>Hello everyone,<br />\nSeeing the other posts pop up I thought we from Darmstadt don't want to miss the party. <br />\nI have attached my pictures for you to enjoy.</p>\n<p>Big thanks to the Chaos Computer Club in Darmstadt for offering their area to host the Home Assistant Community Day 2025 their.</p>\n<p>Also the Pizza was really tasty 😉</p>",
            "date_published": "2025-05-26T12:57:12+00:00",
            "authors": [
                {
                    "name": "Smartzeug",
                    "url": "https://www.reddit.com/user/Smartzeug"
                }
            ]
        },
        {
            "id": "1kulr31",
            "url": "/r/homeassistant/comments/1kulr31/home_assistant_community_day_in_utrecht_the/",
            "external_url": "https://www.reddit.com/gallery/1kulr31",
            "title": "Home Assistant Community Day in Utrecht, the Netherlands",
            "content_html": "<p>On Saturday I visited the Home Assistant Community Day in Utrecht, the Netherlands. A gathering of about 200 people who have together 1 hobby! </p>\n<p>A lot of sharing experiences and getting new ideas. There was a pubquiz about Home Assistant where I ended up as 4th (without calculating the number 2 &amp; 3 who work for Home Assistant 🤣). On the photo with Franck Nijhof  &amp; Ed (SmartHomeJunkie on e.g. YouTube).</p>\n<p>Overal a great afternoon.</p>\n<h1>HADay2025 #HomeAssistant #Smarthome</h1>",
            "date_published": "2025-05-24T21:02:01+00:00",
            "authors": [
                {
                    "name": "WHagenauw",
                    "url": "https://www.reddit.com/user/WHagenauw"
                }
            ]
        },
        {
            "id": "1kmlnqa",
            "url": "/r/homeassistant/comments/1kmlnqa/smart_laundry_scale/",
            "external_url": "https://www.reddit.com/gallery/1kmlnqa",
            "title": "Smart laundry scale",
            "content_html": "<p>I’ve always had trouble keeping up with laundry and ended up with a mountain of clothes before I realized it was time to wash them. So, I decided to fix the problem with a bit of home automation.</p>\n<p>This uses Home Assistant, ESPHome, an ESP32, and a few load cells with an HX711 board. Not gonna lie, I had to 3d print the load cell brackets to justify the Bambulab purchase. </p>\n<p>Now with just a quick glance I can see exactly how much laundry is waiting in the basket. And if it goes over 4 kg, I get a notification the next morning reminding me to load the washing machine before heading to work.</p>\n<p>No more last-minute laundry marathons!</p>",
            "date_published": "2025-05-14T17:49:48+00:00",
            "authors": [
                {
                    "name": "luchoelzurdo",
                    "url": "https://www.reddit.com/user/luchoelzurdo"
                }
            ]
        },
        {
            "id": "1ki0o6m",
            "url": "/r/homeassistant/comments/1ki0o6m/nice_way_to_clean_up_the_dashboard_using_expander/",
            "external_url": "https://i.redd.it/7olr04k3dmze1.png",
            "title": "Nice way to clean up the dashboard using Expander Card",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/7olr04k3dmze1.png\" />",
            "date_published": "2025-05-08T20:41:36+00:00",
            "authors": [
                {
                    "name": "chimph",
                    "url": "https://www.reddit.com/user/chimph"
                }
            ]
        },
        {
            "id": "1kdip17",
            "url": "/r/homeassistant/comments/1kdip17/are_you_kidding_me/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1kdip17/are_you_kidding_me/",
            "title": "Are you kidding me?!",
            "content_html": "<p>I just can't right now.</p>\n<p>I am extremely disappointed with the new backup and restore that the DEVs at HA have forced on us.</p>\n<p>I had to replace my cheapo mini PC due to stability issues. I purchased a nice fan less unit and was really looking forward to digging into this migration after work today.</p>\n<p>I thought that I would get a jump on the weekends worth of work and installed the HASSOS image during lunch. I put my nabu casa credentials in the welcome screen and then told it to restore my back up.</p>\n<p>Needless to say, the restore was done and my HA was back up and running before my lunch break was over. No issues at all!</p>\n<p>Now what am I supposed to do all weekend? Yardwork? Thanks DEVs!</p>",
            "date_published": "2025-05-03T02:40:43+00:00",
            "authors": [
                {
                    "name": "imonlinux",
                    "url": "https://www.reddit.com/user/imonlinux"
                }
            ]
        },
        {
            "id": "1k8ijf3",
            "url": "/r/homeassistant/comments/1k8ijf3/esphomebased_retro_voice_assistant/",
            "external_url": "https://www.reddit.com/gallery/1k8ijf3",
            "title": "ESPHome-based retro voice assistant",
            "content_html": "<p>Not the first one with this idea but I wanted to build my own. This one has an ESP built into the handset with I2S microphone and speaker.</p>\n<p>The microphone is only listening when the handset is picked up, so I don't need any wake-word detection.</p>\n<p>The rotary dial is implemented as a Text-Sensor that publishes the number that was dialed and you can of course trigger any automation based on that.</p>\n<p>It connects like any other ESPHome device with home assistant and doesn't need any external hardware (except a USB-C cable to supply power)</p>",
            "date_published": "2025-04-26T17:37:51+00:00",
            "authors": [
                {
                    "name": "wunschpunsch3D",
                    "url": "https://www.reddit.com/user/wunschpunsch3D"
                }
            ]
        },
        {
            "id": "1k71tcq",
            "url": "/r/homeassistant/comments/1k71tcq/bin_counting_with_gemini/",
            "external_url": "https://i.redd.it/4bddd2459uwe1.png",
            "title": "Bin Counting With Gemini",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/4bddd2459uwe1.png\" />",
            "date_published": "2025-04-24T19:59:10+00:00",
            "authors": [
                {
                    "name": "daern2",
                    "url": "https://www.reddit.com/user/daern2"
                }
            ]
        },
        {
            "id": "1k56401",
            "url": "/r/homeassistant/comments/1k56401/my_buddy_didnt_believe_me_when_i_told_him_this_is/",
            "external_url": "https://i.redd.it/1q8zmkr30ewe1.jpeg",
            "title": "My buddy didn’t believe me when I told him this is Home Assistant",
            "content_html": "<p>Just a little appreciation post, as I’m becoming increasingly content with everything HA has to offer. To all the devs working hard out there feel free to drop your info so I can buy you a coffee. Your work does not go unnoticed :)</p><div><br></div><img src=\"https://i.redd.it/1q8zmkr30ewe1.jpeg\" />",
            "date_published": "2025-04-22T13:19:20+00:00",
            "authors": [
                {
                    "name": "-ManWhat",
                    "url": "https://www.reddit.com/user/-ManWhat"
                }
            ]
        },
        {
            "id": "1k0epeg",
            "url": "/r/homeassistant/comments/1k0epeg/my_work_in_progress_floorplan_dashboard/",
            "external_url": "https://www.reddit.com/gallery/1k0epeg",
            "title": "My (work in progress) Floorplan Dashboard",
            "content_html": "<p>I've been using Home Assistant for many years, but I wanted to start a project to display information and controls on an easily accessible tablet mounted up in the house.  </p>\n<p>My goal was to create something aesthetic but also really simple and intuitive for my family and guests to use, and I think floorplan designs are really great for that. Lovelace is lovely, but once I start explaining which tab or section to find certain controls on, I can see eyes glaze over and I lose the people really quickly.  </p>\n<p>One of my inspirations is Madelena's really great dashboard:  <a href=\"https://www.reddit.com/r/homeassistant/comments/uc79cv/a_maximalist_approach_on_designing_the_ha/\">https://www.reddit.com/r/homeassistant/comments/uc79cv/a_maximalist_approach_on_designing_the_ha/</a>  <br />\nBut while I personally love the style of maximalist info overload, for my intended audience, I tried to only pack in as much information as I could without cluttering anything.  </p>\n<p>So I've been working on a whole new dashboard using ha-floorplan and just wanted to share my progress so far. This is a very rough work-in-progress with a lot of placeholder images and non-finalized styling.  I also have yet to add a lot of features:  </p>\n<ul>\n<li>media controls</li>\n<li>camera feeds</li>\n<li>RGB lighting visualizations</li>\n<li>device battery indicators</li>\n</ul>\n<p>I'd love to hear the thoughts from the community, and please throw me any suggestions and ideas to incorporate!</p>\n<p>Here are some vids to show the dash in action:<br />\n<a href=\"https://youtube.com/shorts/2gq_aCzacX0?feature=share\">https://youtube.com/shorts/2gq_aCzacX0?feature=share</a>  <br />\n<a href=\"https://youtube.com/shorts/Q2EmermGk48?feature=share\">https://youtube.com/shorts/Q2EmermGk48?feature=share</a>  </p>",
            "date_published": "2025-04-16T07:34:13+00:00",
            "authors": [
                {
                    "name": "tozim",
                    "url": "https://www.reddit.com/user/tozim"
                }
            ]
        },
        {
            "id": "1jxo7cg",
            "url": "/r/homeassistant/comments/1jxo7cg/forget_wife_approval_i_got_the_coveted_mil/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1jxo7cg/forget_wife_approval_i_got_the_coveted_mil/",
            "title": "Forget Wife approval, I got the coveted MIL approval!",
            "content_html": "<p>Wife and I went on a vacation and my MIL dog sat at our house.  My wife STILL prefers home kit but I couldn't add my MIL as a guest in our house. So, I just installed HA on her phone with her own account and logged her in. </p>\n<p>When we got back I asked her if she had any issues with the smart home features (blinds, locks, lights, etc) and she said.</p>\n<p>\"No, the app you give me was so useful that I never had to worry about anything. I just opened it and it let me know what was still on and in which area. It was great!\"</p>\n<p>We're talking boomer age here.  I've never felt more vindicated. </p>",
            "date_published": "2025-04-12T18:40:29+00:00",
            "authors": [
                {
                    "name": "DiaDeLosMuebles",
                    "url": "https://www.reddit.com/user/DiaDeLosMuebles"
                }
            ]
        },
        {
            "id": "1jqkr21",
            "url": "/r/homeassistant/comments/1jqkr21/the_wife_approved_the_dashboard/",
            "external_url": "https://www.reddit.com/gallery/1jqkr21",
            "title": "The wife approved the dashboard",
            "content_html": "<p>Been playing around with making a dashboard for the home and the wife approved it! Was quite fun to build and to be honest i was just playing around seeing how far i could push the UI and came up with this. </p>\n<p>It certainly wont be for everyone which is fine, we all have our own tastes hey! I like a clean 'ish' look so thats what i went with. In the end I only used 3 cards in total. The custom-layout card, custom-button card and a light slider card. Used quite a few variables to make building things a little quicker</p>\n<p>This was version 2 and condensed down to just one screen rather than sliding through menus like before.</p>\n<p>A quick screen grab for those interested<br />\n<a href=\"https://imgur.com/a/nfvbEQU\">https://imgur.com/a/nfvbEQU</a></p>",
            "date_published": "2025-04-03T15:01:57+00:00",
            "authors": [
                {
                    "name": "iamtherufus",
                    "url": "https://www.reddit.com/user/iamtherufus"
                }
            ]
        },
        {
            "id": "1jmhj7p",
            "url": "/r/homeassistant/comments/1jmhj7p/well_that_escalated_quickly/",
            "external_url": "https://i.redd.it/xslagsrb6lre1.jpeg",
            "title": "Well that escalated quickly…",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/xslagsrb6lre1.jpeg\" />",
            "date_published": "2025-03-29T08:06:02+00:00",
            "authors": [
                {
                    "name": "abird3132",
                    "url": "https://www.reddit.com/user/abird3132"
                }
            ]
        },
        {
            "id": "1jm3omu",
            "url": "/r/homeassistant/comments/1jm3omu/calendar_card_pro_v22_released/",
            "external_url": "https://i.redd.it/okhyen1ehhre1.png",
            "title": "🎉 CALENDAR CARD PRO v2.2 RELEASED! 🎉",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/okhyen1ehhre1.png\" />",
            "date_published": "2025-03-28T19:41:26+00:00",
            "authors": [
                {
                    "name": "Short_Ad5978",
                    "url": "https://www.reddit.com/user/Short_Ad5978"
                }
            ]
        },
        {
            "id": "1jkyak0",
            "url": "/r/homeassistant/comments/1jkyak0/i_dont_know_what_to_say/",
            "external_url": "https://i.redd.it/kfks6lann6re1.jpeg",
            "title": "I don't know what to say",
            "content_html": "<p>PS: I get the result I wanted at the end. I just found that very funny and wanted to share a laugh with everyone</p><div><br></div><img src=\"https://i.redd.it/kfks6lann6re1.jpeg\" />",
            "date_published": "2025-03-27T07:16:22+00:00",
            "authors": [
                {
                    "name": "ElementZoom",
                    "url": "https://www.reddit.com/user/ElementZoom"
                }
            ]
        },
        {
            "id": "1jkk5oo",
            "url": "/r/homeassistant/comments/1jkk5oo/new_chatgpt_model_great_for_creating_3d/",
            "external_url": "https://www.reddit.com/gallery/1jkk5oo",
            "title": "New ChatGPT model great for creating 3d floorplans of your rooms",
            "content_html": "",
            "date_published": "2025-03-26T19:21:09+00:00",
            "authors": [
                {
                    "name": "GMScreech",
                    "url": "https://www.reddit.com/user/GMScreech"
                }
            ]
        },
        {
            "id": "1ji8qnk",
            "url": "/r/homeassistant/comments/1ji8qnk/calendar_card_pro_for_home_assistant_v200_released/",
            "external_url": "https://www.reddit.com/gallery/1ji8qnk",
            "title": "Calendar Card Pro for Home Assistant - v2.0.0 Released",
            "content_html": "",
            "date_published": "2025-03-23T20:22:31+00:00",
            "authors": [
                {
                    "name": "Short_Ad5978",
                    "url": "https://www.reddit.com/user/Short_Ad5978"
                }
            ]
        },
        {
            "id": "1jgv06o",
            "url": "/r/homeassistant/comments/1jgv06o/literally_happened_today/",
            "external_url": "https://i.redd.it/vtqt7n0xp4qe1.jpeg",
            "title": "Literally happened today",
            "content_html": "<p>And now i started replacing some buttons with badges, changed theme 4 times and are looking for ideas for fresh room cards.</p><div><br></div><img src=\"https://i.redd.it/vtqt7n0xp4qe1.jpeg\" />",
            "date_published": "2025-03-21T23:41:24+00:00",
            "authors": [
                {
                    "name": "MilkyGoat22",
                    "url": "https://www.reddit.com/user/MilkyGoat22"
                }
            ]
        },
        {
            "id": "1jfwnzu",
            "url": "/r/homeassistant/comments/1jfwnzu/poe_mmwave_sensor_its_official/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1jfwnzu/poe_mmwave_sensor_its_official/",
            "title": "PoE mmWave Sensor: It’s Official!",
            "content_html": "<p>Hi everyone! In our <a href=\"https://www.reddit.com/r/homeassistant/comments/1jahptr/should_we_launch_a_poe_mmwave_sensor_next/\">last post</a>, we asked whether we should make a PoE (Power over Ethernet) version of our existing mmWave sensor, the <a href=\"https://sensy-one.com/products/sensy-one-s1\">Sensy-One S1,</a> and your overwhelming response made our decision an easy one! We’re excited to announce that the PoE version is now in development!</p>\n<p><a href=\"https://preview.redd.it/x7gr1gqw2wpe1.png?width=539&amp;format=png&amp;auto=webp&amp;s=83fcca643fbba98c81606c35cab2a5649514fe4d\">ESP32-S3-POE-ETH (dev)</a></p>\n<p>If you don’t need PoE, the original Sensy-One S1 is still available, and if you want to be the first to know when the PoE model launches (targeting early to mid-April), make sure to <a href=\"https://sensy-one.com/\">subscribe</a> on our website for updates!</p>\n<p>In the meantime, you can check out our <a href=\"https://www.youtube.com/watch?v=H-Rij8gbK3s\">YouTube</a> video for an in-depth look at the S1 and explore our <a href=\"https://github.com/sensy-one/mmwave-sensor\">GitHub</a> repository for all the documentation. Thanks again for your support, and I can’t wait to share more news soon!</p>",
            "date_published": "2025-03-20T19:03:05+00:00",
            "authors": [
                {
                    "name": "Technical_Raisin_246",
                    "url": "https://www.reddit.com/user/Technical_Raisin_246"
                }
            ]
        },
        {
            "id": "1jf2j7v",
            "url": "/r/homeassistant/comments/1jf2j7v/is_shelly_trying_to_push_everyone_out_of_the/",
            "external_url": "https://i.redd.it/bdurqg0plope1.jpeg",
            "title": "Is Shelly trying to push everyone out of the market? Damn! Gen4 devices",
            "content_html": "<p>A picture is worth 1000 words. Why bother with anything elsw</p><div><br></div><img src=\"https://i.redd.it/bdurqg0plope1.jpeg\" />",
            "date_published": "2025-03-19T17:29:13+00:00",
            "authors": [
                {
                    "name": "Lazy-Philosopher-234",
                    "url": "https://www.reddit.com/user/Lazy-Philosopher-234"
                }
            ]
        },
        {
            "id": "1jawr34",
            "url": "/r/homeassistant/comments/1jawr34/the_magic_mirror_in_my_bathroom_that_i_realized/",
            "external_url": "https://i.redd.it/mokku7hrcloe1.jpeg",
            "title": "The magic mirror in my bathroom, that I realized with Homeassistant",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/mokku7hrcloe1.jpeg\" />",
            "date_published": "2025-03-14T05:30:46+00:00",
            "authors": [
                {
                    "name": "Individual_Cod_4726",
                    "url": "https://www.reddit.com/user/Individual_Cod_4726"
                }
            ]
        },
        {
            "id": "1j8arqy",
            "url": "/r/homeassistant/comments/1j8arqy/ha_is_now_officially_matter_certified/",
            "external_url": "https://www.home-assistant.io/blog/2025/03/10/matter-certification/",
            "title": "HA is now officially Matter certified!!!! 🎊🎊🎊🎊🎊",
            "content_html": "<p>Text from Home Assistant’s LinkedIn post </p>\n<p>“We're Matter certified!! 🎉</p>\n<p>We've been ahead of the game with Matter implementation, and we're excited to announce both Home Assistant and the Open Home Foundation Matter Server are officially certified by the CSA. 😌</p>\n<p>What does this mean for you? Find out on our blog 👇🏼</p>\n<p>Huge thanks to Resillion for helping us with the testing for certification! 👏🏻”</p>\n<p>We've been ahead of the game with Matter implementation, and we're excited to announce both Home Assistant and the Open Home Foundation Matter Server are officially certified by the CSA. 😌</p>\n<p>What does this mean for you? Find out on our blog 👇🏼</p>\n<p>Huge thanks to Resillion for helping us with the testing for certification! </p>",
            "date_published": "2025-03-10T22:02:13+00:00",
            "authors": [
                {
                    "name": "n1976jmk",
                    "url": "https://www.reddit.com/user/n1976jmk"
                }
            ]
        },
        {
            "id": "1j86z2r",
            "url": "/r/homeassistant/comments/1j86z2r/matter_server_gets_certified/",
            "external_url": "https://www.home-assistant.io/blog/2025/03/10/matter-certification/",
            "title": "Matter server gets certified",
            "content_html": "",
            "date_published": "2025-03-10T19:22:51+00:00",
            "authors": [
                {
                    "name": "HTTP_404_NotFound",
                    "url": "https://www.reddit.com/user/HTTP_404_NotFound"
                }
            ]
        },
        {
            "id": "1j6md1i",
            "url": "/r/homeassistant/comments/1j6md1i/undocumented_backdoor_found_in_esp32_bluetooth/",
            "external_url": "https://i.redd.it/k7k8j9qg5ine1.jpeg",
            "title": "Undocumented backdoor found in ESP32 bluetooth chip used in a billion devices",
            "content_html": "<p>https://www.bleepingcomputer.com/news/security/undocumented-backdoor-found-in-bluetooth-chip-used-by-a-billion-devices/</p><div><br></div><img src=\"https://i.redd.it/k7k8j9qg5ine1.jpeg\" />",
            "date_published": "2025-03-08T17:39:17+00:00",
            "authors": [
                {
                    "name": "DomMan79",
                    "url": "https://www.reddit.com/user/DomMan79"
                }
            ]
        },
        {
            "id": "1j5gr3o",
            "url": "/r/homeassistant/comments/1j5gr3o/finally_made_a_dashboard_i_actually_like_using/",
            "external_url": "https://www.reddit.com/gallery/1j5gr3o",
            "title": "Finally made a dashboard I actually like using and looking at",
            "content_html": "",
            "date_published": "2025-03-07T05:59:47+00:00",
            "authors": [
                {
                    "name": "diamondaires",
                    "url": "https://www.reddit.com/user/diamondaires"
                }
            ]
        },
        {
            "id": "1j56tru",
            "url": "/r/homeassistant/comments/1j56tru/bye_bye_google_hello_nabu/",
            "external_url": "https://i.redd.it/z5y0nqbw15ne1.jpeg",
            "title": "Bye bye google, hello Nabu",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/z5y0nqbw15ne1.jpeg\" />",
            "date_published": "2025-03-06T21:36:09+00:00",
            "authors": [
                {
                    "name": "Noisycarlos",
                    "url": "https://www.reddit.com/user/Noisycarlos"
                }
            ]
        },
        {
            "id": "1j1wde1",
            "url": "/r/homeassistant/comments/1j1wde1/diy_pure_black_cabinet_with_aluminum_profiles/",
            "external_url": "https://www.reddit.com/gallery/1j1wde1",
            "title": "DIY Pure Black Cabinet with Aluminum Profiles - Part two",
            "content_html": "",
            "date_published": "2025-03-02T17:35:53+00:00",
            "authors": [
                {
                    "name": "Equal-Individual56",
                    "url": "https://www.reddit.com/user/Equal-Individual56"
                }
            ]
        },
        {
            "id": "1iyqciz",
            "url": "/r/homeassistant/comments/1iyqciz/diy_pure_black_cabinet_with_aluminum_profiles_a/",
            "external_url": "https://www.reddit.com/gallery/1iyqciz",
            "title": "DIY Pure Black Cabinet with Aluminum Profiles - A Must-See for Home Network Enthusiasts!",
            "content_html": "",
            "date_published": "2025-02-26T15:39:38+00:00",
            "authors": [
                {
                    "name": "Equal-Individual56",
                    "url": "https://www.reddit.com/user/Equal-Individual56"
                }
            ]
        },
        {
            "id": "1ixyzq2",
            "url": "/r/homeassistant/comments/1ixyzq2/im_made_a_screen_saver_that_displays_all_my_mqtt/",
            "external_url": "https://i.redd.it/wi7ezzy8able1.jpeg",
            "title": "I'm made a screen saver that displays all my MQTT data as the matrix code.",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/wi7ezzy8able1.jpeg\" />",
            "date_published": "2025-02-25T16:26:23+00:00",
            "authors": [
                {
                    "name": "melancholytron",
                    "url": "https://www.reddit.com/user/melancholytron"
                }
            ]
        },
        {
            "id": "1ix0h6r",
            "url": "/r/homeassistant/comments/1ix0h6r/im_using_how_much_electricity/",
            "external_url": "https://i.redd.it/esvuj4csu2le1.png",
            "title": "I'm using HOW MUCH electricity?",
            "content_html": "<p>Just for a giggle, obviously got something measuring wrong somewhere.</p><div><br></div><img src=\"https://i.redd.it/esvuj4csu2le1.png\" />",
            "date_published": "2025-02-24T12:04:27+00:00",
            "authors": [
                {
                    "name": "umognog",
                    "url": "https://www.reddit.com/user/umognog"
                }
            ]
        },
        {
            "id": "1itvbzg",
            "url": "/r/homeassistant/comments/1itvbzg/my_first_porject_epaper_display_for_home/",
            "external_url": "https://www.reddit.com/gallery/1itvbzg",
            "title": "My First Porject - ePaper Display For Home Assistant! What do you think~",
            "content_html": "",
            "date_published": "2025-02-20T10:17:50+00:00",
            "authors": [
                {
                    "name": "Miserable_Bluejay663",
                    "url": "https://www.reddit.com/user/Miserable_Bluejay663"
                }
            ]
        },
        {
            "id": "1inslnn",
            "url": "/r/homeassistant/comments/1inslnn/why_are_you_still_using_mushroom_cards/",
            "external_url": "https://www.reddit.com/r/homeassistant/comments/1inslnn/why_are_you_still_using_mushroom_cards/",
            "title": "Why are you still using Mushroom cards? 🍄",
            "content_html": "<p>Hello 👋</p>\n<p><a href=\"https://github.com/piitaya/lovelace-mushroom\"><strong>Mushroom</strong></a> card creator and <strong>Home Assistant</strong> front-end developer for Nabu Casa here.</p>\n<p>I launched <strong>Mushroom cards</strong> 3 years ago. It was only a side project as I could find something I liked for my dashboard. It's now one of the most used custom card in Home Assistant 🤯. Thank you all for your support ❤️.</p>\n<p>2 years ago, the <a href=\"https://www.home-assistant.io/dashboards/tile/\">tile card</a> has been introduced. The look and feel and many features are heavily inspired by Mushroom cards. Many people asked to add features from Mushroom to Home Assistant. Overtime, the official cards has been improved (tile, card features, badges, heading card, ...). And now... I get the inverse feedback : every time a new feature is added to official cards, I got the feature request for Mushroom 🙃.</p>\n<p>If you have some time, I would be very grateful by your answer to these questions :</p>\n<p>- <strong>Why are you still using Mushroom cards?</strong></p>\n<p>- <strong>What features or reasons block you to switch to official Home Assistant cards</strong> (e.g. <a href=\"https://www.home-assistant.io/dashboards/tile/\">tile card</a> and <a href=\"https://www.home-assistant.io/dashboards/badges/\">badges</a>)?</p>\n<p>I already have a good idea of ​​the answers but I would like to have a more precise view to better guide the future development of Mushroom.</p>\n<p>The final goal is to have Mushroom cards as complementary cards instead of duplicating tile cards and badges to Mushroom.</p>\n<p>Thank you again for all the support 🍄</p>",
            "date_published": "2025-02-12T14:52:52+00:00",
            "authors": [
                {
                    "name": "piiitaya",
                    "url": "https://www.reddit.com/user/piiitaya"
                }
            ]
        },
        {
            "id": "1ihj88h",
            "url": "/r/homeassistant/comments/1ihj88h/using_an_aqara_window_contact_sensor_to_detect/",
            "external_url": "https://www.reddit.com/gallery/1ihj88h",
            "title": "Using an Aqara Window Contact Sensor to Detect Toilet Flushes",
            "content_html": "",
            "date_published": "2025-02-04T14:44:36+00:00",
            "authors": [
                {
                    "name": "Duelion",
                    "url": "https://www.reddit.com/user/Duelion"
                }
            ]
        },
        {
            "id": "1iet03t",
            "url": "/r/homeassistant/comments/1iet03t/for_anyone_like_me_who_didnt_know_these_existed/",
            "external_url": "https://www.reddit.com/gallery/1iet03t",
            "title": "For anyone like me who didn’t know these existed…",
            "content_html": "<p>Just installed three of these Sonoff NSPanel Pro units around the house and I’m very very impressed. HA dashboard looks amazing and works great. Takes a little bit of work to sideload the HA app onto the device but well worth it.</p>\n<p>Best bit was when my girlfriend tried the one in the living room and immediately asked for one in her dressing room! The only downside is that I didn’t discover them sooner.</p>\n<p>Also the new Sam Fender tune is a banger if you haven’t listened yet!</p>",
            "date_published": "2025-01-31T23:47:09+00:00",
            "authors": [
                {
                    "name": "jake2547",
                    "url": "https://www.reddit.com/user/jake2547"
                }
            ]
        },
        {
            "id": "1iaoach",
            "url": "/r/homeassistant/comments/1iaoach/this_is_my_wood_case_for_a_home_assistant_touch/",
            "external_url": "https://www.reddit.com/gallery/1iaoach",
            "title": "This is my wood case for a home assistant touch display, the cover is made from an old t-shirt and the wood is machined from oak",
            "content_html": "",
            "date_published": "2025-01-26T19:47:46+00:00",
            "authors": [
                {
                    "name": "Slight_Safe8745",
                    "url": "https://www.reddit.com/user/Slight_Safe8745"
                }
            ]
        },
        {
            "id": "1i5tpgq",
            "url": "/r/homeassistant/comments/1i5tpgq/i_really_really_really_dont_want_water_damage/",
            "external_url": "https://i.redd.it/dk6dhs7ra6ee1.jpeg",
            "title": "I really really really don't want water damage",
            "content_html": "<caption>Open: <a href='winstonapp:///r/homeassistant/comments/1i5tpgq/i_really_really_really_dont_want_water_damage/'>Winston</a> | <a href='https://reddit.com/r/homeassistant/comments/1i5tpgq/i_really_really_really_dont_want_water_damage/'>Reddit</a></caption><div><br></div><p>And I have a lot of bathrooms....</p>\n<p>18 aqara sensors lol </p><div><br></div><img src=\"https://i.redd.it/dk6dhs7ra6ee1.jpeg\" />",
            "date_published": "2025-01-20T16:10:22+00:00",
            "authors": [
                {
                    "name": "coderego",
                    "url": "https://www.reddit.com/user/coderego"
                }
            ]
        },
        {
            "id": "1i566dm",
            "url": "/r/homeassistant/comments/1i566dm/i_found_a_use_for_my_old_ms_surface/",
            "external_url": "https://www.reddit.com/gallery/1i566dm",
            "title": "I found a use for my old MS Surface 😂",
            "content_html": "<caption>Open: <a href='winstonapp:///r/homeassistant/comments/1i566dm/i_found_a_use_for_my_old_ms_surface/'>Winston</a> | <a href='https://reddit.com/r/homeassistant/comments/1i566dm/i_found_a_use_for_my_old_ms_surface/'>Reddit</a></caption><div><br></div><p>So... I finally found a constructive use for the old ms surface go 3.... Purists are probably turning in their grave seeing an Ubuntu (I ended up re-installing with fedora) next to window logo, but I think the end result turned out pretty nice .</p>\n<p>Despite the post on here earlier about these being pointless - it's really handy on the way out the door, to just tap a button to turn out all the lights rather than yell into the other room to Alexa! 😂</p>\n<p>Still got alot of work to do on the dashboard, but so far pretty pleased with the end result.</p>\n<p>For others wanting to use a surface in the future, I found fedora 41 KDE Plasma to be really quick and easy to get booting into Firefox / kiosk mode without any hassle...</p>\n<p>Only installed home assistant 2 weeks ago (previously was just Tado / hue / Wiz / tapo direct through their own apps or in Alexa app) - but I'm already hooked ..  this is gonna get expensive and time consuming 😂😂</p>",
            "date_published": "2025-01-19T19:07:49+00:00",
            "authors": [
                {
                    "name": "Skonamonkey",
                    "url": "https://www.reddit.com/user/Skonamonkey"
                }
            ]
        },
        {
            "id": "1i0i75a",
            "url": "/r/homeassistant/comments/1i0i75a/who_else_maintains_the_illusion_of_stability_by/",
            "external_url": "https://i.redd.it/cq9lgbj7isce1.jpeg",
            "title": "Who else maintains the illusion of stability by applying automations like duct tape?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/homeassistant/comments/1i0i75a/who_else_maintains_the_illusion_of_stability_by/'>Winston</a> | <a href='https://reddit.com/r/homeassistant/comments/1i0i75a/who_else_maintains_the_illusion_of_stability_by/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/cq9lgbj7isce1.jpeg\" />",
            "date_published": "2025-01-13T16:43:04+00:00",
            "authors": [
                {
                    "name": "Skeeter1020",
                    "url": "https://www.reddit.com/user/Skeeter1020"
                }
            ]
        }
    ]
}