{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/macapps",
    "description": "r/MacApps is a one stop shop for all things related to macOS apps - featuring app showcases, news, updates, sales, discounts and even freebies.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/macapps.json",
    "icon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "favicon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "items": [
        {
            "id": "1kcs73f",
            "url": "/r/macapps/comments/1kcs73f/rip_macupdater_01012026/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1kcs73f/rip_macupdater_01012026/",
            "title": "RIP MacUpdater 01.01.2026 😭",
            "content_html": "<p>It's now confirmed. One of the top 10 apps on MacOS is shutting down in 2026. Devastating news!  I wish they had charged $1 a month or $10 a year sub. I would've subscribed easily for the amount of time this app saves me.</p>\n<p>https://www.corecode.io/macupdater/</p>\n<blockquote>\n<p>As promised, all MacUpdater 3 licenses will be supported until 2026-01-01.\nAfter that date we will no longer continue to develop or support MacUpdater\nbut we hope to find some other company to continue the product or its technology:</p>\n</blockquote>\n<p>Similar thing happened with Windows (SUMo) and there's been no replacement other than using softpedia to get RSS updates for updated software. Unfortunately they don't support Mac apps, so we're screwed.</p>\n<p>Latest is the only alternative I know of, but it misses so many.</p>",
            "date_published": "2025-05-02T04:12:48+00:00",
            "authors": [
                {
                    "name": "IwuvNikoNiko",
                    "url": "https://www.reddit.com/user/IwuvNikoNiko"
                }
            ]
        },
        {
            "id": "1kaki3z",
            "url": "/r/macapps/comments/1kaki3z/switched_back_to_mac_my_list_of_the_best_apps_ive/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1kaki3z/switched_back_to_mac_my_list_of_the_best_apps_ive/",
            "title": "Switched back to Mac. My list of the best apps I've found.",
            "content_html": "<p><strong>Utilities/Tools:</strong></p>\n<ul>\n<li>AppCleaner (free, website), deletes leftover files from uninstalled apps.</li>\n<li>GrandPerspective (free, website), disk space visualizer (similar to windirstat)</li>\n<li>Keka (free, website), archiver and extractor (similar to 7zip)</li>\n<li>CotEditor (free, appstore), text editor (very similar to notepad++)</li>\n<li>belanaEtcher (free, website), ISO to USB tool</li>\n<li>Amphetamine (free, app store), prevents system from sleeping</li>\n<li>Cyberduck (free, website), FTP/Cloud storage client (similar to filezilla)</li>\n<li>Transmission (free, website), ptp client</li>\n<li>Welly (free, app store), ssh/telnet client (similar to putty, extra options for BBS/MUDs)</li>\n<li>EasyFind (free, website), file searcher (similar to everything)</li>\n<li>CopyClip (free, appstore), clipboard history in menu bar</li>\n<li>Burn (free, website), disc burner (data,audio,video, menu creator)</li>\n<li>UTM (free, website), virtual machine client, supports x86 on Apple Silicon</li>\n<li>Google Earth Pro (free, website), google earth on desktop</li>\n<li>Unsplash wallpapers (free, appstore), wallpaper app</li>\n<li>AmorphusDiskMark (free, appstore), disk speed test (very similar to CrystalDiskMark)</li>\n<li>Network Utility (free, website), advanced network info and tests</li>\n<li>Speedtest by Ookla (free, appstore), desktop internet speedtest (more accurate than web browser)</li>\n</ul>\n<p><strong>Media:</strong></p>\n<ul>\n<li>VLC (free, website), audio/video player with support for all formats</li>\n<li>Modizer ($2, appstore, iOS app on mac), tracker/mod/game/chiptune music player with visualizations</li>\n</ul>\n<p><strong>Emulators/Gaming Tools:</strong></p>\n<ul>\n<li>OpenEmu (free, website), zero config multisystem emulator (retroarch front end)</li>\n<li>DOSBox Staging (free, website), dos emulator (much more updated than original DOSBox)</li>\n<li>Frotz (free, appstore, iOS app on mac), text adventure game emulator (many preinstalled games like Zork,etc)</li>\n<li>MacOS 9 for macOS (free, website), full MacOS 9 emulator, runs powerpc apps</li>\n<li>Greenlight (free, website), xbox in home streaming and xbox cloud gaming client</li>\n<li>ATLauncher (free, website), minecraft launcher with one click install for many popular new and classic mod packs</li>\n<li>Mighty Dice (free, appstore, iOS app on mac), very nice looking 3d dice rolling app</li>\n<li>The usual gaming clients (steam, battle.net, gog galaxy)</li>\n</ul>\n<p><strong>Photo/Video/Audio Editing/Converting/Downloading:</strong></p>\n<ul>\n<li>Audacity (free, website), audio editor/recorder</li>\n<li>freeac (free, website), audio file converter, cd ripper</li>\n<li>XnViewMP (free, website), advanced image viewer with basic editing and converting</li>\n<li>XnConvert (free, website), image file converter</li>\n<li>XnResize (free, website), image file resizer</li>\n<li>MakeMKV (free, website), DVD ripper (supports encrypted dvds)</li>\n<li>Handbrake (free, website), Video converter/encoder</li>\n<li>Pinta (free, website), paint app and editor (very similar to paint.net)</li>\n<li>GIMP (free, website), advanced image editor</li>\n<li>Krita (free, website), advanced paint/drawing app</li>\n<li>Inkscape (free, website), advanced vector editor/viewer (SVG)</li>\n<li>Stacher7 (free, website), youtube (and many other sites) video/audio downloader)</li>\n</ul>\n<p><strong>Office/Productivity:</strong></p>\n<ul>\n<li>OnlyOffice (free, website), office app, very good compatibility with MS office</li>\n<li>PDFGear (free, appstore), pdf viewer/annotator/editor (100% free, no ads)</li>\n<li>Edison Mail (free, appstore), very good email client with push support for google</li>\n<li>ChatGPT desktop (free, website), desktop client for chatgpt, integrates into system</li>\n<li>WolframAlpha Classic ($2, appstore, iOS app on mac), reference tool, encyclopedia, math solver, many more</li>\n</ul>",
            "date_published": "2025-04-29T10:19:49+00:00",
            "authors": [
                {
                    "name": "drvox1600",
                    "url": "https://www.reddit.com/user/drvox1600"
                }
            ]
        },
        {
            "id": "1k9sidr",
            "url": "/r/macapps/comments/1k9sidr/i_got_tired_of_finance_apps_stealing_my_data_so_i/",
            "external_url": "https://i.redd.it/pgap8d351kxe1.png",
            "title": "I got tired of finance apps stealing my data, so I built my own. No logins. No ads. No tracking. Just peace of mind.",
            "content_html": "<p>Hi everyone,</p>\n<p>Every finance app I tried either wanted me to hand over my login details, spam me with ads, or lock basic features behind a subscription.</p>\n<p>At some point, I thought... why does managing my own money mean giving up my privacy?</p>\n<p>So I built something just for myself: MoneyTool — a privacy-first, fully offline finance tracker.</p>\n<ul>\n<li>Track expenses, income, savings, investments, debts — all in one simple app.</li>\n<li>No logins, no syncing, no ads. Your data stays 100% on your device.</li>\n<li>Minimalist design — clean dashboards, no clutter, no overwhelm.</li>\n</ul>\n<p>It works on iPhone, iPad, and Mac (although Mac/iPad visuals still have a bit of polishing left &gt;&gt; work in progress!).</p>\n<p>I made this because I wanted to own my financial data again, not trade it away for convenience.</p>\n<p>Would love your thoughts:</p>\n<ul>\n<li>What do you hate most about finance apps today?</li>\n<li>How much do you care about privacy when it comes to your money?</li>\n</ul>\n<p>Here’s a screenshot of how it looks: (attach screenshot here)</p>\n<p>If you want to try it out: <a href=\"https://themoneytool.com/download\">themoneytool.com/download</a></p>\n<p>Thanks so much for reading! Would love to hear your feedback or feature ideas!</p><div><br></div><img src=\"https://i.redd.it/pgap8d351kxe1.png\" />",
            "date_published": "2025-04-28T10:46:08+00:00",
            "authors": [
                {
                    "name": "nosleepfounder",
                    "url": "https://www.reddit.com/user/nosleepfounder"
                }
            ]
        },
        {
            "id": "1k7j57g",
            "url": "/r/macapps/comments/1k7j57g/sidebar_the_modern_dock_replacement_for_macos/",
            "external_url": "https://i.redd.it/yrds8qjczywe1.png",
            "title": "Sidebar the modern Dock replacement for macOS - Major update",
            "content_html": "<p>Hi everyone,</p>\n<p><strong>I just wanted to share that Sidebar just got a major update to version 1.8.0</strong>. Sidebar is the modern and most customizable Dock replacement for macOS out there. In general, it makes the space that the Dock would occupy a lot more useful.</p>\n<p>Since my last post here, some <strong>cool new features have been added</strong>, such as:</p>\n<ul>\n<li>Sidebar now offers a customization mode that combines all context specific options in one completely overhauled user interface, allowing you to easily customize various settings</li>\n<li>Application previews have been redesigned and in addition to the classic miniature application preview windows now also offers a list view for more cozy overview</li>\n<li>Two new ways of displaying running applications have been added, called \"Highlight\". Using this running indicator, Sidebar will show a highlighted area around running applications, with optionally the window count next to the icon</li>\n<li>Sidebar now offers a built-in functionality to either move all application windows, or those of a specific application to a specific screen</li>\n<li>Multimedia support has been enhanced to deal with new restrictions introduced by Apple starting with macOS 14.5. Starting with this update you can control Spotify and Apple Music again, even when running macOS 14.5+</li>\n<li>And of course a lot of other small improvements, performance improvements and bug fixes</li>\n</ul>\n<p>For a full list of features added and bugs fixed, have a look at the roadmap at the <a href=\"https://sidebarapp.net/changelog/\">Full Changelog</a> If you want to see more screenshots of the app and a comprehensive overview of all features, please visit <a href=\"https://sidebarapp.net/\">https://sidebarapp.net</a></p>\n<p>As usual, I've reset all prior trial licenses, so you can try Sidebar again, even if you tested it before.</p>\n<p>I’m happy to support you with any questions, problems, bug reports, feature requests etc. :)</p><div><br></div><img src=\"https://i.redd.it/yrds8qjczywe1.png\" />",
            "date_published": "2025-04-25T11:59:29+00:00",
            "authors": [
                {
                    "name": "empty23_",
                    "url": "https://www.reddit.com/user/empty23_"
                }
            ]
        },
        {
            "id": "1k73ed8",
            "url": "/r/macapps/comments/1k73ed8/wblock_v02_is_finally_released_lightweight_native/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1k73ed8/wblock_v02_is_finally_released_lightweight_native/",
            "title": "wBlock v0.2 is (finally) released -- lightweight, native, free, and open-source Safari ad blocker",
            "content_html": "<p>Hey everyone,</p>\n<p>I’m excited to share a huge update for <strong>wBlock</strong>, the <strong>free and open-source</strong> ad blocker for Safari I’ve been building!</p>\n<p><a href=\"https://preview.redd.it/bip3y3j7luwe1.png?width=986&amp;format=png&amp;auto=webp&amp;s=2e6f914612b11feeee3aad5ebf543122194b605a\">The homepage</a></p>\n<p>Over the past several months, I’ve been hard at work (and reading every bit of your feedback here and on GitHub) to make wBlock faster, more powerful, and way easier to use. This update is honestly the one I’m most proud of, so here’s what’s new and improved:</p>\n<ul>\n<li><strong>Keyboard Shortcuts + Cheat Sheet:</strong> You can now navigate and control wBlock with fast hotkeys. There’s even an in-app cheat sheet—your fingers never need to leave the keyboard.</li>\n<li><strong>Custom Filter Lists:</strong> Add, manage, and toggle any ad-blocking list you want—besides the built-in ones. Imported lists? No problem. Sidebar toggle bugs and filter duplication are fixed too.</li>\n<li><strong>Epic Speed Boost (No More Lag!):</strong> The UI is dramatically faster. All the sluggishness, animation lag, and slow filter updates are gone—background processing everywhere.</li>\n<li><strong>(Almost) Bulletproof YouTube Ad-Blocking:</strong> Ad scripts now inject <em>earlier</em> for much better blocking. Enjoy cleaner YouTube (including the homepage and while watching videos). Note that some users still have issues when visiting a YouTube video by pasting a link; YouTube is becoming really annoying when it comes to ads and I'll need some extra time to figure this out.</li>\n<li><strong>No More Annoying Permission Popups:</strong> You won’t be bugged for data access every launch anymore! All that background permission nagging is fixed for good.</li>\n<li><strong>Built-in Language &amp; Custom Filters:</strong> Chinese, Spanish, Portuguese, and many international filters now work flawlessly. Got issues with AdGuard lists before? They’re all fixed.</li>\n<li><strong>See What You’re Blocking:</strong> Filter lists now show the real number of rules, and you can click to go right to the homepage/source.</li>\n<li><strong>Download Progress for Filter Updates:</strong> Never wonder “is it hung?” again—there’s now a live progress bar while updating filters.</li>\n<li><strong>Cleaner, Simpler Interface:</strong> The sidebar is gone, popups are more intuitive, and, finally, every log window and popup can be closed.</li>\n</ul>\n<p>There are ton of smaller bug fixes and UX tweaks too, from “refresh all filters” to improved default settings and support for more macOS versions. The menu, tooltips, and every page should feel easier and friendlier!</p>\n<p><strong>🙏 Thank you to everyone on Reddit and GitHub who’s reported bugs, shared ideas, and encouraged me along the way.</strong> Your support and feedback have shaped every part of this project and made wBlock what it is today! This truly is built <em>for</em> the community, <em>by</em> the community.</p>\n<p>If you haven’t tried wBlock yet, or you gave up on ad-blockers that “almost” worked—give it a go! And if you enjoy it, please star the repo, open suggestions, or just spread the word.</p>\n<p>You can <a href=\"https://github.com/0xCUB3/wBlock\">check out the GitHub</a> or <a href=\"https://testflight.apple.com/join/DFGenhRn\">download it now using TestFlight</a>.</p>\n<p><em>(P.S Massive thanks again to everyone who gave honest feedback, feature ideas, or just a kind word along the way. You guys really keep me going :) )</em></p>",
            "date_published": "2025-04-24T21:04:46+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1k68wre",
            "url": "/r/macapps/comments/1k68wre/i_made_a_completely_free_mac_app_for_creating/",
            "external_url": "https://v.redd.it/kcfyx7n8zmwe1",
            "title": "I made a completely free Mac app for creating customizable countdown timer overlays",
            "content_html": "<p>Hey r/macapps,</p>\n<p>I've been working on a macOS app called <strong>Countdown Timer Pro</strong> for a while, and I’m excited to finally share the first version with you all!</p>\n<p><strong>What is it?</strong> <br />\nIt's an app that lets you create highly customizable timer overlays with a simple click-and-drag from your menu bar. Perfect for everything from quick cooking reminders to tracking long-term project deadlines visually, right on your screen.</p>\n<p><strong>Why did I build it?</strong> <br />\nI originally wanted a timer that was always visible on my screen, but didn't constantly block me from clicking on windows underneath it. That led to the \"pass-through\" feature, and from there, I kept finding new things I wanted to add, resulting in the app you see today.</p>\n<p>I’m releasing it <strong>completely free</strong> on the App Store (no ads, no IAPs, no catches) to keep it accessible for anyone who might find it useful.</p>\n<p><strong>Here's what it can do (Key features):</strong></p>\n<ul>\n<li><strong>Super Easy Creation:</strong> Click the menu bar icon and drag – the farther you drag, the longer the timer.</li>\n<li><strong>Click-Through Timers (Pass-Through Mode):</strong> Timers fade slightly on hover, letting you click <em>right through</em> them to interact with content underneath.</li>\n<li><strong>On-Overlay Controls:</strong> Quickly resize, move, add/subtract time, pause, open the manager, or close the timer directly on the overlay itself.</li>\n<li><strong>Deep Appearance Customization:</strong> Fonts, backgrounds, colors, gradients, opacity, progress ring styles – make it look <em>exactly</em> how you want. Save your favorite color themes, too.</li>\n<li><strong>Default Timer Settings:</strong> Define your preferred style and behavior once, and all new timers will use those settings automatically.</li>\n<li><strong>Flexible Time Display:</strong> Show units from seconds up to years. Timers can auto-switch units (e.g., minutes to seconds when under 60s), and you can optionally display remaining time as a percentage.</li>\n<li><strong>Recurring Timers:</strong> Set timers to repeat daily, weekly, or at custom intervals.</li>\n<li><strong>Custom End Notifications:</strong> Create unique notifications for when specific timers complete.</li>\n<li><strong>Visible Across Spaces:</strong> Timers stay visible even when you switch between Spaces.</li>\n<li><strong>Countdown Manager:</strong> A central window to view, edit, and manage all your timers.</li>\n<li><strong>Window Behavior:</strong> Control whether timers float above everything, act like standard windows, or ignore screen boundaries.</li>\n<li><strong>And More:</strong> Includes keyboard shortcuts, options to hide timers until they start, reverse progress bar direction, and other useful features.</li>\n</ul>\n<p><strong>What's Next &amp; Feedback:</strong> <br />\nThis is just v1.0! I have a list of features and optimizations I'd love to add, especially if there's interest from the community.</p>\n<p>Please check it out! I'd love to hear what you think. Let me know about any bugs you find or features you'd like to see added.</p>\n<p><strong>Download link:</strong> <a href=\"https://apps.apple.com/us/app/countdown-timer-pro/id6744842468\">https://apps.apple.com/us/app/countdown-timer-pro/id6744842468</a></p>\n<p><strong>TL;DR:</strong> Made a free Mac app to create highly customizable, click-through countdown timer overlays. Drag to create. Lots of features. No ads, no IAPs.</p>",
            "date_published": "2025-04-23T20:04:46+00:00",
            "authors": [
                {
                    "name": "nicobakke",
                    "url": "https://www.reddit.com/user/nicobakke"
                }
            ]
        },
        {
            "id": "1k2isa8",
            "url": "/r/macapps/comments/1k2isa8/sniffnet_free_open_source_similar_to_little_snitch/",
            "external_url": "https://i.redd.it/nve8znbihove1.png",
            "title": "Sniffnet (Free & Open Source) similar to Little Snitch",
            "content_html": "<p>Came across this app the other day, thought I'd share it with all y'all. <a href=\"https://sniffnet.net\">Sniffnet</a> is an open-source to monitor your network traffic. It allows you to set filters to apply to the observed traffic, views overall statistics, set custom notifications, and more.</p><div><br></div><img src=\"https://i.redd.it/nve8znbihove1.png\" />",
            "date_published": "2025-04-18T23:32:14+00:00",
            "authors": [
                {
                    "name": "FrediWest",
                    "url": "https://www.reddit.com/user/FrediWest"
                }
            ]
        },
        {
            "id": "1jsvxkr",
            "url": "/r/macapps/comments/1jsvxkr/what_are_the_best_mac_apps_for_translucency_lovers/",
            "external_url": "https://www.reddit.com/gallery/1jsvxkr",
            "title": "What are the best Mac apps for translucency lovers?",
            "content_html": "<p>It's a real question btw, I haven't found other apps that get fully translucent(and not just within their lateral bar.</p>\n<p>In order: Obsidian(Free), Warp(Free), Safari(Paid), CotEditor(Free) </p>",
            "date_published": "2025-04-06T14:54:21+00:00",
            "authors": [
                {
                    "name": "Powerful_Ad725",
                    "url": "https://www.reddit.com/user/Powerful_Ad725"
                }
            ]
        },
        {
            "id": "1joqgne",
            "url": "/r/macapps/comments/1joqgne/we_get_taken_over/",
            "external_url": "https://i.redd.it/n21q4dshm6se1.jpeg",
            "title": "We get taken over?",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/n21q4dshm6se1.jpeg\" />",
            "date_published": "2025-04-01T08:14:04+00:00",
            "authors": [
                {
                    "name": "jakecoolguy",
                    "url": "https://www.reddit.com/user/jakecoolguy"
                }
            ]
        },
        {
            "id": "1jnsp3n",
            "url": "/r/macapps/comments/1jnsp3n/antinote_113_dropdown_mode_v_ocr_autopaste/",
            "external_url": "https://v.redd.it/rbq6gxykawre1",
            "title": "Antinote 1.1.3 - Dropdown mode. ⌘V OCR. AutoPaste. Raycast and Alfred extensions. Translucency. 8 new themes.",
            "content_html": "<p>Hi! Johnson (dev) here! Excited to share some of these new features with the community.</p>\n<p><strong>Dropdown mode (Traditional menu mode)</strong> - Antinote can now live permanently in your menu bar, dropping down when needed. It will show over full-screen apps and also on all desktops. You can change how big you want Antinote to be in settings.</p>\n<p><strong>Cmd-V OCR</strong> - Any image you drag (and now paste) into Antinote will get automatically OCR'd into plain text. Perfect for catching things during screen-shares or hard-to-copy data tables.</p>\n<p><strong>AutoPaste</strong> - Type \"paste\" and Antinote will listen to your clipboard. Anything you put in the clipboard will be automatically pasted in the note. Change the delimiter to anything you like. Great to skip the tedious cmd-tab / cmd+v part of these quick workflows.</p>\n<p><strong>Raycast / Alfred Extensions -</strong> Thanks to <a href=\"https://github.com/sc0\">PanKacper</a>, we are now <a href=\"https://www.raycast.com/sc0/antinote\">officially in the Raycast Store</a>, and also have an <a href=\"https://github.com/sc0/antinote-alfred-workflow/tree/main\">Alfred Extension</a>. These will let you create notes (blank or with content), pin/unpin, and search your notes directly from your favourite super-app.</p>\n<p><strong>Translucency -</strong> (macOS 15+) - Make the background translucent with Apple's materials and change the opacity of the effect to blend it with your favourite theme.</p>\n<p><strong>8 new themes</strong> -  Piccolo, A24, Tartan, Agrabah, Maud'Dib, Knight, Sanrio, Shadow Moses. Not sure how many of you will get the references, but each is inspired by something from my childhood.</p>\n<p>Every single one of these were suggestions from the community. Please <a href=\"https://discord.gg/2SKQbJM9Mz\">join us on Discord.</a> </p>\n<p>Also - I wanted to shout out this YouTube channel (AppsNTips) for making the first Antinote video out in the wild: <a href=\"https://www.youtube.com/watch?v=kQKGOPgOiuI\">https://www.youtube.com/watch?v=kQKGOPgOiuI</a></p>\n<p><strong>Try it out here:</strong></p>\n<h1><a href=\"https://antinote.io\">Antinote.io</a></h1>\n<p>7 day free trial</p>\n<p><strong>$5 one-time.</strong> Forever updates.</p>",
            "date_published": "2025-03-31T02:06:50+00:00",
            "authors": [
                {
                    "name": "johnsonjohnson",
                    "url": "https://www.reddit.com/user/johnsonjohnson"
                }
            ]
        },
        {
            "id": "1jlhu3w",
            "url": "/r/macapps/comments/1jlhu3w/quit_my_job_a_year_ago_to_build_a_notetaking_app/",
            "external_url": "https://www.reddit.com/gallery/1jlhu3w",
            "title": "Quit my job a year ago to build a note-taking app",
            "content_html": "<p><strong>*Before we start:</strong> The app isn’t fully optimized for Mac (support M chip series only) yet, but I'm considering dedicating more time to enhancing its Mac functionalities. Would you be interested in a version with more tailored features for Mac? Your feedback would really help guide my efforts.  </p>\n<p>I used to work as an iOS developer in a well-paying job, but I always had the urge to build something of my own rather than work on other people’s ideas. Since I'm still young, I figured this was the perfect time to take the leap, quit my job, and give it a real shot.</p>\n<p>I've always been passionate about note-taking, so I decided to build one myself. I know the market is crowded, but I wanted to create something with features that stand out—and make it <strong><em>completely free</em></strong> to use.</p>\n<p>The app, <em>Notedrafts</em>, supports three different types of notes:</p>\n<ul>\n<li>PDF/Notebook-style notes</li>\n<li>Infinite Canvas (similar to Apple Freeform)</li>\n<li>Vertical Notes (like the Apple Notes app)</li>\n</ul>\n<p>On top of that, you can fully customize templates to suit your workflow. Notedrafts offers planners, habit trackers, and more—and you can tweak them however you like, from changing dates to adjusting the number of habits you want to track.</p>\n<p>It's available on the App Store. It was mainly build for the iPad and Apple Pencil but you can also use it on your iPhone and draw with your finger: <a href=\"https://apps.apple.com/app/id6743032079\">Notedrafts on App Store</a></p>",
            "date_published": "2025-03-28T00:01:55+00:00",
            "authors": [
                {
                    "name": "Ok_Photograph2604",
                    "url": "https://www.reddit.com/user/Ok_Photograph2604"
                }
            ]
        },
        {
            "id": "1jdss99",
            "url": "/r/macapps/comments/1jdss99/just_launched_markdown2pdf_markdown_converter/",
            "external_url": "https://v.redd.it/2mikb4ugmape1",
            "title": "Just launched Markdown2PDF: Markdown Converter (Lifetime Pro Giveaway)",
            "content_html": "<p>Hey r/macapps!</p>\n<p>I built a Mac app because I got tired of copying LLM responses into Word or Pages, only to have the formatting turn into absolute chaos (random spacing, weird font sizes, bullet points that look like they’ve been through a blender).</p>\n<p>So I made <a href=\"https://apps.apple.com/us/app/markdown2pdf-convert-markdown/id6743325583?mt=12\">Markdown2PDF</a>, a super simple, clean app that takes your markdown (from ChatGPT, Claude, Gemini, whatever you use) and turns it into a properly formatted PDF—<strong>no headaches.</strong> Just copy, paste, and export.</p>\n<p>🚀 <strong>Why I think it’s useful:</strong><br />\n✅ Perfectly formatted PDFs every time<br />\n✅ No more weird copy/paste issues<br />\n✅ Works with any markdown source</p>\n<p>I just launched, so I’m <strong>giving away Lifetime Pro licenses</strong> to folks who want to check it out. <strong>PM me or drop a comment and I’ll send you a code.</strong> Would love to get your thoughts!</p>\n<p>Cheers!</p>",
            "date_published": "2025-03-18T00:46:05+00:00",
            "authors": [
                {
                    "name": "D1no_nugg3t",
                    "url": "https://www.reddit.com/user/D1no_nugg3t"
                }
            ]
        },
        {
            "id": "1jc08n1",
            "url": "/r/macapps/comments/1jc08n1/clipyboard_is_lifetime_free_for_the_next_24_hours/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1jc08n1/clipyboard_is_lifetime_free_for_the_next_24_hours/",
            "title": "🚀 ClipyBoard is Lifetime Free for the Next 24 Hours! 🎉",
            "content_html": "<p>Hey everyone! </p>\n<p>I'm Gohary, the developer behind <strong>ClipyBoard</strong>, the ultimate autopaste keyboard app that’s here to revolutionize your typing experience. For the next <strong>24 hours</strong>, I’m making the app <strong>100% free!</strong> 🚀</p>\n<p>🔥 What Makes ClipyBoard Special?</p>\n<p>✅ Copy &amp; organize text &amp; images easily</p>\n<p>✅ Extract text from images (OCR-powered magic 🪄)</p>\n<p>✅ Create shortcuts for your most-used clips and recall them instantly</p>\n<p>✅ Lightning-fast search to find your saved clips in seconds</p>\n<p>No more endless copy-pasting or searching for the same text over and over again. With <strong>ClipyBoard</strong>, your favorite clips are just a shortcut away!</p>\n<p>We’d love to hear your feedback and suggestions! Drop any questions or comments below, and I’ll check in regularly to respond.</p>\n<p>If you find them useful, I’d love to hear your thoughts! Also, if you enjoy the apps, a review would mean the world to me. ❤️</p>\n<p>How to claim your free upgrade:</p>\n<p>Download ClipyBoard: <a href=\"https://apps.apple.com/app/id6738871678\">https://apps.apple.com/app/id6738871678</a></p>\n<p>Open the app and head to Settings.</p>\n<p>Tap on Redeem Code and enter this code: “gh45334k434343n”. this code only work for next 24 hours , after that you can get the app lifetime discount with 75% off using this code \"gh343443b422332n3\"</p>\n<p>⏳ This offer is only available for the next 24 hours, so grab it while you can!</p>\n<p>Thank you for your support, and happy  Typing!</p>\n<p>Cheers, Gohary</p>\n<p>➡️ Simply comment and upvote and share it with your friends 🧡</p>",
            "date_published": "2025-03-15T17:25:15+00:00",
            "authors": [
                {
                    "name": "Goharyiii",
                    "url": "https://www.reddit.com/user/Goharyiii"
                }
            ]
        },
        {
            "id": "1j9ez7q",
            "url": "/r/macapps/comments/1j9ez7q/i_build_a_small_menu_bar_app_that_nudges_you_back/",
            "external_url": "https://v.redd.it/gvzupts1t7oe1",
            "title": "I build a small menu bar app that nudges you back into focus - launching today",
            "content_html": "",
            "date_published": "2025-03-12T07:56:58+00:00",
            "authors": [
                {
                    "name": "ranft",
                    "url": "https://www.reddit.com/user/ranft"
                }
            ]
        },
        {
            "id": "1j58kan",
            "url": "/r/macapps/comments/1j58kan/we_just_launched_canvid_for_mac_celebrating_with/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1j58kan/we_just_launched_canvid_for_mac_celebrating_with/",
            "title": "We just launched Canvid for Mac! Celebrating with 50 free lifetime licenses!",
            "content_html": "<p>Hey everyone! After about a year as a Windows-only app, I'm excited to announce that we've just released the Mac version of <strong>Canvid</strong>, our screen recorder! 🎉</p>\n<p>https://reddit.com/link/1j58kan/video/xp8e5o6re5ne1/player</p>\n<p>To celebrate, I'm giving away a <strong>lifetime license</strong> to the first 50 people who comment.</p>\n<p>Want to see where Canvid is headed? Check out our <a href=\"https://www.canvid.com/roadmap\">roadmap</a> and this recent <a href=\"https://www.youtube.com/watch?v=Ubz--K2YlLk\">video from BETT UK 2025</a>.</p>\n<p>If you have any questions, feel free to ask here or join our Discord: <a href=\"https://discord.gg/EzrSs5zR\">https://discord.gg/EzrSs5zR</a>.</p>",
            "date_published": "2025-03-06T22:51:06+00:00",
            "authors": [
                {
                    "name": "7107Labs",
                    "url": "https://www.reddit.com/user/7107Labs"
                }
            ]
        },
        {
            "id": "1j46m9d",
            "url": "/r/macapps/comments/1j46m9d/just_launched_atten_app_website_blocker_for_mac/",
            "external_url": "https://i.redd.it/ascvq2izawme1.jpeg",
            "title": "Just launched Atten - App & Website Blocker for Mac & iOS. (Lifetime Pro Giveaway)",
            "content_html": "<p>Hey r/macapps! 👋</p>\n<p>I'm an indie developer, and I'm super excited to announce that Atten, my app and website blocker, is finally available on macOS! 🎉</p>\n<p>Atten helps you focus by blocking distracting apps and websites. The best part? It seamlessly syncs your blocking sessions between your iPhone, iPad, and now your Mac. Start a focus session on one device, and it's active on all of them!</p>\n<p>To celebrate the Mac launch, I'm doing two things:</p>\n<ul>\n<li>The Mac app is currently FREE to download!</li>\n<li>I'm giving away Lifetime Pro codes for the mobile app (iOS)! These codes unlock all premium features forever.</li>\n</ul>\n<p>If you'd like a Lifetime Pro code for the iOS app, upvote and leave a comment below, and I'll DM you one! (While supplies last, of course!).</p>\n<p>You can find the Mac app (and iOS app) here: www.atten.app</p>\n<p>Would love to hear your feedback on the Mac version!</p><div><br></div><img src=\"https://i.redd.it/ascvq2izawme1.jpeg\" />",
            "date_published": "2025-03-05T16:11:03+00:00",
            "authors": [
                {
                    "name": "Atten_app",
                    "url": "https://www.reddit.com/user/Atten_app"
                }
            ]
        },
        {
            "id": "1j2fgrw",
            "url": "/r/macapps/comments/1j2fgrw/tuneful_enhance_your_spotify_and_apple_music/",
            "external_url": "https://v.redd.it/jj6lyreo8gme1",
            "title": "Tuneful - Enhance your Spotify and Apple Music experience",
            "content_html": "",
            "date_published": "2025-03-03T10:09:37+00:00",
            "authors": [
                {
                    "name": "helloworldn",
                    "url": "https://www.reddit.com/user/helloworldn"
                }
            ]
        },
        {
            "id": "1ixsymk",
            "url": "/r/macapps/comments/1ixsymk/i_made_my_commercial_clipboard_manager_open/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1ixsymk/i_made_my_commercial_clipboard_manager_open/",
            "title": "I made my commercial clipboard manager open source because it's right",
            "content_html": "<p>We all know that clipboard managers handle sensitive data such as passwords, personal notes, API keys, etc. To trust one you need to be sure that it doesn't send your data to third parties or store it on remote servers.</p>\n<p>With closed-source apps, you have to take the developer’s word for it. As a software engineer, I don't like that. Transparency matters.</p>\n<p>So, I decided to make my commercial <a href=\"https://clipbook.app\">clipboard manager</a> open source. Anyone can inspect the source code, verify that data stays local and never leaves the user's device. Anyone can <a href=\"https://github.com/vladimir-ikryanov/ClipBook/blob/main/README.md#building-clipbook\">build the app from source</a> and use it.</p>\n<p><strong>GitHub</strong>: <a href=\"https://github.com/vladimir-ikryanov/ClipBook\">https://github.com/vladimir-ikryanov/ClipBook</a></p>\n<p>At the same time, the app is still commercial, as I need to cover hosting, tooling, and development costs. I know this means anyone can build the app from source and use it for free. Or even rebrand and sell it, but I think the trade-off is worth it.</p>\n<p>What do you think about this approach? Would you trust an open-source commercial app more than a closed-source one? Do you think I made a mistake?</p>",
            "date_published": "2025-02-25T11:36:30+00:00",
            "authors": [
                {
                    "name": "Ikryanov",
                    "url": "https://www.reddit.com/user/Ikryanov"
                }
            ]
        },
        {
            "id": "1indhkt",
            "url": "/r/macapps/comments/1indhkt/psa_apple_now_lets_you_migrate_digital_purchases/",
            "external_url": "https://support.apple.com/en-us/117294",
            "title": "[PSA] Apple Now Lets You Migrate Digital Purchases From One Apple Account to Another",
            "content_html": "<p>If an Apple Account is only used for making purchases, those purchases can be migrated to a primary Apple Account to consolidate them.</p>\n<p>Note: This feature isn’t available to users in the European Union, United Kingdom, or India.</p>",
            "date_published": "2025-02-12T00:00:43+00:00",
            "authors": [
                {
                    "name": "73ch_nerd",
                    "url": "https://www.reddit.com/user/73ch_nerd"
                }
            ]
        },
        {
            "id": "1if79wh",
            "url": "/r/macapps/comments/1if79wh/focu_is_now_opensource_mindful_productivity_app/",
            "external_url": "https://www.reddit.com/gallery/1if79wh",
            "title": "Focu is now open-source! Mindful productivity app with a locally running AI and long-term memory",
            "content_html": "",
            "date_published": "2025-02-01T14:19:46+00:00",
            "authors": [
                {
                    "name": "martin_buur",
                    "url": "https://www.reddit.com/user/martin_buur"
                }
            ]
        },
        {
            "id": "1i816n4",
            "url": "/r/macapps/comments/1i816n4/i_built_a_faster_than_your_launcher_launcher_for/",
            "external_url": "https://www.youtube.com/watch?v=hzzQl5FOL-k",
            "title": "I built a *faster than your launcher* launcher for macOS called Leader Key. It's the perfect sidekick for Raycast, Alfred, etc. And it's FREE and open source! Here's a video I made about it",
            "content_html": "",
            "date_published": "2025-01-23T11:21:23+00:00",
            "authors": [
                {
                    "name": "mikker",
                    "url": "https://www.reddit.com/user/mikker"
                }
            ]
        },
        {
            "id": "1i5o40d",
            "url": "/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/",
            "title": "Guide: The Terminal – For Noobs (Like Me)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/'>Reddit</a></caption><div><br></div><p>Yesterday I suddenly spent 7 hours writing a guide I named \"<em><strong>The Terminal – For Noobs (Like Me)</strong></em>\" – so I wanted to share it!</p>\n<p>As the title suggests, I'm absolutely no expert when it comes to the terminal – but I've started to like it. And if you find the terminal a bit daunting, it might be useful to have a guide written by someone for whom it <em>isn't</em> second nature.</p>\n<p>I've done my best to provide accurate explanations, while still keeping them simple. But please let me know if I've missed the mark!</p>\n<p><strong>This is not meant for those who'll <em>live</em> in the terminal! I guess it's <em>mostly</em> for non-programmers, like myself. My intension is to make it seem more tempting to add to your arsenal of Mac tools. And to reduce the dread when you have to dive into the world of command lines.</strong></p>\n<h4>As it become longer than first expected, I decided to split it up into 3 parts:</h4>\n<ul>\n<li>**<a href=\"https://havn.blog/2025/01/19/the-terminal-for-noobs-like.html\">Part One:** The Basic Concepts</a> (<em>Terminal</em>, <em>CLI</em>, <em>Shell</em>, <em>Prompt</em>,)</li>\n<li>**<a href=\"https://havn.blog/2025/01/19/215237.html\">Part Two:** The <em>Why</em> and _What</a>_</li>\n<li>**<a href=\"https://havn.blog/2025/01/19/220119.html\">Part Three:** A More Noob-Friendly Terminal</a></li>\n</ul>\n<p>Feedback is greatly appreciated! Both from noobs (like me), and from pros.</p>\n<p>If you're a noob, did it help you at all? Does it need more images and examples?</p>\n<p>Am I giving some bad advice or inaccurate statements?</p>\n<p>How do <em>you</em> use the terminal? And what are your feelings toward it?</p>",
            "date_published": "2025-01-20T11:26:19+00:00",
            "authors": [
                {
                    "name": "ErlendHM",
                    "url": "https://www.reddit.com/user/ErlendHM"
                }
            ]
        },
        {
            "id": "1i26sdt",
            "url": "/r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/",
            "external_url": "https://i.redd.it/3l7uvlhmq7de1.jpeg",
            "title": "Haven't used a Mac in ten years when I was a loyal user. Switched back to a MBA two days ago and I am absolutely floored. Both the hardware and digital architecture are entirely unrecognizable.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/3l7uvlhmq7de1.jpeg\" />",
            "date_published": "2025-01-15T20:22:09+00:00",
            "authors": [
                {
                    "name": "h4rryP",
                    "url": "https://www.reddit.com/user/h4rryP"
                }
            ]
        },
        {
            "id": "1i1awjs",
            "url": "/r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/",
            "external_url": "https://v.redd.it/rceavzoqrzce1",
            "title": "Let your apps fly—in a pie",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-14T17:09:08+00:00",
            "authors": [
                {
                    "name": "mrtnlxo",
                    "url": "https://www.reddit.com/user/mrtnlxo"
                }
            ]
        },
        {
            "id": "1i0vun1",
            "url": "/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/",
            "title": "My Favourite (Mostly Free) Must Have Mac Apps",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/'>Reddit</a></caption><div><br></div><p>I upgraded from my 2019 MacBook Air to the M3 Air in September and sort of went off the deep end, playing around with a lot of different apps to enhance my Mac experience. As a Uni student, here are the apps that I use every day and my honest user experience and feedback. Most of the apps installed are free, but any that aren't will have their price factored into my overall review. </p>\n<p><strong>All of these apps are super easy to install and use and don't require any complex coding knowledge!</strong></p>\n<p><strong>1. Media Mate</strong></p>\n<p><a href=\"https://wouter01.github.io/MediaMate/\">Media Mate Website</a></p>\n<p>I came across this app 2+ years ago, right when it launched. I hated the Vanilla macOS volume and brightness HUD, and Media Mate was an amazing alternative. In the last two years, the developer(s) have continued to refine and perfect this app with new features and customization options. It is one of the easiest apps to install and set up thanks to its super intuitive UI. While other Notch Apps have come since then that offer more features, none of them do what Media Mate does, as well as Media Mate does it. This app is perfect for anyone looking to refresh some aspects of the outdated macOS HUD. As one of the few paid apps on this list, the modest price tag of 7 euros (roughly $7 USD or $10 CAD) gives you lifetime access to 5 licences. I was more than satisfied with the price when I bought it 2 years ago and since then, the dev(s) have blown me away time and time again. Their ability to constantly release bug-free updates (I have never encountered a bug in my time using it) and well-refined make Media Mate integrate beautifully into macOS. To further emphasize how seamless this app is, I have found myself looking at a friend's computer when they change their volume and almost forgetting the Media Mate isn't a part of the Vanilla macOS. THAT'S HOW SEAMLESSLY THIS APP INTEGRATES INTO YOUR MAC!</p>\n<p>After over 2 years of use, I can confidently say that Media Mate gets a 10/10 from me. It does its job beautifully, and updates never feel like they were rushed out unfinished. Apps have come since which try to be better by having more bells and whistles but for those who just want an app which perfectly adds to your Mac, Media Mate stands alone as the best.</p>\n<p><strong>2. Ice</strong></p>\n<p><a href=\"https://github.com/jordanbaird/Ice/blob/main/README.md\">Ice Github Page</a></p>\n<p>Inspired by Bartender, Ice allows you to customize your menu bar and give it a clean and minimalist look. I love that this app solved my constant gripe about having a cluttered menu bar. I got this app initially before getting a Bartender key from someone else, so I'm able to give a direct comparison between the two. You are able to decide between “Always shown,” “Hidden,” and “Always Hidden.”</p>\n<p>Always shown is pretty self-explanatory. Items in the always-shown section will always be visible. I only have the date and time there, but that's just my love of minimalism speaking.</p>\n<p>Hidden is for your icons that you use semi-regularly but don't want to see all the time. These icons are revealed by dragging the mouse to the top of the screen. With the icons hiding again after moving the mouse away. This is where I keep my Wi-Fi, Bluetooth, and other icons that I visit on a fairly regular basis but not too often.</p>\n<p>Always hidden works the same as the hidden section, except it doesn't reveal when you drag your mouse to the top of the screen. Instead, simply hold option and click the top of the screen to reveal the always hidden bar, which goes back to being hidden once you move the mouse away from the top of the screen. I really only use this for certain apps which force an icon into the menu bar with no ability to disable it.</p>\n<p>There are two reasons why, in my opinion, Ice is actually a better app than Bartender, which I will explain below.</p>\n<p>Number one: IT'S FREE. The beauty of the app being free is that if you don't like it, you can uninstall and never think about it again. For offering all the same features without the cost, there isn't any drawback to at least trying out Ice before spending a whopping $30 CAD (approx 20 USD and Euro) on Bartender. After showing Ice to the person who gave me their bartender key, he was pretty pissed that he'd spent all that money, and I was able to get the same thing for free.</p>\n<p>Number two: This may not be much to everyone, but I love it. When Bartender hides apps from your menu bar, it replaces them with a plain grey space, which is pretty lame compared to what Ice has to offer. With Ice, any area which isn't being used in your menu bar is instead seamlessly replaced by your wallpaper! This feature works regardless of if you're using a still image or a dynamic wallpaper. Ice will always fill the space back in, which makes the menu bar much smaller and your screen much bigger! It reminds me of when Apple switched from the notch to the dynamic island with the iPhone 14. Even though there wasn't much more screen space being added, the screen feels much bigger and the camera housing feels less pronounced than with the notch. Overall, while this feature doesn't serve much of a use, it makes the top of your screen feel much cleaner without the grey bar running along the top of it.</p>\n<p>Overall, Ice gets an 8/10 from me. It has a few bugs now and then, but its dev team is super responsive to feedback and works really hard to fix bugs in a timely manner. Even with that in mind, there is no world where spending $30 on Bartender is better than at least trying Ice at no cost. For me, This is a rare example of an app where the free version is better than the paid.</p>\n<p><strong>3. Icon Champ</strong></p>\n<p><a href=\"https://www.macenhance.com/iconchamp.html\">IconChamp Install</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=487G8qaBky0&amp;ab_channel=MacProTips\">IconChamp YouTube Tutorial</a></p>\n<p><a href=\"https://macosicons.com/#/\">Mac Icons</a></p>\n<p><a href=\"https://apps.apple.com/us/app/image2icon-make-your-icons/id992115977?mt=12\">Image2Icon File Converter</a></p>\n<p>One of my most recent additions, IconChamp is another app that helps you modernize your Mac by giving you the ability to change your app icons to whatever you want. I love the dark icons that came out in iOS18 and wanted a way to give all the apps in my dock a common theme.</p>\n<p>This app has both a free and paid version. The free version allows you to change any apps that you have installed manually, as well as your folder icons on your user folders. The paid version is the only app I've ever been able to find which gives you the ability to change the icons of the base macOS apps and folders. The paid version gives you 3 keys and comes in at a price of approx $15 CAD (approx 10 USD and Euro). It's not the cheapest app, and most people will probably be more than fine with the free version, but the paid version gives that extra bit of personalization we all love (it's the reason that I, along with so many others, are in this subreddit in the first place).</p>\n<p>The beauty of IconChamp is that it's a simple drag-and-drop process, it doesn't require you to disable any security features, and any changes can be reverted with (literally) one click of a button. Since the release of macOS Sequoia, the app has gained a few bugs which, as far as I can see, haven't had any attempts of being remedied. I had to play around with it a bit and came across a YouTube video which helped me install the right version and gave the full run tutorial. I was able to get the majority of my images from the website featured in the video. For the apps which I couldn't find a version I liked on the website, I simply googled what I was looking for and used another app which will also be linked to convert the .png into a .icns file (the standard file type used for Apple app icons)(Since that, I noticed on their website that they claim to accept “all standard image file types,” so I think I took the scenic route for those extra icons by installing a whole other app to convert the file). One bug I encountered after uploading my desired icons was that while the app icons changed in the launchpad, the apps in my dock stayed the same. This was easily fixed by removing and re-adding those apps to my dock. The one app I haven't been able to change is the Calendar app. From doing some research online, it seems that the Calendar app has something special about it which makes it impossible to change its icon. Regardless, I love the ability to customize the rest of my apps and give my computer a more cohesive theme.</p>\n<p>Overall, I rate IconChamps a 7/10. While it has some bugs and the process can be a bit tedious, I found the finished product to be worth the process. The shared theme in my dock really makes it look a thousand times better, and I love that IconChamp is able to change system apps on top of third-party ones. The price tag for the pro version will certainly turn some people off, but the free version is still an amazing app for anyone wanting to update some older app icons.</p>\n<p><strong>4. Notch Focus Timer</strong></p>\n<p><a href=\"https://apps.apple.com/us/app/notch-focus-timer/id6477333821?mt=12&amp;src=AppAgg.com\">Notch Focus Timer</a></p>\n<p>One of the most simple additions to any Mac with a notch, Notch Timer is a super clean timer app that uses the Notch to display how long is left. The app is controlled through the menu bar, where, unlike Apple, you can set a timer as long as you'd like (seriously, I was able to make a time for 1,000,000,000 hours). You can also pause or stop the timer by simply dragging the mouse into the notch, which causes the timer to expand and display how long is left, and the buttons to pause or cancel. Notch Timer also allows you to toggle for different sounds to play once the timer has finished, and even change the colour of the bar wrapping around the notch to be any colour you desire. At a price of free and already on the App Store, there's no reason not to have this simple app on your Mac.</p>\n<p>Notch Focus Timer gets a 9/10. I can't think of any shortcomings in this app or any reason not to install it. The only concern I have is that I don't believe there is any way to delete a custom timer and I fear I now have a timer for 1,000,000,000 hours and no way to delete it. For what it is, it's pretty close to perfect. It's simple, it works perfectly, and it's super easy to use. Not every app needs to have 100 features, and this is a perfect example of that. Notch Timer does one thing, and it does it perfectly, so I can't ask anything more from it.</p>\n<p><strong>5. boringNotch</strong></p>\n<p><a href=\"https://theboring.name/\">boringNotch Install</a></p>\n<p>I previously asked this subreddit which notch app was considered the best. As I anticipated, everyone had their own answer. The thing with these notch apps like Alcove, Dynamic Lake, and NotchNook, is that they all have different pros and cons, making this review a little more subjective. After doing the trial on those previously mentioned apps, I decided to try boringNotch before deciding which app to commit to. Since installing boringNotch, I have forgotten about the other 3. boringNotch is quite similar to NotchNook, but a little simpler with not as many bugs.</p>\n<p>As a bit of a newer app, boringNotch doesn't have all of the features that its competition does, but that isn't always a bad thing. The devs have a clear roadmap on their GitHub page which clearly outlines the features they have planned, and an active discord community in which they tease new features, answer community questions, and investigate bug reports. Currently, boringNotch has an integrated calendar, media player, and drop tray for files, among other things. While boringNotch doesn't currently offer a system hud replacement, it's been teased numerous times and looks to hopefully be ready for release in due course. I've come up with a temporary solution to this by using MediaMate for my system hud and boringNotch for its media player and other features. The team working on this app is passionate about their work and has a strong base and a roadmap which looks promising for the future. I haven't encountered any major bugs using boringNotch and the devs are good about looking into issues and fixing major problems in a timely manner.</p>\n<p>Considering the price, its competition, and the plans for the future, I've gone with an 8/10 for boringNotch. Sure other notch apps may have more features, but is the number of features the only thing used to decide which is better? Of course not. boringNotch is surprisingly stable for being a newer app and it's started with a really strong base. I look forward to seeing the devs continue to build off of their strong start as they work through their roadmap</p>\n<p><strong>5. Dato</strong></p>\n<p><a href=\"https://apps.apple.com/us/app/dato/id1470584107?mt=12\">Dato on the Apple App Store</a></p>\n<p>Having used Dato for a couple of years now, it's another one of those apps that I often forget isn't a part of macOS for everyone! Dato makes it easy to access your calendar and see your upcoming events by simply clicking the icon in the menu bar. It makes it super easy to check your schedule coming up without having to open the calendar app every time. It's another one of those apps that feels super seamless and having used it for over 2 years now, I can't imagine using my Mac without it. I probably use it 2-3 times A DAY because it just makes accessing your calendar so easy. It is the most expensive app on here, costing $16 USD ($23 CAD or approx 15 euros) from the App Store, but I can assure you that you will find Dato to be an absolute essential that is definitely worth the price.</p>\n<p>I'm giving Dato an 8/10. I've never encountered a bug using Dato and I'm confident to say that it will change how you use your calendar on your Mac. My only issue with Dato is the price. I fear that without a free trial, many will underestimate how amazing Dato is, and be turned away by its steep price. Furthermore, by being in the App Store instead of giving a few licence keys which could be split between a few people. Unless you are a part of Family Sharing like I was, $16 USD for one person is a high price to pay and definitely reduces the number of new users. However, those who push past the price will understand why I only docked 2 points from its rating. I promise you, the sting of the price will go away, and you will be left with a truly revolutionary app that totally changes how you use your calendar.</p>\n<p><strong>6. DockDoor</strong></p>\n<p><a href=\"https://github.com/ejbills/DockDoor\">DockDoor Github</a></p>\n<p>Another recent installation, DockDoor makes it so much easier to manage all your windows. I usually like to keep my browser windows organized based on what I'm doing. This means I usually have 3 or 4 windows at a time for the different things I'm doing on my laptop. DockDoor will show you a preview of each window as you hover over it, making it super easy to manage and change windows. It's got a ton of customization and is another one of those apps that makes using a Mac that little bit better. I like being able to get a quick preview of what I have running on each app and I would totally recommend it for people who tend to have numerous apps and windows open at the same time. I've only had DockDoor for a little while now so I can't give the most in-depth review of it but my experience so far made it impossible to leave off of this list.</p>\n<p>Given DockDoor is free, it's another one of those apps where there's no reason not to install it and try it out. As a relatively newer app, I've encountered a few bugs which I'm sure will be fixed, but nothing that impacts your overall user experience. For these reasons, I've given DockDoor an 8/10 because I'm sure its bugs will be fixed and when that happens, you're left with a free app that makes managing your windows so much easier.</p>",
            "date_published": "2025-01-14T02:34:13+00:00",
            "authors": [
                {
                    "name": "aidanmavai",
                    "url": "https://www.reddit.com/user/aidanmavai"
                }
            ]
        },
        {
            "id": "1hz09ph",
            "url": "/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/",
            "title": "List of the best free apps. [UPDATED]",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/'>Reddit</a></caption><div><br></div><p>Link: <a href=\"https://github.com/Axorax/awesome-free-apps\">https://github.com/Axorax/awesome-free-apps</a></p>\n<p>Now, there are more tags and you can also filter to see apps for a specific platform. I also added a lot more apps suggested by you guys!</p>\n<p>Star the project to save it and show support (you can also donate to help)! &lt;3</p>\n<p>Suggest more cools apps here!</p>\n<p>For the future, if it gets enough donations, I plan on buying a domain and making a website so it's easier to filter, search and find cool apps.</p>",
            "date_published": "2025-01-11T16:59:46+00:00",
            "authors": [
                {
                    "name": "axorax",
                    "url": "https://www.reddit.com/user/axorax"
                }
            ]
        },
        {
            "id": "1hxckw7",
            "url": "/r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/",
            "external_url": "https://v.redd.it/iey7mj9suybe1",
            "title": "Dyet - Color your folder icons Automatiaclly",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-09T13:17:33+00:00",
            "authors": [
                {
                    "name": "WickedDogg",
                    "url": "https://www.reddit.com/user/WickedDogg"
                }
            ]
        },
        {
            "id": "1huwfvu",
            "url": "/r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/",
            "external_url": "https://v.redd.it/n06rmvy0tcbe1",
            "title": "Fully Local AI App for Real-Time Meeting Transcription & Dictation (No Wi-Fi Needed)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-06T10:55:00+00:00",
            "authors": [
                {
                    "name": "Which-Comment-8327",
                    "url": "https://www.reddit.com/user/Which-Comment-8327"
                }
            ]
        },
        {
            "id": "1hpvt70",
            "url": "/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/",
            "title": "What’s the Best Mac App of 2024?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/'>Reddit</a></caption><div><br></div><p>Hey everyone,</p>\n<p>As 2024 comes to a close, I’m curious to know which Mac apps stood out for you this year. Whether it's for productivity, creativity, organization, or just pure fun, I’d love to hear your recommendations.</p>\n<p>What’s the one app you think every Mac user should check out in 2024?</p>",
            "date_published": "2024-12-30T19:53:18+00:00",
            "authors": [
                {
                    "name": "vigneshvp",
                    "url": "https://www.reddit.com/user/vigneshvp"
                }
            ]
        },
        {
            "id": "1hmcbpk",
            "url": "/r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/",
            "external_url": "https://shortcat.app/",
            "title": "ShortCat lets you navigate the MacOS UI with your keyboard",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-26T00:06:55+00:00",
            "authors": [
                {
                    "name": "obviousoctopus",
                    "url": "https://www.reddit.com/user/obviousoctopus"
                }
            ]
        },
        {
            "id": "1hkxwgz",
            "url": "/r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/",
            "external_url": "https://v.redd.it/6akaffi32o8e1",
            "title": "Built-in Mac dictation was awful so I built my own called TalkText",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/'>Reddit</a></caption><div><br></div><p>I found built-in dictation awful for use day to day, especially when I had to think on the spot.</p>\n<p>So I built TalkText.io, a free to download macOS app that works anywhere you can type on your Mac. It allows you to speak naturally and not worry about every mistake in your speech being transcribed verbatim, unlocking many use cases.</p>\n<p>It also allows you to select and transform any text - you can select a sentence and ask for it to be rewritten in a certain style. Perhaps you’d like it to be friendlier, more professional, or even to sound like it was written by a pirate - anything is possible.</p>\n<p>You can check it out at: https://talktext.io</p>\n<p>Keen to get some feedback 😀</p>",
            "date_published": "2024-12-23T21:29:11+00:00",
            "authors": [
                {
                    "name": "jamie452",
                    "url": "https://www.reddit.com/user/jamie452"
                }
            ]
        },
        {
            "id": "1hg946x",
            "url": "/r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/",
            "external_url": "https://github.com/jaywcjlove/regex-mate",
            "title": "RegexMate 2.0.0 Released: A regex tool for macOS with built-in examples to help you get started easily! ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-17T12:01:02+00:00",
            "authors": [
                {
                    "name": "wcjiang",
                    "url": "https://www.reddit.com/user/wcjiang"
                }
            ]
        },
        {
            "id": "1hfg2ev",
            "url": "/r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/",
            "external_url": "https://www.reddit.com/gallery/1hfg2ev",
            "title": "I completed building this app recently, now it is available for mac and windows both.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-16T10:16:05+00:00",
            "authors": [
                {
                    "name": "Relevant_Motor_2613",
                    "url": "https://www.reddit.com/user/Relevant_Motor_2613"
                }
            ]
        },
        {
            "id": "1h5lad6",
            "url": "/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/",
            "title": "I'm sick of scam promotions",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/'>Reddit</a></caption><div><br></div><p><strong>BoltAI</strong> as an example. It's a good piece of software and I was considering buying it. But I hate scammers.</p>\n<p>Premium price in October: $79 ~~$100~~</p>\n<p>Premium price in Nov, 5th: $79 ~~$100~~</p>\n<p>Premium price in Nov, 24th: $79 ~~$112~~ (Black Friday promotion)</p>\n<p>Premium price today: $89  ~~$112~~ (Cyber Monday promotion)</p>",
            "date_published": "2024-12-03T11:26:18+00:00",
            "authors": [
                {
                    "name": "GovernmentVast1699",
                    "url": "https://www.reddit.com/user/GovernmentVast1699"
                }
            ]
        },
        {
            "id": "1h4ydsp",
            "url": "/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/",
            "title": "Was Gonna Discount My Mac App for Cyber Monday, But Screw It—Let’s Make It Free For Today Only (Until 12/3).",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/'>Reddit</a></caption><div><br></div><p>Happy Cyber Monday! I recently shared a <a href=\"https://www.reddit.com/r/appletv/comments/1h2qonl/was_gonna_discount_my_apple_tv_apps_for_black/\">similar offer in the Apple TV sub</a> for several of my Apple TV apps during Black Friday and was thrilled by the overwhelming response and gratitude. It inspired me to extend the same generosity to this sub with my macOS app for Cyber Monday! As a way to express my appreciation, I’m making my Mac meeting app, <strong>MeetingMenu</strong>, completely <strong>FREE</strong> until midnight on December 3, UTC! No subscriptions, no catch—just download and enjoy.</p>\n<p>I’m the developer of MeetingMenu, a Mac app I created to solve my own meeting management headaches. Like many of you, I find myself doing lots of meetings online across various apps. I’m frequently accessing the same settings and tools during meetings, and I wanted a way to keep them all in one convenient place—right in the menu bar.</p>\n<p>Most important for me was being able to see my next meeting at a glance, with a countdown timer and the ability to launch it with a single click—right in the menu bar. That feature alone has been a game-changer for staying organized and never missing a meeting.</p>\n<p>In addition, I wanted tools to simplify screen sharing, like quickly hiding my desktop, icons, and wallpaper to avoid any awkward moments. I also built in a privacy browser to prevent my bookmarks or history from showing during meetings.</p>\n<p>As I kept using it, I realized there were even more tools I frequently needed that were buried within the user interfaces of various meeting apps. So, I bundled them all into one app:</p>\n<ul>\n<li>Tools to quickly check my mic volume and see how I look on camera before meetings.</li>\n<li>A quick meeting launcher for platforms like Zoom, Teams, and Google Meet.</li>\n<li>Custom time zone views to see meeting times in different regions.</li>\n</ul>\n<p>Other features include: sticky notes, in-meeting indicator, low power mode, WiFi signal check, audio quality test, and more—all accessible from the menu bar.</p>\n<p>Yes, I know there are apps with overlapping features, but I needed something that combined everything I rely on in one place—like a Swiss Army knife for meeting tools.</p>\n<p>That’s how MeetingMenu came to life, and it’s been a lifesaver for me. It’s still relatively new, so I’d really appreciate any feedback, feature suggestions, or tips to make it better for the community.</p>\n<p>⏳ <strong>This is a one-day offer, valid until midnight on December 3, UTC.</strong> Must download today before it goes back to being paid.</p>\n<p>👉 <a href=\"https://apps.apple.com/us/app/meetingmenu/id6538714770\">Download MeetingMenu for Mac</a><br />\n👉 <a href=\"https://meetingmenu.app/\">Visit the MeetingMenu website</a></p>\n<p>Thanks again to this amazing community for your support—you’re the best! Enjoy the app, and let me know your thoughts in the comments! 😊</p>",
            "date_published": "2024-12-02T16:05:29+00:00",
            "authors": [
                {
                    "name": "rabbimarshak",
                    "url": "https://www.reddit.com/user/rabbimarshak"
                }
            ]
        },
        {
            "id": "1h4171w",
            "url": "/r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/",
            "external_url": "https://v.redd.it/8ukqtq42184e1",
            "title": "Made my first Mac App, which let's you rename files with AI. Any feedback?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-01T11:18:32+00:00",
            "authors": [
                {
                    "name": "Round-Rhubarb-8880",
                    "url": "https://www.reddit.com/user/Round-Rhubarb-8880"
                }
            ]
        },
        {
            "id": "1h17af8",
            "url": "/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/",
            "title": "Better Touch Tool Black Friday deals are here",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/'>Reddit</a></caption><div><br></div><ul>\n<li><strong>25</strong>% off on <strong>standard</strong> licenses</li>\n<li><strong>33</strong>% off on <strong>lifetime</strong> licenses</li>\n</ul>\n<p><a href=\"https://folivora.ai/blog/post/13309\">https://folivora.ai/blog/post/13309</a></p>",
            "date_published": "2024-11-27T15:45:24+00:00",
            "authors": [
                {
                    "name": "MobileCool7175",
                    "url": "https://www.reddit.com/user/MobileCool7175"
                }
            ]
        },
        {
            "id": "1h078qk",
            "url": "/r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/",
            "external_url": "https://v.redd.it/535bh5y0j73e1",
            "title": "I wanted to build this app to post cropped landscape video on the reels/shorts.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-11-26T08:33:14+00:00",
            "authors": [
                {
                    "name": "Relevant_Motor_2613",
                    "url": "https://www.reddit.com/user/Relevant_Motor_2613"
                }
            ]
        },
        {
            "id": "1gy0mvo",
            "url": "/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/",
            "title": "I see a lot of “top free apps” posts - what are your must-have PAID apps? ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/'>Reddit</a></caption><div><br></div><p>Title says it all - what are some paid apps you can’t live without? </p>",
            "date_published": "2024-11-23T14:19:19+00:00",
            "authors": [
                {
                    "name": "MorphicSn0w",
                    "url": "https://www.reddit.com/user/MorphicSn0w"
                }
            ]
        },
        {
            "id": "1gvm542",
            "url": "/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/",
            "title": "Two Free Apps for Mac OS Installation Ease",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/'>Reddit</a></caption><div><br></div><p><a href=\"https://preview.redd.it/1poozcre512e1.png?width=1099&amp;format=png&amp;auto=webp&amp;s=5c9b79722a27b7e2c1d7c4aa64c1269692314145\">Mist Menu</a></p>\n<p>On most modern Macs, the later Intel builds and all Apple Silicon models, you can boot into recovery mode, access disk utility and download and install a new operating system. Unless you can't. Then you have a problem. Or, maybe you are experimenting with <a href=\"https://apps.louplummer.lol/post/open-core-legacy-patcher\">Open Core Legacy Patcher</a> to install a later version of macOS on a device that doesn't officially support it. In that case, you are going to need a copy of an OS, preferably bootable, and some sort of media to copy that OS installation onto. You can do the installation through other methods, like target disk mode or various imaging applications too, but they take some know how. The other thing you can use these files for is when experimenting with virtual machines in something like Virtual Box, UTM or VMWare Fusion.</p>\n<p><strong>Mist</strong></p>\n<p>To get a copy of the firmware and OS you need, I know of no easier method than using <a href=\"https://github.com/ninxsoft/Mist?tab=readme-ov-file\">Mist</a>, a free app available on GitHub. With Mist, you can get everything from the latest beta, all the way back to Mac OS X 7.5. You can get Intel or Apple Silicon installers, or the universal installers available for macOS Big Sur and later.</p>\n<p><strong>Balena Etcher</strong></p>\n<p>If you are planning to use an SD card or a USB drive, things work better when you flash the media than when you try to fiddle with partitions and permissions on your own from the command line. Luckily, there is an app for that. It is <a href=\"https://etcher.balena.io/\">Balena Etcher</a>, a free app with built-in safeguards to keep you from erasing the wrong drive. Balena Etcher will also create bootable media for Windows and various Linux builds too.</p>",
            "date_published": "2024-11-20T10:02:36+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1gkrg9s",
            "url": "/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/",
            "title": "An app to make an chm(Compiled HTML Help) file on MacOS",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/'>Reddit</a></caption><div><br></div><p>Hi there, I've searching an app to make a chm<strong>(Compiled HTML Help)</strong> for years on mac, my findings were null because I found only chm readers like <a href=\"https://github.com/vit9696/ichm\">ichm</a> but I would like to have an app to make my own chm files </p>\n<p>If you know apps, please share i'd glad to hear your comments </p>",
            "date_published": "2024-11-06T05:46:53+00:00",
            "authors": [
                {
                    "name": "SpectyteCovelight",
                    "url": "https://www.reddit.com/user/SpectyteCovelight"
                }
            ]
        },
        {
            "id": "1gkkodt",
            "url": "/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/",
            "title": "Zero Loss Compress: Reduce Photo Library Size Without Data Loss!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/'>Reddit</a></caption><div><br></div><p><a href=\"https://fractale.itch.io/zero-loss\">https://fractale.itch.io/zero-loss</a><br />\nI'm the app developer, and I'm happy to answer any questions you might have.</p>",
            "date_published": "2024-11-05T23:32:54+00:00",
            "authors": [
                {
                    "name": "perecastor",
                    "url": "https://www.reddit.com/user/perecastor"
                }
            ]
        },
        {
            "id": "1gk4utq",
            "url": "/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/",
            "title": "[GIVEAWAY] Alter -- An AI Assistant Truly Built For Mac",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/'>Reddit</a></caption><div><br></div><p>Hey MacApps community!</p>\n<p>We've partnered with a small team of Mac enthusiasts who've created Alter – an AI assistant built for macOS designed to upgrade all your apps with AI capabilities.</p>\n<p><strong>💡 Why Alter was Created:</strong> \"We were frustrated with AI tools that didn't really \"get\" the Mac ecosystem and often disrupted our focus. So we built something that works naturally with macOS, understanding your apps and workflows.\"</p>\n<p><strong>🔥 What makes Alter unique:</strong></p>\n<ol>\n<li>Chat with files and folders directly from the Finder</li>\n<li>App-aware AI - Interact with Apple Mail, Discord, browsers and more.</li>\n<li>YouTube summaries on the fly - Summarize or chat with video content without leaving your page.</li>\n<li>Artifacts - Generate presentations, interactive charts, diagrams and HTML apps ready to be shared.</li>\n<li>Multiple AI providers - Access OpenAI, Anthropic, Together, Google, Groq and others without setup.</li>\n<li>Minimized mode - Start as many conversations as you need and keep them at hand</li>\n<li>Free plan - all features enabled, no limitation, 500 credits to start.</li>\n</ol>\n<p><strong>👉 Notable features:</strong></p>\n<ul>\n<li>Screenshots support - Take screenshots to add context for an AI action.</li>\n<li>Automatic, mnemonic keyboard shortcuts - Quick access to 80+ AI Actions.</li>\n<li>Privacy-ready - Full support for local AI tools: Ollama, LM Studio, etc.</li>\n<li>Bring your own key - Use your own provider with an OpenAI compatible endpoint.</li>\n<li>Image generation - Create visuals with Flux models</li>\n<li>Chain AI actions - Reuse the last output for fast iteration.</li>\n<li>OpenAI Compatible Endpoint - Use all our models in other tools and centralize your billing</li>\n</ul>\n<p><strong>🎁 Special offer for the community:</strong> **Limited Time Offer: **Get 25% off on the Power User Plan with code: MACAPPS. <strong>Giveaway Alert:</strong> We're giving away 2 Self-service plan in our Discord server and 1 exclusive Power User plan for server boosters! To enter the giveaway, join the Discord server: <a href=\"https://discord.gg/macapps-1017764460217237528\">https://discord.gg/macapps-1017764460217237528</a></p>\n<p>🔽 Download Alter: <a href=\"https://alterhq.com/\">https://alterhq.com/</a></p>\n<p><a href=\"https://i.redd.it/8shohufym2zd1.gif\">Preview</a></p>",
            "date_published": "2024-11-05T11:49:47+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1gjwx7v",
            "url": "/r/macapps/comments/1gjwx7v/mac_app_sales/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gjwx7v/mac_app_sales/",
            "title": "mac app sales",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gjwx7v/mac_app_sales/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gjwx7v/mac_app_sales/'>Reddit</a></caption><div><br></div><p>any deals or bundles on sale you all are looking forward to this coming black friday/holiday season?</p>",
            "date_published": "2024-11-05T02:56:57+00:00",
            "authors": [
                {
                    "name": "Few_Association_775",
                    "url": "https://www.reddit.com/user/Few_Association_775"
                }
            ]
        },
        {
            "id": "1gjjf52",
            "url": "/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/",
            "title": "Automatically Quit Apps using \"Last Window Quits\" (new release)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/'>Reddit</a></caption><div><br></div><p>Hello! I’ve just published my second macOS app, which detects when the last window of an app is closed and quits that app. This helps prevent unnecessary memory usage by apps that are not actively being used. While macOS does have built-in memory management, I’ve encountered situations where the system runs out of memory without closing inactive apps. I created this app to ensure all apps without open windows are closed. The app is free—hope you enjoy it, and feel free to share any feedback. Cheers.</p>\n<p><a href=\"https://lawand.io/last-window-quits/\">https://lawand.io/last-window-quits/</a></p>",
            "date_published": "2024-11-04T17:09:20+00:00",
            "authors": [
                {
                    "name": "CharacterTomatillo64",
                    "url": "https://www.reddit.com/user/CharacterTomatillo64"
                }
            ]
        },
        {
            "id": "1gisv45",
            "url": "/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/",
            "title": "Mac apps that are must-installs because they’re masterpieces of software?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/'>Reddit</a></caption><div><br></div><p>Hey everyone,</p>\n<p>Just got a new Mac and I want to make sure I’m loading it up with the best apps out there. I’m not just looking for any app, but those that truly feel like masterpieces of design, functionality, and user experience.</p>\n<p>What Mac apps do you consider essential because they’re beautifully crafted, powerful, or just make life way easier? Bonus points for ones that are a joy to use or that take full advantage of macOS’s design.</p>\n<p>Let me know your top picks! Thanks in advance!</p>",
            "date_published": "2024-11-03T17:57:42+00:00",
            "authors": [
                {
                    "name": "stuffe23",
                    "url": "https://www.reddit.com/user/stuffe23"
                }
            ]
        },
        {
            "id": "1gh8jd2",
            "url": "/r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/",
            "external_url": "https://www.pixelmator.com/blog/2024/11/01/a-new-home-for-pixelmator/",
            "title": "Apple has acquired the Pixelmator Pro team. Are we getting a first-party Photoshop competitor?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-11-01T15:48:23+00:00",
            "authors": [
                {
                    "name": "smelly0live",
                    "url": "https://www.reddit.com/user/smelly0live"
                }
            ]
        },
        {
            "id": "1ge1opz",
            "url": "/r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/",
            "external_url": "https://i.redd.it/8dnm7z38yhxd1.png",
            "title": "Some of my favorite Mac apps! Any more recommendations?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/8dnm7z38yhxd1.png\" />",
            "date_published": "2024-10-28T13:12:19+00:00",
            "authors": [
                {
                    "name": "itsvelora",
                    "url": "https://www.reddit.com/user/itsvelora"
                }
            ]
        },
        {
            "id": "1gdjhh6",
            "url": "/r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/",
            "external_url": "https://mastodon.cloud/@kagihq@mastodon.social/113380675376996794",
            "title": "We have just updated Orion for desktop and it is a big release! ✨\n\nFeaturing auto Picture-in-Picture when switching tabs, enhanced privacy features, custom start pages, smart tab management plus over 70 improvements & bug fixes!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-27T19:46:26+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "1gcgu3r",
            "url": "/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/",
            "title": "Virtual Buddy - Run Mac and Linux VMs with Ease on Apple Silicon for Free",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/'>Reddit</a></caption><div><br></div><p><a href=\"https://preview.redd.it/0xyu6ieze2xd1.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=093dc9738b91549b55dd622f7254feee984e80ff\">Virtual Buddy Showcase</a></p>\n<p>If you want to test out betas without endangering your primary machine or if or if your a developer looking to test backwards compatibility with previous versions of macOS with your app or even if you just want a safe way to test software you want to try before adding it to your daily driver, take a look at Virtual Buddy, by developer Guilherme Rambo, <a href=\"https://github.com/insidegui/VirtualBuddy\">a GitHub release with 5.1K stars</a>. It also runs several Linux distros if you have a need for that.</p>\n<p>You can choose a Mac release (including betas) from a long list ranging from macOS 13.3 all the way to macOS 15.1 RC1. If you have a URL for another IPSW or an IPSW you have already downloaded, you can use them as well.</p>\n<p>If you want to install a beta of a version higher than what you are running on your host computer, all you need to do is download the latest device support package from Apple which you can sometimes download from their website but cal always get if you install the latest Xcode beta.</p>\n<p>The developer lists these features:</p>\n<ul>\n<li>Ability to boot any version of macOS 12 or macOS 13, including betas</li>\n<li>Ability to boot some ARM-based Linux distros (tested with Ubuntu Server and Ubuntu Desktop)</li>\n<li>Built-in installation wizard</li>\n<li>Select from a collection of restore images available on Apple's servers</li>\n<li>Install the latest stable version of macOS</li>\n<li>Local restore image IPSW file</li>\n<li>Custom restore image URL</li>\n<li>Install a Linux distro from a local .iso file</li>\n<li>Select from a collection of Linux distros</li>\n<li>Install Linux from URL</li>\n<li>Boot into recovery mode (in order to disable SIP, for example)</li>\n<li>Networking and file sharing support</li>\n<li>Clipboard sharing</li>\n<li>Customize virtual machine hardware configuration</li>\n<li>Save and restore macOS virtual machine state</li>\n</ul>\n<p><a href=\"https://github.com/insidegui/VirtualBuddy\">Download from GitHub.</a></p>",
            "date_published": "2024-10-26T08:57:03+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1gabcij",
            "url": "/r/macapps/comments/1gabcij/hazel_6_just_got_released/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gabcij/hazel_6_just_got_released/",
            "title": "Hazel 6 just got released",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gabcij/hazel_6_just_got_released/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gabcij/hazel_6_just_got_released/'>Reddit</a></caption><div><br></div><p>According to the email I got it has several awesome new features:</p>\n<ul>\n<li>On-the-fly text recognition. When matching against a file’s contents, Hazel can do text recognition on PDFs that haven’t been OCRed. Works on images, too!</li>\n<li>Ability to read encrypted PDFs. You can now supply a password in your rule to unlock any encrypted PDFs so that Hazel can read their contents. Passwords are stored securely in your keychain.</li>\n<li>Revert File: you can now access Hazel functionality in Finder. If Hazel put a file somewhere you didn’t intend, you can select the file in Finder, right-click it and select Revert to put it back. You can undo file moves, renames, tag and comment changes.</li>\n<li>New custom list attribute to allow you match and store lists of items. You can match against other lists or text. With these, you can copy tags between files or assign tags from files.</li>\n<li>New actions to lock/unlock files and to pause a rule.</li>\n</ul>\n<p>I’m so happy to throw money at this dev. I don’t know how much time Hazel saved me, but it is a lot. Everyone is talking about Inbox zero but this piece of software helped me to achieve Downloads folder zero which is something I wouldn’t have done without it.</p>",
            "date_published": "2024-10-23T14:03:46+00:00",
            "authors": [
                {
                    "name": "Johnkree",
                    "url": "https://www.reddit.com/user/Johnkree"
                }
            ]
        },
        {
            "id": "1g9lpfm",
            "url": "/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/",
            "title": "What paid mac apps are worth every penny that they cost?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-22T16:02:15+00:00",
            "authors": [
                {
                    "name": "ChewyTheJedi",
                    "url": "https://www.reddit.com/user/ChewyTheJedi"
                }
            ]
        },
        {
            "id": "1g2wjnc",
            "url": "/r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/",
            "external_url": "https://i.redd.it/hic83zbajkud1.png",
            "title": "🎉 I just updated my macOS app!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/hic83zbajkud1.png\" />",
            "date_published": "2024-10-13T18:40:28+00:00",
            "authors": [
                {
                    "name": "Glubker",
                    "url": "https://www.reddit.com/user/Glubker"
                }
            ]
        },
        {
            "id": "1g1whdi",
            "url": "/r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/",
            "external_url": "https://v.redd.it/0m9n8n03oaud1",
            "title": "I rewrote ShakePin from scratch for 3 weeks. It's an open source Dropover alternative that i shared 2 months ago.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-12T09:33:20+00:00",
            "authors": [
                {
                    "name": "No_Assistant1783",
                    "url": "https://www.reddit.com/user/No_Assistant1783"
                }
            ]
        },
        {
            "id": "1g0myjl",
            "url": "/r/macapps/comments/1g0myjl/update_wblock_010_beta_is_live/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1g0myjl/update_wblock_010_beta_is_live/",
            "title": "UPDATE: wBlock 0.1.0 beta is live!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g0myjl/update_wblock_010_beta_is_live/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g0myjl/update_wblock_010_beta_is_live/'>Reddit</a></caption><div><br></div><p>I just wanted to follow up on the <a href=\"https://www.reddit.com/r/macapps/comments/1g02q1p/comment/lr8mmim/?context=3\">amazing post</a> from yesterday, where they shared my project, wBlock, with the community. I'm thrilled to announce that wBlock 0.1.0 is now live and available for download!</p>\n<p>For those of you who are new, wBlock is a free and open-source ad blocker for Safari that's designed to be fast, customizable, and effective. I've built it to block not just ads, but also trackers and malware, including scripted YouTube ads - and I'm committed to keeping it free and open for everyone to use and improve.</p>\n<p>As a solo developer, it's been a labor of love to get wBlock to this point, and I'm excited to hear your thoughts and feedback. If you encounter any issues, please don't hesitate to open an issue on GitHub.</p>\n<p><strong>Check out the first release here:</strong> <a href=\"https://github.com/0xCUB3/wBlock/releases/tag/0.1.0\">https://github.com/0xCUB3/wBlock/releases/tag/0.1.0</a></p>\n<p>Main repo: <a href=\"https://github.com/0xCUB3/wBlock\">https://github.com/0xCUB3/wBlock</a></p>",
            "date_published": "2024-10-10T16:33:12+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1g0le53",
            "url": "/r/macapps/comments/1g0le53/polycapture_screen_camera_audio_recorder_macos/",
            "external_url": "https://i.redd.it/cvgqr9524ytd1.png",
            "title": "PolyCapture — Screen, Camera & Audio Recorder (macOS)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g0le53/polycapture_screen_camera_audio_recorder_macos/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g0le53/polycapture_screen_camera_audio_recorder_macos/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/cvgqr9524ytd1.png\" />",
            "date_published": "2024-10-10T15:25:47+00:00",
            "authors": [
                {
                    "name": "mrtnlxo",
                    "url": "https://www.reddit.com/user/mrtnlxo"
                }
            ]
        },
        {
            "id": "1fxe8nr",
            "url": "/r/macapps/comments/1fxe8nr/what_are_the_mac_apps_you_cannot_live_without/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fxe8nr/what_are_the_mac_apps_you_cannot_live_without/",
            "title": "What are the Mac Apps you cannot live without?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fxe8nr/what_are_the_mac_apps_you_cannot_live_without/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fxe8nr/what_are_the_mac_apps_you_cannot_live_without/'>Reddit</a></caption><div><br></div><p>What are some of the Mac Apps you can't live without?</p>\n<p>for me, these are irreplacable:</p>\n<p><strong>1.  1Password:</strong><br />\nMy Password manager for managing passwords, 2FA, Credit cards, Identity, addresses, software licenses and Passkeys. Absolutely irreplaceable.</p>\n<p><strong>2.  RayCast:</strong><br />\nI tried RayCast twice for 1-2 days, wasn't sure how to use it, then I tried it again by going all-in and replacing Spotlight keyboard shortcut with Raycast and man, I'm in live with it more and more everyday! This is an absolutely must-have for developers and normal users alike.</p>\n<p>Their Clipboard history with option to search in Images (OCR) works amazingly and is very snappy.</p>\n<p>It can do wonderful stuff including so many calculations (days to, since specific date, modifying text, Quick snippets to quickly fill tons of texts, replaces MacOS's native Text Replacement much better by allowing to to have multi-line replacements and so much more)</p>\n<p>You can do everything with a keyboard shortcut including making windows full-screen, maximizing, minimizing, specific sizes (left half, first third-half and so much more)|  </p>\n<p><strong>3.  Shottr:</strong><br />\nA wonderful, super-lightweight Screenshot tool, can do a lot more than MacOS' native screenshot tool and works like a charm. You can now add 'backdrop', gradient style backgrounds to screenshots too, the popular style for code and other screenshots these days, and is super super fast!  </p>\n<p>MonitorControl and Lunar:<br />\nThese are both great for managing brightness of your external monitors using keyboard shortcuts, a must have if you use external monitor regularly.  </p>\n<p><strong>4.  Rectangle:</strong><br />\nThis is my Window manager of choice, both free and Pro versions are great. A lot more feature than MacOS' built-in windows manager (that was released just recently in Sequoia) and works amazing with RayCast support.</p>\n<p><strong>5.  ChatGPT:</strong><br />\nChatGPT's Mac native app is amazing! The quickbar works great and it is not possible to live without it. Much easier access compared to the web-version.  </p>\n<p>What are yours?</p>",
            "date_published": "2024-10-06T11:19:36+00:00",
            "authors": [
                {
                    "name": "AmazingExplorer698",
                    "url": "https://www.reddit.com/user/AmazingExplorer698"
                }
            ]
        },
        {
            "id": "1fulspc",
            "url": "/r/macapps/comments/1fulspc/a_fair_warning_about_the_app_wispr_flow_voice/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fulspc/a_fair_warning_about_the_app_wispr_flow_voice/",
            "title": "A fair warning about the app \"Wispr Flow\" voice input app which just launched on Product Hunt",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fulspc/a_fair_warning_about_the_app_wispr_flow_voice/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fulspc/a_fair_warning_about_the_app_wispr_flow_voice/'>Reddit</a></caption><div><br></div><p>Seriously have never encountered such a shady app or business ever (even though the product is great at what it does). The Wispr Team deactivated my Slack account on their workspace after asking polite and totally fair questions there in my mind. Super shady inner workings in this app in my opinion. And a red flag how they treat their users. Definitely did not feel right from the start. (I used it for about a month).</p>\n<p>My post on Slack before they banned me on their Slack (oh and I also said that I was going to uninstall because I realized after removing it from login items, because I was done with it for a while, only to realize THAT IT WILL INJECT ITSELF INTO YOUR LOGIN ITEMS AGAIN SOMEHOW ON LOGIN.</p>\n<p>\"Hey Wispr team,</p>\n<p>I've been using Flow for a while now, and I've got to say, the functionality is impressive. However, I have several concerns:</p>\n<ol>\n<li>\n<p>System Integration:\nThe app for some reason ruins my right-click context menu in Firefox. Extension options in right-click context menus disappear on hover. I spent hours troubleshooting, even ended up nuking my Firefox setup, only to find out Flow was the culprit. What is it doing in Firefox anyway?\nSuddenly, I'm seeing the Wispr Flow logo in my Chrome address bar. I don't remember enabling this, and there seems to be no way to turn this off?\nThe app adds itself to login items every time it's launched. This is not standard behavior and feels intrusive.</p>\n</li>\n<li>\n<p>Resource Usage:\nThe app is a whopping 800MB, which feels kind of big for a dictation tool?\nIt's constantly using about 8% CPU, even when idle. What's it doing in the background?\nLaunch time is around 10 seconds with quirky loading messages. What's really happening during this \"setup\"?</p>\n</li>\n<li>\n<p>Deep Integration and Privacy Concerns:\nThe onboarding checklist actually tracks actions across apps. It knew when I used Discord, ChatGPT, mail and other apps which I don't remember 100%. This level of system awareness is alarming.\nYour promo video shows the app using context to correctly spell unusual names in emails. How exactly is this context gathered? Does it capture my screen or what?</p>\n</li>\n<li>\n<p>Transparency Issues:\nYour privacy policy is vague and broad. It doesn't provide clear limits on data use or specific explanations of what data is collected in different scenarios.\nThe policy mentions using customer content to train AI models. Does this include my dictations and the context you gather?\nThere's no clear documentation about the app's system interactions or the full extent of its capabilities.</p>\n</li>\n<li>\n<p>Browser Integration:\nThe Chrome and Firefox integrations appeared without clear user consent or easy ways to disable them.\nWhat exactly are these browser integrations doing? Are they monitoring my web activity?</p>\n</li>\n<li>\n<p>Data Collection and Usage:\nGiven the app's deep integration and context awareness, what exactly are you collecting?\nHow is this data being used beyond the immediate dictation functionality?\nAre you sharing this data with third parties? If so, with whom and for what purposes?</p>\n</li>\n<li>\n<p>User Control:\nThere seems to be a lack of granular controls for the app's various integrations and features.\nHow can users opt out of specific data collection or feature integrations?\nHow can users opt out of injections into certain apps? Shouldn't it be opt-in?</p>\n</li>\n<li>\n<p>Security Concerns:\nWith such deep system access, what security measures are in place to protect user data?\nHow are you safeguarding against potential misuse of the app's extensive permissions?</p>\n</li>\n</ol>\n<p>Don't get me wrong - the core functionality of Flow is impressive. The dictation accuracy, speed, and cross-app functionality are genuinely useful. But right now, using Flow feels like I've given an unknown entity unfettered access to my digital life. Given these concerns, I'm hesitant about becoming a paid subscriber.</p>\n<p>We need some real transparency here:\n1. Can you provide a detailed, technical explanation of Flow's system access and integration methods?\n2. What specific data are you collecting, and how exactly is it being used and protected?\n3. Can we get more granular user controls over the app's various features and integrations?\n4. Are there plans to optimize the app's resource usage and size?\n5. How are you ensuring user privacy and security given the app's deep system access?</p>\n<p>I want to continue using Flow, but I need to fully understand what I'm permitting on my system. Looking forward to your detailed response.\"</p>\n<p>I've got some email correspondence with them and I had more questions in the Slack which went unanswered.</p>",
            "date_published": "2024-10-02T17:24:34+00:00",
            "authors": [
                {
                    "name": "StableSable",
                    "url": "https://www.reddit.com/user/StableSable"
                }
            ]
        },
        {
            "id": "1fsqyc9",
            "url": "/r/macapps/comments/1fsqyc9/hey_my_speech_dictation_tool_wisprflow_is_finally/",
            "external_url": "https://v.redd.it/nu4oq0uttwrd1",
            "title": "Hey! My speech dictation tool (WisprFlow) is finally launching on Product Hunt today",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fsqyc9/hey_my_speech_dictation_tool_wisprflow_is_finally/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fsqyc9/hey_my_speech_dictation_tool_wisprflow_is_finally/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-09-30T08:48:49+00:00",
            "authors": [
                {
                    "name": "LanguageSad1430",
                    "url": "https://www.reddit.com/user/LanguageSad1430"
                }
            ]
        },
        {
            "id": "1fridsq",
            "url": "/r/macapps/comments/1fridsq/just_finished_my_first_macos_app_daily_so_proud/",
            "external_url": "https://v.redd.it/0fk59crfvkrd1",
            "title": " Just finished my first macOS app - Daily. So proud! It has full keyboard support and focuses on your productivity!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fridsq/just_finished_my_first_macos_app_daily_so_proud/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fridsq/just_finished_my_first_macos_app_daily_so_proud/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-09-28T16:40:38+00:00",
            "authors": [
                {
                    "name": "Baervan",
                    "url": "https://www.reddit.com/user/Baervan"
                }
            ]
        },
        {
            "id": "1fp2eju",
            "url": "/r/macapps/comments/1fp2eju/we_did_it_100000_members_strong/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fp2eju/we_did_it_100000_members_strong/",
            "title": "🎉 We Did It! 100,000 Members Strong! 🎉",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fp2eju/we_did_it_100000_members_strong/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fp2eju/we_did_it_100000_members_strong/'>Reddit</a></caption><div><br></div><p><a href=\"https://i.redd.it/ytu3k317yxqd1.gif\">Made with Gifski</a></p>\n<p>Hey everyone,</p>\n<p>We are beyond thrilled to announce that our community has reached a major milestone - <strong>100,000 members</strong>! This is an incredible achievement, and it’s all thanks to each and every one of you who has joined, contributed, and supported this subreddit.</p>\n<p>From the bottom of our hearts, thank you for making this community such a vibrant, engaging, and supportive place. Whether you’ve been here since the beginning or are a new member, your participation has helped us grow into the amazing group we are today.</p>\n<p>To celebrate this milestone, u/sindresorhus is gifting us 40! codes (per app!!) for <a href=\"https://sindresorhus.com/dato\">Dato</a>, <a href=\"https://sindresorhus.com/scratchpad\">Scratchpad</a>, <a href=\"https://sindresorhus.com/online-check\">Online Check</a>, <a href=\"https://sindresorhus.com/one-task\">One Task</a>, <a href=\"https://sindresorhus.com/camera-preview\">Camera Preview</a>, <a href=\"https://sindresorhus.com/black-out\">Black Out</a>, <a href=\"https://sindresorhus.com/lungo\">Lungo</a> and <a href=\"https://sindresorhus.com/battery-indicator\">Battery Indicator</a>. Quite amazing really. We will randomly distribute them to anyone who's interested after in about a week or so. Simply let us know in a comment what app you'd like, or already have.</p>\n<p>Thank you again for being part of this. Thank you u/evolworks, u/0xCUBE &amp; u/Yusuf-Dev for your relentless work. And thank you Sindre for for being awesome. Here’s to the next 100k members and beyond!</p>\n<p>With gratitude,</p>\n<p>Your Mods</p>",
            "date_published": "2024-09-25T11:46:05+00:00",
            "authors": [
                {
                    "name": "Pandemojo",
                    "url": "https://www.reddit.com/user/Pandemojo"
                }
            ]
        },
        {
            "id": "1focdje",
            "url": "/r/macapps/comments/1focdje/fresh_mac_apps_for_productivity_in_2024_to_give/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1focdje/fresh_mac_apps_for_productivity_in_2024_to_give/",
            "title": "Fresh Mac Apps for Productivity in 2024 to Give Your Workflow a Boost",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1focdje/fresh_mac_apps_for_productivity_in_2024_to_give/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1focdje/fresh_mac_apps_for_productivity_in_2024_to_give/'>Reddit</a></caption><div><br></div><p>Hey all! I’ve been hunting for some new productivity apps for my Mac, and after a bit of experimenting, I found some lesser-known gems that really helped me streamline my work. These apps are on the rise and definitely worth checking out:</p>\n<ol>\n<li><strong>Flow by Wispr</strong>: If you’ve got a lot of ideas but not enough time to type them all out, Flow is a great voice-to-text app. It’s not just about dictation—it actually personalizes your written word to match your natural style. I’ve found it super helpful when I’m multitasking or trying to capture ideas on the fly.</li>\n<li><strong>Raycast</strong>: Similar to Alfred but sleeker and faster. It’s a productivity launcher that lets you manage apps, scripts, and even GitHub or Slack right from your keyboard. It’s perfect if you love hotkeys and avoiding the mouse altogether.</li>\n<li><strong>TickTick</strong>: A to-do list app that comes with an integrated Pomodoro timer and habit tracker. It’s been my go-to for managing tasks and staying focused on one thing at a time. Plus, it’s flexible enough for both work and personal use.</li>\n<li><strong>Superhuman</strong>: For anyone who deals with a flood of emails, this one’s a game-changer. It’s an email app that focuses on speed and minimalism, helping you get through your inbox faster than ever. Super helpful for cutting through the clutter!</li>\n<li><strong>Loom</strong>: Loom’s a video messaging tool, but it’s perfect for sending quick updates or feedback without typing long emails. I use it to create short video walk-throughs for my team, and it saves so much time compared to typing everything out.</li>\n</ol>\n<p>Lemme know if you've tried knew stuff that stuck!</p>",
            "date_published": "2024-09-24T13:22:57+00:00",
            "authors": [
                {
                    "name": "Tick_Tock_Snazzy",
                    "url": "https://www.reddit.com/user/Tick_Tock_Snazzy"
                }
            ]
        },
        {
            "id": "1fnkpf6",
            "url": "/r/macapps/comments/1fnkpf6/made_an_app_to_stop_the_recurring_screen_capture/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fnkpf6/made_an_app_to_stop_the_recurring_screen_capture/",
            "title": "Made an app to stop the recurring screen capture permissions on Sequoia. It's called Amnesia and it's free.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fnkpf6/made_an_app_to_stop_the_recurring_screen_capture/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fnkpf6/made_an_app_to_stop_the_recurring_screen_capture/'>Reddit</a></caption><div><br></div><p>Amnesia allows you to disable the monthly reminders for Screen Capture Access on an app by app basis. </p>\n<p>When you run the app for the first time to have to give access to the folder where the .plist is stored. The app reads and adjusts the timestamp for the apps you want to change.</p>\n<p><em>\\~/Library/Group Containers/</em><a href=\"http://group.com.apple/\"><em>group.com.apple</em></a><em>.replayd/ScreenCaptureApprovals.plist</em></p>\n<p>If you are on 15.1 this current version will not work. You can already download the app and you'll receive an updated version soon.</p>\n<p>If the app is useful you can choose to pay any amount, but also feel free to just put 0!</p>\n<p><a href=\"https://goodsnooze.gumroad.com/l/amnesia\">https://goodsnooze.gumroad.com/l/amnesia</a></p>",
            "date_published": "2024-09-23T13:40:37+00:00",
            "authors": [
                {
                    "name": "ineedlesssleep",
                    "url": "https://www.reddit.com/user/ineedlesssleep"
                }
            ]
        },
        {
            "id": "1fl7ctb",
            "url": "/r/macapps/comments/1fl7ctb/iina_free_and_opensource_audiovideo_player/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fl7ctb/iina_free_and_opensource_audiovideo_player/",
            "title": "IINA - Free and Open-Source Audio/Video Player ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fl7ctb/iina_free_and_opensource_audiovideo_player/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fl7ctb/iina_free_and_opensource_audiovideo_player/'>Reddit</a></caption><div><br></div><p>https://preview.redd.it/ip0c60lsfxpd1.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=bd4f2d2501e8344a7e8bb1266f46121a45b1f983</p>\n<p>I have been installing VLC on computers at work for over 20 years, it's been a standard part of the image in K12 and higher ed schools for such a long time because it just works. You can throw just about any type of video file at it and VLC will play it. Whenever someone tries to use something else and runs into a problem, I generally won't help them unless they try to use VLC first. So, you can imagine that I was rather dubious when I first encountered <a href=\"https://iina.io/\">IINA</a>, a free and open-source video and audio player. I do have to admit that it is way better looking. VLC is still rocking that Windows XP vibe and IINA has a sleek, post-Yosemite native macOS design aesthetic. It is lovely to look at. When I looked into it, I found that it is a front end for two rock solid CLI video platforms ff-mpeg and mpv. It can play just about anything VLC can play.</p>\n<h1>Other IINA Features</h1>\n<ul>\n<li>IINA is easy to customize. You can control playback speed, video rotation, aspect ratio adjustment, deinterlacing, and more.</li>\n<li>IINA plays online videos easily through URL support</li>\n<li>It has very strong sub-title support with built in search, language choice (be sure to set a default language in settings), size and adjustable timing</li>\n<li>Although it doesn't do editing, it can serve as a QuickTime replacement for playback</li>\n<li>Gesture control using a trackpad or Magic Mouse for most program features</li>\n<li>Supports picture in picture mode for multi-tasking</li>\n</ul>\n<p>You can get IINA on <a href=\"https://iina.io/\">the project's website</a> or on <a href=\"https://github.com/iina/iina\">GitHub</a>.</p>",
            "date_published": "2024-09-20T08:43:52+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1fkkbtg",
            "url": "/r/macapps/comments/1fkkbtg/a_voice_dictation_tool_that_works_at_the_speed_of/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fkkbtg/a_voice_dictation_tool_that_works_at_the_speed_of/",
            "title": "A Voice Dictation tool that works at the speed of thought ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fkkbtg/a_voice_dictation_tool_that_works_at_the_speed_of/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fkkbtg/a_voice_dictation_tool_that_works_at_the_speed_of/'>Reddit</a></caption><div><br></div><p>Hi, this is a voice dictation tool. I've been using it for over 3 months and was a beta tester for it. The app is supposed to launch really soon and it's going to become paid, I think. Just sending it across to let you know that it’s finally open to download directly from the website now. </p>\n<p><strong>Wispr Flow.</strong> It’s a speech to text tool that understands you, it’s like having a personal assistant who reads your mind. I’m Indian so most names I say are “complicated” but this tool gets it. And you wont get a blob of text that you’ll need to fix, you’ll receive a well formatted document. I generally use it for emails, texting and essays but it works in any text box out there so give it a whirl (its free rn)</p>\n<p>It adapts to your writing style, gets your names right, and fixes your grammar. It also knows over 100 languages which is pretty cool because that's the best use case for me, if I have to text people who don't understand English I can just ask it to convert it to my mother tongue at the end of the sentence and it does that which has made communication so much easier. </p>\n<p>In terms of productivity, I think my favourite use is just answering emails using this and just using it on Slack because it's just that much faster and because it structures it into paragraphs and bullet points I don't even need to worry about it I just hit send right away. Gives me a bunch of time. The convenience of it helps me not get too tired, and I feel I'm a better communicator because I'm not stingy with my words because keyboards used to be so annoying to type (each word) but now I can just ramble on (this post has been written by flow, so expect it to be long).</p>\n<p>To top it all off, I am a writer, a hobbyist in fact at this point because can't pursue it professionally just yet. However, this tool was kind of a godsend. </p>\n<p>I never thought that I would be using speech for long form writing and I was even very confused about it. But I just feel so relieved. There is no overwhelming feeling before I actually get to writing now. It's just a freeing feeling knowing that it's going to be convenient and that is why I don't even procrastinate too much. I feel like it's just a way to trick my brain into actually working since the physical effort is practically wiped out and there is such a low edit rate. It's personalized to how I write because there's tone match there that I never have to really edit proper nouns or anything when I'm writing it. And any fictitious names that I come up with for my writing, I can just add it to the dictionary so it gets it right every time. </p>\n<p>I've had the best time using it. It's just become an integral part of my work. And while I would hope for it to be free forever, they're launching it on 30th, which means that after that, there's going to be a freemium version. So anyone, students, professionals, whoever feels like this is something that could help take even a little bit of anxiety off your head, do it because work's not getting any shorter and our life's not getting any longer :)</p>",
            "date_published": "2024-09-19T13:03:48+00:00",
            "authors": [
                {
                    "name": "Outrageous_Driver470",
                    "url": "https://www.reddit.com/user/Outrageous_Driver470"
                }
            ]
        },
        {
            "id": "1fk13g9",
            "url": "/r/macapps/comments/1fk13g9/access_the_missing_piece_to_apples_new_passwords/",
            "external_url": "https://i.redd.it/pen6ou87bmpd1.png",
            "title": "Access: the missing piece to Apple's new Passwords app",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fk13g9/access_the_missing_piece_to_apples_new_passwords/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fk13g9/access_the_missing_piece_to_apples_new_passwords/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/pen6ou87bmpd1.png\" />",
            "date_published": "2024-09-18T19:18:17+00:00",
            "authors": [
                {
                    "name": "8aev",
                    "url": "https://www.reddit.com/user/8aev"
                }
            ]
        },
        {
            "id": "1fjvu82",
            "url": "/r/macapps/comments/1fjvu82/list_of_macos_utilities_which_feel_native/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fjvu82/list_of_macos_utilities_which_feel_native/",
            "title": "List of MacOS utilities, which feel native",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fjvu82/list_of_macos_utilities_which_feel_native/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fjvu82/list_of_macos_utilities_which_feel_native/'>Reddit</a></caption><div><br></div><p><strong>List of modern and clean looking MacOS utilities, which feel native</strong></p>\n<p><em>Pricing</em></p>\n<p>free - fully free, mostly open source</p>\n<p>freemium - have a long free trial or a free version</p>\n<p>paid - are only paid, some could include a short trial</p>\n<p><em>List</em></p>\n<ol>\n<li>\n<p><a href=\"https://highlyopinionated.co/swish/\">Swish</a>(paid) - window snapping on steroids with Magic Mouse or trackpad gestures.</p>\n</li>\n<li>\n<p><a href=\"https://replay.software/sleeve\">Sleeve</a>(paid) - ultimate widget for music from Apple Music and Spotify. </p>\n</li>\n<li>\n<p><a href=\"https://sindresorhus.com/dato\">Dato</a>(freemium) - the most advanced menu bar calendar with full screen notifications. </p>\n</li>\n<li>\n<p><a href=\"https://dropoverapp.com/\">DropOver</a>(freemium) - drag and drop on steroids. </p>\n</li>\n<li>\n<p><a href=\"https://bananabin.app/\">BananaBin</a>(paid) - a reminder to empty your trash. </p>\n</li>\n<li>\n<p><a href=\"https://cleanshot.com/\">CleanShot X</a>(paid) - the most advanced screenshot app. </p>\n</li>\n<li>\n<p><a href=\"https://lowtechguys.com/clop/\">Clop</a>(freemium) - the fastest and easiest to use optimization tool. </p>\n</li>\n<li>\n<p><a href=\"https://theboring.name/\">BoringNotch</a>(free) - not so boring notch. </p>\n</li>\n</ol>\n<p>All of the apps I’ve tried myself and these feel like a native feature of MacOS with awesome modern UI. Those, which impressed me the most are Dato, DropOver and BoringNotch. </p>\n<p>If you have some to add, would be nice to hear. </p>",
            "date_published": "2024-09-18T15:37:33+00:00",
            "authors": [
                {
                    "name": "Romachamp10",
                    "url": "https://www.reddit.com/user/Romachamp10"
                }
            ]
        },
        {
            "id": "1fi6gw8",
            "url": "/r/macapps/comments/1fi6gw8/maccy_20/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fi6gw8/maccy_20/",
            "title": "Maccy 2.0",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fi6gw8/maccy_20/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fi6gw8/maccy_20/'>Reddit</a></caption><div><br></div><p>Maccy is an open source clipboard manager for macOS.</p>\n<p>After 15 beta versions and <a href=\"https://github.com/p0deje/Maccy/pull/869\">145 commits</a>, I'm happy to release <strong>Maccy 2.0</strong> to a broader audience. Grab it via auto-update, or download it from <a href=\"https://maccy.app\">the website</a> or <a href=\"https://github.com/p0deje/Maccy\">GitHub</a>. The App Store version is currently being reviewed and will be available shortly.</p>\n<p>You should not see a lot of differences, but it's a massive release on the inside with a completely different technology stack. It fixed a bunch of old issues and unlocked new features that could be added in the subsequent releases (e.g. drag &amp; drop, iCloud sync, iPhone version, etc.)</p>\n<p>Hope you folks enjoy the new version!</p>\n<h1>Highlights of 2.0</h1>\n<ul>\n<li>The user interface has been rewritten from AppKit + NSMenu to SwiftUI + NSPanel.</li>\n<li>Storage has been rewritten from Core Data to SwiftData.</li>\n<li>Requires macOS 14 Sonoma or newer.</li>\n<li>Backward compatibility with Maccy 1.x. You can downgrade to 1.0 if you don't like the new version or encounter bugs.</li>\n<li>No backward compatibility with Maccy０.x.</li>\n<li>New setting to pop up at the last position Maccy was opened at (#829).</li>\n<li>New search highlight matches mode with a yellow color similar to Safari (#830).</li>\n<li>Improved memory usage for copying large images.</li>\n<li>Fixed multiple issues with Japanese/Chinese/Korean language input in search.</li>\n<li>Fixed an issue when Maccy could not be shown over password fields.</li>\n<li>Fixed an issue when Maccy would not paste to the Spotlight window.</li>\n<li>Fixed an issue when Maccy would not open over full-screen windows.</li>\n</ul>\n<h1>Differences from 1.0</h1>\n<ul>\n<li>The window can be resized like any other window and the history list is now scrollable.</li>\n<li>Pinned items are shown without dots and stick to the scrollable history list.</li>\n<li>Appearance preference <strong>Number of items</strong> removed. Instead, vertically resize the main panel window according to your needs.</li>\n<li>Appearance preference <strong>Title length</strong> removed. Instead, horizontally resize the main panel window according to your needs.</li>\n<li>Advanced preference <strong>Avoid taking application focus</strong> removed. The focus will always remain on the active application, similar to how Spotlight works.</li>\n<li>A pin letter \"V\" can no longer be used since it's reserved for a system paste shortcut.</li>\n</ul>",
            "date_published": "2024-09-16T14:45:54+00:00",
            "authors": [
                {
                    "name": "p0deje",
                    "url": "https://www.reddit.com/user/p0deje"
                }
            ]
        },
        {
            "id": "1fi67lo",
            "url": "/r/macapps/comments/1fi67lo/maccy_200_is_released/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fi67lo/maccy_200_is_released/",
            "title": "Maccy 2.0.0 is released!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fi67lo/maccy_200_is_released/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fi67lo/maccy_200_is_released/'>Reddit</a></caption><div><br></div><p>Heads up - <a href=\"https://github.com/p0deje/Maccy/releases/tag/2.0.0\">Maccy 2.0.0</a>, the free clipboard manager is out.</p>",
            "date_published": "2024-09-16T14:35:04+00:00",
            "authors": [
                {
                    "name": "Wacko_66",
                    "url": "https://www.reddit.com/user/Wacko_66"
                }
            ]
        },
        {
            "id": "1fhb41t",
            "url": "/r/macapps/comments/1fhb41t/i_just_updated_my_macos_app/",
            "external_url": "https://i.redd.it/y420b4gzsyod1.png",
            "title": "🎉 I just updated my macOS app!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fhb41t/i_just_updated_my_macos_app/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fhb41t/i_just_updated_my_macos_app/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/y420b4gzsyod1.png\" />",
            "date_published": "2024-09-15T12:15:08+00:00",
            "authors": [
                {
                    "name": "Glubker",
                    "url": "https://www.reddit.com/user/Glubker"
                }
            ]
        },
        {
            "id": "1ffoi7r",
            "url": "/r/macapps/comments/1ffoi7r/i_built_a_visual_notetaking_app_work_offline/",
            "external_url": "https://i.redd.it/g96llcu7yiod1.png",
            "title": "I built a visual note-taking app, work offline, one-time payment",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ffoi7r/i_built_a_visual_notetaking_app_work_offline/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ffoi7r/i_built_a_visual_notetaking_app_work_offline/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/g96llcu7yiod1.png\" />",
            "date_published": "2024-09-13T06:56:23+00:00",
            "authors": [
                {
                    "name": "Otherwise-Yam3524",
                    "url": "https://www.reddit.com/user/Otherwise-Yam3524"
                }
            ]
        },
        {
            "id": "1fetdy9",
            "url": "/r/macapps/comments/1fetdy9/i_made_a_collection_of_the_100_best_mac_apps_i/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1fetdy9/i_made_a_collection_of_the_100_best_mac_apps_i/",
            "title": "🎉 I made a collection of the 100 best Mac apps I found in three years",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1fetdy9/i_made_a_collection_of_the_100_best_mac_apps_i/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1fetdy9/i_made_a_collection_of_the_100_best_mac_apps_i/'>Reddit</a></caption><div><br></div><p><a href=\"https://bestmacapps.com\">bestmacapps.com</a></p>",
            "date_published": "2024-09-12T03:44:50+00:00",
            "authors": [
                {
                    "name": "Jolly-Swing-7726",
                    "url": "https://www.reddit.com/user/Jolly-Swing-7726"
                }
            ]
        },
        {
            "id": "1f9vg6n",
            "url": "/r/macapps/comments/1f9vg6n/the_new_reeder_app_is_now_available_for_download/",
            "external_url": "https://apps.apple.com/us/app/reeder/id6475002485",
            "title": "The new Reeder app is now available for download!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f9vg6n/the_new_reeder_app_is_now_available_for_download/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f9vg6n/the_new_reeder_app_is_now_available_for_download/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-09-05T19:42:54+00:00",
            "authors": [
                {
                    "name": "rezatvs",
                    "url": "https://www.reddit.com/user/rezatvs"
                }
            ]
        },
        {
            "id": "1f8wcbs",
            "url": "/r/macapps/comments/1f8wcbs/power_node_12_ive_made_the_app_free_for_24_hours/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1f8wcbs/power_node_12_ive_made_the_app_free_for_24_hours/",
            "title": "Power Node 1.2 - I've made the app free for 24 hours for you",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f8wcbs/power_node_12_ive_made_the_app_free_for_24_hours/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f8wcbs/power_node_12_ive_made_the_app_free_for_24_hours/'>Reddit</a></caption><div><br></div><p>Hey there, last time I promised I would post more promo codes. But it looks like there's no more codes I can generate. So I made the app free for 24 hours. If you didn't get a code last time now is your chance to get the app :)</p>\n<p>All you have to do is go to https://apps.apple.com/app/power-node-mind-map/id1195518228 and download it. Run the app and press on any of the \"Buy\" buttons. You can then \"purchase\" the Full Version unlock for $0.00. And that's it. The app is yours :)</p>\n<p>(The message box at the start will tell you the price is $19.99 but that's just a display error - the app is still free, the App Store will tell you this when you go through the \"purchase\" process).</p>\n<p>If anyone is interested to know what's new in 1.2:</p>\n<ul>\n<li>\n<ul>\n<li>Support for opening .txt, .rtf, .docx, .md and .opml files (via File -&gt; Open)</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>Export of OPML files (vie File -&gt; Export)</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>You can paste in raw OPML code and the app will generate nodes from the structure (other Mind Mappers will just mindlessly paste in the OPML source code). Hint: You can ask all those AIs to format their output in OPML for easier pasting into Power Node</li>\n</ul>\n</li>\n<li>\n<ul>\n<li>A few bugfixes</li>\n</ul>\n</li>\n</ul>\n<p>I'd be thrilled to hear any feedback, feature requests, etc.! And if you like the app (or don't) you can leave a review/rating but please be honest :)</p>\n<p><em>Info: This promo runs until this post is 24 hours old. Then I'll change the price back.</em></p>",
            "date_published": "2024-09-04T15:33:59+00:00",
            "authors": [
                {
                    "name": "shroom_elemental",
                    "url": "https://www.reddit.com/user/shroom_elemental"
                }
            ]
        },
        {
            "id": "1f86pnb",
            "url": "/r/macapps/comments/1f86pnb/affinity_is_now_free_for_education_accounts/",
            "external_url": "https://i.redd.it/jeb3pj00wmmd1.png",
            "title": "Affinity is now FREE for Education accounts.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f86pnb/affinity_is_now_free_for_education_accounts/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f86pnb/affinity_is_now_free_for_education_accounts/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/jeb3pj00wmmd1.png\" />",
            "date_published": "2024-09-03T18:02:34+00:00",
            "authors": [
                {
                    "name": "KesoReal",
                    "url": "https://www.reddit.com/user/KesoReal"
                }
            ]
        },
        {
            "id": "1f79mwa",
            "url": "/r/macapps/comments/1f79mwa/switch_your_mouse_keyboard_and_monitor_to_another/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1f79mwa/switch_your_mouse_keyboard_and_monitor_to_another/",
            "title": "Switch your mouse, keyboard and monitor to another computer without a KVM switch",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f79mwa/switch_your_mouse_keyboard_and_monitor_to_another/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f79mwa/switch_your_mouse_keyboard_and_monitor_to_another/'>Reddit</a></caption><div><br></div><ul>\n<li>In this video I show you how I switch my keyboard, which is a glove80, mouse, which is a logitech mx vertical, and monitor, which is an asus PA278CV, between my 2 computers, one is a mac mini, and a MacBook laptop. </li>\n<li>You don't need that keyboard, that's just what I use.</li>\n<li><a href=\"https://youtu.be/26r52tpzbY4\">link to the video here</a></li>\n<li>I don't use a KVM switch, but instead I rely on karabiner-elements with the hidapitester tool to switch the mouse over, then to switch the monitor I use betterdisplay. I use macos as my operating system, but this video will give you some ideas to get something going on your side. </li>\n</ul>\n<p>https://preview.redd.it/bjzrvtfmzemd1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=a327c47e71a3716eb5a6e277dd1e2c8edc60a748</p>",
            "date_published": "2024-09-02T15:31:30+00:00",
            "authors": [
                {
                    "name": "linkarzu",
                    "url": "https://www.reddit.com/user/linkarzu"
                }
            ]
        },
        {
            "id": "1f6asg4",
            "url": "/r/macapps/comments/1f6asg4/curated_collection_of_free_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1f6asg4/curated_collection_of_free_apps/",
            "title": " Curated Collection of Free Apps",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f6asg4/curated_collection_of_free_apps/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f6asg4/curated_collection_of_free_apps/'>Reddit</a></caption><div><br></div><p>To celebrate posting 150 consecutive days here and at <a href=\"https://apps.louplmmer.lol\">AppAddict</a>, here is a curated collection of free software. </p>\n<h2>Free Apps</h2>\n<ul>\n<li><a href=\"https://apps.louplummer.lol/post/apparency-the-app-that-open-apps\">Apparency - The Apps That Opens Apps</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/toyviewer-a-preview-replacment\">ToyViewer - A Preview Replacment</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/chrome-remote-desktop-free-remote-control\">Chrome Remote Desktop - Free Remote Control</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/bbedit-it-doesn-t-suck\">BBEdit - It Doesn't Suck</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/blip-free-cross-platform-file-transfers\">Blip - Free Cross Platform File Transfers</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/freetube-maybe-the-most-underrated-app\">FreeTube - Maybe the Most Underrated App</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/bean-a-free-lightweight-word-processor\">Bean - A Free, Lightweight Word Processor</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/maestral-an-open-source-dropbox-client\">Maestral, an Open-Source Dropbox Client</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/zavala-free-open-source-outliner-for-mac-iphone-ipad\">Zavala - Free, Open-Source Outliner for Mac, iPhone, iPad</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/velja-browser-picker-by-sindre-sorhus\">Velja Browser Picker by Sindre Sorhus</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/omnivore-a-free-open-source-read-it-later-app\">Omnivore, a Free Open-Source Read It Later App</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/why-haven-t-you-installed-keka-yet\">Why Haven't You Installed Keka Yet?</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/blockblock-and-knockknock-from-objective-see\">BlockBlock and KnockKnock from Objective-See</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/things-you-can-do-with-obsidian\">Things You Can Do with Obsidian</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/applite-an-app-store-for-homebrew\">Applite - An App Store for Homebrew</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/open-core-legacy-patcher\">Open Core Legacy Patcher</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/angry-ip-scanner\">Angry IP Scanner</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/upscayl-a-free-and-open-source-image-enlarger\">Upscayl - A Free and Open-Source Image Enlarger</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/amphetamine-ultimate-sleep-prevention-for-your-mac\">Amphetamine - Ultimate Sleep Prevention for Your Mac</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/stats-is-a-free-alternative-to-istat-menus\">Stats Is a Free Alternative to iStat Menus</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/onlyswitch-free-app-for-system-controls-more\">OnlySwitch - Free App for System Controls &amp; More</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/app-cleaner-vs-pear-cleaner\">App Cleaner vs. Pear Cleaner</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/disk-drill-has-six-free-tools\">Disk Drill Has Six Free Tools</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/network-utility-is-back\">Network Utility is Back!</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/cryptomator-free-and-open-source-cloud-encryption\">Cryptomator Free and Open Source Cloud Encryption</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/dockdoor-adds-functionality-to-macos\">DockDoor Adds Functionality to macOS</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/transnomino-free-file-renaming-utility-with-pro-capabilities\">TRANSNOMINO - Free File Renaming Utility with Pro Capabilities</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/reikey-and-task-explorer-from-objective-see\">ReiKey and Task Explorer from Objective-See</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/rocket-free-slack-style-emoji-picker\">Rocket - Free, Slack-Style Emoji Picker</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/wordservice-another-free-utility-from-devon-technologies\">WordService - Another Free Utility from Devon Technologies</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/karabiner-elements-to-the-rescue\">Karabiner Elements to the Rescue</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/swift-shift-a-free-tool-to-move-and-resize-windows\">Swift Shift - A Free Tool to Move and Resize Windows</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/onyx-for-mac\">Onyx for Mac</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/meteorologist-free-and-open-source-menu-bar-weather\">Meteorologist - Free and Open-Source Menu Bar Weather</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/silentknight-free-security-checks-for-your-mac\">SilentKnight - Free Security Checks for Your Mac</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/folder-peek-ftw\">Folder Peek FTW</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/2024-08-16\">FlowVision - Image Viewer</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/imageoptim-free-and-open-source-utility-to-reduce-file-sizes\">ImageOptim - Free and Open-Source Utility to Reduce File Sizes</a></li>\n<li><a href=\"https://apps.louplummer.lol/post/xmenu-free-menu-bar-app-launcher\">XMenu - Free Menu Bar App Launcher</a></li>\n</ul>",
            "date_published": "2024-09-01T09:52:03+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1f54es7",
            "url": "/r/macapps/comments/1f54es7/for_those_who_use_english_dictionary_apps_on_macos/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1f54es7/for_those_who_use_english_dictionary_apps_on_macos/",
            "title": "For those who use English dictionary apps on macOS…",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f54es7/for_those_who_use_english_dictionary_apps_on_macos/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f54es7/for_those_who_use_english_dictionary_apps_on_macos/'>Reddit</a></caption><div><br></div><p><em>*Currently it is supported on Apple Silicon only for macOS. Future plans to make a dedicated macOS app. More details at the bottom.</em></p>\n<p>I’m excited to share that I have recently created not just a dictionary app, but an entire dictionary from the ground up. It’s completely free without ads. I call it <a href=\"https://apps.apple.com/us/app/lngo-the-peoples-dictionary/id6596728974\">Lngo: The People's Dictionary</a>. </p>\n<p><strong>Why did I do this?</strong> I have a profound love for language, and I was continually frustrated with cancer-level ads on other dictionary apps, and the extortion of subscription fees. The free app alternatives often had outdated definitions, clunky designs, and missing features like saving or syncing words.</p>\n<p>I know a dedicated dictionary app might not be for everyone. Many people use a browser or iPhone’s Spotlight search. This app is tailored for those who love diving deep into word definitions, exploring etymology, and actively trying to expand their vocabulary by saving words for future study and review. </p>\n<p>I teamed up with a small group of software engineers and those with backgrounds in linguistics, to build this app. We all shared the same grievance with the lackluster dictionary options available on the Apple ecosystem. So we sifted through open-source dictionaries, cleaned up the clutter, removed duplicates, used AI to revise, and manually reviewed as many definitions as possible.</p>\n<p><strong>Here’s what makes this app stand out:</strong></p>\n<ul>\n<li>250,000+ unique words</li>\n<li>Fully offline access</li>\n<li>The most comprehensive synonym and antonym search found on any app or website</li>\n<li>In-depth etymology and word history</li>\n<li>Multi-platform compatibility for iPhone, iPad, and Mac (Apple silicon only)</li>\n<li>iCloud sync for your saved words across all devices</li>\n<li>Integrated flashcard system for studying</li>\n<li>Specialized vocabulary sections for ACT, SAT, and GRE preparation that provide exposure to new words</li>\n<li>Modern user interface utilizing the full capabilities of SwiftUI</li>\n<li>Includes slang and curse words</li>\n<li>IPA pronunciation</li>\n<li>Export options (e.g., load saved words into Anki)</li>\n</ul>\n<p><strong>A quick comparison of other English dictionary apps:</strong></p>\n<p><a href=\"https://apps.apple.com/us/app/wordbook-universal/id364030280\">WordBook</a>: Great app and my previous go-to, but it lacks a Mac version, flashcards, and word antonyms. That was a dealbreaker for me.</p>\n<p><a href=\"https://apps.apple.com/us/app/lookup-dictionary-learn-daily/id872564448\">LookUp</a>: A beautifully designed app, but requires a subscription and doesn’t sync saved words across devices. Also lacks offline access and rich synonyms/antonyms.</p>\n<p><a href=\"https://apps.apple.com/us/app/wordweb-dictionary/id309627313\">WordWeb</a>: Basic definitions with no antonyms, no sync, and no Mac version.</p>\n<p><a href=\"https://apps.apple.com/us/app/dictionary/id379450383\">The Free Dictionary</a>: Outdated interface and no Mac app.</p>\n<p>Merriam-Webster, <a href=\"http://dictionary.com/\">Dictionary.com</a>, Oxford: Quality definitions, but the ads are insane, and the subscription fees are equally ridiculous. Additionally, they all require online access, and they don’t have Mac apps for syncing favorites. </p>\n<p><strong>Please use the app and enjoy! If you find it helpful, I'd appreciate it if you could leave a review and help spread the word. :)</strong></p>\n<p><em>*I do want to point out that I specifically optimized this app to be used on Macs. My purpose for creating one app version for all three platforms (iOS, iPadOS, macOS) was so that I can maintain one codebase and still distribute to the 3 platforms. Yet, within the Swift code itself I am performing checks to verify when the app is running on iOS, iPadOs, or macOS, so that I can perform actions and behaviors to best suit the device running it.</em> </p>",
            "date_published": "2024-08-30T19:52:31+00:00",
            "authors": [
                {
                    "name": "MamaJojoPuddinCup",
                    "url": "https://www.reddit.com/user/MamaJojoPuddinCup"
                }
            ]
        },
        {
            "id": "1f1770b",
            "url": "/r/macapps/comments/1f1770b/monarch_v07_released_super_fast_file_search/",
            "external_url": "https://www.reddit.com/gallery/1f1770b",
            "title": "Monarch v0.7 released: Super fast File Search, Homebrew & much more in a launcher being built by the users!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f1770b/monarch_v07_released_super_fast_file_search/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f1770b/monarch_v07_released_super_fast_file_search/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-25T21:18:17+00:00",
            "authors": [
                {
                    "name": "thievingfour",
                    "url": "https://www.reddit.com/user/thievingfour"
                }
            ]
        },
        {
            "id": "1f0i1jr",
            "url": "/r/macapps/comments/1f0i1jr/i_spent_6_months_building_a_tool_to_help_devs/",
            "external_url": "https://www.reddit.com/gallery/1f0i1jr",
            "title": "I spent 6 months building a tool to help devs setup their Macs (using code)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1f0i1jr/i_spent_6_months_building_a_tool_to_help_devs/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1f0i1jr/i_spent_6_months_building_a_tool_to_help_devs/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-24T22:59:10+00:00",
            "authors": [
                {
                    "name": "_kevinwang",
                    "url": "https://www.reddit.com/user/_kevinwang"
                }
            ]
        },
        {
            "id": "1eyrfjq",
            "url": "/r/macapps/comments/1eyrfjq/trace_a_free_macos_timetracker_that_shows_your/",
            "external_url": "https://www.reddit.com/gallery/1eyrfjq",
            "title": "Trace - A free macOS time-tracker that shows your app activity",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1eyrfjq/trace_a_free_macos_timetracker_that_shows_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1eyrfjq/trace_a_free_macos_timetracker_that_shows_your/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-22T18:55:37+00:00",
            "authors": [
                {
                    "name": "leqote",
                    "url": "https://www.reddit.com/user/leqote"
                }
            ]
        },
        {
            "id": "1eyhvhy",
            "url": "/r/macapps/comments/1eyhvhy/time_to_call_dynamicisland_calls_notifications/",
            "external_url": "https://v.redd.it/9ev5n9zvj7kd1",
            "title": "Time to call - DynamicIsland calls notifications",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1eyhvhy/time_to_call_dynamicisland_calls_notifications/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1eyhvhy/time_to_call_dynamicisland_calls_notifications/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-22T12:19:54+00:00",
            "authors": [
                {
                    "name": "Aviorrok",
                    "url": "https://www.reddit.com/user/Aviorrok"
                }
            ]
        },
        {
            "id": "1ewr0qt",
            "url": "/r/macapps/comments/1ewr0qt/my_free_macos_apps/",
            "external_url": "https://sindresorhus.com/apps/free#macos",
            "title": "My free macOS apps",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ewr0qt/my_free_macos_apps/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ewr0qt/my_free_macos_apps/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-20T09:16:45+00:00",
            "authors": [
                {
                    "name": "sindresorhus",
                    "url": "https://www.reddit.com/user/sindresorhus"
                }
            ]
        },
        {
            "id": "1et98ad",
            "url": "/r/macapps/comments/1et98ad/a_voice_dictation_app_that_writes_just_like_you/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1et98ad/a_voice_dictation_app_that_writes_just_like_you/",
            "title": "A voice dictation app that writes just like you",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1et98ad/a_voice_dictation_app_that_writes_just_like_you/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1et98ad/a_voice_dictation_app_that_writes_just_like_you/'>Reddit</a></caption><div><br></div><p>Hey, I'm talking about flow by wispr. For some context, I was onboarded as an early beta user for this app and I have been a huge fan since the very beginning. As they're gearing up for a launch, I just wanted to share this app before it becomes paid to anyone who wants to use it (currently it's free). It's this really cool voice dictation tool that is unlike others because:</p>\n<p>It has a very very low latency.</p>\n<p>It structures your writing. So, if you're writing a blob of text, it's going to make it into well-formatted text (be it bullet points or paragraphs).</p>\n<p>It understands different languages. So, if I'm talking in say Spanish, and I ask it to translate it to English after finishing, it's going to convert it to that. It also fixes your grammar, making work go by a lot faster.</p>\n<p>I use it for a lot of my work simply to organize meetings. Realized that a lot of my friends who also ended up picking up the app said was it just makes you a lot more productive and efficient because when you don't have to stress about writing or typing, you're not as stingy with your words, which means you can explain and define things better. And in that you also communicate properly, which means work gets done faster.</p>\n<p>Don't know when the launch is, but I think it's going to happen in the next 1-2 months. Because they've been sending a lot of user interviews for it. But yeah, Now is a good time to download if you are looking to save a bunch of hours every day AND I like it because of the convenience of it all. I think there's a waitlist but they usually gets you off the waitlist in under a day.</p>\n<p>here's the link: <a href=\"https://www.flowvoice.ai\">https://www.flowvoice.ai</a></p>",
            "date_published": "2024-08-15T23:01:22+00:00",
            "authors": [
                {
                    "name": "Ruby-Ethereal",
                    "url": "https://www.reddit.com/user/Ruby-Ethereal"
                }
            ]
        },
        {
            "id": "1eq7an9",
            "url": "/r/macapps/comments/1eq7an9/my_must_have_macos_utilities/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1eq7an9/my_must_have_macos_utilities/",
            "title": "My must have MacOS utilities",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1eq7an9/my_must_have_macos_utilities/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1eq7an9/my_must_have_macos_utilities/'>Reddit</a></caption><div><br></div><p><strong><em>Modern MacOS Utilities List with nice UI and useful features</em></strong></p>\n<p><em>Price list</em></p>\n<p><strong>Free</strong> - fully free</p>\n<p><strong>Freemium</strong> - can be used for free with optional pro plan or include free trial</p>\n<p><strong>Paid</strong> - can be used properly, only If you buy them  </p>\n<p><em>Must have apps for daily use</em></p>\n<ol>\n<li><a href=\"https://github.com/jordanbaird/Ice\">Ice</a>(<strong>free</strong>) - Hide menu bar icons and customise it. Similar apps: Bartender, HiddenBar</li>\n<li><a href=\"https://www.raycast.com\">Raycast</a>(<strong>free</strong>) - Spotlight on steroids, windows manager, clipboard manager. Similar apps: Spotlight, Alfred</li>\n<li><a href=\"https://www.popclip.app\">PopClip</a>(<strong>freemium</strong>) -  Instant text actions. Similar apps: None</li>\n<li><a href=\"https://github.com/iamharshdev/TheBoringNotch\">BoringNotch</a>(<strong>free</strong>) - Dynamic island for MacOS. Similar apps: DynamicLakePro, NotchNook, NotchDrop</li>\n<li><a href=\"https://shottr.cc/\">Shottr</a>(<strong>freemium</strong>) -  Insane screenshot tool, OCR, and color picker. Similar apps: CleanShot X</li>\n<li><a href=\"https://lowtechguys.com/clop\">Clop</a>(<strong>freemium</strong>) -  File optimizer and converter. Similar apps: Permute</li>\n</ol>\n<p><em>Great apps for their use cases</em></p>\n<ol>\n<li><a href=\"https://github.com/alienator88/Pearcleaner\">PearCleaner</a>(<strong>free</strong>) - App uninstaller and cleaner. Similar apps: App Cleaner</li>\n<li><a href=\"https://iina.io\">IINA</a>(<strong>free</strong>) - Media player with more supported formats. Similar apps: QuickTime Player, Elmedia Player</li>\n<li><a href=\"https://diffusionbee.com\">Diffusion Bee</a>(<strong>free</strong>) - AI Image editor with upscayling and generating. Similar apps: Upscayl</li>\n<li><a href=\"https://brew.sh\">Homebrew</a>(<strong>free</strong>) - Package Manager, which helps to install Software, tools and developer stuff via Terminal. Similar apps: MacPorts</li>\n<li><a href=\"https://protonvpn.com/?ref=pmehpherolink\">Proton VPN</a>(<strong>free</strong>) - VPN which includes 3 locations for connecting to. Similar apps: Nord VPN</li>\n<li><a href=\"https://www.jetbrains.com/toolbox-app/\">JetBrains Toolbox</a>(<strong>free</strong>) - installing and controlling developer IDEs for different programming langauges like Pycharm. Similar apps: VS code</li>\n<li><a href=\"https://openai.com/chatgpt/download/\">ChatGPT</a>(<strong>freemium</strong>) - Native ChatGPT app. Similar apps: MacGPT, BoltAI</li>\n</ol>\n<p><em>Safari/Chrome Extensions</em></p>\n<ol>\n<li><a href=\"https://adguard.com/uk/welcome.html\">AdGuard For Both</a>(<strong>freemium</strong>) - Ad blocker with deep settings and cookie banners blocker. Similar apps: AdLock For Both, uBlock For Chrome</li>\n<li><a href=\"https://getnoir.app\">Noir For Safari</a>(<strong>paid</strong>),<a href=\"https://darkreader.org\"> Dark Reader For Chrome</a>(<strong>free</strong>) - Dark Mode for each website. Similar apps: None</li>\n<li><a href=\"https://momentumdash.com\">Momentum For Both</a>(<strong>free</strong>) - Change the look of a new tab. Similar apps: Bonjour for Chrome</li>\n</ol>\n<p><em>Honorable mentions</em></p>\n<ol>\n<li><a href=\"https://www.textsniper.app\">TextSniper</a>(<strong>paid</strong>) - OCR for copying text from images and scaning QR codes. Similar apps: Viz</li>\n<li><a href=\"https://linearmouse.app/uk-UA/\">LinearMouse</a>(<strong>free</strong>) - Controlling external mouse or trackpad for smoother expirience. Similar apps: MOS, MultiTouch</li>\n<li><a href=\"https://menubarx.app\">Menu Bar X</a>(<strong>free</strong>) - Pin most used websites to the menu bar, also supports dropping files to them. Similar apps: None</li>\n<li><a href=\"https://github.com/exelban/stats?tab=readme-ov-file\">Stats</a>(<strong>free</strong>) - system stats monitoring such as CPU, GPU, etc. Similar apps: iStat menus</li>\n<li><a href=\"https://appmakes.io/paletro\">Paletro</a>(<strong>paid</strong>) - command palette in any application, which lets you search actions of the app. Similar apps: PieMenu</li>\n<li><a href=\"https://micropixels.software/apps/batfi\">BatFi</a>(<strong>paid</strong>) - increase the life of your battery, by limiting its charging to a certain amount. Similar apps: AlDente</li>\n</ol>",
            "date_published": "2024-08-12T07:12:04+00:00",
            "authors": [
                {
                    "name": "Romachamp10",
                    "url": "https://www.reddit.com/user/Romachamp10"
                }
            ]
        },
        {
            "id": "1en3dzz",
            "url": "/r/macapps/comments/1en3dzz/what_is_the_one_mac_app_that_changed_your/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1en3dzz/what_is_the_one_mac_app_that_changed_your/",
            "title": "What is the ONE Mac App that changed your productivity/coding/personal business?\n",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1en3dzz/what_is_the_one_mac_app_that_changed_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1en3dzz/what_is_the_one_mac_app_that_changed_your/'>Reddit</a></caption><div><br></div><p>I'm buying my Macbook soon. I am a Data Scientist and also have a start up agency that i am building. I want to know all the different types of apps that can help with productivity, time management, coding and start up business help. </p>\n<p>I've seen many different threads for this, but everyone just mentions the name of the app without explain what they use it for and any hot features. So PLEASE if you're commenting, please let me know what you use the app for :)))</p>",
            "date_published": "2024-08-08T11:22:29+00:00",
            "authors": [
                {
                    "name": "AdaobiN",
                    "url": "https://www.reddit.com/user/AdaobiN"
                }
            ]
        },
        {
            "id": "1emlw74",
            "url": "/r/macapps/comments/1emlw74/minitube_for_youtube_is_free/",
            "external_url": "https://apps.apple.com/us/app/minitube-for-youtube/id422006190?mt=12&src=AppAgg.com",
            "title": "Minitube for YouTube is free",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1emlw74/minitube_for_youtube_is_free/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1emlw74/minitube_for_youtube_is_free/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-07T20:05:54+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "1elitsc",
            "url": "/r/macapps/comments/1elitsc/whats_your_musthave_singlepurpose_mac_app_for/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1elitsc/whats_your_musthave_singlepurpose_mac_app_for/",
            "title": "What's your must-have, single-purpose Mac app for daily use?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1elitsc/whats_your_musthave_singlepurpose_mac_app_for/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1elitsc/whats_your_musthave_singlepurpose_mac_app_for/'>Reddit</a></caption><div><br></div><p>What's that one single-purpose app you couldn't live without on a daily basis? I'm talking about those lean, focused utilities that do one job extremely well.</p>\n<p>Whether it's a clipboard manager, window tiler, Markdown editor, or something else entirely, I'd love to hear about the single-purpose apps that have become indispensable parts of your workflow.</p>\n<p>What makes your pick so great? How has it improved your productivity or made your Mac life easier? Any tips for getting the most out of the app?</p>\n<p>I personally use <a href=\"https://apps.apple.com/us/app/system-color-picker/id1545870783?mt=12\">Color Picker</a> because it's the only one that supports LCH format.</p>",
            "date_published": "2024-08-06T14:11:49+00:00",
            "authors": [
                {
                    "name": "sayzlim",
                    "url": "https://www.reddit.com/user/sayzlim"
                }
            ]
        },
        {
            "id": "1ekiggy",
            "url": "/r/macapps/comments/1ekiggy/shakepin_open_source_project_i_made_within_the/",
            "external_url": "https://v.redd.it/uo9yl0naxsgd1",
            "title": "ShakePin, Open Source Project I Made Within The Last 2 Days Inspired by Dropover",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ekiggy/shakepin_open_source_project_i_made_within_the/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ekiggy/shakepin_open_source_project_i_made_within_the/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-05T08:15:12+00:00",
            "authors": [
                {
                    "name": "No_Assistant1783",
                    "url": "https://www.reddit.com/user/No_Assistant1783"
                }
            ]
        },
        {
            "id": "1ejthkm",
            "url": "/r/macapps/comments/1ejthkm/dynamicisland_apps_switcher_with_preview_and_push/",
            "external_url": "https://v.redd.it/digxp580zmgd1",
            "title": "DynamicIsland apps switcher with preview and Push notifications",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ejthkm/dynamicisland_apps_switcher_with_preview_and_push/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ejthkm/dynamicisland_apps_switcher_with_preview_and_push/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-08-04T11:55:07+00:00",
            "authors": [
                {
                    "name": "Aviorrok",
                    "url": "https://www.reddit.com/user/Aviorrok"
                }
            ]
        },
        {
            "id": "1ejqaeb",
            "url": "/r/macapps/comments/1ejqaeb/notchnook_not_ready_for_prime_time/",
            "external_url": "https://i.redd.it/0us93c17wlgd1.jpeg",
            "title": "NotchNook Not Ready for Prime Time",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ejqaeb/notchnook_not_ready_for_prime_time/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ejqaeb/notchnook_not_ready_for_prime_time/'>Reddit</a></caption><div><br></div><p>After reading about NotchNook on Reddit and seeing the 35% off offer from the $25 purchase price, I purchased it to test it out. I reenabled the notch on my MacBook, which I had turned off with Better Monitor. The installation was straightforward, requiring access to the camera, microphone and Apple Events.  </p>\n<p>NotchNook has two feature areas, the nook and the file tray. The nook is where the widgets are located. The currently supported widgets are media controls, shortcuts, calendar and mirror. There is a placeholder for notes, but it is not currently active. The media control widget offered to start Apple Music or YouTube. Once I opened Apple Music, the controls were no different than what is already available in Control Center with the exception of being able to use gestures to move between songs. You can add two shortcuts to the nook, but they do not support drag and drop nor do they act on files selected in the Finder rendering the usefulness limited.The calendar displays the current day and two days prior and after that. There is no way to choose a default calendar and when I added events to my system default calendar, they did not appear. The mirror widget displays an image from your built-in camera that is the literal size of a postage stamp with no way to enlarge it. I did not find it useful.  </p>\n<p>The second feature area is the file tray. It serves as a place to drag and keep files. Once you have a file there, there are no options to perform other actions, like compression or moving to cloud storage apps or any kind of image modification actions. It is strictly a holding area. There is a place holder that states additional file actions are coming, but as of now, they do not exist.  </p>\n<p>Because of the lack of depth on the features, I do not recommend purchasing this app right now. <a href=\"https://apps.apple.com/us/app/dropover-easier-drag-drop/id1355679052?mt=12a\">Dropover</a>, $5.99 app provides a huge variety of file actions. You can use Control Center for media control and add shortcuts to your dock or menu bar natively. If you still want to try Notch Nook, you can get it <a href=\"https://lo.cafe/notchnook\">on the developer's website.</a> Currently you can get a %35 discount if you tweet about the app.</p><div><br></div><img src=\"https://i.redd.it/0us93c17wlgd1.jpeg\" />",
            "date_published": "2024-08-04T08:16:42+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1ei5pe8",
            "url": "/r/macapps/comments/1ei5pe8/money_keeper_for_mac_only_what_you_need/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1ei5pe8/money_keeper_for_mac_only_what_you_need/",
            "title": "Money Keeper for Mac. Only What You Need 🏦✨",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ei5pe8/money_keeper_for_mac_only_what_you_need/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ei5pe8/money_keeper_for_mac_only_what_you_need/'>Reddit</a></caption><div><br></div><p>Hello MacApps community! 😊✨</p>\n<p>I would like to take a moment for a brief self-promotion. I am the developer of this app. 🙏</p>\n<hr />\n<p>Fixed Expenses. Easy to Grasp at a Glance.</p>\n<p>Categories. Custom-Made for You.</p>\n<p>No Ads. No Data Collection.</p>\n<p>Regular Updates Based on User Feedback.</p>\n<p>Seamless Sync Across iPhone, iPad, and Mac, Just Like a Native Apple App.</p>\n<p><a href=\"https://apps.apple.com/app/id6514279917\">https://apps.apple.com/app/id6514279917</a></p>\n<hr />\n<p>As apps continue to grow more complex, I began to ponder: Are only feature-packed, multifaceted apps truly useful to people? Could a simple app, providing only the essential features, also be valuable?</p>\n<p>From this reflection, the Small App Project was born. The idea behind the Small App Project is to deliver \"Small Apps\" that focus on providing just the necessary features, without the complexity.</p>\n<p>Money Keeper embodies this philosophy. It’s designed to be straightforward and efficient, offering only the essential functionalities you need to manage your finances effectively.</p>\n<p>I believe that a simple app can be just as useful, if not more so, than a complex one. Money Keeper aims to prove that by focusing on what truly matters.</p>\n<p>I hope this small, yet powerful, app will be helpful to many. I wish you happiness 🌸✨</p>\n<p>You can download Money Keeper here: <a href=\"https://apps.apple.com/app/id6514279917\">https://apps.apple.com/app/id6514279917</a></p>\n<p>https://preview.redd.it/4dnts6kqy7gd1.jpg?width=2560&amp;format=pjpg&amp;auto=webp&amp;s=6268307b5b5aa8ba70846edaa3d06bd724c97850</p>\n<p>https://preview.redd.it/mci0j6kqy7gd1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=b6edfdb42c6ac10e00d49e0b3838bd5616d2733b</p>\n<p>https://preview.redd.it/h15j47kqy7gd1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=82017e392f4ffde0177f605465f9aad09cc49cbc</p>\n<p>https://preview.redd.it/axvxt6kqy7gd1.png?width=2560&amp;format=png&amp;auto=webp&amp;s=37d2343a2fe2d5e0d8d0839fd58924829c6f643c</p>",
            "date_published": "2024-08-02T09:26:37+00:00",
            "authors": [
                {
                    "name": "SmallAppProject",
                    "url": "https://www.reddit.com/user/SmallAppProject"
                }
            ]
        },
        {
            "id": "1egjln4",
            "url": "/r/macapps/comments/1egjln4/it_took_me_three_years_to_make_this_encrypted/",
            "external_url": "https://www.reddit.com/gallery/1egjln4",
            "title": "It took me three years to make this encrypted to-do list, habit and mood tracker, journaling, life-tracking and notes app. And now, Lunatask comes with Relationship Tracking too! 🌟",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1egjln4/it_took_me_three_years_to_make_this_encrypted/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1egjln4/it_took_me_three_years_to_make_this_encrypted/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-07-31T10:18:38+00:00",
            "authors": [
                {
                    "name": "mikekreeki2",
                    "url": "https://www.reddit.com/user/mikekreeki2"
                }
            ]
        },
        {
            "id": "1eew2t1",
            "url": "/r/macapps/comments/1eew2t1/goodlinks_20_is_out/",
            "external_url": "https://apps.apple.com/us/app/goodlinks/id1474335294?src=AppAgg.com&mt=12",
            "title": "GoodLinks 2.0 is out.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1eew2t1/goodlinks_20_is_out/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1eew2t1/goodlinks_20_is_out/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-07-29T10:25:45+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "1ecivpe",
            "url": "/r/macapps/comments/1ecivpe/get_a_cat_fact_with_each_click/",
            "external_url": "https://v.redd.it/x2cqmlq9mted1",
            "title": "Get a Cat Fact with each click.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ecivpe/get_a_cat_fact_with_each_click/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ecivpe/get_a_cat_fact_with_each_click/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-07-26T08:21:03+00:00",
            "authors": [
                {
                    "name": "Arthur_Smith_",
                    "url": "https://www.reddit.com/user/Arthur_Smith_"
                }
            ]
        },
        {
            "id": "1eb47nm",
            "url": "/r/macapps/comments/1eb47nm/screenshot_studio_app_store_screenshot_made_easy/",
            "external_url": "https://v.redd.it/5r0jm1qsehed1",
            "title": "Screenshot Studio - App Store screenshot made easy",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1eb47nm/screenshot_studio_app_store_screenshot_made_easy/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1eb47nm/screenshot_studio_app_store_screenshot_made_easy/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-07-24T15:24:33+00:00",
            "authors": [
                {
                    "name": "sarunw",
                    "url": "https://www.reddit.com/user/sarunw"
                }
            ]
        },
        {
            "id": "1e8jvm0",
            "url": "/r/macapps/comments/1e8jvm0/dockdoor_adds_extra_functionality_to_macos/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1e8jvm0/dockdoor_adds_extra_functionality_to_macos/",
            "title": "DockDoor Adds Extra Functionality to macOS",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1e8jvm0/dockdoor_adds_extra_functionality_to_macos/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1e8jvm0/dockdoor_adds_extra_functionality_to_macos/'>Reddit</a></caption><div><br></div><p>https://preview.redd.it/p9ffdwiqtudd1.jpg?width=643&amp;format=pjpg&amp;auto=webp&amp;s=2b848ab636aa8b8ca725eecb7113fdafe45c74c4</p>\n<p>In Windows, when you hover over an app on the taskbar, the operating system show you the open windows for that app, a useful feature missing in macOS until now with the introduction of the free menu bar app DockDoor.</p>\n<p>Installing DockDoor requires granting access to Accessibility and Screen Recording settings. You can install if by <a href=\"https://github.com/ejbills/DockDoor\">downloading it from GitHub</a> or through Homebrew. Once you have it installed and running with the proper permissions, you will see a pop-up preview of the apps window (or windows) when you hover over the app in the dock, regardless of where you place the dock in your workspace. I have mine on the left side of the screen.</p>\n<p>If you choose to use it, the included window switcher moves between open Windows (not just between apps like the macOS default). I already use an app for window switching (Alt+Tab) and have it configured with shortcuts I like so I turned off this functionality in DockDoor.</p>\n<p>When you activate DockDoor from the dock, four traffic light buttons appear in the window pop-up, each with a different function.</p>\n<ul>\n<li>🟣 Quit the window's app. You can hold the Option (⌥) key while clicking to f<strong>orce</strong> quit.</li>\n<li>🔴 Close the window</li>\n<li>🟡 Minimize the window</li>\n<li>🟢 Enter the window to full screen</li>\n</ul>\n<p>DockDoor is highly customizable as seen in the preference windows below.</p>\n<p>https://preview.redd.it/e7ndcksttudd1.jpg?width=1650&amp;format=pjpg&amp;auto=webp&amp;s=f8f81ad775e165c4fb3b8a23aaab54b8c5cf903b</p>\n<p>https://preview.redd.it/6or65urwtudd1.jpg?width=1656&amp;format=pjpg&amp;auto=webp&amp;s=2eca6c731c5f4ca3549280ee53e148e2beb88c50</p>",
            "date_published": "2024-07-21T11:08:03+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1e7e25g",
            "url": "/r/macapps/comments/1e7e25g/i_made_a_mac_note_app_that_aims_to_be_as/",
            "external_url": "https://i.redd.it/qc0yhp81fjdd1.png",
            "title": "I made a Mac note app that aims to be as high-performing as native notes while offering comprehensive formats to express your ideas when needed.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1e7e25g/i_made_a_mac_note_app_that_aims_to_be_as/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1e7e25g/i_made_a_mac_note_app_that_aims_to_be_as/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/qc0yhp81fjdd1.png\" />",
            "date_published": "2024-07-19T20:48:12+00:00",
            "authors": [
                {
                    "name": "huy_cf",
                    "url": "https://www.reddit.com/user/huy_cf"
                }
            ]
        },
        {
            "id": "1e75o0m",
            "url": "/r/macapps/comments/1e75o0m/what_are_the_best_places_for_finding_good_mac/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1e75o0m/what_are_the_best_places_for_finding_good_mac/",
            "title": "What are the best places for finding good Mac apps besides this subreddit?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1e75o0m/what_are_the_best_places_for_finding_good_mac/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1e75o0m/what_are_the_best_places_for_finding_good_mac/'>Reddit</a></caption><div><br></div><p>So far my go to place is this subreddit. I also found this: <a href=\"https://macmenubar.com/\">https://macmenubar.com/</a> but it is for menu bar apps only.</p>\n<p>Could you guys give me some good websites that list only or mostly Mac apps?</p>",
            "date_published": "2024-07-19T14:53:43+00:00",
            "authors": [
                {
                    "name": "chrisBhappy",
                    "url": "https://www.reddit.com/user/chrisBhappy"
                }
            ]
        },
        {
            "id": "1e3vedq",
            "url": "/r/macapps/comments/1e3vedq/work_scheduling_is_now_available_in_lookaway_160/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1e3vedq/work_scheduling_is_now_available_in_lookaway_160/",
            "title": "Work Scheduling is now available in LookAway 1.6.0 + 40% discount",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1e3vedq/work_scheduling_is_now_available_in_lookaway_160/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1e3vedq/work_scheduling_is_now_available_in_lookaway_160/'>Reddit</a></caption><div><br></div><p>Hello,</p>\n<p>First of all, thank you for using <a href=\"https://lookaway.app\">LookAway</a>, and helping me make a difference in people's lives. Your feedback and support means a lot.</p>\n<p>LookAway 1.6.0 is now released and here's what's new:</p>\n<h1>Work Schedule</h1>\n<p>https://preview.redd.it/32cgsk8psocd1.png?width=1317&amp;format=png&amp;auto=webp&amp;s=3e562500cd5ba245abc65b48ca5108c942e167b7</p>\n<p>Setting a work schedule in LookAway has been the most requested feature since the launch. You can now set a schedule and LookAway will only suggest breaks during those hours.</p>\n<h1>Custom Durations</h1>\n<p>https://preview.redd.it/36k6gwtysocd1.png?width=1339&amp;format=png&amp;auto=webp&amp;s=5f00b8ea6271445339f40e904263c0e7c095ca20</p>\n<p>You can now set custom durations for everything in the settings - including the idle time thresholds.</p>\n<h1>And more...</h1>\n<ul>\n<li>\n<p>LookAway now correctly detects any new cameras or mics that are connected while LookAway is already running. This makes the meeting detection even better.  </p>\n</li>\n<li>\n<p>Long break cycle is now reset when you cross your idle time reset threshold instead of focus time.</p>\n</li>\n</ul>\n<h1>Thank you!</h1>\n<p>Also, I am offering a 40% discount on all license options for a limited time. You can use the code MACAPPS40OFF at checkout to get a discount. The code will expire after 48 hours.</p>\n<p>And that's all! Thanks for reading, and helping me make LookAway better everyday. Please keep your feedback coming - it helps a lot!</p>",
            "date_published": "2024-07-15T13:56:00+00:00",
            "authors": [
                {
                    "name": "kushsolitary",
                    "url": "https://www.reddit.com/user/kushsolitary"
                }
            ]
        }
    ]
}