{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/macapps",
    "description": "r/MacApps is a one stop shop for all things related to macOS apps - featuring app showcases, news, updates, sales, discounts and even freebies.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/macapps.json",
    "icon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "favicon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "items": [
        {
            "id": "1nz6tco",
            "url": "/r/macapps/comments/1nz6tco/open_source_disable_liquid_glass_with_solidglass/",
            "external_url": "https://www.reddit.com/gallery/1nz6tco",
            "title": "[Open Source] Disable Liquid Glass with SolidGlass",
            "content_html": "<p>SolidGlass is a lightweight, open-source SwiftUI application that lets you disable the Liquid Glass effect for specific apps or system-wide.</p>\n<p><strong>Download latest version</strong> <a href=\"https://github.com/rafaelSwi/SolidGlass/releases/latest\"><strong>clicking here</strong></a><strong>. Github repository</strong> <a href=\"https://github.com/rafaelSwi/SolidGlass\"><strong>here</strong></a><strong>.</strong></p>\n<p><em>Since I don’t have a paid Apple Developer license, you may see a warning saying that the app cannot be opened because it is from an unidentified developer.</em></p>\n<p><em>To run it, go to</em> <strong><em>System Settings → Privacy &amp; Security → (scroll down) → Open Anyway</em></strong><em>.</em></p>",
            "date_published": "2025-10-06T02:05:59+00:00",
            "authors": [
                {
                    "name": "Fragrant_Okra6671",
                    "url": "https://www.reddit.com/user/Fragrant_Okra6671"
                }
            ]
        },
        {
            "id": "1nxusr7",
            "url": "/r/macapps/comments/1nxusr7/timescroll_is_now_open_source_find_anything_you/",
            "external_url": "https://www.reddit.com/gallery/1nxusr7",
            "title": "TimeScroll is now open source! — find anything you saw on your Mac",
            "content_html": "<p>hi everyone!</p>\n<p>i'm the developer of <a href=\"https://timescroll.muzhen.org/\">TimeScroll</a> and today I have a few significant updates. since it's a new month i'm able to post again.</p>\n<p>TimeScroll is a free, lightweight utility that lets you find anything you saw on your Mac. it captures your screen at regular intervals so you can search or play it back later.</p>\n<p>first - the app is now fully <a href=\"https://github.com/XInTheDark/TimeScrollApp\">open source</a>! I understand privacy is a very important part of the app, and this was a top feedback. Thanks to everyone for the feedback and encouragement!</p>\n<p>other new features since my last post include:</p>\n<ul>\n<li>A new search experience</li>\n<li>Encryption: your snapshots can now be stored in a secure vault, encrypted at rest.</li>\n<li>AI search mode: uses local NLP to enable smart semantic search, so you can find what you're looking for, even if you don't remember the exact words.</li>\n</ul>\n<p>quick note: the app is in alpha phase, I am actively developing, and things may not work as expected — please file an issue on GitHub if something breaks for you.</p>\n<p>If you have any questions or suggestions please feel free to drop a comment below!</p>",
            "date_published": "2025-10-04T14:01:43+00:00",
            "authors": [
                {
                    "name": "XInTheDark",
                    "url": "https://www.reddit.com/user/XInTheDark"
                }
            ]
        },
        {
            "id": "1nuc725",
            "url": "/r/macapps/comments/1nuc725/100_yearly_licences_giveaway_alter_talk_your_mac/",
            "external_url": "https://v.redd.it/0xcrqaojy9sf1",
            "title": "100 yearly licences giveaway - Alter: Talk your mac to get stuff done",
            "content_html": "<p>Hey r/MacApps! We're the team behind Alter, an AI that understands what you see and interacts with your Mac.</p>\n<p><strong>TLDR:</strong> Comment here to have one year free sub (<a href=\"https://www.youtube.com/watch?v=MoIyX3zvycs\">and this is a 3 min tour of Alter is capable of</a>)</p>\n<p><strong>New toy for our local oriented users  - SOTA Diarization</strong></p>\n<p>We just shipped an Alter update with the brand new Pyannote Community-1 (<a href=\"https://www.pyannote.ai/blog/community-1\">launching today</a>), the OSS SOTA for diarization (the capacity to identify different speakers in a discussion), thanks to <a href=\"https://www.argmaxinc.com/\">our partner Argmax</a> </p>\n<p>Many of our Alter users want the option to have a 100% offline/local version of Alter, but cloud transcription &amp; diarization services were still far better than local ones.</p>\n<p>On top of this, Alter users can choose between Whisper Pro and Parakeet V3 for their local transcriptions, allowing us to do:</p>\n<ul>\n<li>Talk to your mac with STT done locally</li>\n<li>Real-time transcription as people speak</li>\n<li>Works with every meeting app (Zoom, Meet, Teams, FaceTime, WhatsApp)</li>\n<li>Complete privacy - never touches the internet</li>\n<li>On par with the best cloud services, but stays on your Mac</li>\n<li>Drop one or multiple audio or video files and we'll transcribe it too</li>\n</ul>\n<p>You can also use Alter to replace any dictation software (Whisper Pro, SuperWhisper, Willow etc.) as we offer:</p>\n<ul>\n<li>Dictation including smart formatting</li>\n<li>Voice note transcription</li>\n<li>Talk to AI global shortcut (we call this Speech-to-Prompt)</li>\n<li>Trigger words for advanced workflows</li>\n</ul>\n<p>And of course, what Alter has been built for: orchestrate your Mac and your favorite tools with AI to be way more productive. (we have integration with 2000+ tools &amp; you can use Apple Scripts and Apple Shortcuts as tools too!)</p>\n<p><strong>To use it:</strong> <a href=\"http://Alterhq.com\"><strong>Alterhq.com</strong></a></p>\n<ul>\n<li>You can try Alter for free for 7 days, <strong>no credit card required, including UNLIMITED access</strong> to our 50+ AI models (including Claude 4.5 that was released yesterday).</li>\n<li>If you want to keep using it after your trial period, we are giving away 100 yearly Alter Local+ subscriptions to the first 100 commenters on this post.</li>\n</ul>\n<p><strong>YES, Alter can be used for free, forever.</strong></p>\n<p>I'm not going to pretend I don't know r/macapps are not fans of subscriptions, so yes, you are free to use Alter for free forever in BYOK mode or with Ollama/LM Studio, using Whisper models for STT.</p>\n<p>No ads, no BS, no questions asked.</p>\n<p><strong>(mini) FAQ</strong></p>\n<p>|<strong>Question</strong>|<strong>Answer</strong>|\n|:-|:-|\n|What is the difference between your different subscriptions?|We have a table explaining the differences <a href=\"https://alterhq.com/pricing\">here</a>.|\n|Why are you doing a subscription model for local models?|To support the development as we try our best to make sure the vast majority of our features are available for BYOK/Local users (we are not VC funded!) &amp; We pay a monthly fee for every device having access to Parakeet, Whisper Pro, and Pyannote.|\n|Do you offer student, academic, and non-profit discounts?|yes 35% off, shoot us an email to hi (at) <a href=\"http://altehq.com\">altehq.com</a>|\n|Oh no, another vibe-coded app, poorly made and that will not be maintained. |Senior developers are behind this 100% Swift app, coding it the old-school way 🙂 We've been releasing every week since December 2024; you can check <a href=\"https://alterhq.com/changelog\">our changelog here.</a>|</p>\n<p>PS: </p>\n<p>Also, while we love Parakeet V3, we are suspicious of its language coverage (<a href=\"https://www.reddit.com/r/LocalLLaMA/comments/1nf10ye/30_days_testing_parakeet_v3_vs_whisper/\">read our Reddit post here</a>), so if you speak any of those languages: </p>\n<p>Bulgarian, Croatian, Czech, Danish, Dutch, Estonian, Finnish, Greek, Hungarian, Italian, Latvian, Lithuanian, Maltese, Polish, Romanian, Slovak, Slovenian, Swedish, Russian, Ukrainian</p>\n<p>-&gt; send me a DM. I would like to offer you a yearly local+ subscription too (2 users per language) so you can help us here (no idea how I can verify you speak those languages, so be creative in your DMs).</p>",
            "date_published": "2025-09-30T12:44:46+00:00",
            "authors": [
                {
                    "name": "ewqeqweqweqweqweqw",
                    "url": "https://www.reddit.com/user/ewqeqweqweqweqweqw"
                }
            ]
        },
        {
            "id": "1nrt9kq",
            "url": "/r/macapps/comments/1nrt9kq/after_weeks_of_stalling_and_rejecting_apple/",
            "external_url": "https://apps.apple.com/us/app/relaunch/id6752254955",
            "title": "After weeks of stalling and rejecting, Apple finally approved my pixel-perfect Launchpad clone!",
            "content_html": "<p>Hi everyone,</p>\n<p>A little backstory first: I started working on a Launchpad replacement right after Apple announced its removal at WWDC in June. I knew multiple clones would appear, so I wanted mine to be both the first and the most faithful to the original. Fast forward a few weeks, after solving way more challenges than I expected, I was ready to submit in August.</p>\n<p>But Apple rejected my app, saying it was “too close to the original”. I tried everything: tweaking the UI, changing screenshots and descriptions, even submitting under different app names with different strategies (e.g., showing one UI on macOS 15 and another on 26, or positioning it as a “generic customizable launcher”). Every single submission stalled or failed. Even after macOS 26 was officially released and I dropped macOS 15 support, they still insisted it “duplicates the look and feel of Launchpad, included on macOS devices” and I needed to “differentiate it from existing apps.”</p>\n<p>At that point, I gave up. I’d already sunk too many hours on the project.</p>\n<p>But then… one of my last submissions, which had been stuck at <em>In Review</em> for almost two weeks, suddenly flipped to <em>Approved</em> overnight! Maybe I had a hidden angel at Apple after all. 🙌</p>\n<p>So today, I’m releasing <strong>ReLaunch</strong>, my Launchpad re-implementation for macOS 26.</p>\n<p>A few technical challenges I’m proud of solving:</p>\n<ul>\n<li>Visual fidelity: It had to look and feel <em>exactly</em> like Launchpad: from the homescreen and scrolling to tricky details like hiding the Dock app-indicator dot and keeping the Dock visible while the menu bar is hidden (surprisingly hard to pull off on macOS).</li>\n<li>Fast launch: No delays. Click the ReLaunch icon and your apps are there instantly.</li>\n<li>Lean memory: It needs to stay resident for speed but remain light. My target was &lt;100 MB idle (\\~0.5% of RAM on the lowest-spec Macs), and I beat it.</li>\n<li>Robust indexing: macOS apps live in multiple places; ReLaunch efficiently indexes them and watches for changes.</li>\n<li>Room to grow: Apple’s old implementation was basically frozen in time. ReLaunch creates space for optional, useful features and customizations over time without compromising the familiar feel.</li>\n</ul>\n<p>What’s still in progress: Drag-and-drop on the main grid. For now, there’s a Settings window to quickly organize apps and folders while I make DnD feel natural. (The original Launchpad’s DnD is deceptively complex: reordering across pages, distinguishing between creating a folder vs. swapping an icon into an existing slot, moving in and out of folders while the UI transitions underneath, dragging to the Dock, and more!).</p>\n<p>The one big thing still in progress is drag-and-drop on the main screen. In the original Launchpad, drag-and-drop is surprisingly complex: you can move icons across multiple screens, replacing or merging app into a folder, move into and out of folders, etc. For now, I’ve added a Settings window where you can easily organize apps and folders while I work on making drag-and-drop feel natural.</p>\n<p>About the App Store page: The current screenshots and description are intentionally conservative (no “Launchpad” mentions and a UI variant shown from earlier macOS) to avoid more review drama. But that’s just metadata; on macOS 26 you’ll get the familiar interface right away. I’m holding off on updating the screenshots until I’m sure I won’t risk another rejection.</p>\n<p>Any feedback is very welcome! There’s a <strong>Feedback</strong> button in ReLaunch Settings that goes straight to my personal email. I’d love to hear your use cases and ideas.</p>\n<p><a href=\"https://apps.apple.com/us/app/relaunch/id6752254955\">Download ReLaunch on the Mac App Store!</a></p>\n<p>(This is a repost from r/mac and r/macos since the've deleted my post)</p>",
            "date_published": "2025-09-27T11:51:47+00:00",
            "authors": [
                {
                    "name": "JagiofJagi",
                    "url": "https://www.reddit.com/user/JagiofJagi"
                }
            ]
        },
        {
            "id": "1nompg5",
            "url": "/r/macapps/comments/1nompg5/vibeware_has_killed_this_sub/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1nompg5/vibeware_has_killed_this_sub/",
            "title": "Vibeware has killed this sub",
            "content_html": "<p>It saddens me that this sub has devolved into 50% promo posts for yet another screen capture or clipboard manager vibeware piece of garbage.</p>\n<p>another 49% of posts are complaints that ice or bartender doesn’t work on Tahoe. </p>\n<p>I miss the days that I got turned onto actually useful Mac software developed by experienced professionals and enthusiasts. does anyone know if those types of posts exist in another sub that has yet to descend to the same pitfalls?</p>",
            "date_published": "2025-09-23T16:51:40+00:00",
            "authors": [
                {
                    "name": "Bamboodl",
                    "url": "https://www.reddit.com/user/Bamboodl"
                }
            ]
        },
        {
            "id": "1nnhnia",
            "url": "/r/macapps/comments/1nnhnia/jobsnail_a_macos_app_to_track_job_applications/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1nnhnia/jobsnail_a_macos_app_to_track_job_applications/",
            "title": "JobSnail – A macOS app to track job applications & interviews (Free lifetime promo codes)",
            "content_html": "<p>I built <a href=\"https://apps.apple.com/us/app/jobsnail-smart-job-tracker/id6449959070?mt=12\">JobSnail</a>, a lightweight productivity app that helps you manage job applications and interviews in one clean interface, synced via iCloud.</p>\n<p>There’s a free <a href=\"https://www.jobsnail.app/\">web version</a> too (no signups, just log in with Apple), and I'm also working on iOS version that will be available very soon.</p>\n<p>Drop a comment, upvote, or DM me for a promo code. The first 100 people will get the code.<br />\nAny feedback or questions are welcome. Thanks for checking it out!</p>",
            "date_published": "2025-09-22T09:17:05+00:00",
            "authors": [
                {
                    "name": "netsplatter",
                    "url": "https://www.reddit.com/user/netsplatter"
                }
            ]
        },
        {
            "id": "1nl8g0m",
            "url": "/r/macapps/comments/1nl8g0m/apphub_the_most_detailed_launchpad_replica_for/",
            "external_url": "https://www.reddit.com/gallery/1nl8g0m",
            "title": "AppHub: the most detailed Launchpad replica for macOS 26",
            "content_html": "<p>After 3 months of development, I'm proud to finally unveil AppHub – the most sophisticated alternative to Apple Launchpad for macOS right now.</p>\n<p>When I installed macOS 26 beta, I realised that there's no way I will use this system with that \"Apps\" thing. There are some third party options already, but I wasn't impressed by any. That's why I created my own version that builds upon the original Launchpad, while also fixing its issues.</p>\n<p>Tried to put it on Mac App Store, but Apple rejected because my app \"looks and feels\" too much like Apple Launchpad. Proud of that 😊</p>\n<p><strong>Features:</strong></p>\n<p>•  see the apps you need most and hide those that you don't need <br />\n•  click on side areas to close AppHub <br />\n•  create folders and move your apps on the grid as you wish <br />\n•  enjoy pleasant animations, different ways to scroll, and quick folders renaming. No visual noise! <br />\n•  build your custom layout with empty spaces <br />\n•  use keyboard navigation <br />\n•  works with Light and Dark mode <br />\n•  works with app names in any language <br />\n•  change background style <br />\n•  right click on app icons or folders for quick access to options <br />\n•  enable compact mode to move the window around, change its size to make icons bigger or smaller <br />\n•  delete apps right from AppHub <br />\n•  change icons size and grid scale to make it perfect for your monitor and macOS scaling preferences</p>\n<p>Many more features are on the way! <br />\nYou can download full version or a trial here:</p>\n<p><a href=\"https://bringbacklaunchpad.com/apphub.html\">https://bringbacklaunchpad.com/apphub.html</a></p>\n<p>Lots of features already, therefore I added documentation .pdf to the Help section of the menu bar. </p>\n<p>Would love to hear your feedback!</p>",
            "date_published": "2025-09-19T16:34:56+00:00",
            "authors": [
                {
                    "name": "BohdanKoles",
                    "url": "https://www.reddit.com/user/BohdanKoles"
                }
            ]
        },
        {
            "id": "1nko0f9",
            "url": "/r/macapps/comments/1nko0f9/an_open_source_launchpad_for_macos_26/",
            "external_url": "https://i.redd.it/qmjtricge0qf1.jpeg",
            "title": "An open source Launchpad for MacOS 26",
            "content_html": "<p>An open sourced version of Launchpad that I enhanced ,  you can import from old system Launchpad(just one click), and most of things looks same. There are also a lot of functions like adjust / display /hide icon size and title, localize icons</p>\n<p>Still quickly updating, feel free to open a pull request😃</p>\n<p>Thank you.</p>\n<p>https://github.com/RoversX/LaunchNext</p><div><br></div><img src=\"https://i.redd.it/qmjtricge0qf1.jpeg\" />",
            "date_published": "2025-09-18T23:38:52+00:00",
            "authors": [
                {
                    "name": "no-shadowban-lmao",
                    "url": "https://www.reddit.com/user/no-shadowban-lmao"
                }
            ]
        },
        {
            "id": "1nimpom",
            "url": "/r/macapps/comments/1nimpom/deskrest_appstore_launch_smart_break_and_posture/",
            "external_url": "https://www.reddit.com/gallery/1nimpom",
            "title": "DeskRest AppStore Launch - Smart break and posture reminder app (promo codes giveaway)",
            "content_html": "<p>Hey r/macapps! 👋</p>\n<p>I'm the developer behind DeskRest, and I'm super excited to announce that my workplace wellness app is finally available on the AppStore! 🎉</p>\n<p>To celebrate the AppStore launch, I'm giving away lifetime promo codes! These codes unlock all premium features forever.</p>\n<p>If you'd like a promo code for the macOS app, upvote and leave a comment below, and I'll DM you one! (While supplies last, of course!).</p>\n<p><strong>What is DeskRest?</strong></p>\n<ul>\n<li>DeskRest helps you maintain healthy work habits with smart break reminders, posture alerts, and work-life balance features.</li>\n<li>It's been actively developed for 11 months with regular updates based on user feedback.</li>\n<li>The app intelligently detects when you're watching videos or in meetings to avoid interruptions, and includes features like customizable exercises, visual progress tracking, and a \"Clock Out\" mode to enforce healthy boundaries.</li>\n</ul>\n<p>You can find the Mac app here: <a href=\"https://apps.apple.com/app/id6751417411\">https://apps.apple.com/app/id6751417411</a></p>\n<p>Would love to hear your feedback on the AppStore version!</p>",
            "date_published": "2025-09-16T16:44:58+00:00",
            "authors": [
                {
                    "name": "0xmarcel",
                    "url": "https://www.reddit.com/user/0xmarcel"
                }
            ]
        },
        {
            "id": "1nhejp2",
            "url": "/r/macapps/comments/1nhejp2/is_it_just_me_or_are_these_prices_ridiculous/",
            "external_url": "https://i.redd.it/2z1g746lv9pf1.png",
            "title": "Is it just me or are these prices ridiculous? Cheapest yearly plan is now $430",
            "content_html": "<p>I didn't even receive an email about this ludicrous price increase. I don't think Setapp is worth it for me anymore. For the apps I use, half of them have decent free alternatives, and the other half I'll purchase this Black Friday.</p><div><br></div><img src=\"https://i.redd.it/2z1g746lv9pf1.png\" />",
            "date_published": "2025-09-15T06:35:43+00:00",
            "authors": [
                {
                    "name": "frizla",
                    "url": "https://www.reddit.com/user/frizla"
                }
            ]
        },
        {
            "id": "1ng5isn",
            "url": "/r/macapps/comments/1ng5isn/wallper_just_passed_10k_active_users/",
            "external_url": "https://v.redd.it/m1d8kdb9azof1",
            "title": "Wallper just passed 10k active users",
            "content_html": "<p>I’ve posted here before about Wallper, our macOS app for live 4K wallpapers. Today we crossed <strong>10,000 active users</strong> and we’re really thankful to everyone who tried it, shared feedback, or supported it.</p>\n<p>To celebrate we’re running a promo until September 17 - <strong>50% off for everyone.</strong> </p>\n<p>So if you wanted to try it, now’s the time.</p>\n<p><strong>Get yours here -</strong><a href=\"https://www.wallper.app\"> <strong>wallper.app</strong></a></p>",
            "date_published": "2025-09-13T18:50:36+00:00",
            "authors": [
                {
                    "name": "Dim_Kat",
                    "url": "https://www.reddit.com/user/Dim_Kat"
                }
            ]
        },
        {
            "id": "1ncpjhm",
            "url": "/r/macapps/comments/1ncpjhm/wispr_flow_has_turned_into_total_garbage_dumpster/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1ncpjhm/wispr_flow_has_turned_into_total_garbage_dumpster/",
            "title": "Wispr Flow has turned into total garbage dumpster fire with literally no support, any alternatives?",
            "content_html": "<p>Rant incoming, Im really frustrated. This product was super cool, I used to love it, I even recommend it to 3 friends who also got a pro plan and are now lowkey annoyed at me because they're having the same issues ffs. I had been using it a lot, but it's been going to the absolute shitters recently, which is so, so disappointing. </p>\n<p>Over the past few weeks, it's turned into a real mess. Connections keep dropping randomly, it'll freeze mid-sentence or say it's offline even when my internet is stable. I logged out thinking maybe it's some cache issue but holy freaking airball, I couldn't log back in for three full days. No error messages, nothing, just completely locked out. And good luck getting through to support, they literally have an AI Agent that funnily enough doesn't even work half the time (I was the only one out of my friends who got a reply, see more below on friends omfg) And when the stupid AI can't help you with it's stupid obvious suggestions, it says it'll transfer to a colleague that is probably on vacation for the past week because jfc no reply. Also, their transcriptions have gotten poorer, idk if it's poor data getting into their training but just constant misses and constant failed transcriptions, lags, or the app crashing. Im so annoyed ugh.</p>\n<p>I just love the idea and I need an alternative. Please, please help me because holy, the concept is super smart. I just really need a good alternative because sorry this isn't it.</p>",
            "date_published": "2025-09-09T17:40:17+00:00",
            "authors": [
                {
                    "name": "5678",
                    "url": "https://www.reddit.com/user/5678"
                }
            ]
        },
        {
            "id": "1nbm1fx",
            "url": "/r/macapps/comments/1nbm1fx/adobe_im_officially_done_with_you/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1nbm1fx/adobe_im_officially_done_with_you/",
            "title": "Adobe, I'm officially done with you!",
            "content_html": "<p>This fall, I finally took the plunge: I didn't renew my Adobe Creative Cloud subscription.</p>\n<p>I'm sick of renting software that's become bloated, locked down, and evolving in directions I just don't care about. AI everywhere (hello Firefly), but we still can't get artboards larger than 5 meters in Illustrator... 🙃</p>\n<p>I've been exploring alternatives for years, and I've finally put together a solid, performant toolkit on macOS:</p>\n<ul>\n<li><strong>Photoshop</strong> → Affinity Photo</li>\n<li><strong>Illustrator</strong> → Affinity Designer (+ Inkscape for specific tasks)</li>\n<li><strong>InDesign</strong> → Affinity Publisher</li>\n<li><strong>Acrobat</strong> → PDF Expert, Preview</li>\n<li><strong>Premiere</strong> → Final Cut Pro (not totally convinced... might dig into DaVinci Resolve, but my editing needs are pretty limited)</li>\n<li><strong>After Effects</strong> → Motion, Cavalry (free version)</li>\n<li><strong>Audition</strong> → Ableton Live, Logic Pro</li>\n<li><strong>Media Encoder</strong> → Compressor, HandBrake</li>\n<li><strong>Bridge</strong> → Eagle</li>\n</ul>\n<p>I bought all the perpetual licenses gradually over time. Several solutions are free and/or open source. It feels amazing to have that freedom back!</p>\n<p>Next subscription in my crosshairs: Microsoft 365.</p>\n<p><em>What alternatives have you found that work well? Always curious to hear what others are using!</em></p>",
            "date_published": "2025-09-08T12:12:27+00:00",
            "authors": [
                {
                    "name": "zakxxi",
                    "url": "https://www.reddit.com/user/zakxxi"
                }
            ]
        },
        {
            "id": "1n6oy2p",
            "url": "/r/macapps/comments/1n6oy2p/open_source_make_your_mac_look_like_unlicensed/",
            "external_url": "https://www.reddit.com/gallery/1n6oy2p",
            "title": "[Open Source] Make your Mac look like unlicensed Windows",
            "content_html": "<p>Basically it places a message identical to the Windows activation message in the lower right corner. You can customize the OS name. It has two versions, one with multiple languages ​​and one with just English (in case you think the message in English is cooler).</p>\n<p>I’m not sure what this is supposed to be used for.</p>\n<p>Download the <a href=\"https://github.com/rafaelSwi/ActivateMacOverlay/releases/latest\">latest version by clicking here</a>.</p>\n<p><em>You may have seen this app before because it was posted on</em> r/badUIbattles<em>, but it was never posted here.</em></p>",
            "date_published": "2025-09-02T16:56:01+00:00",
            "authors": [
                {
                    "name": "Fragrant_Okra6671",
                    "url": "https://www.reddit.com/user/Fragrant_Okra6671"
                }
            ]
        },
        {
            "id": "1n54a64",
            "url": "/r/macapps/comments/1n54a64/mac_apps_i_cant_live_without_whats_yours/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1n54a64/mac_apps_i_cant_live_without_whats_yours/",
            "title": "Mac Apps I Can't Live Without - What's yours?",
            "content_html": "<p>These are the apps I use every single day, curious what everyone else is using daily.</p>\n<ol>\n<li>Alfred 5</li>\n<li>PastePal</li>\n<li>Ice</li>\n<li>Shottr</li>\n<li>Battery Health 3</li>\n<li>Espanso</li>\n<li>Dropover</li>\n<li>AppCleaner</li>\n<li>Magnet</li>\n<li>CheatSheet</li>\n<li>LocalSend</li>\n<li>Amphetamine</li>\n<li>PopClip</li>\n<li>Supercharge</li>\n<li>LookAway</li>\n</ol>\n<p>These apps I rarely use, although want to:</p>\n<ul>\n<li><em>hazel</em></li>\n<li><em>bettertouchtool</em></li>\n<li><em>IINA</em></li>\n</ul>\n<p>What about you? Cheers!</p>",
            "date_published": "2025-08-31T19:52:37+00:00",
            "authors": [
                {
                    "name": "justadityaraj",
                    "url": "https://www.reddit.com/user/justadityaraj"
                }
            ]
        },
        {
            "id": "1n28f1v",
            "url": "/r/macapps/comments/1n28f1v/my_top_95_must_have_mac_apps/",
            "external_url": "https://i.redd.it/b0iy02hikqlf1.png",
            "title": "My Top 95 Must Have Mac Apps",
            "content_html": "<p>Hey r/macapps! A lot of people post their app lists, so I've decided to post mine! Excited to hear what you guys have to say! Let me know if you think anything is missing!</p>\n<p>1Password  </p>\n<p>AlDente  </p>\n<p>AltTab  </p>\n<p>Amphetamine  </p>\n<p>AnyDesk  </p>\n<p>Apparency  </p>\n<p>AppBeBack  </p>\n<p>Apowersoft Screenshot  </p>\n<p>Audacity  </p>\n<p>Auto-Editor  </p>\n<p>Background Music  </p>\n<p>BetterDisplay  </p>\n<p>BetterZip  </p>\n<p>Bitwarden  </p>\n<p>Blip  </p>\n<p>BrightXDR  </p>\n<p>Caffeine  </p>\n<p>CleanMyMac X  </p>\n<p>Cluely  </p>\n<p>Color Picker  </p>\n<p>Comet  </p>\n<p>ComfyUI  </p>\n<p>Cursor  </p>\n<p>Daily  </p>\n<p>DevHub  </p>\n<p>Dia  </p>\n<p>Dropover  </p>\n<p>eqMac  </p>\n<p>Find Any File  </p>\n<p>Flux  </p>\n<p>Freewrite  </p>\n<p>Genspark  </p>\n<p>Ghostty  </p>\n<p>GrandPerspective  </p>\n<p>GuitarTuna  </p>\n<p>Hand Mirror  </p>\n<p>HEIC Converter  </p>\n<p>Hidden Bar  </p>\n<p>Hotlist  </p>\n<p>ImageOptim  </p>\n<p>IINA  </p>\n<p>iMazing  </p>\n<p>iTerm  </p>\n<p>IsThereNet  </p>\n<p>KeyCastr  </p>\n<p>KeyClicker  </p>\n<p>KnockKnock  </p>\n<p>Latest  </p>\n<p>LM Studio  </p>\n<p>Lunar  </p>\n<p>LuLu  </p>\n<p>MacWhisper  </p>\n<p>Maintenance  </p>\n<p>Malwarebytes  </p>\n<p>MeetingBar  </p>\n<p>Menuist  </p>\n<p>Music Decoy  </p>\n<p>Muse Hub  </p>\n<p>Numi  </p>\n<p>OBS  </p>\n<p>Ollama  </p>\n<p>On Air Mode  </p>\n<p>OnyX  </p>\n<p>Pandan  </p>\n<p>Pearcleaner  </p>\n<p>PDFgear  </p>\n<p>Permute 3  </p>\n<p>Plash  </p>\n<p>ProtonVPN  </p>\n<p>QuickLookPro  </p>\n<p>Raycast  </p>\n<p>Rectangle  </p>\n<p>Repo Prompt  </p>\n<p>Rocket  </p>\n<p>Screenlight  </p>\n<p>Screen Studio  </p>\n<p>SelfControl  </p>\n<p>Shottr  </p>\n<p>Shutter Encoder  </p>\n<p>Speediness  </p>\n<p>Speedtest  </p>\n<p>Spokenly  </p>\n<p>Spotube  </p>\n<p>Splashtop Business  </p>\n<p>State  </p>\n<p>SteelSeries ExactMouse Tool  </p>\n<p>Suspicious Package  </p>\n<p>Sublime Text  </p>\n<p>TempBox  </p>\n<p>Things  </p>\n<p>The Clock  </p>\n<p>The Unarchiver  </p>\n<p>Time Out  </p>\n<p>TinkerTool  </p>\n<p>Toolkit  </p>\n<p>Trae  </p>\n<p>TrackWeight  </p>\n<p>Under My Roof  </p>\n<p>Usage  </p>\n<p>VLC  </p>\n<p>WidgetWall  </p>\n<p>Whisky  </p>\n<p>Windsurf  </p>\n<p>Wispr Flow  </p><div><br></div><img src=\"https://i.redd.it/b0iy02hikqlf1.png\" />",
            "date_published": "2025-08-28T10:18:48+00:00",
            "authors": [
                {
                    "name": "LessPermission2503",
                    "url": "https://www.reddit.com/user/LessPermission2503"
                }
            ]
        },
        {
            "id": "1n05437",
            "url": "/r/macapps/comments/1n05437/10_lifetime_discount_scrapethemap_the_ultimate/",
            "external_url": "https://v.redd.it/vjpqn2cjt8lf1",
            "title": "[10% Lifetime Discount] Scrapethemap | The ultimate lead generation app for macOS",
            "content_html": "<p>Use code : \"SCRAPE100\" to save 10%</p>\n<p>Website :  <a href=\"https://scrapethemap.com\">Scrapethemap</a></p>",
            "date_published": "2025-08-25T22:42:52+00:00",
            "authors": [
                {
                    "name": "alexkendig",
                    "url": "https://www.reddit.com/user/alexkendig"
                }
            ]
        },
        {
            "id": "1mviwyz",
            "url": "/r/macapps/comments/1mviwyz/how_i_speed_up_my_mac_in_minutes_and_free_24_gb/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1mviwyz/how_i_speed_up_my_mac_in_minutes_and_free_24_gb/",
            "title": "How I Speed Up My Mac in Minutes and Free 2–4 GB of Space. No cleanMyMac, no paid apps",
            "content_html": "<p>Since a lot of you liked my previous posts, I’ve decided to turn this into a mini series where I share hidden Mac features that save time and keep your computer clean. All without using any third-party apps.</p>\n<p>I kept seeing ads for paid <strong>“speed up your Mac”</strong> apps, so I asked my friend who is a developer to make me a mini version using Automator and a shell script.</p>\n<p>Now I click one icon and it:</p>\n<p><strong>·</strong>         Empties the Trash</p>\n<p><strong>·</strong>         Clears system cache files</p>\n<p><strong>·</strong>         Deletes leftover DMG installers</p>\n<p><strong>·</strong>         Flushes DNS cache</p>\n<p><strong>·</strong>         Clears the temporary files that slow everything down</p>\n<p>It’s just a tiny script wrapped in Automator. You already have everything you need to run it..</p>\n<p><strong>How I made it (3 minutes):</strong></p>\n<p><strong>1.</strong>  Open <strong>Automator</strong>, Click <strong>New Document</strong>, choose <strong>Application</strong></p>\n<p><strong>2.</strong>  In the left sidebar, search for <strong>Run Shell Script</strong> and drag it into the workflow</p>\n<p><strong>3.</strong>  Paste this script:</p>\n<p><code># Empty Trash</code></p>\n<p><code>rm -rf ~/.Trash/*</code></p>\n<p><code># Delete user cache files</code></p>\n<p><code>rm -rf ~/Library/Caches/*</code></p>\n<p><code># Delete old DMG files from Downloads</code></p>\n<p><code>find ~/Downloads -name \"*.dmg\" -mtime +1 -delete</code></p>\n<p><strong>4.</strong> Save the file with a name like “<strong>CleanUp.app</strong>” and drop it on your desktop.</p>\n<p>Now I just double-click it once a week and my Mac feels faster instantly.</p>\n<p>It targets the exact same stuff those paid “cleaner” apps do, but it’s free and transparent. I saved 3GB the first time I ran it and my Mac feels noticeably snappier, especially apps like Safari and Photoshop.</p>\n<p><strong>Let me know if you want more automations like this.</strong></p>",
            "date_published": "2025-08-20T16:02:09+00:00",
            "authors": [
                {
                    "name": "Tack911",
                    "url": "https://www.reddit.com/user/Tack911"
                }
            ]
        },
        {
            "id": "1mur7ys",
            "url": "/r/macapps/comments/1mur7ys/my_downloads_folder_now_cleans_itself/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1mur7ys/my_downloads_folder_now_cleans_itself/",
            "title": "My Downloads folder now cleans itself automatically using built-in Mac tools",
            "content_html": "<p>After my last post went viral <a href=\"https://www.reddit.com/r/macapps/comments/1mtt6gj/how_i_automated_my_entire_morning_workflow_on_mac/\">\"<strong>How I automated my entire morning workflow on Mac using only built-in tools</strong></a>\", I realized how many Mac users didn’t know their computer could automate things by itself. A ton of people asked me to share more of these built-in tricks, so here’s another one that’s been saving me time every day and not just 30 seconds like previous post  :)</p>\n<p>Most people’s <strong>Downloads folder</strong> is a mess full of screenshots, ZIP files, invoices, and old installers. Mine cleans and organizes itself behind the scenes and I barely think about it now.</p>\n<p><strong>Here’s what it does for me:</strong></p>\n<ul>\n<li>Moves all images into a folder called “Downloads/Images”</li>\n<li>Puts PDFs into “Downloads/Documents”</li>\n<li>Sends ZIP files into “Downloads/Archives”</li>\n<li>Deletes DMG installer files after a day</li>\n</ul>\n<blockquote>\n<p>All of this is done using a feature on macOS called Automator with a Folder Action. No apps to install and no scripts to learn.</p>\n</blockquote>\n<p><strong>How to set it up (takes 2 or 3 minutes):</strong></p>\n<p><strong>1.</strong> Open the Automator app and choose <strong>New Document</strong>, then select <strong>Folder Action.</strong></p>\n<p><strong>2.</strong> At the top, choose <strong>Downloads</strong> as the folder this action watches.</p>\n<p><strong>3.</strong> From the list of actions, search and drag in <strong>Filter Finder Items.</strong></p>\n<p><strong>-</strong> Set it to: Kind is Image.</p>\n<p><strong>4.</strong> Then drag in <strong>Move Finder Items</strong> and choose the folder you want those images to go to (like Downloads/Images).</p>\n<p><strong>5.</strong> Repeat steps 3 and 4 for:</p>\n<ul>\n<li>Kind is PDF → move to Documents</li>\n<li>Kind is Archive → move to Downloads/Archives</li>\n</ul>\n<p><strong>6.</strong> Save the workflow with a name like “<strong>Downloads Cleaner</strong>”</p>\n<p><em>Optional: You can create another workflow that deletes DMG files older than 1 day and trigger it using the Calendar app with a Custom alert if you want it to run on a schedule.</em></p>\n<p>This one Automator action keeps my Downloads folder clean without me doing anything. I used to spend time dragging files around or deleting installers every Friday. Now it's automatic.</p>\n<p>This honestly replaces paid apps like CleanMyMac or Hazel for this type of cleanup.</p>\n<p><strong>If people are interested I’ll keep sharing more Mac automations that don’t require any paid tools or coding.</strong></p>",
            "date_published": "2025-08-19T18:46:41+00:00",
            "authors": [
                {
                    "name": "Tack911",
                    "url": "https://www.reddit.com/user/Tack911"
                }
            ]
        },
        {
            "id": "1mqm3cm",
            "url": "/r/macapps/comments/1mqm3cm/stop_the_subscription_madness_we_need_to_draw_the/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1mqm3cm/stop_the_subscription_madness_we_need_to_draw_the/",
            "title": "Stop the subscription madness: we need to draw the line",
            "content_html": "<p>Some apps genuinely deserve subscription models, those with real server costs, constantly updated content, or ongoing development. But most don't.</p>\n<p>Not every app is a service. If your app works offline, doesn't require servers, and isn't constantly updated with new content, you don't deserve recurring revenue. Period.</p>",
            "date_published": "2025-08-15T03:20:43+00:00",
            "authors": [
                {
                    "name": "DevelopmentSevere278",
                    "url": "https://www.reddit.com/user/DevelopmentSevere278"
                }
            ]
        },
        {
            "id": "1mi7tqb",
            "url": "/r/macapps/comments/1mi7tqb/ublock_origin_lite_is_now_available_for_safari/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1mi7tqb/ublock_origin_lite_is_now_available_for_safari/",
            "title": "uBlock Origin Lite is now available for Safari",
            "content_html": "<p><a href=\"https://apps.apple.com/in/app/ublock-origin-lite/id6745342698\">https://apps.apple.com/in/app/ublock-origin-lite/id6745342698</a></p>",
            "date_published": "2025-08-05T12:28:30+00:00",
            "authors": [
                {
                    "name": "simtaankaaran",
                    "url": "https://www.reddit.com/user/simtaankaaran"
                }
            ]
        },
        {
            "id": "1mg18uj",
            "url": "/r/macapps/comments/1mg18uj/open_source_privacyfirst_macosnative_ai_meeting/",
            "external_url": "https://i.redd.it/w2qlqfry7ogf1.jpeg",
            "title": "Open Source, Privacy-First, macOS-Native AI Meeting Summary",
            "content_html": "<p>Hey /macapps</p>\n<p>Saw a guy who stole my work, design and project and hosted it on Gitlab with malware. I decided to post the original work on macapps to prevent further unauthorized distribution(s) of Recap. Thank you. Open Source is ❤️ </p>\n<p>Been working on this for so long. I have found no other open-source alternative that allows my data to stay on my device.</p>\n<p>Recap is an open-source, privacy-focused, macOS-native project to help you summarize your meetings. You could summarize audio of any app, not just meetings.</p>\n<p>I don't want to say too much here, my README contains everything you want :)</p>\n<p>https://github.com/rawandahmad698/Recap</p><div><br></div><img src=\"https://i.redd.it/w2qlqfry7ogf1.jpeg\" />",
            "date_published": "2025-08-02T21:03:55+00:00",
            "authors": [
                {
                    "name": "Soprano-C",
                    "url": "https://www.reddit.com/user/Soprano-C"
                }
            ]
        },
        {
            "id": "1mcd3h0",
            "url": "/r/macapps/comments/1mcd3h0/im_building_a_native_macos_youtube_app/",
            "external_url": "https://www.reddit.com/gallery/1mcd3h0",
            "title": "I’m building a native macOS YouTube app",
            "content_html": "<p>I’ve spent over 100 hours on this. I’m new to coding, and my only dream is to make native macOS versions of the apps I use the most. For now, this is just the first showcase. Once it’s ready, I’ll release it as a free beta version for the community and keep it updated for a long time.</p>\n<p>I have a few questions out of curiosity. Is this legal? I’m trying to make an open-source app that doesn’t collect any user data and is safe to use. But I haven’t researched much — could YouTube sue me for this?</p>\n<p>Other than that, if there’s a feature you think would be nice to have, let me know. I’ll try to add it as best as I can.</p>\n<p>Let me also mention that the app is currently being developed in Turkish. When I release the beta, it will support both Turkish and English.</p>\n<h1>Features I’m planning to implement, if possible:</h1>\n<ul>\n<li>A <strong>“minimize video”</strong> button — when clicked, the video will shrink into the bottom section of the sidebar, allowing easier controls.</li>\n<li>A <strong>compact mode for music</strong>, similar to how Apple Music works. I’m not sure if I can manage it yet, but I’ll try.</li>\n</ul>\n<p>The app will be <strong>completely free</strong>. I also want to say this:</p>\n<p>Before I started this journey, I used to question why some apps were paid. But now I understand — it’s truly difficult. There are constant bugs and issues, especially for a broad app like this (at least from my perspective). I really hope I can reach a flawless version one day.</p>\n<p>Lastly, if you want, I can create a <strong>GitHub page</strong> and share what I add to the app daily or weekly. Once it’s ready for public use, I’ll share it through the same GitHub page.</p>",
            "date_published": "2025-07-29T14:35:06+00:00",
            "authors": [
                {
                    "name": "safak45x",
                    "url": "https://www.reddit.com/user/safak45x"
                }
            ]
        },
        {
            "id": "1mc9kaz",
            "url": "/r/macapps/comments/1mc9kaz/brilliant_is_now_free/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1mc9kaz/brilliant_is_now_free/",
            "title": "Brilliant is now free",
            "content_html": "<h1>Yep, as the title says - Brilliant is now completely free.</h1>\n<p>For those who don't know, <a href=\"https://brilliant.design\">Brilliant</a> is extremely powerful and can be used for screen annotation, prototyping, brainstorming and much more.  </p>\n<p>Here's a tutorial on how to use Brilliant as a screen annotator to get you started:<br />\n<a href=\"https://www.youtube.com/watch?v=593b8tXQdbo\">https://www.youtube.com/watch?v=593b8tXQdbo</a></p>\n<p>And here's the link to Brilliant's documentation which includes everything from installation to customization: <a href=\"http://brilliant.design/docs\">brilliant.design/docs</a></p>\n<h1>Wait, how is it free? Are you mining my data?</h1>\n<p>Nothing you create ever leaves your computer. All your work is 100% local and private. Brilliant is built as a local-first tool and doesn't require anything your Mac doesn't already know how to do.</p>\n<h1>Okay, so how are you making money?</h1>\n<p>We'll be introducing a separate platform where you'll (optionally) be able to publish, sync and share the work you created in Brilliant. As part of our go-to-market strategy, we're giving away the client completely for free.</p>\n<h1>Windows/Linux version when?</h1>\n<p>The cross platform version (which will also be completely free) of Brilliant is 70% ready and a beta version will hopefully be available soon :)</p>\n<p>Feel free to drop any feedback, feature requests or questions in the comments. Looking forward to hear new users' experiences with Brilliant!</p>",
            "date_published": "2025-07-29T12:03:23+00:00",
            "authors": [
                {
                    "name": "amantinband",
                    "url": "https://www.reddit.com/user/amantinband"
                }
            ]
        },
        {
            "id": "1m95m29",
            "url": "/r/macapps/comments/1m95m29/i_built_a_privacyfirst_transcribing_summarizing/",
            "external_url": "https://i.redd.it/6wgfwsxh22ff1.jpeg",
            "title": "I built a privacy-first transcribing + summarizing tool that's FREE FOREVER",
            "content_html": "<p>Hey all,</p>\n<p>I built a macOS app called <a href=\"https://hyprnote.com\">Hyprnote</a> - it’s an AI-powered notepad that listens during meetings and turns your rough notes into clean, structured summaries. Everything runs locally on your Mac, so no data ever leaves your device. We even trained our own LLM for this.</p>\n<p>We used to manually scrub through recordings, stitch together notes, and try to make sense of scattered thoughts after every call. That sucked. So we built Hyprnote to fix it - no cloud, no copy-pasting, just fast, private note-taking.</p>\n<p>People from Fortune 100 companies to doctors, lawyers, therapists - even D&amp;D players - are using it. It works great in air-gapped environments, too.</p>\n<p>Would love your honest feedback. If you’re in back-to-back calls or just want a cleaner way to capture ideas, give it a spin and let me know what you think.</p>\n<p>You can check it out at <a href=\"https://hyprnote.com/\">hyprnote.com</a>.</p>\n<p>Oh we're also <a href=\"https://github.com/fastrepl/github\">open-source</a>.</p>\n<p>Thanks!</p><div><br></div><img src=\"https://i.redd.it/6wgfwsxh22ff1.jpeg\" />",
            "date_published": "2025-07-25T17:36:52+00:00",
            "authors": [
                {
                    "name": "beerbellyman4vr",
                    "url": "https://www.reddit.com/user/beerbellyman4vr"
                }
            ]
        },
        {
            "id": "1m7ywqn",
            "url": "/r/macapps/comments/1m7ywqn/tuneful_27_is_out_native_playback_manager_for/",
            "external_url": "https://v.redd.it/upk6zvmi6sef1",
            "title": "Tuneful 2.7 is out - Native playback manager for Spotify and Apple Music",
            "content_html": "",
            "date_published": "2025-07-24T08:31:39+00:00",
            "authors": [
                {
                    "name": "helloworldn",
                    "url": "https://www.reddit.com/user/helloworldn"
                }
            ]
        },
        {
            "id": "1m2yovu",
            "url": "/r/macapps/comments/1m2yovu/create_screen_recordings_like_this_for_free/",
            "external_url": "https://v.redd.it/otbqabw40mdf1",
            "title": "create screen recordings like this FOR FREE",
            "content_html": "<p>i just launched <strong>flowy</strong>, a macOS app that allows you to create <strong>animated screen recordings</strong>, and now it's <strong>FREE</strong> for you to keep <strong>forever</strong> (<em>includes future updates!</em>). be aware, the offer expires in less than 24 hours as on 19 July we go back to 19.99$.</p>\n<p>find it on <a href=\"https://apps.apple.com/us/app/flowy-screen-recorder-editor/id6748351905\">Mac App Store</a> or at <a href=\"https://getflowy.app/\">getflowy.app</a></p>\n<p>you can record the whole screen/only a window and the app will automatically create zoom effects based on your interactions, which you can later edit in the editor, along with the background, output aspect ratio, cursor, etc.</p>\n<p>it's one of my first released projects, so i'd love to hear your input! tip me with a review on the app store if ur kind ✌️</p>",
            "date_published": "2025-07-18T10:25:49+00:00",
            "authors": [
                {
                    "name": "clmemagi",
                    "url": "https://www.reddit.com/user/clmemagi"
                }
            ]
        },
        {
            "id": "1lzxv7q",
            "url": "/r/macapps/comments/1lzxv7q/is_is_just_me_or_has_there_been_a_pretty_big/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1lzxv7q/is_is_just_me_or_has_there_been_a_pretty_big/",
            "title": "Is is just me, or has there been a pretty big increase in \"I built an app\" posts recently?",
            "content_html": "<p>I hope I am wrong, but I'm wondering now if people are just using AI coding tools to crank out apps and throwing them up for sale quickly.</p>\n<p>I have no issue with competent developers using a programming LLM to speed up their coding. But if you're coding last ended with writing a small script to automate some task you had, I don't think that's going to help you code an app using an LLM, and be able to support bug fixes and security updates long-term.</p>",
            "date_published": "2025-07-14T20:38:59+00:00",
            "authors": [
                {
                    "name": "plazman30",
                    "url": "https://www.reddit.com/user/plazman30"
                }
            ]
        },
        {
            "id": "1lumvak",
            "url": "/r/macapps/comments/1lumvak/discovered_the_app_blip_and_its_the_best_file/",
            "external_url": "https://www.reddit.com/gallery/1lumvak",
            "title": "discovered the app Blip .. and its the best file sending app ever really",
            "content_html": "<p>I've used it on mac, windows, android so far, without any problems, love it!</p>\n<p>best thing is, you don't have to be connected to the same wifi to send each other files<br />\nthis is super convenient for me</p>\n<p><a href=\"https://blip.net/\">https://blip.net/</a></p>",
            "date_published": "2025-07-08T12:08:27+00:00",
            "authors": [
                {
                    "name": "bokunobokuu",
                    "url": "https://www.reddit.com/user/bokunobokuu"
                }
            ]
        },
        {
            "id": "1lo72ik",
            "url": "/r/macapps/comments/1lo72ik/griply_30_time_blocking_goal_roadmap_calendar/",
            "external_url": "https://v.redd.it/obee43yqc2af1",
            "title": "Griply 3.0: Time Blocking, Goal Roadmap & Calendar - here’s what’s new [+ Giveaway & LTD]",
            "content_html": "<p>Hi everyone!</p>\n<p>I’m Amber, founder of Griply: a goal planner and task manager I started out of frustration with how disconnected most productivity tools felt.</p>\n<p>I had my long-term goals in Notion, habits in one app, and daily tasks in another. Nothing showed how it all fit together. I kept losing sight of what actually mattered.</p>\n<p>So we started building what I wished existed.</p>\n<p><strong>What Griply does</strong><br />\nGriply connects your goals, habits, and tasks in one system, all aligned with your bigger vision. You can:</p>\n<ul>\n<li>Break down big goals into subgoals, habits, and actionable tasks</li>\n<li>Set measurable targets (e.g. read 12 books, lose 5kg, save $5k)</li>\n<li>Organize everything around your life areas (like health, career, relationships)</li>\n<li>Track progress visually with charts on a dashboard</li>\n<li>Use widgets on iOS to keep goals, habits, and tasks top of mind</li>\n<li>Available on Mac, Windows, Web &amp; iOS – all synced (join the waitlist for Android on our website)</li>\n</ul>\n<p>It’s built for people who want to stop just checking off tasks and actually start making consistent progress on what matters.</p>\n<p><strong>What’s new in Griply 3.0</strong></p>\n<p>This is our biggest update yet and it finally closes the gap between long-term goals and daily actions.</p>\n<ul>\n<li><strong>Goal Timeline</strong> – Plan goals months and years ahead on a roadmap</li>\n<li><strong>Calendar &amp; Time Blocking</strong> – Schedule tasks, goals and life areas with drag &amp; drop</li>\n<li><strong>Goal Time Slots</strong> – This is really unique, plan slots on the calendar for your goals or life areas instead of single tasks</li>\n<li><strong>New Daily Planner</strong> – Focus each day around your goals, habits, and tasks</li>\n<li><strong>Google Calendar Integration</strong> – Show your Google Calendar events</li>\n<li><strong>Completely Redesigned Desktop App</strong> – Easier planning on big screens</li>\n</ul>\n<p>I’ve attached a short video here showing everything that’s new. And we've shared all the details on our launch page: <a href=\"http://griply.app/v3\">http://griply.app/v3</a></p>\n<p><strong>🎁 Lifetime Giveaway</strong></p>\n<p>To celebrate the 3.0 launch, I’m giving away Lifetime Premium to the <strong>first 25 people</strong> under this post (send me your Griply sign-up email so I can grant you the lifetime access).</p>\n<ul>\n<li>Next 25: 1 year Premium</li>\n<li>Next 50: 6 months Premium</li>\n<li>Everyone else: One month Premium</li>\n</ul>\n<p>You can sign up here: <a href=\"http://griply.app/\">http://griply.app</a>.</p>\n<p>(If you’d like to support us, there’s also a limited Lifetime Deal available on our website)</p>\n<p>We’re a passionate bootstrapped team of four building this based on user feedback and closely with our community. If you have thoughts, feedback, suggestions, I’d love to hear from you.</p>\n<p>Thanks so much for reading!</p>",
            "date_published": "2025-06-30T13:07:52+00:00",
            "authors": [
                {
                    "name": "amberhaccou",
                    "url": "https://www.reddit.com/user/amberhaccou"
                }
            ]
        },
        {
            "id": "1lmtw7y",
            "url": "/r/macapps/comments/1lmtw7y/dory_an_app_switcher_for_people_who_cant_remember/",
            "external_url": "https://v.redd.it/qfp8dqskmp9f1",
            "title": "Dory - An app switcher for people who can’t remember shortcuts - 1.1.0 is out! [promo codes giveaway]",
            "content_html": "<p>Hey everyone! The past month has been incredible - the response and feedback from this amazing community have been overwhelming. I've been hard at work, and I’m excited to introduce the new version of Dory!</p>\n<p><strong>Similar to last time, as a small token of appreciation, upvote and leave a comment below, and I’ll randomly share promo codes while supplies last.</strong></p>\n<p>Here's what's new:</p>\n<p>• Two beautiful new menus to choose from - Palette and Fan, each available in 3 sizes.</p>\n<p>• You can now assign different letters and even launch terminated apps using a configured letter. This was the #1 most requested feature… I finally caved and added it :) </p>\n<p>• Dory can now open Progressive Web Apps (PWA).</p>\n<p>• Apps can now launch when you hover over them and release the button.</p>\n<p>• You can now set the app list to appear only on the main screen.</p>\n<p>---<br />\nMeet Dory - A quick way to cycle through apps without moving your hand from the mouse - and without needing to remember any shortcuts.</p>\n<p>Click your middle mouse button - or the right Command key if both hands are on the keyboard - and type the first letter of the app’s name.</p>\n<p>Find apps using the first letter, middle letters, acronyms, or similar names.</p>\n<p>If multiple apps share that letter, just keep tapping it to cycle through them.</p>\n<p>You can also press the middle mouse button and start typing the app’s name directly.</p>\n<p>You can also enable an optional App list popup when switching between apps</p>\n<p>Dory works right out of the box - and over time, it learns which apps you use most and prioritizes them.</p>\n<p>No extra shortcuts.</p>\n<p>No setup. Nothing to remember.</p>\n<p>It's currently $3.99 - <a href=\"https://apps.apple.com/us/app/dory-app-switcher/id6746273626?mt=12\">App Store</a> (One-time purchase. No subscription.)</p>",
            "date_published": "2025-06-28T18:32:24+00:00",
            "authors": [
                {
                    "name": "segevs",
                    "url": "https://www.reddit.com/user/segevs"
                }
            ]
        },
        {
            "id": "1lcsbxl",
            "url": "/r/macapps/comments/1lcsbxl/is_it_just_me_ignoring_apps_which_mention_use_of/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1lcsbxl/is_it_just_me_ignoring_apps_which_mention_use_of/",
            "title": "Is it just me.... ignoring apps which mention use of or have A.I in their title",
            "content_html": "<p>Am I the only one who feels fatigued by the amount of apps coming out now which feel they have to use some form of AI or to mention it within the application name?</p>\n<p>Probably going to get mass-downvoted for this one!</p>",
            "date_published": "2025-06-16T13:07:22+00:00",
            "authors": [
                {
                    "name": "mrkibbledoeswhat",
                    "url": "https://www.reddit.com/user/mrkibbledoeswhat"
                }
            ]
        },
        {
            "id": "1l91168",
            "url": "/r/macapps/comments/1l91168/updated_deskminder²_reminders_tasks_on_your/",
            "external_url": "https://v.redd.it/npsygnxcec6f1",
            "title": "[Updated] DeskMinder² – Reminders & Tasks on your Desktop",
            "content_html": "<p>Hi r/macapps, four months ago, I released my first macOS app, and when I shared it here, I received hundreds of reviews, dozens of great ideas, and a huge boost of motivation to keep working on it.</p>\n<p>Over the past couple of months, I’ve been working on a new version, and today I’m excited to share it with you. </p>\n<ul>\n<li>In this update, I’ve added a mode switcher so you can not only create reminders quickly but also mark the start of your work on tasks.</li>\n<li>The entire interface has been redesigned – it’s now truly transparent and fluid.</li>\n<li>Fullscreen notifications have been improved to deliver a smooth, pleasant animation and a unique blurred background effect.</li>\n<li>A new History mode is now available, complete with search and a cool animation in the menubar when a timer or task is active.</li>\n<li>One of the things I’m most proud of is the <strong>Audio-Haptic Experiences</strong> – if you have a trackpad, you’ll love how it feels to interact with the widget.</li>\n<li>Shortcuts have been improved too, and the app size has been reduced from 200MB to just 8MB.</li>\n</ul>\n<p>As always, I’d love to hear your feedback, ideas, and impressions – you know I listen and implement them.</p>\n<p><strong>The price goes up in 48 hours</strong>, but you’ll still get the best deal for a great product.</p>\n<p><a href=\"https://apps.apple.com/ua/app/deskminder-reminders-tasks/id6740942938?mt=12\">Try DeskMinder²</a></p>",
            "date_published": "2025-06-11T18:59:52+00:00",
            "authors": [
                {
                    "name": "Dmytro-Wakeup",
                    "url": "https://www.reddit.com/user/Dmytro-Wakeup"
                }
            ]
        },
        {
            "id": "1l6p55h",
            "url": "/r/macapps/comments/1l6p55h/working_on_a_free_individual_volume_control_app/",
            "external_url": "https://i.redd.it/6z1plb828s5f1.png",
            "title": "Working on a FREE individual volume control app (Suggestions Please!)",
            "content_html": "<p>I’m currently building a free macOS app that lets you control the volume of <strong>individual apps separately</strong> — something macOS doesn’t natively support. Think of it like Volume Mixer on Windows, but for macOS.</p>\n<p>It’s still in early development, and I’d <strong>love your suggestions</strong> on features, UX, and anything else you’d want from such a tool.</p><div><br></div><img src=\"https://i.redd.it/6z1plb828s5f1.png\" />",
            "date_published": "2025-06-08T22:46:10+00:00",
            "authors": [
                {
                    "name": "Cyber_pill",
                    "url": "https://www.reddit.com/user/Cyber_pill"
                }
            ]
        },
        {
            "id": "1l5wg0r",
            "url": "/r/macapps/comments/1l5wg0r/dory_an_app_switcher_for_people_who_cant_remember/",
            "external_url": "https://v.redd.it/b57tsid4tk5f1",
            "title": "Dory - An app switcher for people who can’t remember shortcuts - [promo codes giveaway]",
            "content_html": "<p>Hey everyone! I shared Dory a few weeks ago and got some amazing feedback - thank you!</p>\n<p><strong>As a small token of appreciation, upvote and leave a comment below, and I’ll randomly share promo codes while supplies last.</strong></p>\n<p><strong>---</strong></p>\n<p>Meet Dory - A quick way to cycle through apps without moving your hand from the mouse - and without needing to remember any shortcuts.</p>\n<p>Click your middle mouse button - or the right Command key if both hands are on the keyboard - and type the first letter of the app’s name.</p>\n<p>Find apps using the first letter, middle letters, acronyms, or similar names.</p>\n<p>If multiple apps share that letter, just keep tapping it to cycle through them.</p>\n<p>You can also press the middle mouse button and start typing the app’s name directly.</p>\n<p>You can also enable an optional App list popup when switching between apps</p>\n<p>Dory works right out of the box - and over time, it learns which apps you use most and prioritizes them.</p>\n<p>No custom letters.</p>\n<p>No extra shortcuts.</p>\n<p>No setup. Nothing to remember.</p>\n<p>It's currently $3.99 - <a href=\"https://apps.apple.com/us/app/dory-app-switcher/id6746273626?mt=12\">App Store</a> (One-time purchase. No subscription.)</p>\n<p>There's a free trial <a href=\"https://smooze.co/Dory/Dory%20-%20Trial.zip\">here</a> (The trial ends after a few hours. Restarting the app will reset the trial)</p>",
            "date_published": "2025-06-07T22:02:44+00:00",
            "authors": [
                {
                    "name": "segevs",
                    "url": "https://www.reddit.com/user/segevs"
                }
            ]
        },
        {
            "id": "1l40i9d",
            "url": "/r/macapps/comments/1l40i9d/pomo_a_minimalist_pomodoro_timer/",
            "external_url": "https://v.redd.it/xqb9uliq945f1",
            "title": "pomo™ - A Minimalist Pomodoro Timer",
            "content_html": "<p>I made this simple minimalist pomodoro timer with design inspired by Dieter Rams &amp; Braun</p>\n<p>There's a 10-day free trial but happy to send 10 promo codes to get it 100% for free for the 10 first people who upvote &amp; comment on here 🙂</p>\n<p><a href=\"https://apps.apple.com/us/app/pomo/id6745888273?mt=12\">See it in the App Store</a></p>",
            "date_published": "2025-06-05T14:24:32+00:00",
            "authors": [
                {
                    "name": "SpaceTraveler611",
                    "url": "https://www.reddit.com/user/SpaceTraveler611"
                }
            ]
        },
        {
            "id": "1l3o6ke",
            "url": "/r/macapps/comments/1l3o6ke/just_launched_haplo_ai_local_private_llms/",
            "external_url": "https://v.redd.it/6d02j21h105f1",
            "title": "Just launched Haplo AI: Local & Private LLMs (Lifetime Pro Giveaway)",
            "content_html": "<p>Hey r/macapps ! 👋</p>\n<p>I built a Mac app (also available for iOS devices) because I wanted a <em>private</em>, <em>offline</em> way to chat with AI models—no cloud processing, no data tracking, no weird permissions.</p>\n<p>So I made <a href=\"https://apps.apple.com/us/app/haplo-ai-local-private-llms/id6746702574\">Haplo AI</a> — an app that lets you download open-source LLMs (like Mistral, Phi, Gemma, etc.) and run them <em>entirely on your Mac</em>. Everything stays on-device. No internet required.</p>\n<p>🧠 Why it’s useful:<br />\n✅ Chat with AI anywhere, even offline<br />\n✅ Choose your model and customize how it responds<br />\n✅ Private, fast, and zero data leaves your phone</p>\n<p>I just launched, and I’m giving away <strong>Lifetime Pro</strong> licenses to anyone who wants to try it. Drop a comment, upvote, and PM me and I’ll send you a code!</p>\n<p>Once I run out of codes, it’s just a one-time $4.99. No subscriptions (because nobody likes subscriptions!).</p>\n<p>Would love any criticism, feedback, questions, or feature ideas!</p>",
            "date_published": "2025-06-05T02:33:20+00:00",
            "authors": [
                {
                    "name": "D1no_nugg3t",
                    "url": "https://www.reddit.com/user/D1no_nugg3t"
                }
            ]
        },
        {
            "id": "1l2hiat",
            "url": "/r/macapps/comments/1l2hiat/collected_some_awesome_opensource_macos_apps_made/",
            "external_url": "https://v.redd.it/2r5xw4fjvq4f1",
            "title": "Collected some awesome open-source macOS apps made with Swift – productivity, utilities, and more!",
            "content_html": "<p>Hey everyone 👋</p>\n<p>I’ve put together a curated list of open-source macOS apps developed with <strong>Swift</strong>. The collection spans productivity tools, utilities, and system enhancements — all open-source, free to explore, and well-crafted.</p>\n<p>👉 <a href=\"https://github.com/jaywcjlove/awesome-swift-macos-apps\">https://github.com/jaywcjlove/awesome-swift-macos-apps</a></p>\n<p>🔧 <strong>For developers</strong>, this list is a goldmine of real-world Swift implementations. You’ll find great examples of macOS-specific UI design, performance optimization, menu bar integration, and more — perfect for learning or improving your skills.</p>\n<p>🧑‍💻 <strong>Not a developer?</strong> No problem! Many of these apps are user-friendly and ready to use. They’re great free tools that can enhance your macOS experience.</p>\n<p>Check it out and feel free to share your favorites or suggest more great open-source Swift apps!</p>",
            "date_published": "2025-06-03T17:11:36+00:00",
            "authors": [
                {
                    "name": "wcjiang",
                    "url": "https://www.reddit.com/user/wcjiang"
                }
            ]
        },
        {
            "id": "1kztuya",
            "url": "/r/macapps/comments/1kztuya/airpods_as_a_posture_coach_on_mac/",
            "external_url": "https://v.redd.it/gr1t11axf34f1",
            "title": "AirPods as a Posture Coach on Mac",
            "content_html": "<p>Hi all,</p>\n<p>I’m building a macOS app that uses your AirPods’ sensors to detect bad posture in real time.</p>\n<p>How it works:</p>\n<ul>\n<li><strong>Real-time tilt tracking</strong> – Your AirPods already have the necessary sensors</li>\n<li><strong>Customizable alerts</strong> – Adjust the sensitivity so it only nudges you when needed</li>\n</ul>\n<p>Would you be interested in using it? It’ll be free and 100% open source.🙏</p>",
            "date_published": "2025-05-31T10:24:40+00:00",
            "authors": [
                {
                    "name": "gh0stsintheshell",
                    "url": "https://www.reddit.com/user/gh0stsintheshell"
                }
            ]
        },
        {
            "id": "1kx0bvo",
            "url": "/r/macapps/comments/1kx0bvo/arc_browser_development_ends/",
            "external_url": "https://www.engadget.com/ai/the-browser-company-stops-active-development-of-arc-in-favor-of-new-ai-focused-product-153045276.html?src=rss",
            "title": "Arc Browser development ends…",
            "content_html": "",
            "date_published": "2025-05-27T22:05:44+00:00",
            "authors": [
                {
                    "name": "Jebus-Xmas",
                    "url": "https://www.reddit.com/user/Jebus-Xmas"
                }
            ]
        },
        {
            "id": "1ksuin2",
            "url": "/r/macapps/comments/1ksuin2/turn_your_screen_selection_into_a_mario_level/",
            "external_url": "https://v.redd.it/yko68f45wc2f1",
            "title": "Turn your screen selection into a Mario level (Nintendo don't sue me pls)",
            "content_html": "<p>I've found this little cool project on the GitHub, originally called Screentendo. All it does is transforming any selection on macOS into a Mario level, which you actually can play. I was pretty excited to try this abandoned gem, but the last update was like 10 years ago, so it doesn't actually work with newer versions of macOS anymore. I've spent some time to port this stuff to support macOS &gt; 14 and make it a bit faster than it was originally. </p>\n<p>Hope it triggers someone's little inner kid as much as it did to me. Here's the repo with the updated version - <a href=\"https://github.com/macos-first/nintendifier\">https://github.com/macos-first/nintendifier</a></p>",
            "date_published": "2025-05-22T16:05:45+00:00",
            "authors": [
                {
                    "name": "sedatedcow420",
                    "url": "https://www.reddit.com/user/sedatedcow420"
                }
            ]
        },
        {
            "id": "1ks80br",
            "url": "/r/macapps/comments/1ks80br/keyclu_see_all_macos_keyboard_shortcuts_quickly/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1ks80br/keyclu_see_all_macos_keyboard_shortcuts_quickly/",
            "title": "KeyClu – See all macOS Keyboard Shortcuts Quickly!",
            "content_html": "<p>If you're like me and have been on the hunt for the ultimate macOS application setup, you might've come across the app \"Cheatsheet\" before which allows seeing many keyboard shortcuts in an overlay window when holding the Command key. Nice as this application is, it hadn't been updated in a while, so I decided to search for alternatives and stumbled across the also-free \"<a href=\"https://github.com/Anze/KeyCluCask/\">KeyClu</a>\", an amazing app I'd consider to be a drop-in replacement with even more functionality! I am not affiliated with the developers whatsoever and only discovered this moments ago, but as of right now, just like how I switched from recommending AppCleaner to PearCleaner, I now say KeyClu is another one of those must-have apps for every Mac user! It offers all the same features and a plethora of more, even some sort of global keyboard shortcuts thing I've not explored yet... absolutely amazing!</p>\n<p><a href=\"https://github.com/Anze/KeyCluCask\">https://github.com/Anze/KeyCluCask</a></p>\n<p><a href=\"https://preview.redd.it/d1olk3mq172f1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=5b6308fcf8827d5fa86e8237b993b432499c173f\">The KeyClu default UI. Such an underrated app.</a></p>",
            "date_published": "2025-05-21T20:19:52+00:00",
            "authors": [
                {
                    "name": "Foreign_Eye4052",
                    "url": "https://www.reddit.com/user/Foreign_Eye4052"
                }
            ]
        },
        {
            "id": "1kmihf5",
            "url": "/r/macapps/comments/1kmihf5/i_built_an_app_that_transforms_any_content_with/",
            "external_url": "https://v.redd.it/114ndil8mr0f1",
            "title": "I built an app that transforms any content with GPU shaders in real-time",
            "content_html": "<p>I'm excited to share <strong>Yume</strong>, a macOS app I've been working on that lets you apply GPU shaders to virtually anything on your screen:</p>\n<h1>What it does:</h1>\n<ul>\n<li>Transform videos, camera feeds, and even other apps in real-time</li>\n<li>Apply 2000+ RetroArch shader presets (CRT simulation, upscaling, VHS effects, etc.)</li>\n<li>Use \"glass mode\" as a floating overlay on your desktop</li>\n<li>Clone input from app windows, media files, or external cameras</li>\n</ul>\n<h1>Some cool use cases:</h1>\n<ul>\n<li>Make your Zoom calls look like they're coming from a 90s VHS tape</li>\n<li>Play modern games with authentic retro CRT scanlines</li>\n<li>Add professional-grade visual effects to your streams</li>\n<li>Create unique visual aesthetics for creative projects</li>\n</ul>\n<p>Everything happens in real-time with minimal performance impact. It's designed to be both powerful for technical users but accessible enough for anyone to create <a href=\"https://customer-79ujtta5lvd442do.cloudflarestream.com/285cbbc90a3b257779841520ad739214/watch\">amazing visuals</a> quickly.</p>\n<h1>Roadmap &amp; Feedback</h1>\n<p>I have some <a href=\"https://yume.sh/roadmap/\">big features planned</a>, but I'd love to hear what YOU would want to see. Early adopters from this community will help shape where Yume goes next!</p>\n<p><strong>Looking to try it?</strong> Download it here: <a href=\"https://yume.sh\">yume.sh</a></p>\n<p><strong>Want a chance at a free lifetime key?</strong> Just upvote and share your thoughts in the comments!</p>\n<p>Let me know what you think or if you have any questions!</p>",
            "date_published": "2025-05-14T15:45:10+00:00",
            "authors": [
                {
                    "name": "AndrewMD5",
                    "url": "https://www.reddit.com/user/AndrewMD5"
                }
            ]
        },
        {
            "id": "1klkzwj",
            "url": "/r/macapps/comments/1klkzwj/i_copied_apple_to_create_my_free_app_and_then/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1klkzwj/i_copied_apple_to_create_my_free_app_and_then/",
            "title": "I copied Apple to create my free app, and then Apple copied me. And I'm proud of myself.",
            "content_html": "<p>Earlier this year, I released <a href=\"https://github.com/Lospi/MacMotionCues\">Mac Motion Cues</a>, a copy of iOS Vehicle Motion Cues, but for Mac, using your AirPods' accelerometer to calculate the motion dots.</p>\n<p>Today, Apple announced the same feature that my app does: <a href=\"https://www.apple.com/newsroom/2025/05/apple-unveils-powerful-accessibility-features-coming-later-this-year/\">Vehicle Motion Cues are coming to macOS 16.</a> In the end, I copied them, and they copied me. But what matters is that we, the users, are winning in the situation.</p>\n<p>For those that used my app, I'm proud that I helped you make a better use of your Macs. But with the native solution, I'll be deprecating my app. Hope everyone made a great use of it.</p>\n<p>It will still be available for download for those who want to use my version, of course :)</p>",
            "date_published": "2025-05-13T12:45:02+00:00",
            "authors": [
                {
                    "name": "Lospi",
                    "url": "https://www.reddit.com/user/Lospi"
                }
            ]
        },
        {
            "id": "1kj7vtq",
            "url": "/r/macapps/comments/1kj7vtq/pixelmator_version_history_beforeafter_apples/",
            "external_url": "https://i.redd.it/g2xngi2kuxze1.jpeg",
            "title": "Pixelmator Version History before/after Apple's acquisition",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/g2xngi2kuxze1.jpeg\" />",
            "date_published": "2025-05-10T11:16:50+00:00",
            "authors": [
                {
                    "name": "NotRenton",
                    "url": "https://www.reddit.com/user/NotRenton"
                }
            ]
        },
        {
            "id": "1kf2101",
            "url": "/r/macapps/comments/1kf2101/title_my_top_mac_apps_that_actually_made_a/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1kf2101/title_my_top_mac_apps_that_actually_made_a/",
            "title": "Title: My Top Mac Apps That Actually Made a Difference in 2025",
            "content_html": "<p>This isn’t one of those posts with 50 apps you’ll never download. These are the 9 Mac tools that actually stuck around and became essential to how I work every day.</p>\n<ul>\n<li>\n<p>SoundSource: Separates volume control by app. I can crank up Zoom while keeping Spotify in the background.</p>\n</li>\n<li>\n<p>WillowVoice: I use this for everything from replying to emails to outlining ideas for projects. It’s way faster than typing and surprisingly accurate even with background noise.</p>\n</li>\n<li>\n<p>Raycast: Replaces Spotlight with smarter commands and clipboard history. I didn’t know how much I needed it until I started using it.</p>\n</li>\n<li>\n<p>FocusFrame: Great for reducing distractions. It literally dims all other windows except the one you’re working in.</p>\n</li>\n<li>\n<p>DropOver: Drag-and-drop file holder. If you’re working with screenshots, PDFs, or folders, this will save your life.</p>\n</li>\n<li>\n<p>PearCleaner: Cleans up junk and removes apps thoroughly.</p>\n</li>\n<li>\n<p>Stats: Menu bar system monitor that doesn’t feel bloated.</p>\n</li>\n<li>\n<p>BatFi: Limits battery charging to 80%, which helped extend battery health significantly.</p>\n</li>\n<li>\n<p>MindNode: Best visual mind mapping tool I’ve found so far.</p>\n</li>\n</ul>\n<p>If I had to keep only three, it would be WillowVoice, Raycast, and FocusFrame. What are your daily drivers?</p>",
            "date_published": "2025-05-05T03:25:37+00:00",
            "authors": [
                {
                    "name": "WaltzGold4201",
                    "url": "https://www.reddit.com/user/WaltzGold4201"
                }
            ]
        },
        {
            "id": "1kcs73f",
            "url": "/r/macapps/comments/1kcs73f/rip_macupdater_01012026/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1kcs73f/rip_macupdater_01012026/",
            "title": "RIP MacUpdater 01.01.2026 😭",
            "content_html": "<p>It's now confirmed. One of the top 10 apps on MacOS is shutting down in 2026. Devastating news!  I wish they had charged $1 a month or $10 a year sub. I would've subscribed easily for the amount of time this app saves me.</p>\n<p>https://www.corecode.io/macupdater/</p>\n<blockquote>\n<p>As promised, all MacUpdater 3 licenses will be supported until 2026-01-01.\nAfter that date we will no longer continue to develop or support MacUpdater\nbut we hope to find some other company to continue the product or its technology:</p>\n</blockquote>\n<p>Similar thing happened with Windows (SUMo) and there's been no replacement other than using softpedia to get RSS updates for updated software. Unfortunately they don't support Mac apps, so we're screwed.</p>\n<p>Latest is the only alternative I know of, but it misses so many.</p>",
            "date_published": "2025-05-02T04:12:48+00:00",
            "authors": [
                {
                    "name": "IwuvNikoNiko",
                    "url": "https://www.reddit.com/user/IwuvNikoNiko"
                }
            ]
        },
        {
            "id": "1kaki3z",
            "url": "/r/macapps/comments/1kaki3z/switched_back_to_mac_my_list_of_the_best_apps_ive/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1kaki3z/switched_back_to_mac_my_list_of_the_best_apps_ive/",
            "title": "Switched back to Mac. My list of the best apps I've found.",
            "content_html": "<p><strong>Utilities/Tools:</strong></p>\n<ul>\n<li>AppCleaner (free, website), deletes leftover files from uninstalled apps.</li>\n<li>GrandPerspective (free, website), disk space visualizer (similar to windirstat)</li>\n<li>Keka (free, website), archiver and extractor (similar to 7zip)</li>\n<li>CotEditor (free, appstore), text editor (very similar to notepad++)</li>\n<li>belanaEtcher (free, website), ISO to USB tool</li>\n<li>Amphetamine (free, app store), prevents system from sleeping</li>\n<li>Cyberduck (free, website), FTP/Cloud storage client (similar to filezilla)</li>\n<li>Transmission (free, website), ptp client</li>\n<li>Welly (free, app store), ssh/telnet client (similar to putty, extra options for BBS/MUDs)</li>\n<li>EasyFind (free, website), file searcher (similar to everything)</li>\n<li>CopyClip (free, appstore), clipboard history in menu bar</li>\n<li>Burn (free, website), disc burner (data,audio,video, menu creator)</li>\n<li>UTM (free, website), virtual machine client, supports x86 on Apple Silicon</li>\n<li>Google Earth Pro (free, website), google earth on desktop</li>\n<li>Unsplash wallpapers (free, appstore), wallpaper app</li>\n<li>AmorphusDiskMark (free, appstore), disk speed test (very similar to CrystalDiskMark)</li>\n<li>Network Utility (free, website), advanced network info and tests</li>\n<li>Speedtest by Ookla (free, appstore), desktop internet speedtest (more accurate than web browser)</li>\n</ul>\n<p><strong>Media:</strong></p>\n<ul>\n<li>VLC (free, website), audio/video player with support for all formats</li>\n<li>Modizer ($2, appstore, iOS app on mac), tracker/mod/game/chiptune music player with visualizations</li>\n</ul>\n<p><strong>Emulators/Gaming Tools:</strong></p>\n<ul>\n<li>OpenEmu (free, website), zero config multisystem emulator (retroarch front end)</li>\n<li>DOSBox Staging (free, website), dos emulator (much more updated than original DOSBox)</li>\n<li>Frotz (free, appstore, iOS app on mac), text adventure game emulator (many preinstalled games like Zork,etc)</li>\n<li>MacOS 9 for macOS (free, website), full MacOS 9 emulator, runs powerpc apps</li>\n<li>Greenlight (free, website), xbox in home streaming and xbox cloud gaming client</li>\n<li>ATLauncher (free, website), minecraft launcher with one click install for many popular new and classic mod packs</li>\n<li>Mighty Dice (free, appstore, iOS app on mac), very nice looking 3d dice rolling app</li>\n<li>The usual gaming clients (steam, battle.net, gog galaxy)</li>\n</ul>\n<p><strong>Photo/Video/Audio Editing/Converting/Downloading:</strong></p>\n<ul>\n<li>Audacity (free, website), audio editor/recorder</li>\n<li>freeac (free, website), audio file converter, cd ripper</li>\n<li>XnViewMP (free, website), advanced image viewer with basic editing and converting</li>\n<li>XnConvert (free, website), image file converter</li>\n<li>XnResize (free, website), image file resizer</li>\n<li>MakeMKV (free, website), DVD ripper (supports encrypted dvds)</li>\n<li>Handbrake (free, website), Video converter/encoder</li>\n<li>Pinta (free, website), paint app and editor (very similar to paint.net)</li>\n<li>GIMP (free, website), advanced image editor</li>\n<li>Krita (free, website), advanced paint/drawing app</li>\n<li>Inkscape (free, website), advanced vector editor/viewer (SVG)</li>\n<li>Stacher7 (free, website), youtube (and many other sites) video/audio downloader)</li>\n</ul>\n<p><strong>Office/Productivity:</strong></p>\n<ul>\n<li>OnlyOffice (free, website), office app, very good compatibility with MS office</li>\n<li>PDFGear (free, appstore), pdf viewer/annotator/editor (100% free, no ads)</li>\n<li>Edison Mail (free, appstore), very good email client with push support for google</li>\n<li>ChatGPT desktop (free, website), desktop client for chatgpt, integrates into system</li>\n<li>WolframAlpha Classic ($2, appstore, iOS app on mac), reference tool, encyclopedia, math solver, many more</li>\n</ul>",
            "date_published": "2025-04-29T10:19:49+00:00",
            "authors": [
                {
                    "name": "drvox1600",
                    "url": "https://www.reddit.com/user/drvox1600"
                }
            ]
        },
        {
            "id": "1k9sidr",
            "url": "/r/macapps/comments/1k9sidr/i_got_tired_of_finance_apps_stealing_my_data_so_i/",
            "external_url": "https://i.redd.it/pgap8d351kxe1.png",
            "title": "I got tired of finance apps stealing my data, so I built my own. No logins. No ads. No tracking. Just peace of mind.",
            "content_html": "<p>Hi everyone,</p>\n<p>Every finance app I tried either wanted me to hand over my login details, spam me with ads, or lock basic features behind a subscription.</p>\n<p>At some point, I thought... why does managing my own money mean giving up my privacy?</p>\n<p>So I built something just for myself: MoneyTool — a privacy-first, fully offline finance tracker.</p>\n<ul>\n<li>Track expenses, income, savings, investments, debts — all in one simple app.</li>\n<li>No logins, no syncing, no ads. Your data stays 100% on your device.</li>\n<li>Minimalist design — clean dashboards, no clutter, no overwhelm.</li>\n</ul>\n<p>It works on iPhone, iPad, and Mac (although Mac/iPad visuals still have a bit of polishing left &gt;&gt; work in progress!).</p>\n<p>I made this because I wanted to own my financial data again, not trade it away for convenience.</p>\n<p>Would love your thoughts:</p>\n<ul>\n<li>What do you hate most about finance apps today?</li>\n<li>How much do you care about privacy when it comes to your money?</li>\n</ul>\n<p>Here’s a screenshot of how it looks: (attach screenshot here)</p>\n<p>If you want to try it out: <a href=\"https://themoneytool.com/download\">themoneytool.com/download</a></p>\n<p>Thanks so much for reading! Would love to hear your feedback or feature ideas!</p><div><br></div><img src=\"https://i.redd.it/pgap8d351kxe1.png\" />",
            "date_published": "2025-04-28T10:46:08+00:00",
            "authors": [
                {
                    "name": "nosleepfounder",
                    "url": "https://www.reddit.com/user/nosleepfounder"
                }
            ]
        },
        {
            "id": "1k7j57g",
            "url": "/r/macapps/comments/1k7j57g/sidebar_the_modern_dock_replacement_for_macos/",
            "external_url": "https://i.redd.it/yrds8qjczywe1.png",
            "title": "Sidebar the modern Dock replacement for macOS - Major update",
            "content_html": "<p>Hi everyone,</p>\n<p><strong>I just wanted to share that Sidebar just got a major update to version 1.8.0</strong>. Sidebar is the modern and most customizable Dock replacement for macOS out there. In general, it makes the space that the Dock would occupy a lot more useful.</p>\n<p>Since my last post here, some <strong>cool new features have been added</strong>, such as:</p>\n<ul>\n<li>Sidebar now offers a customization mode that combines all context specific options in one completely overhauled user interface, allowing you to easily customize various settings</li>\n<li>Application previews have been redesigned and in addition to the classic miniature application preview windows now also offers a list view for more cozy overview</li>\n<li>Two new ways of displaying running applications have been added, called \"Highlight\". Using this running indicator, Sidebar will show a highlighted area around running applications, with optionally the window count next to the icon</li>\n<li>Sidebar now offers a built-in functionality to either move all application windows, or those of a specific application to a specific screen</li>\n<li>Multimedia support has been enhanced to deal with new restrictions introduced by Apple starting with macOS 14.5. Starting with this update you can control Spotify and Apple Music again, even when running macOS 14.5+</li>\n<li>And of course a lot of other small improvements, performance improvements and bug fixes</li>\n</ul>\n<p>For a full list of features added and bugs fixed, have a look at the roadmap at the <a href=\"https://sidebarapp.net/changelog/\">Full Changelog</a> If you want to see more screenshots of the app and a comprehensive overview of all features, please visit <a href=\"https://sidebarapp.net/\">https://sidebarapp.net</a></p>\n<p>As usual, I've reset all prior trial licenses, so you can try Sidebar again, even if you tested it before.</p>\n<p>I’m happy to support you with any questions, problems, bug reports, feature requests etc. :)</p><div><br></div><img src=\"https://i.redd.it/yrds8qjczywe1.png\" />",
            "date_published": "2025-04-25T11:59:29+00:00",
            "authors": [
                {
                    "name": "empty23_",
                    "url": "https://www.reddit.com/user/empty23_"
                }
            ]
        },
        {
            "id": "1k73ed8",
            "url": "/r/macapps/comments/1k73ed8/wblock_v02_is_finally_released_lightweight_native/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1k73ed8/wblock_v02_is_finally_released_lightweight_native/",
            "title": "wBlock v0.2 is (finally) released -- lightweight, native, free, and open-source Safari ad blocker",
            "content_html": "<p>Hey everyone,</p>\n<p>I’m excited to share a huge update for <strong>wBlock</strong>, the <strong>free and open-source</strong> ad blocker for Safari I’ve been building!</p>\n<p><a href=\"https://preview.redd.it/bip3y3j7luwe1.png?width=986&amp;format=png&amp;auto=webp&amp;s=2e6f914612b11feeee3aad5ebf543122194b605a\">The homepage</a></p>\n<p>Over the past several months, I’ve been hard at work (and reading every bit of your feedback here and on GitHub) to make wBlock faster, more powerful, and way easier to use. This update is honestly the one I’m most proud of, so here’s what’s new and improved:</p>\n<ul>\n<li><strong>Keyboard Shortcuts + Cheat Sheet:</strong> You can now navigate and control wBlock with fast hotkeys. There’s even an in-app cheat sheet—your fingers never need to leave the keyboard.</li>\n<li><strong>Custom Filter Lists:</strong> Add, manage, and toggle any ad-blocking list you want—besides the built-in ones. Imported lists? No problem. Sidebar toggle bugs and filter duplication are fixed too.</li>\n<li><strong>Epic Speed Boost (No More Lag!):</strong> The UI is dramatically faster. All the sluggishness, animation lag, and slow filter updates are gone—background processing everywhere.</li>\n<li><strong>(Almost) Bulletproof YouTube Ad-Blocking:</strong> Ad scripts now inject <em>earlier</em> for much better blocking. Enjoy cleaner YouTube (including the homepage and while watching videos). Note that some users still have issues when visiting a YouTube video by pasting a link; YouTube is becoming really annoying when it comes to ads and I'll need some extra time to figure this out.</li>\n<li><strong>No More Annoying Permission Popups:</strong> You won’t be bugged for data access every launch anymore! All that background permission nagging is fixed for good.</li>\n<li><strong>Built-in Language &amp; Custom Filters:</strong> Chinese, Spanish, Portuguese, and many international filters now work flawlessly. Got issues with AdGuard lists before? They’re all fixed.</li>\n<li><strong>See What You’re Blocking:</strong> Filter lists now show the real number of rules, and you can click to go right to the homepage/source.</li>\n<li><strong>Download Progress for Filter Updates:</strong> Never wonder “is it hung?” again—there’s now a live progress bar while updating filters.</li>\n<li><strong>Cleaner, Simpler Interface:</strong> The sidebar is gone, popups are more intuitive, and, finally, every log window and popup can be closed.</li>\n</ul>\n<p>There are ton of smaller bug fixes and UX tweaks too, from “refresh all filters” to improved default settings and support for more macOS versions. The menu, tooltips, and every page should feel easier and friendlier!</p>\n<p><strong>🙏 Thank you to everyone on Reddit and GitHub who’s reported bugs, shared ideas, and encouraged me along the way.</strong> Your support and feedback have shaped every part of this project and made wBlock what it is today! This truly is built <em>for</em> the community, <em>by</em> the community.</p>\n<p>If you haven’t tried wBlock yet, or you gave up on ad-blockers that “almost” worked—give it a go! And if you enjoy it, please star the repo, open suggestions, or just spread the word.</p>\n<p>You can <a href=\"https://github.com/0xCUB3/wBlock\">check out the GitHub</a> or <a href=\"https://testflight.apple.com/join/DFGenhRn\">download it now using TestFlight</a>.</p>\n<p><em>(P.S Massive thanks again to everyone who gave honest feedback, feature ideas, or just a kind word along the way. You guys really keep me going :) )</em></p>",
            "date_published": "2025-04-24T21:04:46+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1k68wre",
            "url": "/r/macapps/comments/1k68wre/i_made_a_completely_free_mac_app_for_creating/",
            "external_url": "https://v.redd.it/kcfyx7n8zmwe1",
            "title": "I made a completely free Mac app for creating customizable countdown timer overlays",
            "content_html": "<p>Hey r/macapps,</p>\n<p>I've been working on a macOS app called <strong>Countdown Timer Pro</strong> for a while, and I’m excited to finally share the first version with you all!</p>\n<p><strong>What is it?</strong> <br />\nIt's an app that lets you create highly customizable timer overlays with a simple click-and-drag from your menu bar. Perfect for everything from quick cooking reminders to tracking long-term project deadlines visually, right on your screen.</p>\n<p><strong>Why did I build it?</strong> <br />\nI originally wanted a timer that was always visible on my screen, but didn't constantly block me from clicking on windows underneath it. That led to the \"pass-through\" feature, and from there, I kept finding new things I wanted to add, resulting in the app you see today.</p>\n<p>I’m releasing it <strong>completely free</strong> on the App Store (no ads, no IAPs, no catches) to keep it accessible for anyone who might find it useful.</p>\n<p><strong>Here's what it can do (Key features):</strong></p>\n<ul>\n<li><strong>Super Easy Creation:</strong> Click the menu bar icon and drag – the farther you drag, the longer the timer.</li>\n<li><strong>Click-Through Timers (Pass-Through Mode):</strong> Timers fade slightly on hover, letting you click <em>right through</em> them to interact with content underneath.</li>\n<li><strong>On-Overlay Controls:</strong> Quickly resize, move, add/subtract time, pause, open the manager, or close the timer directly on the overlay itself.</li>\n<li><strong>Deep Appearance Customization:</strong> Fonts, backgrounds, colors, gradients, opacity, progress ring styles – make it look <em>exactly</em> how you want. Save your favorite color themes, too.</li>\n<li><strong>Default Timer Settings:</strong> Define your preferred style and behavior once, and all new timers will use those settings automatically.</li>\n<li><strong>Flexible Time Display:</strong> Show units from seconds up to years. Timers can auto-switch units (e.g., minutes to seconds when under 60s), and you can optionally display remaining time as a percentage.</li>\n<li><strong>Recurring Timers:</strong> Set timers to repeat daily, weekly, or at custom intervals.</li>\n<li><strong>Custom End Notifications:</strong> Create unique notifications for when specific timers complete.</li>\n<li><strong>Visible Across Spaces:</strong> Timers stay visible even when you switch between Spaces.</li>\n<li><strong>Countdown Manager:</strong> A central window to view, edit, and manage all your timers.</li>\n<li><strong>Window Behavior:</strong> Control whether timers float above everything, act like standard windows, or ignore screen boundaries.</li>\n<li><strong>And More:</strong> Includes keyboard shortcuts, options to hide timers until they start, reverse progress bar direction, and other useful features.</li>\n</ul>\n<p><strong>What's Next &amp; Feedback:</strong> <br />\nThis is just v1.0! I have a list of features and optimizations I'd love to add, especially if there's interest from the community.</p>\n<p>Please check it out! I'd love to hear what you think. Let me know about any bugs you find or features you'd like to see added.</p>\n<p><strong>Download link:</strong> <a href=\"https://apps.apple.com/us/app/countdown-timer-pro/id6744842468\">https://apps.apple.com/us/app/countdown-timer-pro/id6744842468</a></p>\n<p><strong>TL;DR:</strong> Made a free Mac app to create highly customizable, click-through countdown timer overlays. Drag to create. Lots of features. No ads, no IAPs.</p>",
            "date_published": "2025-04-23T20:04:46+00:00",
            "authors": [
                {
                    "name": "nicobakke",
                    "url": "https://www.reddit.com/user/nicobakke"
                }
            ]
        },
        {
            "id": "1k2isa8",
            "url": "/r/macapps/comments/1k2isa8/sniffnet_free_open_source_similar_to_little_snitch/",
            "external_url": "https://i.redd.it/nve8znbihove1.png",
            "title": "Sniffnet (Free & Open Source) similar to Little Snitch",
            "content_html": "<p>Came across this app the other day, thought I'd share it with all y'all. <a href=\"https://sniffnet.net\">Sniffnet</a> is an open-source to monitor your network traffic. It allows you to set filters to apply to the observed traffic, views overall statistics, set custom notifications, and more.</p><div><br></div><img src=\"https://i.redd.it/nve8znbihove1.png\" />",
            "date_published": "2025-04-18T23:32:14+00:00",
            "authors": [
                {
                    "name": "FrediWest",
                    "url": "https://www.reddit.com/user/FrediWest"
                }
            ]
        },
        {
            "id": "1jsvxkr",
            "url": "/r/macapps/comments/1jsvxkr/what_are_the_best_mac_apps_for_translucency_lovers/",
            "external_url": "https://www.reddit.com/gallery/1jsvxkr",
            "title": "What are the best Mac apps for translucency lovers?",
            "content_html": "<p>It's a real question btw, I haven't found other apps that get fully translucent(and not just within their lateral bar.</p>\n<p>In order: Obsidian(Free), Warp(Free), Safari(Paid), CotEditor(Free) </p>",
            "date_published": "2025-04-06T14:54:21+00:00",
            "authors": [
                {
                    "name": "Powerful_Ad725",
                    "url": "https://www.reddit.com/user/Powerful_Ad725"
                }
            ]
        },
        {
            "id": "1joqgne",
            "url": "/r/macapps/comments/1joqgne/we_get_taken_over/",
            "external_url": "https://i.redd.it/n21q4dshm6se1.jpeg",
            "title": "We get taken over?",
            "content_html": "<div><br></div><img src=\"https://i.redd.it/n21q4dshm6se1.jpeg\" />",
            "date_published": "2025-04-01T08:14:04+00:00",
            "authors": [
                {
                    "name": "jakecoolguy",
                    "url": "https://www.reddit.com/user/jakecoolguy"
                }
            ]
        },
        {
            "id": "1jnsp3n",
            "url": "/r/macapps/comments/1jnsp3n/antinote_113_dropdown_mode_v_ocr_autopaste/",
            "external_url": "https://v.redd.it/rbq6gxykawre1",
            "title": "Antinote 1.1.3 - Dropdown mode. ⌘V OCR. AutoPaste. Raycast and Alfred extensions. Translucency. 8 new themes.",
            "content_html": "<p>Hi! Johnson (dev) here! Excited to share some of these new features with the community.</p>\n<p><strong>Dropdown mode (Traditional menu mode)</strong> - Antinote can now live permanently in your menu bar, dropping down when needed. It will show over full-screen apps and also on all desktops. You can change how big you want Antinote to be in settings.</p>\n<p><strong>Cmd-V OCR</strong> - Any image you drag (and now paste) into Antinote will get automatically OCR'd into plain text. Perfect for catching things during screen-shares or hard-to-copy data tables.</p>\n<p><strong>AutoPaste</strong> - Type \"paste\" and Antinote will listen to your clipboard. Anything you put in the clipboard will be automatically pasted in the note. Change the delimiter to anything you like. Great to skip the tedious cmd-tab / cmd+v part of these quick workflows.</p>\n<p><strong>Raycast / Alfred Extensions -</strong> Thanks to <a href=\"https://github.com/sc0\">PanKacper</a>, we are now <a href=\"https://www.raycast.com/sc0/antinote\">officially in the Raycast Store</a>, and also have an <a href=\"https://github.com/sc0/antinote-alfred-workflow/tree/main\">Alfred Extension</a>. These will let you create notes (blank or with content), pin/unpin, and search your notes directly from your favourite super-app.</p>\n<p><strong>Translucency -</strong> (macOS 15+) - Make the background translucent with Apple's materials and change the opacity of the effect to blend it with your favourite theme.</p>\n<p><strong>8 new themes</strong> -  Piccolo, A24, Tartan, Agrabah, Maud'Dib, Knight, Sanrio, Shadow Moses. Not sure how many of you will get the references, but each is inspired by something from my childhood.</p>\n<p>Every single one of these were suggestions from the community. Please <a href=\"https://discord.gg/2SKQbJM9Mz\">join us on Discord.</a> </p>\n<p>Also - I wanted to shout out this YouTube channel (AppsNTips) for making the first Antinote video out in the wild: <a href=\"https://www.youtube.com/watch?v=kQKGOPgOiuI\">https://www.youtube.com/watch?v=kQKGOPgOiuI</a></p>\n<p><strong>Try it out here:</strong></p>\n<h1><a href=\"https://antinote.io\">Antinote.io</a></h1>\n<p>7 day free trial</p>\n<p><strong>$5 one-time.</strong> Forever updates.</p>",
            "date_published": "2025-03-31T02:06:50+00:00",
            "authors": [
                {
                    "name": "johnsonjohnson",
                    "url": "https://www.reddit.com/user/johnsonjohnson"
                }
            ]
        },
        {
            "id": "1jlhu3w",
            "url": "/r/macapps/comments/1jlhu3w/quit_my_job_a_year_ago_to_build_a_notetaking_app/",
            "external_url": "https://www.reddit.com/gallery/1jlhu3w",
            "title": "Quit my job a year ago to build a note-taking app",
            "content_html": "<p><strong>*Before we start:</strong> The app isn’t fully optimized for Mac (support M chip series only) yet, but I'm considering dedicating more time to enhancing its Mac functionalities. Would you be interested in a version with more tailored features for Mac? Your feedback would really help guide my efforts.  </p>\n<p>I used to work as an iOS developer in a well-paying job, but I always had the urge to build something of my own rather than work on other people’s ideas. Since I'm still young, I figured this was the perfect time to take the leap, quit my job, and give it a real shot.</p>\n<p>I've always been passionate about note-taking, so I decided to build one myself. I know the market is crowded, but I wanted to create something with features that stand out—and make it <strong><em>completely free</em></strong> to use.</p>\n<p>The app, <em>Notedrafts</em>, supports three different types of notes:</p>\n<ul>\n<li>PDF/Notebook-style notes</li>\n<li>Infinite Canvas (similar to Apple Freeform)</li>\n<li>Vertical Notes (like the Apple Notes app)</li>\n</ul>\n<p>On top of that, you can fully customize templates to suit your workflow. Notedrafts offers planners, habit trackers, and more—and you can tweak them however you like, from changing dates to adjusting the number of habits you want to track.</p>\n<p>It's available on the App Store. It was mainly build for the iPad and Apple Pencil but you can also use it on your iPhone and draw with your finger: <a href=\"https://apps.apple.com/app/id6743032079\">Notedrafts on App Store</a></p>",
            "date_published": "2025-03-28T00:01:55+00:00",
            "authors": [
                {
                    "name": "Ok_Photograph2604",
                    "url": "https://www.reddit.com/user/Ok_Photograph2604"
                }
            ]
        },
        {
            "id": "1jdss99",
            "url": "/r/macapps/comments/1jdss99/just_launched_markdown2pdf_markdown_converter/",
            "external_url": "https://v.redd.it/2mikb4ugmape1",
            "title": "Just launched Markdown2PDF: Markdown Converter (Lifetime Pro Giveaway)",
            "content_html": "<p>Hey r/macapps!</p>\n<p>I built a Mac app because I got tired of copying LLM responses into Word or Pages, only to have the formatting turn into absolute chaos (random spacing, weird font sizes, bullet points that look like they’ve been through a blender).</p>\n<p>So I made <a href=\"https://apps.apple.com/us/app/markdown2pdf-convert-markdown/id6743325583?mt=12\">Markdown2PDF</a>, a super simple, clean app that takes your markdown (from ChatGPT, Claude, Gemini, whatever you use) and turns it into a properly formatted PDF—<strong>no headaches.</strong> Just copy, paste, and export.</p>\n<p>🚀 <strong>Why I think it’s useful:</strong><br />\n✅ Perfectly formatted PDFs every time<br />\n✅ No more weird copy/paste issues<br />\n✅ Works with any markdown source</p>\n<p>I just launched, so I’m <strong>giving away Lifetime Pro licenses</strong> to folks who want to check it out. <strong>PM me or drop a comment and I’ll send you a code.</strong> Would love to get your thoughts!</p>\n<p>Cheers!</p>",
            "date_published": "2025-03-18T00:46:05+00:00",
            "authors": [
                {
                    "name": "D1no_nugg3t",
                    "url": "https://www.reddit.com/user/D1no_nugg3t"
                }
            ]
        },
        {
            "id": "1jc08n1",
            "url": "/r/macapps/comments/1jc08n1/clipyboard_is_lifetime_free_for_the_next_24_hours/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1jc08n1/clipyboard_is_lifetime_free_for_the_next_24_hours/",
            "title": "🚀 ClipyBoard is Lifetime Free for the Next 24 Hours! 🎉",
            "content_html": "<p>Hey everyone! </p>\n<p>I'm Gohary, the developer behind <strong>ClipyBoard</strong>, the ultimate autopaste keyboard app that’s here to revolutionize your typing experience. For the next <strong>24 hours</strong>, I’m making the app <strong>100% free!</strong> 🚀</p>\n<p>🔥 What Makes ClipyBoard Special?</p>\n<p>✅ Copy &amp; organize text &amp; images easily</p>\n<p>✅ Extract text from images (OCR-powered magic 🪄)</p>\n<p>✅ Create shortcuts for your most-used clips and recall them instantly</p>\n<p>✅ Lightning-fast search to find your saved clips in seconds</p>\n<p>No more endless copy-pasting or searching for the same text over and over again. With <strong>ClipyBoard</strong>, your favorite clips are just a shortcut away!</p>\n<p>We’d love to hear your feedback and suggestions! Drop any questions or comments below, and I’ll check in regularly to respond.</p>\n<p>If you find them useful, I’d love to hear your thoughts! Also, if you enjoy the apps, a review would mean the world to me. ❤️</p>\n<p>How to claim your free upgrade:</p>\n<p>Download ClipyBoard: <a href=\"https://apps.apple.com/app/id6738871678\">https://apps.apple.com/app/id6738871678</a></p>\n<p>Open the app and head to Settings.</p>\n<p>Tap on Redeem Code and enter this code: “gh45334k434343n”. this code only work for next 24 hours , after that you can get the app lifetime discount with 75% off using this code \"gh343443b422332n3\"</p>\n<p>⏳ This offer is only available for the next 24 hours, so grab it while you can!</p>\n<p>Thank you for your support, and happy  Typing!</p>\n<p>Cheers, Gohary</p>\n<p>➡️ Simply comment and upvote and share it with your friends 🧡</p>",
            "date_published": "2025-03-15T17:25:15+00:00",
            "authors": [
                {
                    "name": "Goharyiii",
                    "url": "https://www.reddit.com/user/Goharyiii"
                }
            ]
        },
        {
            "id": "1j9ez7q",
            "url": "/r/macapps/comments/1j9ez7q/i_build_a_small_menu_bar_app_that_nudges_you_back/",
            "external_url": "https://v.redd.it/gvzupts1t7oe1",
            "title": "I build a small menu bar app that nudges you back into focus - launching today",
            "content_html": "",
            "date_published": "2025-03-12T07:56:58+00:00",
            "authors": [
                {
                    "name": "ranft",
                    "url": "https://www.reddit.com/user/ranft"
                }
            ]
        },
        {
            "id": "1j58kan",
            "url": "/r/macapps/comments/1j58kan/we_just_launched_canvid_for_mac_celebrating_with/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1j58kan/we_just_launched_canvid_for_mac_celebrating_with/",
            "title": "We just launched Canvid for Mac! Celebrating with 50 free lifetime licenses!",
            "content_html": "<p>Hey everyone! After about a year as a Windows-only app, I'm excited to announce that we've just released the Mac version of <strong>Canvid</strong>, our screen recorder! 🎉</p>\n<p>https://reddit.com/link/1j58kan/video/xp8e5o6re5ne1/player</p>\n<p>To celebrate, I'm giving away a <strong>lifetime license</strong> to the first 50 people who comment.</p>\n<p>Want to see where Canvid is headed? Check out our <a href=\"https://www.canvid.com/roadmap\">roadmap</a> and this recent <a href=\"https://www.youtube.com/watch?v=Ubz--K2YlLk\">video from BETT UK 2025</a>.</p>\n<p>If you have any questions, feel free to ask here or join our Discord: <a href=\"https://discord.gg/EzrSs5zR\">https://discord.gg/EzrSs5zR</a>.</p>",
            "date_published": "2025-03-06T22:51:06+00:00",
            "authors": [
                {
                    "name": "7107Labs",
                    "url": "https://www.reddit.com/user/7107Labs"
                }
            ]
        },
        {
            "id": "1j46m9d",
            "url": "/r/macapps/comments/1j46m9d/just_launched_atten_app_website_blocker_for_mac/",
            "external_url": "https://i.redd.it/ascvq2izawme1.jpeg",
            "title": "Just launched Atten - App & Website Blocker for Mac & iOS. (Lifetime Pro Giveaway)",
            "content_html": "<p>Hey r/macapps! 👋</p>\n<p>I'm an indie developer, and I'm super excited to announce that Atten, my app and website blocker, is finally available on macOS! 🎉</p>\n<p>Atten helps you focus by blocking distracting apps and websites. The best part? It seamlessly syncs your blocking sessions between your iPhone, iPad, and now your Mac. Start a focus session on one device, and it's active on all of them!</p>\n<p>To celebrate the Mac launch, I'm doing two things:</p>\n<ul>\n<li>The Mac app is currently FREE to download!</li>\n<li>I'm giving away Lifetime Pro codes for the mobile app (iOS)! These codes unlock all premium features forever.</li>\n</ul>\n<p>If you'd like a Lifetime Pro code for the iOS app, upvote and leave a comment below, and I'll DM you one! (While supplies last, of course!).</p>\n<p>You can find the Mac app (and iOS app) here: www.atten.app</p>\n<p>Would love to hear your feedback on the Mac version!</p><div><br></div><img src=\"https://i.redd.it/ascvq2izawme1.jpeg\" />",
            "date_published": "2025-03-05T16:11:03+00:00",
            "authors": [
                {
                    "name": "Atten_app",
                    "url": "https://www.reddit.com/user/Atten_app"
                }
            ]
        },
        {
            "id": "1j2fgrw",
            "url": "/r/macapps/comments/1j2fgrw/tuneful_enhance_your_spotify_and_apple_music/",
            "external_url": "https://v.redd.it/jj6lyreo8gme1",
            "title": "Tuneful - Enhance your Spotify and Apple Music experience",
            "content_html": "",
            "date_published": "2025-03-03T10:09:37+00:00",
            "authors": [
                {
                    "name": "helloworldn",
                    "url": "https://www.reddit.com/user/helloworldn"
                }
            ]
        },
        {
            "id": "1ixsymk",
            "url": "/r/macapps/comments/1ixsymk/i_made_my_commercial_clipboard_manager_open/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1ixsymk/i_made_my_commercial_clipboard_manager_open/",
            "title": "I made my commercial clipboard manager open source because it's right",
            "content_html": "<p>We all know that clipboard managers handle sensitive data such as passwords, personal notes, API keys, etc. To trust one you need to be sure that it doesn't send your data to third parties or store it on remote servers.</p>\n<p>With closed-source apps, you have to take the developer’s word for it. As a software engineer, I don't like that. Transparency matters.</p>\n<p>So, I decided to make my commercial <a href=\"https://clipbook.app\">clipboard manager</a> open source. Anyone can inspect the source code, verify that data stays local and never leaves the user's device. Anyone can <a href=\"https://github.com/vladimir-ikryanov/ClipBook/blob/main/README.md#building-clipbook\">build the app from source</a> and use it.</p>\n<p><strong>GitHub</strong>: <a href=\"https://github.com/vladimir-ikryanov/ClipBook\">https://github.com/vladimir-ikryanov/ClipBook</a></p>\n<p>At the same time, the app is still commercial, as I need to cover hosting, tooling, and development costs. I know this means anyone can build the app from source and use it for free. Or even rebrand and sell it, but I think the trade-off is worth it.</p>\n<p>What do you think about this approach? Would you trust an open-source commercial app more than a closed-source one? Do you think I made a mistake?</p>",
            "date_published": "2025-02-25T11:36:30+00:00",
            "authors": [
                {
                    "name": "Ikryanov",
                    "url": "https://www.reddit.com/user/Ikryanov"
                }
            ]
        },
        {
            "id": "1indhkt",
            "url": "/r/macapps/comments/1indhkt/psa_apple_now_lets_you_migrate_digital_purchases/",
            "external_url": "https://support.apple.com/en-us/117294",
            "title": "[PSA] Apple Now Lets You Migrate Digital Purchases From One Apple Account to Another",
            "content_html": "<p>If an Apple Account is only used for making purchases, those purchases can be migrated to a primary Apple Account to consolidate them.</p>\n<p>Note: This feature isn’t available to users in the European Union, United Kingdom, or India.</p>",
            "date_published": "2025-02-12T00:00:43+00:00",
            "authors": [
                {
                    "name": "73ch_nerd",
                    "url": "https://www.reddit.com/user/73ch_nerd"
                }
            ]
        },
        {
            "id": "1if79wh",
            "url": "/r/macapps/comments/1if79wh/focu_is_now_opensource_mindful_productivity_app/",
            "external_url": "https://www.reddit.com/gallery/1if79wh",
            "title": "Focu is now open-source! Mindful productivity app with a locally running AI and long-term memory",
            "content_html": "",
            "date_published": "2025-02-01T14:19:46+00:00",
            "authors": [
                {
                    "name": "martin_buur",
                    "url": "https://www.reddit.com/user/martin_buur"
                }
            ]
        },
        {
            "id": "1i816n4",
            "url": "/r/macapps/comments/1i816n4/i_built_a_faster_than_your_launcher_launcher_for/",
            "external_url": "https://www.youtube.com/watch?v=hzzQl5FOL-k",
            "title": "I built a *faster than your launcher* launcher for macOS called Leader Key. It's the perfect sidekick for Raycast, Alfred, etc. And it's FREE and open source! Here's a video I made about it",
            "content_html": "",
            "date_published": "2025-01-23T11:21:23+00:00",
            "authors": [
                {
                    "name": "mikker",
                    "url": "https://www.reddit.com/user/mikker"
                }
            ]
        },
        {
            "id": "1i5o40d",
            "url": "/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/",
            "title": "Guide: The Terminal – For Noobs (Like Me)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i5o40d/guide_the_terminal_for_noobs_like_me/'>Reddit</a></caption><div><br></div><p>Yesterday I suddenly spent 7 hours writing a guide I named \"<em><strong>The Terminal – For Noobs (Like Me)</strong></em>\" – so I wanted to share it!</p>\n<p>As the title suggests, I'm absolutely no expert when it comes to the terminal – but I've started to like it. And if you find the terminal a bit daunting, it might be useful to have a guide written by someone for whom it <em>isn't</em> second nature.</p>\n<p>I've done my best to provide accurate explanations, while still keeping them simple. But please let me know if I've missed the mark!</p>\n<p><strong>This is not meant for those who'll <em>live</em> in the terminal! I guess it's <em>mostly</em> for non-programmers, like myself. My intension is to make it seem more tempting to add to your arsenal of Mac tools. And to reduce the dread when you have to dive into the world of command lines.</strong></p>\n<h4>As it become longer than first expected, I decided to split it up into 3 parts:</h4>\n<ul>\n<li>**<a href=\"https://havn.blog/2025/01/19/the-terminal-for-noobs-like.html\">Part One:** The Basic Concepts</a> (<em>Terminal</em>, <em>CLI</em>, <em>Shell</em>, <em>Prompt</em>,)</li>\n<li>**<a href=\"https://havn.blog/2025/01/19/215237.html\">Part Two:** The <em>Why</em> and _What</a>_</li>\n<li>**<a href=\"https://havn.blog/2025/01/19/220119.html\">Part Three:** A More Noob-Friendly Terminal</a></li>\n</ul>\n<p>Feedback is greatly appreciated! Both from noobs (like me), and from pros.</p>\n<p>If you're a noob, did it help you at all? Does it need more images and examples?</p>\n<p>Am I giving some bad advice or inaccurate statements?</p>\n<p>How do <em>you</em> use the terminal? And what are your feelings toward it?</p>",
            "date_published": "2025-01-20T11:26:19+00:00",
            "authors": [
                {
                    "name": "ErlendHM",
                    "url": "https://www.reddit.com/user/ErlendHM"
                }
            ]
        },
        {
            "id": "1i26sdt",
            "url": "/r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/",
            "external_url": "https://i.redd.it/3l7uvlhmq7de1.jpeg",
            "title": "Haven't used a Mac in ten years when I was a loyal user. Switched back to a MBA two days ago and I am absolutely floored. Both the hardware and digital architecture are entirely unrecognizable.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i26sdt/havent_used_a_mac_in_ten_years_when_i_was_a_loyal/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/3l7uvlhmq7de1.jpeg\" />",
            "date_published": "2025-01-15T20:22:09+00:00",
            "authors": [
                {
                    "name": "h4rryP",
                    "url": "https://www.reddit.com/user/h4rryP"
                }
            ]
        },
        {
            "id": "1i1awjs",
            "url": "/r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/",
            "external_url": "https://v.redd.it/rceavzoqrzce1",
            "title": "Let your apps fly—in a pie",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i1awjs/let_your_apps_flyin_a_pie/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-14T17:09:08+00:00",
            "authors": [
                {
                    "name": "mrtnlxo",
                    "url": "https://www.reddit.com/user/mrtnlxo"
                }
            ]
        },
        {
            "id": "1i0vun1",
            "url": "/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/",
            "title": "My Favourite (Mostly Free) Must Have Mac Apps",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1i0vun1/my_favourite_mostly_free_must_have_mac_apps/'>Reddit</a></caption><div><br></div><p>I upgraded from my 2019 MacBook Air to the M3 Air in September and sort of went off the deep end, playing around with a lot of different apps to enhance my Mac experience. As a Uni student, here are the apps that I use every day and my honest user experience and feedback. Most of the apps installed are free, but any that aren't will have their price factored into my overall review. </p>\n<p><strong>All of these apps are super easy to install and use and don't require any complex coding knowledge!</strong></p>\n<p><strong>1. Media Mate</strong></p>\n<p><a href=\"https://wouter01.github.io/MediaMate/\">Media Mate Website</a></p>\n<p>I came across this app 2+ years ago, right when it launched. I hated the Vanilla macOS volume and brightness HUD, and Media Mate was an amazing alternative. In the last two years, the developer(s) have continued to refine and perfect this app with new features and customization options. It is one of the easiest apps to install and set up thanks to its super intuitive UI. While other Notch Apps have come since then that offer more features, none of them do what Media Mate does, as well as Media Mate does it. This app is perfect for anyone looking to refresh some aspects of the outdated macOS HUD. As one of the few paid apps on this list, the modest price tag of 7 euros (roughly $7 USD or $10 CAD) gives you lifetime access to 5 licences. I was more than satisfied with the price when I bought it 2 years ago and since then, the dev(s) have blown me away time and time again. Their ability to constantly release bug-free updates (I have never encountered a bug in my time using it) and well-refined make Media Mate integrate beautifully into macOS. To further emphasize how seamless this app is, I have found myself looking at a friend's computer when they change their volume and almost forgetting the Media Mate isn't a part of the Vanilla macOS. THAT'S HOW SEAMLESSLY THIS APP INTEGRATES INTO YOUR MAC!</p>\n<p>After over 2 years of use, I can confidently say that Media Mate gets a 10/10 from me. It does its job beautifully, and updates never feel like they were rushed out unfinished. Apps have come since which try to be better by having more bells and whistles but for those who just want an app which perfectly adds to your Mac, Media Mate stands alone as the best.</p>\n<p><strong>2. Ice</strong></p>\n<p><a href=\"https://github.com/jordanbaird/Ice/blob/main/README.md\">Ice Github Page</a></p>\n<p>Inspired by Bartender, Ice allows you to customize your menu bar and give it a clean and minimalist look. I love that this app solved my constant gripe about having a cluttered menu bar. I got this app initially before getting a Bartender key from someone else, so I'm able to give a direct comparison between the two. You are able to decide between “Always shown,” “Hidden,” and “Always Hidden.”</p>\n<p>Always shown is pretty self-explanatory. Items in the always-shown section will always be visible. I only have the date and time there, but that's just my love of minimalism speaking.</p>\n<p>Hidden is for your icons that you use semi-regularly but don't want to see all the time. These icons are revealed by dragging the mouse to the top of the screen. With the icons hiding again after moving the mouse away. This is where I keep my Wi-Fi, Bluetooth, and other icons that I visit on a fairly regular basis but not too often.</p>\n<p>Always hidden works the same as the hidden section, except it doesn't reveal when you drag your mouse to the top of the screen. Instead, simply hold option and click the top of the screen to reveal the always hidden bar, which goes back to being hidden once you move the mouse away from the top of the screen. I really only use this for certain apps which force an icon into the menu bar with no ability to disable it.</p>\n<p>There are two reasons why, in my opinion, Ice is actually a better app than Bartender, which I will explain below.</p>\n<p>Number one: IT'S FREE. The beauty of the app being free is that if you don't like it, you can uninstall and never think about it again. For offering all the same features without the cost, there isn't any drawback to at least trying out Ice before spending a whopping $30 CAD (approx 20 USD and Euro) on Bartender. After showing Ice to the person who gave me their bartender key, he was pretty pissed that he'd spent all that money, and I was able to get the same thing for free.</p>\n<p>Number two: This may not be much to everyone, but I love it. When Bartender hides apps from your menu bar, it replaces them with a plain grey space, which is pretty lame compared to what Ice has to offer. With Ice, any area which isn't being used in your menu bar is instead seamlessly replaced by your wallpaper! This feature works regardless of if you're using a still image or a dynamic wallpaper. Ice will always fill the space back in, which makes the menu bar much smaller and your screen much bigger! It reminds me of when Apple switched from the notch to the dynamic island with the iPhone 14. Even though there wasn't much more screen space being added, the screen feels much bigger and the camera housing feels less pronounced than with the notch. Overall, while this feature doesn't serve much of a use, it makes the top of your screen feel much cleaner without the grey bar running along the top of it.</p>\n<p>Overall, Ice gets an 8/10 from me. It has a few bugs now and then, but its dev team is super responsive to feedback and works really hard to fix bugs in a timely manner. Even with that in mind, there is no world where spending $30 on Bartender is better than at least trying Ice at no cost. For me, This is a rare example of an app where the free version is better than the paid.</p>\n<p><strong>3. Icon Champ</strong></p>\n<p><a href=\"https://www.macenhance.com/iconchamp.html\">IconChamp Install</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=487G8qaBky0&amp;ab_channel=MacProTips\">IconChamp YouTube Tutorial</a></p>\n<p><a href=\"https://macosicons.com/#/\">Mac Icons</a></p>\n<p><a href=\"https://apps.apple.com/us/app/image2icon-make-your-icons/id992115977?mt=12\">Image2Icon File Converter</a></p>\n<p>One of my most recent additions, IconChamp is another app that helps you modernize your Mac by giving you the ability to change your app icons to whatever you want. I love the dark icons that came out in iOS18 and wanted a way to give all the apps in my dock a common theme.</p>\n<p>This app has both a free and paid version. The free version allows you to change any apps that you have installed manually, as well as your folder icons on your user folders. The paid version is the only app I've ever been able to find which gives you the ability to change the icons of the base macOS apps and folders. The paid version gives you 3 keys and comes in at a price of approx $15 CAD (approx 10 USD and Euro). It's not the cheapest app, and most people will probably be more than fine with the free version, but the paid version gives that extra bit of personalization we all love (it's the reason that I, along with so many others, are in this subreddit in the first place).</p>\n<p>The beauty of IconChamp is that it's a simple drag-and-drop process, it doesn't require you to disable any security features, and any changes can be reverted with (literally) one click of a button. Since the release of macOS Sequoia, the app has gained a few bugs which, as far as I can see, haven't had any attempts of being remedied. I had to play around with it a bit and came across a YouTube video which helped me install the right version and gave the full run tutorial. I was able to get the majority of my images from the website featured in the video. For the apps which I couldn't find a version I liked on the website, I simply googled what I was looking for and used another app which will also be linked to convert the .png into a .icns file (the standard file type used for Apple app icons)(Since that, I noticed on their website that they claim to accept “all standard image file types,” so I think I took the scenic route for those extra icons by installing a whole other app to convert the file). One bug I encountered after uploading my desired icons was that while the app icons changed in the launchpad, the apps in my dock stayed the same. This was easily fixed by removing and re-adding those apps to my dock. The one app I haven't been able to change is the Calendar app. From doing some research online, it seems that the Calendar app has something special about it which makes it impossible to change its icon. Regardless, I love the ability to customize the rest of my apps and give my computer a more cohesive theme.</p>\n<p>Overall, I rate IconChamps a 7/10. While it has some bugs and the process can be a bit tedious, I found the finished product to be worth the process. The shared theme in my dock really makes it look a thousand times better, and I love that IconChamp is able to change system apps on top of third-party ones. The price tag for the pro version will certainly turn some people off, but the free version is still an amazing app for anyone wanting to update some older app icons.</p>\n<p><strong>4. Notch Focus Timer</strong></p>\n<p><a href=\"https://apps.apple.com/us/app/notch-focus-timer/id6477333821?mt=12&amp;src=AppAgg.com\">Notch Focus Timer</a></p>\n<p>One of the most simple additions to any Mac with a notch, Notch Timer is a super clean timer app that uses the Notch to display how long is left. The app is controlled through the menu bar, where, unlike Apple, you can set a timer as long as you'd like (seriously, I was able to make a time for 1,000,000,000 hours). You can also pause or stop the timer by simply dragging the mouse into the notch, which causes the timer to expand and display how long is left, and the buttons to pause or cancel. Notch Timer also allows you to toggle for different sounds to play once the timer has finished, and even change the colour of the bar wrapping around the notch to be any colour you desire. At a price of free and already on the App Store, there's no reason not to have this simple app on your Mac.</p>\n<p>Notch Focus Timer gets a 9/10. I can't think of any shortcomings in this app or any reason not to install it. The only concern I have is that I don't believe there is any way to delete a custom timer and I fear I now have a timer for 1,000,000,000 hours and no way to delete it. For what it is, it's pretty close to perfect. It's simple, it works perfectly, and it's super easy to use. Not every app needs to have 100 features, and this is a perfect example of that. Notch Timer does one thing, and it does it perfectly, so I can't ask anything more from it.</p>\n<p><strong>5. boringNotch</strong></p>\n<p><a href=\"https://theboring.name/\">boringNotch Install</a></p>\n<p>I previously asked this subreddit which notch app was considered the best. As I anticipated, everyone had their own answer. The thing with these notch apps like Alcove, Dynamic Lake, and NotchNook, is that they all have different pros and cons, making this review a little more subjective. After doing the trial on those previously mentioned apps, I decided to try boringNotch before deciding which app to commit to. Since installing boringNotch, I have forgotten about the other 3. boringNotch is quite similar to NotchNook, but a little simpler with not as many bugs.</p>\n<p>As a bit of a newer app, boringNotch doesn't have all of the features that its competition does, but that isn't always a bad thing. The devs have a clear roadmap on their GitHub page which clearly outlines the features they have planned, and an active discord community in which they tease new features, answer community questions, and investigate bug reports. Currently, boringNotch has an integrated calendar, media player, and drop tray for files, among other things. While boringNotch doesn't currently offer a system hud replacement, it's been teased numerous times and looks to hopefully be ready for release in due course. I've come up with a temporary solution to this by using MediaMate for my system hud and boringNotch for its media player and other features. The team working on this app is passionate about their work and has a strong base and a roadmap which looks promising for the future. I haven't encountered any major bugs using boringNotch and the devs are good about looking into issues and fixing major problems in a timely manner.</p>\n<p>Considering the price, its competition, and the plans for the future, I've gone with an 8/10 for boringNotch. Sure other notch apps may have more features, but is the number of features the only thing used to decide which is better? Of course not. boringNotch is surprisingly stable for being a newer app and it's started with a really strong base. I look forward to seeing the devs continue to build off of their strong start as they work through their roadmap</p>\n<p><strong>5. Dato</strong></p>\n<p><a href=\"https://apps.apple.com/us/app/dato/id1470584107?mt=12\">Dato on the Apple App Store</a></p>\n<p>Having used Dato for a couple of years now, it's another one of those apps that I often forget isn't a part of macOS for everyone! Dato makes it easy to access your calendar and see your upcoming events by simply clicking the icon in the menu bar. It makes it super easy to check your schedule coming up without having to open the calendar app every time. It's another one of those apps that feels super seamless and having used it for over 2 years now, I can't imagine using my Mac without it. I probably use it 2-3 times A DAY because it just makes accessing your calendar so easy. It is the most expensive app on here, costing $16 USD ($23 CAD or approx 15 euros) from the App Store, but I can assure you that you will find Dato to be an absolute essential that is definitely worth the price.</p>\n<p>I'm giving Dato an 8/10. I've never encountered a bug using Dato and I'm confident to say that it will change how you use your calendar on your Mac. My only issue with Dato is the price. I fear that without a free trial, many will underestimate how amazing Dato is, and be turned away by its steep price. Furthermore, by being in the App Store instead of giving a few licence keys which could be split between a few people. Unless you are a part of Family Sharing like I was, $16 USD for one person is a high price to pay and definitely reduces the number of new users. However, those who push past the price will understand why I only docked 2 points from its rating. I promise you, the sting of the price will go away, and you will be left with a truly revolutionary app that totally changes how you use your calendar.</p>\n<p><strong>6. DockDoor</strong></p>\n<p><a href=\"https://github.com/ejbills/DockDoor\">DockDoor Github</a></p>\n<p>Another recent installation, DockDoor makes it so much easier to manage all your windows. I usually like to keep my browser windows organized based on what I'm doing. This means I usually have 3 or 4 windows at a time for the different things I'm doing on my laptop. DockDoor will show you a preview of each window as you hover over it, making it super easy to manage and change windows. It's got a ton of customization and is another one of those apps that makes using a Mac that little bit better. I like being able to get a quick preview of what I have running on each app and I would totally recommend it for people who tend to have numerous apps and windows open at the same time. I've only had DockDoor for a little while now so I can't give the most in-depth review of it but my experience so far made it impossible to leave off of this list.</p>\n<p>Given DockDoor is free, it's another one of those apps where there's no reason not to install it and try it out. As a relatively newer app, I've encountered a few bugs which I'm sure will be fixed, but nothing that impacts your overall user experience. For these reasons, I've given DockDoor an 8/10 because I'm sure its bugs will be fixed and when that happens, you're left with a free app that makes managing your windows so much easier.</p>",
            "date_published": "2025-01-14T02:34:13+00:00",
            "authors": [
                {
                    "name": "aidanmavai",
                    "url": "https://www.reddit.com/user/aidanmavai"
                }
            ]
        },
        {
            "id": "1hz09ph",
            "url": "/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/",
            "title": "List of the best free apps. [UPDATED]",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hz09ph/list_of_the_best_free_apps_updated/'>Reddit</a></caption><div><br></div><p>Link: <a href=\"https://github.com/Axorax/awesome-free-apps\">https://github.com/Axorax/awesome-free-apps</a></p>\n<p>Now, there are more tags and you can also filter to see apps for a specific platform. I also added a lot more apps suggested by you guys!</p>\n<p>Star the project to save it and show support (you can also donate to help)! &lt;3</p>\n<p>Suggest more cools apps here!</p>\n<p>For the future, if it gets enough donations, I plan on buying a domain and making a website so it's easier to filter, search and find cool apps.</p>",
            "date_published": "2025-01-11T16:59:46+00:00",
            "authors": [
                {
                    "name": "axorax",
                    "url": "https://www.reddit.com/user/axorax"
                }
            ]
        },
        {
            "id": "1hxckw7",
            "url": "/r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/",
            "external_url": "https://v.redd.it/iey7mj9suybe1",
            "title": "Dyet - Color your folder icons Automatiaclly",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hxckw7/dyet_color_your_folder_icons_automatiaclly/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-09T13:17:33+00:00",
            "authors": [
                {
                    "name": "WickedDogg",
                    "url": "https://www.reddit.com/user/WickedDogg"
                }
            ]
        },
        {
            "id": "1huwfvu",
            "url": "/r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/",
            "external_url": "https://v.redd.it/n06rmvy0tcbe1",
            "title": "Fully Local AI App for Real-Time Meeting Transcription & Dictation (No Wi-Fi Needed)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1huwfvu/fully_local_ai_app_for_realtime_meeting/'>Reddit</a></caption><div><br></div>",
            "date_published": "2025-01-06T10:55:00+00:00",
            "authors": [
                {
                    "name": "Which-Comment-8327",
                    "url": "https://www.reddit.com/user/Which-Comment-8327"
                }
            ]
        },
        {
            "id": "1hpvt70",
            "url": "/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/",
            "title": "What’s the Best Mac App of 2024?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hpvt70/whats_the_best_mac_app_of_2024/'>Reddit</a></caption><div><br></div><p>Hey everyone,</p>\n<p>As 2024 comes to a close, I’m curious to know which Mac apps stood out for you this year. Whether it's for productivity, creativity, organization, or just pure fun, I’d love to hear your recommendations.</p>\n<p>What’s the one app you think every Mac user should check out in 2024?</p>",
            "date_published": "2024-12-30T19:53:18+00:00",
            "authors": [
                {
                    "name": "vigneshvp",
                    "url": "https://www.reddit.com/user/vigneshvp"
                }
            ]
        },
        {
            "id": "1hmcbpk",
            "url": "/r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/",
            "external_url": "https://shortcat.app/",
            "title": "ShortCat lets you navigate the MacOS UI with your keyboard",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hmcbpk/shortcat_lets_you_navigate_the_macos_ui_with_your/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-26T00:06:55+00:00",
            "authors": [
                {
                    "name": "obviousoctopus",
                    "url": "https://www.reddit.com/user/obviousoctopus"
                }
            ]
        },
        {
            "id": "1hkxwgz",
            "url": "/r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/",
            "external_url": "https://v.redd.it/6akaffi32o8e1",
            "title": "Built-in Mac dictation was awful so I built my own called TalkText",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hkxwgz/builtin_mac_dictation_was_awful_so_i_built_my_own/'>Reddit</a></caption><div><br></div><p>I found built-in dictation awful for use day to day, especially when I had to think on the spot.</p>\n<p>So I built TalkText.io, a free to download macOS app that works anywhere you can type on your Mac. It allows you to speak naturally and not worry about every mistake in your speech being transcribed verbatim, unlocking many use cases.</p>\n<p>It also allows you to select and transform any text - you can select a sentence and ask for it to be rewritten in a certain style. Perhaps you’d like it to be friendlier, more professional, or even to sound like it was written by a pirate - anything is possible.</p>\n<p>You can check it out at: https://talktext.io</p>\n<p>Keen to get some feedback 😀</p>",
            "date_published": "2024-12-23T21:29:11+00:00",
            "authors": [
                {
                    "name": "jamie452",
                    "url": "https://www.reddit.com/user/jamie452"
                }
            ]
        },
        {
            "id": "1hg946x",
            "url": "/r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/",
            "external_url": "https://github.com/jaywcjlove/regex-mate",
            "title": "RegexMate 2.0.0 Released: A regex tool for macOS with built-in examples to help you get started easily! ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hg946x/regexmate_200_released_a_regex_tool_for_macos/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-17T12:01:02+00:00",
            "authors": [
                {
                    "name": "wcjiang",
                    "url": "https://www.reddit.com/user/wcjiang"
                }
            ]
        },
        {
            "id": "1hfg2ev",
            "url": "/r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/",
            "external_url": "https://www.reddit.com/gallery/1hfg2ev",
            "title": "I completed building this app recently, now it is available for mac and windows both.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1hfg2ev/i_completed_building_this_app_recently_now_it_is/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-16T10:16:05+00:00",
            "authors": [
                {
                    "name": "Relevant_Motor_2613",
                    "url": "https://www.reddit.com/user/Relevant_Motor_2613"
                }
            ]
        },
        {
            "id": "1h5lad6",
            "url": "/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/",
            "title": "I'm sick of scam promotions",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h5lad6/im_sick_of_scam_promotions/'>Reddit</a></caption><div><br></div><p><strong>BoltAI</strong> as an example. It's a good piece of software and I was considering buying it. But I hate scammers.</p>\n<p>Premium price in October: $79 ~~$100~~</p>\n<p>Premium price in Nov, 5th: $79 ~~$100~~</p>\n<p>Premium price in Nov, 24th: $79 ~~$112~~ (Black Friday promotion)</p>\n<p>Premium price today: $89  ~~$112~~ (Cyber Monday promotion)</p>",
            "date_published": "2024-12-03T11:26:18+00:00",
            "authors": [
                {
                    "name": "GovernmentVast1699",
                    "url": "https://www.reddit.com/user/GovernmentVast1699"
                }
            ]
        },
        {
            "id": "1h4ydsp",
            "url": "/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/",
            "title": "Was Gonna Discount My Mac App for Cyber Monday, But Screw It—Let’s Make It Free For Today Only (Until 12/3).",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h4ydsp/was_gonna_discount_my_mac_app_for_cyber_monday/'>Reddit</a></caption><div><br></div><p>Happy Cyber Monday! I recently shared a <a href=\"https://www.reddit.com/r/appletv/comments/1h2qonl/was_gonna_discount_my_apple_tv_apps_for_black/\">similar offer in the Apple TV sub</a> for several of my Apple TV apps during Black Friday and was thrilled by the overwhelming response and gratitude. It inspired me to extend the same generosity to this sub with my macOS app for Cyber Monday! As a way to express my appreciation, I’m making my Mac meeting app, <strong>MeetingMenu</strong>, completely <strong>FREE</strong> until midnight on December 3, UTC! No subscriptions, no catch—just download and enjoy.</p>\n<p>I’m the developer of MeetingMenu, a Mac app I created to solve my own meeting management headaches. Like many of you, I find myself doing lots of meetings online across various apps. I’m frequently accessing the same settings and tools during meetings, and I wanted a way to keep them all in one convenient place—right in the menu bar.</p>\n<p>Most important for me was being able to see my next meeting at a glance, with a countdown timer and the ability to launch it with a single click—right in the menu bar. That feature alone has been a game-changer for staying organized and never missing a meeting.</p>\n<p>In addition, I wanted tools to simplify screen sharing, like quickly hiding my desktop, icons, and wallpaper to avoid any awkward moments. I also built in a privacy browser to prevent my bookmarks or history from showing during meetings.</p>\n<p>As I kept using it, I realized there were even more tools I frequently needed that were buried within the user interfaces of various meeting apps. So, I bundled them all into one app:</p>\n<ul>\n<li>Tools to quickly check my mic volume and see how I look on camera before meetings.</li>\n<li>A quick meeting launcher for platforms like Zoom, Teams, and Google Meet.</li>\n<li>Custom time zone views to see meeting times in different regions.</li>\n</ul>\n<p>Other features include: sticky notes, in-meeting indicator, low power mode, WiFi signal check, audio quality test, and more—all accessible from the menu bar.</p>\n<p>Yes, I know there are apps with overlapping features, but I needed something that combined everything I rely on in one place—like a Swiss Army knife for meeting tools.</p>\n<p>That’s how MeetingMenu came to life, and it’s been a lifesaver for me. It’s still relatively new, so I’d really appreciate any feedback, feature suggestions, or tips to make it better for the community.</p>\n<p>⏳ <strong>This is a one-day offer, valid until midnight on December 3, UTC.</strong> Must download today before it goes back to being paid.</p>\n<p>👉 <a href=\"https://apps.apple.com/us/app/meetingmenu/id6538714770\">Download MeetingMenu for Mac</a><br />\n👉 <a href=\"https://meetingmenu.app/\">Visit the MeetingMenu website</a></p>\n<p>Thanks again to this amazing community for your support—you’re the best! Enjoy the app, and let me know your thoughts in the comments! 😊</p>",
            "date_published": "2024-12-02T16:05:29+00:00",
            "authors": [
                {
                    "name": "rabbimarshak",
                    "url": "https://www.reddit.com/user/rabbimarshak"
                }
            ]
        },
        {
            "id": "1h4171w",
            "url": "/r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/",
            "external_url": "https://v.redd.it/8ukqtq42184e1",
            "title": "Made my first Mac App, which let's you rename files with AI. Any feedback?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h4171w/made_my_first_mac_app_which_lets_you_rename_files/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-12-01T11:18:32+00:00",
            "authors": [
                {
                    "name": "Round-Rhubarb-8880",
                    "url": "https://www.reddit.com/user/Round-Rhubarb-8880"
                }
            ]
        },
        {
            "id": "1h17af8",
            "url": "/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/",
            "title": "Better Touch Tool Black Friday deals are here",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h17af8/better_touch_tool_black_friday_deals_are_here/'>Reddit</a></caption><div><br></div><ul>\n<li><strong>25</strong>% off on <strong>standard</strong> licenses</li>\n<li><strong>33</strong>% off on <strong>lifetime</strong> licenses</li>\n</ul>\n<p><a href=\"https://folivora.ai/blog/post/13309\">https://folivora.ai/blog/post/13309</a></p>",
            "date_published": "2024-11-27T15:45:24+00:00",
            "authors": [
                {
                    "name": "MobileCool7175",
                    "url": "https://www.reddit.com/user/MobileCool7175"
                }
            ]
        },
        {
            "id": "1h078qk",
            "url": "/r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/",
            "external_url": "https://v.redd.it/535bh5y0j73e1",
            "title": "I wanted to build this app to post cropped landscape video on the reels/shorts.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1h078qk/i_wanted_to_build_this_app_to_post_cropped/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-11-26T08:33:14+00:00",
            "authors": [
                {
                    "name": "Relevant_Motor_2613",
                    "url": "https://www.reddit.com/user/Relevant_Motor_2613"
                }
            ]
        },
        {
            "id": "1gy0mvo",
            "url": "/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/",
            "title": "I see a lot of “top free apps” posts - what are your must-have PAID apps? ",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gy0mvo/i_see_a_lot_of_top_free_apps_posts_what_are_your/'>Reddit</a></caption><div><br></div><p>Title says it all - what are some paid apps you can’t live without? </p>",
            "date_published": "2024-11-23T14:19:19+00:00",
            "authors": [
                {
                    "name": "MorphicSn0w",
                    "url": "https://www.reddit.com/user/MorphicSn0w"
                }
            ]
        },
        {
            "id": "1gvm542",
            "url": "/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/",
            "title": "Two Free Apps for Mac OS Installation Ease",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gvm542/two_free_apps_for_mac_os_installation_ease/'>Reddit</a></caption><div><br></div><p><a href=\"https://preview.redd.it/1poozcre512e1.png?width=1099&amp;format=png&amp;auto=webp&amp;s=5c9b79722a27b7e2c1d7c4aa64c1269692314145\">Mist Menu</a></p>\n<p>On most modern Macs, the later Intel builds and all Apple Silicon models, you can boot into recovery mode, access disk utility and download and install a new operating system. Unless you can't. Then you have a problem. Or, maybe you are experimenting with <a href=\"https://apps.louplummer.lol/post/open-core-legacy-patcher\">Open Core Legacy Patcher</a> to install a later version of macOS on a device that doesn't officially support it. In that case, you are going to need a copy of an OS, preferably bootable, and some sort of media to copy that OS installation onto. You can do the installation through other methods, like target disk mode or various imaging applications too, but they take some know how. The other thing you can use these files for is when experimenting with virtual machines in something like Virtual Box, UTM or VMWare Fusion.</p>\n<p><strong>Mist</strong></p>\n<p>To get a copy of the firmware and OS you need, I know of no easier method than using <a href=\"https://github.com/ninxsoft/Mist?tab=readme-ov-file\">Mist</a>, a free app available on GitHub. With Mist, you can get everything from the latest beta, all the way back to Mac OS X 7.5. You can get Intel or Apple Silicon installers, or the universal installers available for macOS Big Sur and later.</p>\n<p><strong>Balena Etcher</strong></p>\n<p>If you are planning to use an SD card or a USB drive, things work better when you flash the media than when you try to fiddle with partitions and permissions on your own from the command line. Luckily, there is an app for that. It is <a href=\"https://etcher.balena.io/\">Balena Etcher</a>, a free app with built-in safeguards to keep you from erasing the wrong drive. Balena Etcher will also create bootable media for Windows and various Linux builds too.</p>",
            "date_published": "2024-11-20T10:02:36+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1gkrg9s",
            "url": "/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/",
            "title": "An app to make an chm(Compiled HTML Help) file on MacOS",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gkrg9s/an_app_to_make_an_chmcompiled_html_help_file_on/'>Reddit</a></caption><div><br></div><p>Hi there, I've searching an app to make a chm<strong>(Compiled HTML Help)</strong> for years on mac, my findings were null because I found only chm readers like <a href=\"https://github.com/vit9696/ichm\">ichm</a> but I would like to have an app to make my own chm files </p>\n<p>If you know apps, please share i'd glad to hear your comments </p>",
            "date_published": "2024-11-06T05:46:53+00:00",
            "authors": [
                {
                    "name": "SpectyteCovelight",
                    "url": "https://www.reddit.com/user/SpectyteCovelight"
                }
            ]
        },
        {
            "id": "1gkkodt",
            "url": "/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/",
            "title": "Zero Loss Compress: Reduce Photo Library Size Without Data Loss!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gkkodt/zero_loss_compress_reduce_photo_library_size/'>Reddit</a></caption><div><br></div><p><a href=\"https://fractale.itch.io/zero-loss\">https://fractale.itch.io/zero-loss</a><br />\nI'm the app developer, and I'm happy to answer any questions you might have.</p>",
            "date_published": "2024-11-05T23:32:54+00:00",
            "authors": [
                {
                    "name": "perecastor",
                    "url": "https://www.reddit.com/user/perecastor"
                }
            ]
        },
        {
            "id": "1gk4utq",
            "url": "/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/",
            "title": "[GIVEAWAY] Alter -- An AI Assistant Truly Built For Mac",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gk4utq/giveaway_alter_an_ai_assistant_truly_built_for_mac/'>Reddit</a></caption><div><br></div><p>Hey MacApps community!</p>\n<p>We've partnered with a small team of Mac enthusiasts who've created Alter – an AI assistant built for macOS designed to upgrade all your apps with AI capabilities.</p>\n<p><strong>💡 Why Alter was Created:</strong> \"We were frustrated with AI tools that didn't really \"get\" the Mac ecosystem and often disrupted our focus. So we built something that works naturally with macOS, understanding your apps and workflows.\"</p>\n<p><strong>🔥 What makes Alter unique:</strong></p>\n<ol>\n<li>Chat with files and folders directly from the Finder</li>\n<li>App-aware AI - Interact with Apple Mail, Discord, browsers and more.</li>\n<li>YouTube summaries on the fly - Summarize or chat with video content without leaving your page.</li>\n<li>Artifacts - Generate presentations, interactive charts, diagrams and HTML apps ready to be shared.</li>\n<li>Multiple AI providers - Access OpenAI, Anthropic, Together, Google, Groq and others without setup.</li>\n<li>Minimized mode - Start as many conversations as you need and keep them at hand</li>\n<li>Free plan - all features enabled, no limitation, 500 credits to start.</li>\n</ol>\n<p><strong>👉 Notable features:</strong></p>\n<ul>\n<li>Screenshots support - Take screenshots to add context for an AI action.</li>\n<li>Automatic, mnemonic keyboard shortcuts - Quick access to 80+ AI Actions.</li>\n<li>Privacy-ready - Full support for local AI tools: Ollama, LM Studio, etc.</li>\n<li>Bring your own key - Use your own provider with an OpenAI compatible endpoint.</li>\n<li>Image generation - Create visuals with Flux models</li>\n<li>Chain AI actions - Reuse the last output for fast iteration.</li>\n<li>OpenAI Compatible Endpoint - Use all our models in other tools and centralize your billing</li>\n</ul>\n<p><strong>🎁 Special offer for the community:</strong> **Limited Time Offer: **Get 25% off on the Power User Plan with code: MACAPPS. <strong>Giveaway Alert:</strong> We're giving away 2 Self-service plan in our Discord server and 1 exclusive Power User plan for server boosters! To enter the giveaway, join the Discord server: <a href=\"https://discord.gg/macapps-1017764460217237528\">https://discord.gg/macapps-1017764460217237528</a></p>\n<p>🔽 Download Alter: <a href=\"https://alterhq.com/\">https://alterhq.com/</a></p>\n<p><a href=\"https://i.redd.it/8shohufym2zd1.gif\">Preview</a></p>",
            "date_published": "2024-11-05T11:49:47+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1gjwx7v",
            "url": "/r/macapps/comments/1gjwx7v/mac_app_sales/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gjwx7v/mac_app_sales/",
            "title": "mac app sales",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gjwx7v/mac_app_sales/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gjwx7v/mac_app_sales/'>Reddit</a></caption><div><br></div><p>any deals or bundles on sale you all are looking forward to this coming black friday/holiday season?</p>",
            "date_published": "2024-11-05T02:56:57+00:00",
            "authors": [
                {
                    "name": "Few_Association_775",
                    "url": "https://www.reddit.com/user/Few_Association_775"
                }
            ]
        },
        {
            "id": "1gjjf52",
            "url": "/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/",
            "title": "Automatically Quit Apps using \"Last Window Quits\" (new release)",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gjjf52/automatically_quit_apps_using_last_window_quits/'>Reddit</a></caption><div><br></div><p>Hello! I’ve just published my second macOS app, which detects when the last window of an app is closed and quits that app. This helps prevent unnecessary memory usage by apps that are not actively being used. While macOS does have built-in memory management, I’ve encountered situations where the system runs out of memory without closing inactive apps. I created this app to ensure all apps without open windows are closed. The app is free—hope you enjoy it, and feel free to share any feedback. Cheers.</p>\n<p><a href=\"https://lawand.io/last-window-quits/\">https://lawand.io/last-window-quits/</a></p>",
            "date_published": "2024-11-04T17:09:20+00:00",
            "authors": [
                {
                    "name": "CharacterTomatillo64",
                    "url": "https://www.reddit.com/user/CharacterTomatillo64"
                }
            ]
        },
        {
            "id": "1gisv45",
            "url": "/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/",
            "title": "Mac apps that are must-installs because they’re masterpieces of software?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gisv45/mac_apps_that_are_mustinstalls_because_theyre/'>Reddit</a></caption><div><br></div><p>Hey everyone,</p>\n<p>Just got a new Mac and I want to make sure I’m loading it up with the best apps out there. I’m not just looking for any app, but those that truly feel like masterpieces of design, functionality, and user experience.</p>\n<p>What Mac apps do you consider essential because they’re beautifully crafted, powerful, or just make life way easier? Bonus points for ones that are a joy to use or that take full advantage of macOS’s design.</p>\n<p>Let me know your top picks! Thanks in advance!</p>",
            "date_published": "2024-11-03T17:57:42+00:00",
            "authors": [
                {
                    "name": "stuffe23",
                    "url": "https://www.reddit.com/user/stuffe23"
                }
            ]
        },
        {
            "id": "1gh8jd2",
            "url": "/r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/",
            "external_url": "https://www.pixelmator.com/blog/2024/11/01/a-new-home-for-pixelmator/",
            "title": "Apple has acquired the Pixelmator Pro team. Are we getting a first-party Photoshop competitor?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gh8jd2/apple_has_acquired_the_pixelmator_pro_team_are_we/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-11-01T15:48:23+00:00",
            "authors": [
                {
                    "name": "smelly0live",
                    "url": "https://www.reddit.com/user/smelly0live"
                }
            ]
        },
        {
            "id": "1ge1opz",
            "url": "/r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/",
            "external_url": "https://i.redd.it/8dnm7z38yhxd1.png",
            "title": "Some of my favorite Mac apps! Any more recommendations?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1ge1opz/some_of_my_favorite_mac_apps_any_more/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/8dnm7z38yhxd1.png\" />",
            "date_published": "2024-10-28T13:12:19+00:00",
            "authors": [
                {
                    "name": "itsvelora",
                    "url": "https://www.reddit.com/user/itsvelora"
                }
            ]
        },
        {
            "id": "1gdjhh6",
            "url": "/r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/",
            "external_url": "https://mastodon.cloud/@kagihq@mastodon.social/113380675376996794",
            "title": "We have just updated Orion for desktop and it is a big release! ✨\n\nFeaturing auto Picture-in-Picture when switching tabs, enhanced privacy features, custom start pages, smart tab management plus over 70 improvements & bug fixes!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gdjhh6/we_have_just_updated_orion_for_desktop_and_it_is/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-27T19:46:26+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "1gcgu3r",
            "url": "/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/",
            "title": "Virtual Buddy - Run Mac and Linux VMs with Ease on Apple Silicon for Free",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gcgu3r/virtual_buddy_run_mac_and_linux_vms_with_ease_on/'>Reddit</a></caption><div><br></div><p><a href=\"https://preview.redd.it/0xyu6ieze2xd1.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=093dc9738b91549b55dd622f7254feee984e80ff\">Virtual Buddy Showcase</a></p>\n<p>If you want to test out betas without endangering your primary machine or if or if your a developer looking to test backwards compatibility with previous versions of macOS with your app or even if you just want a safe way to test software you want to try before adding it to your daily driver, take a look at Virtual Buddy, by developer Guilherme Rambo, <a href=\"https://github.com/insidegui/VirtualBuddy\">a GitHub release with 5.1K stars</a>. It also runs several Linux distros if you have a need for that.</p>\n<p>You can choose a Mac release (including betas) from a long list ranging from macOS 13.3 all the way to macOS 15.1 RC1. If you have a URL for another IPSW or an IPSW you have already downloaded, you can use them as well.</p>\n<p>If you want to install a beta of a version higher than what you are running on your host computer, all you need to do is download the latest device support package from Apple which you can sometimes download from their website but cal always get if you install the latest Xcode beta.</p>\n<p>The developer lists these features:</p>\n<ul>\n<li>Ability to boot any version of macOS 12 or macOS 13, including betas</li>\n<li>Ability to boot some ARM-based Linux distros (tested with Ubuntu Server and Ubuntu Desktop)</li>\n<li>Built-in installation wizard</li>\n<li>Select from a collection of restore images available on Apple's servers</li>\n<li>Install the latest stable version of macOS</li>\n<li>Local restore image IPSW file</li>\n<li>Custom restore image URL</li>\n<li>Install a Linux distro from a local .iso file</li>\n<li>Select from a collection of Linux distros</li>\n<li>Install Linux from URL</li>\n<li>Boot into recovery mode (in order to disable SIP, for example)</li>\n<li>Networking and file sharing support</li>\n<li>Clipboard sharing</li>\n<li>Customize virtual machine hardware configuration</li>\n<li>Save and restore macOS virtual machine state</li>\n</ul>\n<p><a href=\"https://github.com/insidegui/VirtualBuddy\">Download from GitHub.</a></p>",
            "date_published": "2024-10-26T08:57:03+00:00",
            "authors": [
                {
                    "name": "amerpie",
                    "url": "https://www.reddit.com/user/amerpie"
                }
            ]
        },
        {
            "id": "1gabcij",
            "url": "/r/macapps/comments/1gabcij/hazel_6_just_got_released/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1gabcij/hazel_6_just_got_released/",
            "title": "Hazel 6 just got released",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1gabcij/hazel_6_just_got_released/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1gabcij/hazel_6_just_got_released/'>Reddit</a></caption><div><br></div><p>According to the email I got it has several awesome new features:</p>\n<ul>\n<li>On-the-fly text recognition. When matching against a file’s contents, Hazel can do text recognition on PDFs that haven’t been OCRed. Works on images, too!</li>\n<li>Ability to read encrypted PDFs. You can now supply a password in your rule to unlock any encrypted PDFs so that Hazel can read their contents. Passwords are stored securely in your keychain.</li>\n<li>Revert File: you can now access Hazel functionality in Finder. If Hazel put a file somewhere you didn’t intend, you can select the file in Finder, right-click it and select Revert to put it back. You can undo file moves, renames, tag and comment changes.</li>\n<li>New custom list attribute to allow you match and store lists of items. You can match against other lists or text. With these, you can copy tags between files or assign tags from files.</li>\n<li>New actions to lock/unlock files and to pause a rule.</li>\n</ul>\n<p>I’m so happy to throw money at this dev. I don’t know how much time Hazel saved me, but it is a lot. Everyone is talking about Inbox zero but this piece of software helped me to achieve Downloads folder zero which is something I wouldn’t have done without it.</p>",
            "date_published": "2024-10-23T14:03:46+00:00",
            "authors": [
                {
                    "name": "Johnkree",
                    "url": "https://www.reddit.com/user/Johnkree"
                }
            ]
        },
        {
            "id": "1g9lpfm",
            "url": "/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/",
            "title": "What paid mac apps are worth every penny that they cost?",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g9lpfm/what_paid_mac_apps_are_worth_every_penny_that/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-22T16:02:15+00:00",
            "authors": [
                {
                    "name": "ChewyTheJedi",
                    "url": "https://www.reddit.com/user/ChewyTheJedi"
                }
            ]
        },
        {
            "id": "1g2wjnc",
            "url": "/r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/",
            "external_url": "https://i.redd.it/hic83zbajkud1.png",
            "title": "🎉 I just updated my macOS app!",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g2wjnc/i_just_updated_my_macos_app/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/hic83zbajkud1.png\" />",
            "date_published": "2024-10-13T18:40:28+00:00",
            "authors": [
                {
                    "name": "Glubker",
                    "url": "https://www.reddit.com/user/Glubker"
                }
            ]
        },
        {
            "id": "1g1whdi",
            "url": "/r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/",
            "external_url": "https://v.redd.it/0m9n8n03oaud1",
            "title": "I rewrote ShakePin from scratch for 3 weeks. It's an open source Dropover alternative that i shared 2 months ago.",
            "content_html": "<caption>Open: <a href='winstonapp:///r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/'>Winston</a> | <a href='https://reddit.com/r/macapps/comments/1g1whdi/i_rewrote_shakepin_from_scratch_for_3_weeks_its/'>Reddit</a></caption><div><br></div>",
            "date_published": "2024-10-12T09:33:20+00:00",
            "authors": [
                {
                    "name": "No_Assistant1783",
                    "url": "https://www.reddit.com/user/No_Assistant1783"
                }
            ]
        }
    ]
}