{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/macapps",
    "description": "r/MacApps is a one stop shop for all things related to macOS apps - featuring app showcases, news, updates, sales, discounts and even freebies.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/macapps.json",
    "icon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "favicon": "https://styles.redditmedia.com/t5_2rt9r/styles/communityIcon_0uhxpv2hraf61.jpg",
    "items": [
        {
            "id": "17memua",
            "url": "/r/macapps/comments/17memua/is_there_an_app_that_lets_you_launch_and_quit_a/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17memua/is_there_an_app_that_lets_you_launch_and_quit_a/",
            "title": "Is there an app that lets you launch and quit a bunch of selected or grouped apps ?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17memua/is_there_an_app_that_lets_you_launch_and_quit_a/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17memua/is_there_an_app_that_lets_you_launch_and_quit_a/'>Reddit</a></caption><div><br></div><p>For example, I want to group apps for a specific context. I want to do software development work now, it opens apps I choose specific to that context - VS Code, Iterm2, Arc, Slack, etc. Another group could be writing - opens Notion, Arc, Email app, etc.</p>\n<p>&#x200B;</p>\n<p>I want to be able to quickly:</p>\n<ol>\n<li>open them up.</li>\n<li>close only those window them all as well</li>\n</ol>\n<p>&#x200B;</p>\n<p>Does something like this exist? Do people also have interest in this ?</p>",
            "date_published": "2023-11-02T21:42:11+00:00",
            "authors": [
                {
                    "name": "techsparrowlionpie",
                    "url": "https://www.reddit.com/user/techsparrowlionpie"
                }
            ]
        },
        {
            "id": "17le9i5",
            "url": "/r/macapps/comments/17le9i5/announcing_backdrop_the_wallpaper_engine_for_macos/",
            "external_url": "https://cindori.com/backdrop",
            "title": "Announcing Backdrop: The Wallpaper Engine for macOS",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17le9i5/announcing_backdrop_the_wallpaper_engine_for_macos/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17le9i5/announcing_backdrop_the_wallpaper_engine_for_macos/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-01T15:09:09+00:00",
            "authors": [
                {
                    "name": "Cindori",
                    "url": "https://www.reddit.com/user/Cindori"
                }
            ]
        },
        {
            "id": "17lfzpj",
            "url": "/r/macapps/comments/17lfzpj/music_decoy_stop_launching_the_music_app_whenever/",
            "external_url": "https://github.com/FuzzyIdeas/MusicDecoy",
            "title": "Music Decoy: Stop launching the Music app whenever you press ▶ Play",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17lfzpj/music_decoy_stop_launching_the_music_app_whenever/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17lfzpj/music_decoy_stop_launching_the_music_app_whenever/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-01T16:27:19+00:00",
            "authors": [
                {
                    "name": "alin23",
                    "url": "https://www.reddit.com/user/alin23"
                }
            ]
        },
        {
            "id": "17lcve8",
            "url": "/r/macapps/comments/17lcve8/building_a_mac_app_to_help_designers_prototype/",
            "external_url": "https://v.redd.it/0cux14pmtqxb1",
            "title": "Building a mac app to help designers prototype for AR/VR experiences!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17lcve8/building_a_mac_app_to_help_designers_prototype/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17lcve8/building_a_mac_app_to_help_designers_prototype/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-01T14:04:00+00:00",
            "authors": [
                {
                    "name": "v-mohan",
                    "url": "https://www.reddit.com/user/v-mohan"
                }
            ]
        },
        {
            "id": "17kt3gs",
            "url": "/r/macapps/comments/17kt3gs/10_macos_free_or_low_cost_apps_that_help_me_every/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17kt3gs/10_macos_free_or_low_cost_apps_that_help_me_every/",
            "title": "10 MacOS Free or low cost Apps that help me every day",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17kt3gs/10_macos_free_or_low_cost_apps_that_help_me_every/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17kt3gs/10_macos_free_or_low_cost_apps_that_help_me_every/'>Reddit</a></caption><div><br></div><p>I am relatively new to the Mac world compared to some other folks going for decades. I found some great apps with nice interfaces and great functionality. Some are free, while others are reasonably priced. I will list the ones I like the most here, but ideally it would be awesome if you can also share your recommendations too 😉</p>\n<p><a href=\"https://apps.apple.com/us/app/command-x/id6448461551?mt=12\">Command X</a> – FREE. When I switched from Windows to MacOS, one of the most painful things was to re-wire my brain that CTRL+X and CTRL+V would not work for everything as on Windows. After I gave up that I would not get use to it (because I keep on working with Windows machines) is when Command X came here to save me. This together with <a href=\"https://support.apple.com/guide/mac-help/change-the-behavior-of-the-modifier-keys-mchlp1011/mac\">modifier keys</a> natively on the Mac.</p>\n<p><a href=\"https://clipgrab.org/\">ClibGrab</a> – FREE. Sometimes you need to download videos from different websites like YouTube, Vimeo, Facebook and other sites, this nice app helps you download them very easily.</p>\n<p><a href=\"https://apps.apple.com/us/app/magnet/id441258766?mt=12\">Magnet</a> – USD 10 (one time) Magnet allows you to re-arrange multiple screens easily around your screens. Saving you a lot of time.</p>\n<p><a href=\"https://maccy.app/\">Maccy</a> – USD 10 (one time) This app gives you all the flexibility you need from a Clipboard Manager. Never again regret not pasting that thing you had on the clipboard, just check the whole clipboard history by pressing one button.</p>\n<p><a href=\"https://www.videolan.org/vlc/\">VLC Player –</a> FREE The VLC Player has been the multimedia player of choice of millions of people on Windows and Mac is not the exception. A classic that works very smoothly and offers a lot of benefits.</p>\n<p><a href=\"https://www.audacityteam.org/\">Audacity</a> – FREE Recording audio doesn’t have to be difficult, I´ve been using Audacity and creating MP3 files for video production or other use cases. Super simple and has a lot of funcionalities, effects, etc.</p>\n<p><a href=\"https://apps.apple.com/us/app/photosweeper/id463362050?mt=12\">PhotoSweeper</a> – USD 10 (one time) I have a large amount of digital pictures that I´ve taken over the years. This great app has helped me a lot to save storage space and organize my library. It offers a lot of flexibility: you can delete exact images, also similar images and then decide which ones to delete.</p>\n<p><a href=\"https://handbrake.fr/\">HandBrake</a> – FREE You need to convert or transcode video files across different formats? Check this multi-platform free option.</p>\n<p><a href=\"https://goodsnooze.gumroad.com/?a=267231699&amp;gclid=Cj0KCQjwqP2pBhDMARIsAJQ0CzrtdNSzyW7J2QnafnyzdPSO1KuAbeaM48ho2QAzRSholzeO_w14IqwaAh2xEALw_wcB\">Several Apps from Jordi Bruin</a>: Jordi is an Independent Developer with an amazing skillset to create beautiful and simple apps that just work. He is constantly working on all of them, improving them and adding functionality. Some of them are Free, some have a cost, but usually they are very affordable.</p>\n<p><a href=\"https://www.corecode.io/macupdater/\">MacUpdater 3</a>– Free &amp; From: USD 15 (one time) MacUpdater is a very cool App that allows you to keep most of the Apps you have on your Mac automatically updated. Even those that were not downloaded through the Mac App Store. Its free if you want to keep up to 10 Apps updated, or USD 15 for a Standard Edition license. There are some other options too like Family Pro License for USD 35. It works very well.</p>\n<p>What about your preferred apps? Let’s build the ultimate list of cool apps that are Free or that have a friendly price 😉</p>",
            "date_published": "2023-10-31T19:24:05+00:00",
            "authors": [
                {
                    "name": "fscheps",
                    "url": "https://www.reddit.com/user/fscheps"
                }
            ]
        },
        {
            "id": "17kh5wu",
            "url": "/r/macapps/comments/17kh5wu/what_apps_would_you_love_to_have_that_dont_exist/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17kh5wu/what_apps_would_you_love_to_have_that_dont_exist/",
            "title": "What Apps Would You Love To Have That Don’t Exist Yet?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17kh5wu/what_apps_would_you_love_to_have_that_dont_exist/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17kh5wu/what_apps_would_you_love_to_have_that_dont_exist/'>Reddit</a></caption><div><br></div><p>Just what utility/app would u all love and what would u pay for it?</p>",
            "date_published": "2023-10-31T09:39:57+00:00",
            "authors": [
                {
                    "name": "danmartinvela",
                    "url": "https://www.reddit.com/user/danmartinvela"
                }
            ]
        },
        {
            "id": "17k27mj",
            "url": "/r/macapps/comments/17k27mj/my_apple_note_taking_journey/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17k27mj/my_apple_note_taking_journey/",
            "title": "My Apple Note Taking Journey",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17k27mj/my_apple_note_taking_journey/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17k27mj/my_apple_note_taking_journey/'>Reddit</a></caption><div><br></div><p>Apple Notes has gotten really good over the last few years. But it had two major issues for me:</p>\n<ol>\n<li>There was no way to easily get your notes OUT OF Apple Notes</li>\n<li>There was no \"web clipper\" plugin that could scrape a web page and make it a Note</li>\n<li>It wasn't cross-platform (I needed Mac, iOS and Linux).</li>\n</ol>\n<p>So, this sent me down a bit of a rabbit hole.</p>\n<h2>Joplin</h2>\n<p>I first tried Joplin. I liked the desktop app, but did not like the mobile app. The split view in the desktop app was less than appealing, but it was completely free. So I wasn't complaining.</p>\n<h2>Obsidian</h2>\n<p>I next tried Obsidian.  I liked the desktop app, but I hated the mobile app. Having the markdown hidden and only displayed when editing a line was a huge improvement. The plugin system was very nice. But the mobile app on my iPhone was pretty painful to use.</p>\n<h2>Loqseq</h2>\n<p>I dipped my toes in Logseq, but was not happy with how it worked, so I gave up on it pretty quickly. After watching a few lengthy videos, I realized it just wasn't for me.</p>\n<h2>Bear Notes</h2>\n<p>Next I tried Bear Notes.  I liked that it was Markdown-based. I liked the UI. The iOS apps were nice. The Markdown was hidden, just like in Obsidian. It even had a web clipper plugin. I bought a $15.00/year subscription and used it for a few months. The app wasn't cross platform. But at this point I owned a MacBook Pro, a Mac mini, an iPhone, an iPad, a Homepod mini and an Apple Watch. The need for a cross-platform solution didn't exist any more. As much as I liked Bear Notes, it had 2 problems:</p>\n<ol>\n<li>It was not end-to-end encrypted even with Advanced Data Protection on.</li>\n<li>There was a subscription.  $15 a year was not a lot. But the price went up to $30 a year. I was grandfathered in. But still it was a subscription.</li>\n</ol>\n<h2>fsnotes</h2>\n<p>fsnotes had a lot going for it.  It was markdown-based. It was open source and free, or you could buy it in the app store to support the developer. It had a nice preview mode. It was a fast native app that used iCloud Drive for syncing, so it was end-to-end encrypted if Advanced Data Protection was turned on.</p>\n<p>I used fsnotes for a good 6 months and was pretty happy with it, but:</p>\n<ol>\n<li>There was no web clipper for it.</li>\n<li>When you pasted text into it, it didn't auto-convert it into Markdown.</li>\n</ol>\n<h2>Upnote</h2>\n<p>Another interesting app.  This one IS cross platform, and you can subscribe or buy a \"lifetime subscription.\" The UI is very nice. The mobile apps are nice, and you get web clipper plugins.</p>\n<p>I signed up the $0.99/month subscription and imported my notes.  Overall a nice app, except:</p>\n<ol>\n<li>The data is not end-to-end encrypted and they have no plans to support it.</li>\n<li>I run Fedora Silverblue which requires all apps be Flatpaks, and Upnote only offers their app as an AppImage and a Snap.</li>\n</ol>\n<p>So, my #1 reason for checking out this app, the Linux support, didn't work for me.</p>\n<p>If you need a cross-platform note taking app, and don't care about end-to-end encryption, this is a solid choice.</p>\n<h2>Apple Notes</h2>\n<p>Now, after this long journey, I have all my notes in Apple Notes. Here is why:</p>\n<ol>\n<li>Apple Notes is free. It comes with every Mac and every iPhone/iPad.</li>\n<li>Apple Notes is end-to-end encrypted if you have Advanced Data Protection turned on.</li>\n<li>My wife uses a Mac and iPhone too. So it's dead simple to share notes with her.</li>\n</ol>\n<p>Here is how I worked around some of the limitations I had with Apple Notes.</p>\n<ol>\n<li>There is an app in the Mac App Store called Exporter. It will export ALL your Apple Notes, with attachments as Markdown. So, if you want to leave Apple Notes, it's a lot simpler to do so. I use Exporter once a week to export all my notes to Markdown and back them up to my NAS.</li>\n<li>The web clipper problem was easier than I thought. If I want to move a web page to Notes, I open it in Safari, click on the reader view icon. Then I press ⌘+A followed by ⌘+C to copy the whole page. Then I just paste it into a new note.  Everything comes over: formatting, images and link. Then I copy and paste the URL to the bottom of the page.</li>\n<li>As I said, my need for a cross-platform solution pretty much doesn't exist any more. But even if it does, I can easily open the Markdown file off my NAS. So I can at least see the data on another OS, even though I can't edit it.</li>\n</ol>\n<p>I also get these two benefits:</p>\n<ol>\n<li>My notes are now end-to-end encrypted.</li>\n<li>I can easily share them with my wife.</li>\n<li>Notes lets you \"scan\" documents by taking pictures of them, cropping them, and dumping them directly into Notes.</li>\n<li>No subscription fees</li>\n</ol>\n<p>I'm done now. No reason to go anywhere else. Now I need to spend time building a personal knowledgebase rather than wasting time hopping around different notes applications.</p>\n<p>One thing this experience has taught me is the importance of open standards. I would not have been able to do this hopping around if I wasn't able to exports my notes into an open format such as Markdown, RTF or HTML. Kind of ironic, since I ended up with Apple Notes.</p>\n<p>Apple Notes will let you import RTF and HTML notes, so it's easy to get notes into it. And the exporter tool will let me get notes out of it. If Exporter goes away, so does my use of Apple Notes. That's why I am backing up weekly to Markdown.</p>\n<p>I did look at some cross-platform end-to-end encrypted notes apps such as Standard Notes. But Standard Notes was $90/year and it was the cheapest of the options I looked at. That was just way too expensive.</p>\n<h2>Conclusion</h2>\n<p>This is my MY journey.  You may not like Apple Notes because of vendor lock in. But it is a credible choice with a nice feature set.</p>\n<p>If you've had a similar journey, please let me know your path and where you ended up.</p>",
            "date_published": "2023-10-30T20:02:14+00:00",
            "authors": [
                {
                    "name": "plazman30",
                    "url": "https://www.reddit.com/user/plazman30"
                }
            ]
        },
        {
            "id": "17jbmr2",
            "url": "/r/macapps/comments/17jbmr2/what_are_your_must_have_safari_extensions/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17jbmr2/what_are_your_must_have_safari_extensions/",
            "title": "What are your must have safari extensions?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17jbmr2/what_are_your_must_have_safari_extensions/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17jbmr2/what_are_your_must_have_safari_extensions/'>Reddit</a></caption><div><br></div><p>What are your must have safari extensions?</p>",
            "date_published": "2023-10-29T20:19:49+00:00",
            "authors": [
                {
                    "name": "Lekowski",
                    "url": "https://www.reddit.com/user/Lekowski"
                }
            ]
        },
        {
            "id": "17j4uac",
            "url": "/r/macapps/comments/17j4uac/i_made_an_app_that_combines_ai_and_mac_automation/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17j4uac/i_made_an_app_that_combines_ai_and_mac_automation/",
            "title": "I made an app that combines AI and Mac automation, would love some feedback!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17j4uac/i_made_an_app_that_combines_ai_and_mac_automation/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17j4uac/i_made_an_app_that_combines_ai_and_mac_automation/'>Reddit</a></caption><div><br></div><p>Hey everyone,</p>\n<p>With recent developments in AI, I have been very interested in using it to make my Mac automation simpler, more intuitive, and more powerful. This is how I ended up creating <a href=\"https://www.chatpc.ai/\">ChatPC</a>.</p>\n<p><strong>ChatPC allows you to use simple English to automate your Mac. It can manage files and interact with other Mac applications through Shortcuts and AppleScripts.</strong></p>\n<p>Check out this quick demo:</p>\n<p>https://reddit.com/link/17j4uac/video/wekn2asop5xb1/player</p>\n<p><strong>Safe by design -</strong> With ChatPC, you are in total control. By default, ChatPC cannot execute any actions on your Mac. You must explicitly give ChatPC access to the folders, Shortcuts, and AppleScripts that it can action on. In addition, you can configure which actions require your explicit approval before executing.</p>\n<p>I'm currently looking for beta testers to try out the app and give me feedback! The app is free to use up to some token limit. If you hit the limit, DM me with your initial thoughts and the email address you signed up with -- <strong>I'll be giving free coupons to the first 100 beta testers!</strong></p>\n<p>To get started, check out the <a href=\"https://www.chatpc.ai/docs/macos/getting-started/\">MacOS Getting Started Guide</a> (MacOS 13.0 or higher required).</p>",
            "date_published": "2023-10-29T15:04:55+00:00",
            "authors": [
                {
                    "name": "dounanshi",
                    "url": "https://www.reddit.com/user/dounanshi"
                }
            ]
        },
        {
            "id": "17irttl",
            "url": "/r/macapps/comments/17irttl/i_made_an_app_because_i_was_annoyed_that_my_mac/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17irttl/i_made_an_app_because_i_was_annoyed_that_my_mac/",
            "title": "I made an App because I was annoyed that my mac switched to my microphone automatically",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17irttl/i_made_an_app_because_i_was_annoyed_that_my_mac/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17irttl/i_made_an_app_because_i_was_annoyed_that_my_mac/'>Reddit</a></caption><div><br></div><p>Hi everyone !I was annoyed to switch away from my bluetooth headset microphone every time I connect it to my macbook so I made a tray App to block devices to be switched to !</p>\n<p><a href=\"https://github.com/jbgosselin/audio-device-blocker\">https://github.com/jbgosselin/audio-device-blocker</a></p>\n<p>Feel free to give it a shot and maybe even contribute if you feel like so, this is my first MacOS app and the first time I used Swift and SwiftUI so please be mindful of that.</p>\n<p>I use it daily for a little while and it just make my life easier, so why not make others life easier too !</p>",
            "date_published": "2023-10-29T01:04:15+00:00",
            "authors": [
                {
                    "name": "dennajort",
                    "url": "https://www.reddit.com/user/dennajort"
                }
            ]
        },
        {
            "id": "17iounr",
            "url": "/r/macapps/comments/17iounr/made_a_mac_app_that_organizes_your_files_in/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17iounr/made_a_mac_app_that_organizes_your_files_in/",
            "title": "Made a Mac app that organizes your files in folders using chatGPT",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17iounr/made_a_mac_app_that_organizes_your_files_in/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17iounr/made_a_mac_app_that_organizes_your_files_in/'>Reddit</a></caption><div><br></div><p>I never had the time to organize my downloads folder properly. And none of the available apps for folder organization utilized AI/LLMs and required manual configuration. That's why I made Sorted App.You can easily use your Open API key and select the folder you want to organize, and you're all set. It also has automatic sorting, which is especially helpful for your downloads folder. I have tested it for folder sizes as large as 2500 files and it has worked perfectly. Not going to lie, it has taken a ton of tweaking and optimizing.The files are only moved into other folders so there is no deleting of files.You can download it here at www.getsorted.ai</p>",
            "date_published": "2023-10-28T22:29:28+00:00",
            "authors": [
                {
                    "name": "MaxTwang",
                    "url": "https://www.reddit.com/user/MaxTwang"
                }
            ]
        },
        {
            "id": "17gso5j",
            "url": "/r/macapps/comments/17gso5j/lookaway_my_first_native_mac_app_to_combat/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17gso5j/lookaway_my_first_native_mac_app_to_combat/",
            "title": "LookAway – My first native mac app to combat digital eye strain",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17gso5j/lookaway_my_first_native_mac_app_to_combat/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17gso5j/lookaway_my_first_native_mac_app_to_combat/'>Reddit</a></caption><div><br></div><p>Hi Reddit! I'm Kushagra. I created LookAway after suffering from eye strain due to working for long hours staring at my screen.</p>\n<p>The app nudges you to take regular breaks by blurring the screen to help reduce eye strain. It gives a heads-up before each break so you can wrap up tasks, and you can adjust the break intervals and durations to fit your routine.</p>\n<p>LookAway is smart - it works when you work, pauses when you don't, and handles idle time intelligently. It also pauses automatically during calls or meetings. </p>\n<p>I’d love to hear your feedback to improve it. Check it out at https://lookaway.app. Thank you for your time!</p>",
            "date_published": "2023-10-26T09:37:09+00:00",
            "authors": [
                {
                    "name": "kushsolitary",
                    "url": "https://www.reddit.com/user/kushsolitary"
                }
            ]
        },
        {
            "id": "17ga4p8",
            "url": "/r/macapps/comments/17ga4p8/is_vlc_still_the_king_of_video_players/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17ga4p8/is_vlc_still_the_king_of_video_players/",
            "title": "Is VLC still the king of video players?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17ga4p8/is_vlc_still_the_king_of_video_players/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17ga4p8/is_vlc_still_the_king_of_video_players/'>Reddit</a></caption><div><br></div><p>I imagine there are several posts regarding this but I'm just too lazy to read all of them.</p>\n<p>Long story short, I've been using VLC for the better part of 20 years and I'm wondering if there's a more modern app that does the job just for the sake of using a more modern app :D.</p>\n<p>Some of the features I mostly use in VLC and would love to keep having are:</p>\n<p>- support for playlists / open folders / queue multiple videos<br />\n- multiple subtitles / audio tracks support<br />\n- possibly multiple instances (I have a script for VLC that can open it multiple times)<br />\n- support for modern codecs (HDR10+, DV) and containers (MKV and MP4 mainly)<br />\n- variable ratios, video adapts to window size<br />\n- network access<br />\n- photo slideshow</p>\n<p>I mean VLC is an old piece of software but it does A LOT.  </p>\n<p>I tryed IINA a few years ago and I hated it. But I see there are other players out there both free or paid. Fig Player, Omni Player, 5kplayer and so on.  </p>\n<p>Is there anything that actually beats VLC on capabilities and flexibility and has a more modern/mature interface? Or should I just stick to it (which is actually not a problem)</p>",
            "date_published": "2023-10-25T17:26:25+00:00",
            "authors": [
                {
                    "name": "zenotds",
                    "url": "https://www.reddit.com/user/zenotds"
                }
            ]
        },
        {
            "id": "17ga605",
            "url": "/r/macapps/comments/17ga605/screenmemory_now_available_free_trial_or_19/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17ga605/screenmemory_now_available_free_trial_or_19/",
            "title": "ScreenMemory now available (free trial or $19)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17ga605/screenmemory_now_available_free_trial_or_19/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17ga605/screenmemory_now_available_free_trial_or_19/'>Reddit</a></caption><div><br></div><p>Hello, some 3 weeks ago I posted <a href=\"https://www.reddit.com/r/macapps/comments/173134q/working_on_a_rewindaiish_application_anyone_want/\">this thread</a> on this subreddit and I got a lot of feedback. Bug and general user experience has been resolved, and I now have a sizable backlog of things to implement.</p>\n<p>In short - ScreenMemory is an app that takes screenshot of your screen(s) and then lets you rewind time to look back at it. Useful to see what you did during the day, track time if you're a freelancer or work, compare something you worked on, find lost information, etc. I have a lot of use cases on the website (<a href=\"https://screenmemory.app/\">https://screenmemory.app</a>).</p>\n<p>Here's the app in action, you can see I was working on things a couple of days ago between 2pm-3pm, and later 8.30pm-9.30pm (just as an illustration of how you can track time).</p>\n<p>https://preview.redd.it/zlle34vkudwb1.png?width=2174&amp;format=png&amp;auto=webp&amp;s=7dd9898f971fc712a382ea3f1fc4b9174847bab9</p>\n<p>I read some quote today that, if you're not embarrassed by your 1.0 version, you've launched too late. I'm already at 1.5.1 but I'm still a bit embarrassed. I have features and polish to implement, but I figured I should at least launch somewhat 'officially' since it works really well.</p>\n<p>The app is paid, at <strong>$19</strong> currently. I am still not sure what the final price will be, suggestions are welcome. It is usable in free mode, with some heavy limitations but it should show how the app works for you to make a decision, at least.</p>\n<p>The website is here: <a href=\"https://screenmemory.app/\">https://screenmemory.app/</a> and it has <em>some</em> more info.</p>",
            "date_published": "2023-10-25T17:27:57+00:00",
            "authors": [
                {
                    "name": "jontelang",
                    "url": "https://www.reddit.com/user/jontelang"
                }
            ]
        },
        {
            "id": "17f9woi",
            "url": "/r/macapps/comments/17f9woi/keyboardmaestro_11_now_available/",
            "external_url": "https://www.stairways.com/press/2023-10-24",
            "title": "KeyboardMaestro 11 now available!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17f9woi/keyboardmaestro_11_now_available/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17f9woi/keyboardmaestro_11_now_available/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-24T10:50:39+00:00",
            "authors": [
                {
                    "name": "jmtamere",
                    "url": "https://www.reddit.com/user/jmtamere"
                }
            ]
        },
        {
            "id": "17ezcj7",
            "url": "/r/macapps/comments/17ezcj7/bettertouchtool_introducing_floating_menus/",
            "external_url": "https://www.macstories.net/sponsored/bettertouchtool-introducing-floating-menus-sponsor/",
            "title": "BetterTouchTool: Introducing Floating Menus",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17ezcj7/bettertouchtool_introducing_floating_menus/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17ezcj7/bettertouchtool_introducing_floating_menus/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-24T00:11:43+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "17eskn4",
            "url": "/r/macapps/comments/17eskn4/proton_pass_plus_free_for_12_months/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17eskn4/proton_pass_plus_free_for_12_months/",
            "title": "Proton Pass Plus free for 12 months",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17eskn4/proton_pass_plus_free_for_12_months/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17eskn4/proton_pass_plus_free_for_12_months/'>Reddit</a></caption><div><br></div><p>As a reaction for Dashlane's move to limit their free tier to 25 passwords only, Proton made their Premium version of Proton Pass - Plus, free for 12 months for all users. More info here:</p>\n<p><a href=\"https://proton.me/blog/dashlane-alternative\">https://proton.me/blog/dashlane-alternative</a></p>\n<p>Offer valid until end of October.</p>",
            "date_published": "2023-10-23T19:19:11+00:00",
            "authors": [
                {
                    "name": "QenTox",
                    "url": "https://www.reddit.com/user/QenTox"
                }
            ]
        },
        {
            "id": "17cqalt",
            "url": "/r/macapps/comments/17cqalt/project_white_rabbit_an_ai_web_browser_copilot/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17cqalt/project_white_rabbit_an_ai_web_browser_copilot/",
            "title": "Project White Rabbit 🐇 - An AI web browser copilot that helps organize your tabs and notes",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17cqalt/project_white_rabbit_an_ai_web_browser_copilot/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17cqalt/project_white_rabbit_an_ai_web_browser_copilot/'>Reddit</a></caption><div><br></div><p>👋 Hey r/macapps community! I'm really excited about a new product called <a href=\"https://www.pwr.builders/\">Project White Rabbit (PWR)</a>.</p>\n<p>I've been obsessing over the productivity space for years, and as I'm sure you've seen things have been picking up a lot this year because of all the AI progress. This is the first \"productivity\" app that I've started using regularly, because it's deeply integrated into my workflow. Curious what you all think of it, and if there are other similar products you use.</p>\n<p>PWR addresses a few problems:</p>\n<ul>\n<li>you have a ton of browser tabs open, and you don't remember how they are connected to each other or which ones you still need</li>\n<li>your tabs are disconnected from each other and from all the notes and things you write</li>\n<li>you have to keep re-searching for things online, and don't remember what you've already seen</li>\n</ul>\n<p>A few reasons why I like it:</p>\n<ul>\n<li>all my tabs and notes are embedded together, with the context I need</li>\n<li>helps me quickly group tabs, save the ones I want, and close the ones I don't need</li>\n<li>it's entirely private - your data never leaves your computer without your permission</li>\n<li>it's not just another chatGPT wrapper, but actually has some interesting AI under the hood (I've also followed product updates for a while and seems like there are some pretty useful AI features coming soon)</li>\n</ul>\n<p>It's still in beta, but I still find it more than good enough for daily use. Hope you like it!</p>\n<p><a href=\"https://www.pwr.builders/\">https://www.pwr.builders</a> to download the Mac app and learn more</p>\n<p>PS - I also love the nods to The Matrix 🕳️🐇</p>\n<p>https://preview.redd.it/in1abc4jdgvb1.png?width=1154&amp;format=png&amp;auto=webp&amp;s=b6f2478818b0c6f889e9931409e2c63f63b4e4fc</p>",
            "date_published": "2023-10-21T00:48:29+00:00",
            "authors": [
                {
                    "name": "DEngiVerLI",
                    "url": "https://www.reddit.com/user/DEngiVerLI"
                }
            ]
        },
        {
            "id": "17bfz41",
            "url": "/r/macapps/comments/17bfz41/i_built_an_app_to_turn_plain_screen_recordings/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17bfz41/i_built_an_app_to_turn_plain_screen_recordings/",
            "title": "I built an app to turn plain screen recordings into stunning demo/promo videos automatically. Any thoughts on it?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17bfz41/i_built_an_app_to_turn_plain_screen_recordings/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17bfz41/i_built_an_app_to_turn_plain_screen_recordings/'>Reddit</a></caption><div><br></div><p>Hey guys,</p>\n<p>For the past 3 months, I’ve been making a screen recording app with auto-editing features. It’s built for everyone (including me) who’s got no video editing skills to create captivating tutorial, promo, sales, and demo videos in minutes.</p>\n<p>As a startup team, we know the struggle of needing high-quality product videos without breaking the bank. Hiring a professional can cost hundreds of $ for each video, and creating a just-so-so video ourselves consumes precious hours. It’s a huge cost for us, either in terms of money or time.</p>\n<p>That’s why we built FocuSee, hoping to make post-production easier, smoother, and as friendly as possible for non-professionals.</p>\n<p><strong>How it works?</strong></p>\n<ul>\n<li>Simply record your screen (with webcam and mic) as you usually do</li>\n<li>FocuSee automatically adds pan &amp; zoom effects, and a nice background. So <strong>once finishing recording, you'll have a video ready to shine</strong></li>\n<li>Export it as video/GIF locally, share it via a link, or embed it anywhere</li>\n<li>You can even add in-video quizzes, forms, and call-to-action buttons to generate leads or get feedback more efficiently. (This feature is available for videos shared online)</li>\n</ul>\n<p><a href=\"https://reddit.com/link/17bfz41/video/yf1zj9mpz4vb1/player\">FocuSee Demo Video</a></p>\n<p>Also, you can make personalized adjustments easily:</p>\n<ul>\n<li>Add extra highlights to focal points with Spotlight to draw the audience's attention</li>\n<li>Choose the selfie and screen layout based on your use case: side-by-side, overlay, or screen-only</li>\n<li>Pick from 8 mouse cursor styles and 3 button click effects to match your video's style</li>\n<li>Change the background, rounded corners, shadow, inset, and padding as you like</li>\n<li>And more…</li>\n</ul>\n<p>We're offering a <a href=\"https://gemoo.com/focusee/\">free trial</a> for both Windows and Mac, with which you can explore all features and export one watermarked video for free. Your feedback is gold to us, and we'd be highly grateful for your insights.</p>\n<p>If you find FocuSee useful, please let me know, and I’d love to offer you an additional 30% off exclusive discount on top of our current early bird offer, as a reward for your support!</p>\n<p>Thanks in advance!</p>",
            "date_published": "2023-10-19T10:30:09+00:00",
            "authors": [
                {
                    "name": "Jocie712",
                    "url": "https://www.reddit.com/user/Jocie712"
                }
            ]
        },
        {
            "id": "179u4m2",
            "url": "/r/macapps/comments/179u4m2/i_built_a_cleanmymacx_alternative_for_developers/",
            "external_url": "https://www.reddit.com/r/macapps/comments/179u4m2/i_built_a_cleanmymacx_alternative_for_developers/",
            "title": "I built a CleanMyMacX alternative for developers",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/179u4m2/i_built_a_cleanmymacx_alternative_for_developers/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/179u4m2/i_built_a_cleanmymacx_alternative_for_developers/'>Reddit</a></caption><div><br></div><p>Hey r/macapps crew,</p>\n<p>My first Mac had a measly 125 GB of storage, and I've been wrestling with disk space issues ever since. Tools like CleanMyMacX helped but couldn't spot the files I knew were cluttering things—node_modules, caches, and old project files.</p>\n<p>So, I created Roomy, an honest-to-goodness macOS app designed by a dev for devs. It's all about decluttering and optimizing your workspace without the fluff.</p>\n<p>🚀 Try Roomy Alpha: <a href=\"https://tdermendjievft.gumroad.com/l/roomy-alpha\">Gumroad</a> <a href=\"https://github.com/tdermendjiev/Roomy/releases/tag/0.2.1\">GitHub</a></p>\n<p>Roomy currently tackles Xcode and JavaScript-related files. For JavaScript, just set your workspace path in Settings.</p>\n<p>&#x200B;</p>\n<p>https://preview.redd.it/lb8de6vpbqub1.png?width=2204&amp;format=png&amp;auto=webp&amp;s=498b83455516e7794039d9b48eb76d8f7197e54c</p>\n<p>Check Scan-&gt;Javascript to see how much space your node_modules, build files, and caches are eating up project by project.</p>\n<p>https://preview.redd.it/jcyv4qmrbqub1.png?width=2204&amp;format=png&amp;auto=webp&amp;s=06e8d76acb9c9026e510d60c8bf7efd38046c40f</p>\n<p>Scan-&gt;Xcode on my machine shows this:</p>\n<p>https://preview.redd.it/fzuqtpcubqub1.png?width=2196&amp;format=png&amp;auto=webp&amp;s=53f4059e67dcda2e21452e72266325c284ded6cf</p>\n<p>I'm constantly improving Roomy, and your feedback is gold. Let me know if it simplifies your developer life and what you'd love to see next.</p>",
            "date_published": "2023-10-17T09:11:55+00:00",
            "authors": [
                {
                    "name": "mdm_r",
                    "url": "https://www.reddit.com/user/mdm_r"
                }
            ]
        },
        {
            "id": "179743e",
            "url": "/r/macapps/comments/179743e/i_built_an_allinone_desktop_app_with_a_nobs/",
            "external_url": "https://www.reddit.com/r/macapps/comments/179743e/i_built_an_allinone_desktop_app_with_a_nobs/",
            "title": "I built an all-in-one desktop app with a no-BS approach to getting work done",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/179743e/i_built_an_allinone_desktop_app_with_a_nobs/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/179743e/i_built_an_allinone_desktop_app_with_a_nobs/'>Reddit</a></caption><div><br></div><p>Hello r/macapps community! After being overwhelmed with the number of tools we use every day to get work done, I built a single desktop app to streamline the entire process of working, from logging in at 9 a.m. to logging out at 5 p.m. I've adopted a no-BS approach, which means it eliminates everything unnecessary and distracting in our workflow, and offers a simple way to work with maximum efficiency, focus, and organization.</p>\n<p>It will make you rethink the way you work today.</p>\n<p>Please check out the website to see screenshots, learn more, and download the app: <a href=\"https://www.floutwork.com/?ref=reddit\">https://www.floutwork.com</a></p>\n<p>&#x200B;</p>\n<p>https://preview.redd.it/btqy3b1lpkub1.png?width=1152&amp;format=png&amp;auto=webp&amp;s=0c4f4d8f6534f0cbb6951869516e31ceea514cc2</p>\n<p>&#x200B;</p>\n<p>&#x200B;</p>",
            "date_published": "2023-10-16T14:21:29+00:00",
            "authors": [
                {
                    "name": "daniel_sushil",
                    "url": "https://www.reddit.com/user/daniel_sushil"
                }
            ]
        },
        {
            "id": "178y254",
            "url": "/r/macapps/comments/178y254/swiftguard_antiforensic_macos_app_to_safeguard/",
            "external_url": "https://www.reddit.com/r/macapps/comments/178y254/swiftguard_antiforensic_macos_app_to_safeguard/",
            "title": "swiftGuard - Anti-forensic macOS app to safeguard your USB ports",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/178y254/swiftguard_antiforensic_macos_app_to_safeguard/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/178y254/swiftguard_antiforensic_macos_app_to_safeguard/'>Reddit</a></caption><div><br></div><p>&#x200B;</p>\n<p>https://preview.redd.it/swnpjeejvhub1.png?width=1000&amp;format=png&amp;auto=webp&amp;s=386ab37f31cfe8947e47a229451c19fd83153ab5</p>\n<p>Anti-forensic macOS tray application designed to safeguard your system by monitoring USB ports. It ensures your device's security by automatically initiating either a system shutdown or hibernation if an unauthorized device connects or a connected device is unplugged. It offers the flexibility to whitelist designated devices, to select an action to be executed and to set a countdown timer, allowing to disarm the shutdown process.</p>\n<h1>What it offers</h1>\n<ul>\n<li><strong>Monitoring:</strong> Continuously monitors USB ports for device activity, even in sleep mode.</li>\n<li><strong>Whitelisting:</strong> Allows users to whitelist authorized devices, ensuring hassle-free connectivity.</li>\n<li><strong>Discrete:</strong> Operates in the macOS system tray, minimizing interruptions.</li>\n<li><strong>Customizable:</strong> Allows users to configure various settings, including action (shutdown/hibernate), countdown timer and whitelist.</li>\n<li><strong>Lightweight:</strong> Designed to consume minimal system resources for optimal performance.</li>\n<li><strong>Privacy:</strong> Does not require an internet connection, ensuring the privacy of your data.</li>\n<li><strong>Open Source:</strong> Provides transparency and allows community contributions for continuous development.</li>\n</ul>\n<h2>See it in Action!</h2>\n<p>https://preview.redd.it/7tbu7jaovhub1.png?width=1200&amp;format=png&amp;auto=webp&amp;s=99956eb28b1964efda0f7c5720a374ee2a795aff</p>\n<h2>Why should You care?</h2>\n<p>A few reasons to use this tool:</p>\n<ul>\n<li><strong>Anti-Forensic Measures:</strong> In case the police or other thugs break in. The police often use a mouse jiggler to prevent the screen saver or sleep mode from being activated.</li>\n<li><strong>Prevent Data Exfiltration:</strong> You do not want someone adding or copying documents to or from your computer via USB.</li>\n<li><strong>Public Environments:</strong> If you frequently use your Mac in public places like libraries or cafes, swiftGuard acts as an additional layer of security against physical attacks in a potentially vulnerable setting.</li>\n<li><strong>Server Protection:</strong> You want to improve the security of your home or company server (e.g. your Raspberry Pi, NAS, etc.).</li>\n<li><strong>Data Protection Regulations:</strong> Many industries and organizations are subject to strict data protection regulations. swiftGuard helps maintain compliance by preventing unauthorized data transfers and access through USB ports.</li>\n</ul>\n<blockquote>\n<p><strong>Tip</strong>: You might also want to use a cord to attach a USB key to your wrist. Then plug the key into your computer and run swiftGuard. If your computer is robbed, the USB is removed and the computer shuts down immediately.</p>\n</blockquote>\n<h2>What Features are planned next?</h2>\n<ul>\n<li><strong>Bluetooth:</strong> If a Bluetooth Device (tries to) connect(s), or if a new Bt Device comes near you MacBook, swiftGuard will shutdown/hibernate.</li>\n<li><strong>More Actions:</strong> When it detects a Manipulation swiftGuard is able to delete or encrypt files/folders, wipe ram, send an email notification, ...)</li>\n<li><strong>Custom Actions:</strong> You can define custom shell/python commands to be executed, e.g., run a script.</li>\n<li><strong>Linux Support:</strong> Cross-platform support.</li>\n<li><strong>Encryption:</strong> More security on top, with password protected configuration and defusing.</li>\n<li><strong>Auto Start/Update:</strong> I think this one is clear.</li>\n</ul>\n<p>&#x200B;</p>\n<h2>Getting started!</h2>\n<p>Visit the <a href=\"https://github.com/Lennolium/swiftGuard\">GitHub Repository</a> to explore the code, contribute to development, or download the latest release.</p>",
            "date_published": "2023-10-16T04:47:02+00:00",
            "authors": [
                {
                    "name": "smoGGGGG",
                    "url": "https://www.reddit.com/user/smoGGGGG"
                }
            ]
        },
        {
            "id": "178bgqc",
            "url": "/r/macapps/comments/178bgqc/one_task_conquer_one_task_at_a_time/",
            "external_url": "https://apps.apple.com/app/one-task/id6465745322",
            "title": "One Task — Conquer one task at a time",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/178bgqc/one_task_conquer_one_task_at_a_time/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/178bgqc/one_task_conquer_one_task_at_a_time/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-15T09:08:20+00:00",
            "authors": [
                {
                    "name": "sindresorhus",
                    "url": "https://www.reddit.com/user/sindresorhus"
                }
            ]
        },
        {
            "id": "177iixz",
            "url": "/r/macapps/comments/177iixz/just_a_small_update_to_a_mac_app_i_wrote_8_months/",
            "external_url": "https://www.reddit.com/r/macapps/comments/177iixz/just_a_small_update_to_a_mac_app_i_wrote_8_months/",
            "title": "🥦Just a small update to a mac app I wrote 8 months ago: NEW FREE function added",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/177iixz/just_a_small_update_to_a_mac_app_i_wrote_8_months/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/177iixz/just_a_small_update_to_a_mac_app_i_wrote_8_months/'>Reddit</a></caption><div><br></div><p>On February 2023 I wrote Broccoli, a macOS app for AI chat. I know there are sooooo many apps of the same kind, so I thought it was out of date. But recently when I want to use inline input function (which is to input the answer got in the first round with AI to the cursor position), I found that there is nearly no one easy to use. It's in the first week of October and I updated my app to support this function. </p>\n<p>I feel disappointed at the situation that we are so impressed by the fact that AI tools are just ENOUGH, but when we take a closer look at it, we will find the useful ones are still in need. I will pick some to show you as for inline input function: </p>\n<ul>\n<li>MacGPT can do this, but it cannot let users to define the HOST/ENDPOINT</li>\n<li>PopClip: same as above</li>\n<li>BoltAI: can do this and can customize HOST/ENDPOINT, but is paid for $29</li>\n<li>Notion or Obsidian extension? Notion is paid and I don't know if Obsidian extension can do both.</li>\n</ul>\n<p>I do think the apps above are quite good apps and I adore them. But I just want this function with customizable HOST/ENDPOINT and in a fair price, better to be free. So to this point, I think Broccoli can do what I need and if you are in search of a similar one, maybe you can try my app! So I'm here~</p>\n<p>What is good about Broccoli🥦:\n- The tool is free, although you might need to use the paid service from OpenAI\n- You can customize the HOST/ENDPOINT to a third party provider of OpenAI service\n- After you use the inline input, you can choose whether to continue asking in the chat window (don't forget to choose remember history), which is not supported by most apps (I need that so I added it)\n- There are so many basic functions that you might like, including reading a TXT or DOCX file\n- And I'm very proud that I made its UI animation different from most apps, which can float on every space</p>\n<p>I will paste the link here and I will appreciated it if you come to see my work😊</p>\n<p><a href=\"https://github.com/Ryan-the-hito/Broccoli\">GitHub</a></p>\n<p>PS: The GitHub page is basically Chinese and I'm a student in university working on my dissertation right now. So I will update it into English when I get rid of the papers...🥲</p>",
            "date_published": "2023-10-14T05:44:52+00:00",
            "authors": [
                {
                    "name": "Plenty-Reference69",
                    "url": "https://www.reddit.com/user/Plenty-Reference69"
                }
            ]
        },
        {
            "id": "176u95h",
            "url": "/r/macapps/comments/176u95h/just_launched_v2_of_ejimo_the_ultimate_emoji/",
            "external_url": "https://www.reddit.com/r/macapps/comments/176u95h/just_launched_v2_of_ejimo_the_ultimate_emoji/",
            "title": "🎉 Just Launched v2 of Ejimo: The Ultimate Emoji, Kaomoji, and Symbol Picker – Now with Kaomoji Support!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/176u95h/just_launched_v2_of_ejimo_the_ultimate_emoji/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/176u95h/just_launched_v2_of_ejimo_the_ultimate_emoji/'>Reddit</a></caption><div><br></div><p>Hey macOS aficionados! 🍏 Just rolled out v2 of my app, Ejimo, and I'm excited to showcase it here on r/MacApps. If your Mac's emoji game needs leveling up, or if you've ever been on the hunt for the perfect symbol or kaomoji, then this might just become your next favorite tool.</p>\n<p>🔹 <strong>What is Ejimo?</strong></p>\n<p>Ejimo is your go-to source for over 3000 emojis, symbols, and now – kaomoji! (ノ◕ヮ◕)ノ*:・゚✧. Whether you're crafting a tweet, sprucing up a presentation, or coding your next big project, Ejimo has you covered. Here's what it offers:</p>\n<ul>\n<li>😊 <strong>Huge Library</strong>: 1800+ emojis, 17000+ symbols - from smileys 😃 to punctuation ⁈.</li>\n<li>✏️ <strong>Hassle-Free Copy-Paste</strong>: Just click, copy, and you're good to go!</li>\n<li>🔍 <strong>Swift Search</strong>: Type in a keyword, and watch Ejimo bring up all related emojis and symbols.</li>\n<li>☀️ <strong>Light &amp; Dark Themes</strong>: Toggle based on your mood or aesthetic.</li>\n<li>✈️ <strong>Offline Capabilities</strong>: No internet? No problem.</li>\n<li>🕶️ <strong>Your Privacy Matters</strong>: We don't snoop. Period.</li>\n<li>⌨️ <strong>Keyboard Shortcuts</strong>: Speed up your workflow.</li>\n</ul>\n<p>🔹 <strong>Compatibility</strong>: Whether you're on macOS 🍏, Windows 🪟, Linux 🐧, iOS 📱, Android 🤖, or just browsing the Web 🌐 – Ejimo has got your back.</p>\n<p>🔹 <strong>Open Source ❤️</strong>: For all you developers out there, the project is open source! You can check out the code, contribute, or maybe even fork it for your own uses: <a href=\"https://github.com/albemala/emoji-picker\">Ejimo on GitHub</a>.</p>\n<p>🔹 <strong>Download</strong>: The best part? It's <strong>FREE</strong>. You can get Ejimo on:</p>\n<ul>\n<li><a href=\"https://ejimo-app.web.app\">Web</a></li>\n<li><a href=\"https://apps.apple.com/us/app/ejimo/id1598944603\">macOS App Store</a></li>\n<li><a href=\"https://apps.microsoft.com/store/detail/ejimo/9PF0Q1XP8LCX\">Windows Store</a></li>\n<li><a href=\"https://apps.apple.com/us/app/ejimo/id1598944603\">iOS App Store</a></li>\n<li><a href=\"https://play.google.com/store/apps/details?id=me.albemala.ejimo\">Android Play Store</a></li>\n<li>Linux Snap Store (Coming Soon!)</li>\n</ul>\n<p>Would love to hear your thoughts, feedback, or any feature requests. Thanks for checking it out and happy emoji hunting! 😄🎉👩‍💻👨‍💻</p>\n<p>-- albemala</p>\n<p>&#x200B;</p>\n<p>https://preview.redd.it/t0qm384foxtb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=f717f258baee4f3b23e85c1a8d879621fbe04e0c</p>\n<p>https://preview.redd.it/4kfcg44foxtb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=8e7ec413b19223d5201db542115189a1d96495eb</p>\n<p>https://preview.redd.it/xvbe834foxtb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=d4a6d63bc99532b212b0d8b04b43780d6d1ed24f</p>",
            "date_published": "2023-10-13T08:51:01+00:00",
            "authors": [
                {
                    "name": "albemala",
                    "url": "https://www.reddit.com/user/albemala"
                }
            ]
        },
        {
            "id": "175x1uo",
            "url": "/r/macapps/comments/175x1uo/spacedrive_one_explorer_all_your_files/",
            "external_url": "https://www.spacedrive.com/",
            "title": "Spacedrive One Explorer. All Your Files.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/175x1uo/spacedrive_one_explorer_all_your_files/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/175x1uo/spacedrive_one_explorer_all_your_files/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-12T03:21:38+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "175ei2w",
            "url": "/r/macapps/comments/175ei2w/maccy_no_longer_works_for_macos_sonoma_any_new/",
            "external_url": "https://www.reddit.com/r/macapps/comments/175ei2w/maccy_no_longer_works_for_macos_sonoma_any_new/",
            "title": "Maccy no longer works for MacOS Sonoma. Any new recommendations?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/175ei2w/maccy_no_longer_works_for_macos_sonoma_any_new/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/175ei2w/maccy_no_longer_works_for_macos_sonoma_any_new/'>Reddit</a></caption><div><br></div><p>Hi, love this app but it no longer copies my clipboard, using macos sonoma in m1 mac. Any recommendations? Need a free and fast one like Maccy  </p>\n<p>RESOLVED! I go to this link to download the beta version  </p>\n<p><a href=\"https://github.com/p0deje/Maccy/files/12327821/Maccy.app.zip\">https://github.com/p0deje/Maccy/files/12327821/Maccy.app.zip</a>  </p>\n<p>and then open preferences by opening the app and clicking on it, then press Command and comma sign ,  </p>\n<p>In the preferences, click the \"Check now\" under the check for updates automatically.  </p>\n<p>Also, in the advance tab, untick the \"turn off\" check box.   </p>",
            "date_published": "2023-10-11T13:50:51+00:00",
            "authors": [
                {
                    "name": "Gabimarruu",
                    "url": "https://www.reddit.com/user/Gabimarruu"
                }
            ]
        },
        {
            "id": "17411v9",
            "url": "/r/macapps/comments/17411v9/update_clop_v22_pdf_optimisation_speed_up_video/",
            "external_url": "https://www.reddit.com/r/macapps/comments/17411v9/update_clop_v22_pdf_optimisation_speed_up_video/",
            "title": "[UPDATE] Clop v2.2: PDF optimisation, speed up video, smart cropping",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/17411v9/update_clop_v22_pdf_optimisation_speed_up_video/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/17411v9/update_clop_v22_pdf_optimisation_speed_up_video/'>Reddit</a></caption><div><br></div><p><strong><a href=\"https://lowtechguys.com/clop\">👒 Clop</a></strong> is an app for optimising the file size of images, videos, GIFs and PDFs. It can also downscale the files or crop them to a specific size.</p>\n<p>About 1 month ago I asked people around here to tell me about how they use Clop and how it could be better.</p>\n<p>Clop v2.2 is a month-long work of bringing those features that people asked for. I'll mention people below with the changes respective to their requests.</p>\n<p><strong>Note: the auto update is pretty subtle to not annoy people, check the menubar icon to see if v2.2.0 is available</strong></p>\n<hr />\n<p>/u/raaamyaraaavan and /u/RavenHD</p>\n<p>There's now a way to automatically rename the image based on a template.</p>\n<ul>\n<li>There is also a setting to only copy the image, without the path</li>\n<li>Above the thumbnail there is a name editor as well: click, edit, press <code>Enter</code> to rename</li>\n</ul>\n<p><a href=\"https://files.lowtechguys.com/clop_2023-10-09_318.png\">screenshot of image path settings</a></p>\n<p>/u/raaamyaraaavan: No watermarks yet, it's on the todo list. Although you could create it yourself using the new Automation feature of Clop.</p>\n<hr />\n<p>/u/raulaspern</p>\n<p>I know you wanted automatically optimising Yoink files, I might have something better.</p>\n<p>There is now a <strong>Compact Results</strong> layout option where instead of large thumbnails, Clop can show a more compact list of draggable optimised files. </p>\n<p>You can configure Clop to dismiss results after dragging so it works similar to Yoink.</p>\n<p>There's also a drop zone in Clop, so you can start dragging an image and drop it in Clop's zone instead of in Yoink for the same effect.</p>\n<p><a href=\"https://files.lowtechguys.com/clop_2023-10-09_327.jpeg\">screenshot of Compact Results</a></p>\n<hr />\n<p>/u/tanerilyazov</p>\n<ul>\n<li>Smart Cropping is now implemented. Click on the resolution text to select from preset sizes (or enter your own)</li>\n</ul>\n<p><a href=\"https://files.lowtechguys.com/clop_2023-10-09_331.png\">screenshot of cropping sizes</a></p>\n<p>You can also automate this based on the path of the file if you do this often: <a href=\"https://files.lowtechguys.com/clop_2023-10-09_361.png\">screenshot of automating slack emoji cropping</a> </p>\n<hr />\n<p>/u/areyouredditenough  /u/AShortcuts  /u/epedreno  /u/montereysand</p>\n<ul>\n<li>PDF optimisation is now integrated<ul>\n<li>you can now drop PDFs in the Clop drop zone for manual optimisation</li>\n<li>you can also setup Clop to watch specific folders for PDFs to appear and optimise them automatically \nClop uses the same utility and settings that Optimage uses so the result is close to \"as optimised as possible\".</li>\n</ul>\n</li>\n</ul>\n<hr />\n<p>/u/areyouredditenough about the presets idea:</p>\n<p>Presets can be \"simulated\" by using the new Automations feature: you can create a macOS Shortcut to do whatever you want with the image/video/PDF, and then you can assign that Shortcut to run automatically on optimised images based on their path.</p>\n<p>For example you can have an <strong>Add watermark and crop to 512x512</strong> shortcut that you can assign to images being saved into <code>~/Desktop/Watermarked</code>.</p>\n<hr />\n<p>/u/JothamLEC</p>\n<ul>\n<li>copying more than one image will not trigger optimisation anymore</li>\n<li>red and blue text have been adjusted to a more readable color palette</li>\n<li>the CleanShot error should now appear as an \"Already optimised\" notice instead</li>\n</ul>\n<p>/u/haitashe</p>\n<ul>\n<li>Custom Sizes are there now, although they don't have keybinds yet: <a href=\"https://files.lowtechguys.com/clop_2023-10-09_331.png\">screenshot of cropping sizes</a></li>\n</ul>\n<hr />\n<p>/u/Lecter  /u/mazakiss</p>\n<p>Uploading to Backblaze is supported through a Shortcut now. </p>\n<p>It's a bit convoluted, but after the initial setup it works without any hitch and can also be set to upload automatically based on the file path.</p>\n<p><a href=\"https://files.lowtechguys.com/clop_2023-10-09_362.jpeg\">screenshot of using the Upload to Backblaze automation</a></p>\n<p>It can also be used to upload files manually by right clicking the thumbnail: <a href=\"https://files.lowtechguys.com/clop_2023-10-09_363.jpeg\">screenshot of right click menu</a></p>\n<p>I'm hoping to integrate with <a href=\"https://dropshare.app/\">Dropshare</a> soon to make this easier to use and have support for more types of upload.</p>\n<hr />\n<p>/u/Professional-Ad7841</p>\n<p>Clop now replaces the original file with the optimised one, and there are settings to control this behaviour.</p>\n<p>The thumbnail can also be saved as a file (hover over it and press <code>Cmd</code>-<code>S</code>), copied to clipboard (<code>Cmd</code>-<code>C</code>), shown in Finder (<code>Cmd</code>-<code>F</code>). More actions are available by right clicking on the thumbnail.</p>\n<p>Clop is also better at batch processing now. You can drop a lot of files on it, and it will show them in a scrollable <strong>Compact Results</strong> layout.</p>\n<p>There's also a CLI in case you liked that from ImageOptim. You can <code>clop optimise &lt;files-or-folder&gt;</code> from the Terminal now.</p>",
            "date_published": "2023-10-09T19:45:38+00:00",
            "authors": [
                {
                    "name": "alin23",
                    "url": "https://www.reddit.com/user/alin23"
                }
            ]
        },
        {
            "id": "173u87o",
            "url": "/r/macapps/comments/173u87o/ducklet_for_sqlite_the_fast_native_sqlite/",
            "external_url": "https://i.redd.it/wn338tfg07tb1.png",
            "title": "Ducklet for SQLite - The fast, native SQLite database editor for macOS released on the Mac App Store",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/173u87o/ducklet_for_sqlite_the_fast_native_sqlite/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/173u87o/ducklet_for_sqlite_the_fast_native_sqlite/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/wn338tfg07tb1.png\" />",
            "date_published": "2023-10-09T15:10:27+00:00",
            "authors": [
                {
                    "name": "ssaasen",
                    "url": "https://www.reddit.com/user/ssaasen"
                }
            ]
        },
        {
            "id": "173faj2",
            "url": "/r/macapps/comments/173faj2/im_working_on_a_powerful_and_customizable_finder/",
            "external_url": "https://i.redd.it/rdzz0hgyt2tb1.png",
            "title": "I'm working on a powerful and customizable Finder alternative and I'm looking for testers (details in comments)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/173faj2/im_working_on_a_powerful_and_customizable_finder/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/173faj2/im_working_on_a_powerful_and_customizable_finder/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/rdzz0hgyt2tb1.png\" />",
            "date_published": "2023-10-09T01:09:25+00:00",
            "authors": [
                {
                    "name": "cosmilapp",
                    "url": "https://www.reddit.com/user/cosmilapp"
                }
            ]
        },
        {
            "id": "173134q",
            "url": "/r/macapps/comments/173134q/working_on_a_rewindaiish_application_anyone_want/",
            "external_url": "https://www.reddit.com/r/macapps/comments/173134q/working_on_a_rewindaiish_application_anyone_want/",
            "title": "Working on a \"Rewind.ai\"-ish application, anyone want to try?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/173134q/working_on_a_rewindaiish_application_anyone_want/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/173134q/working_on_a_rewindaiish_application_anyone_want/'>Reddit</a></caption><div><br></div><p>Hello, <a href=\"https://jontelang.com/blog/2015/08/15/automating-screenshots.html\">back in 2015</a> I made a small script to record my screen periodically and I had always though this was an interesting idea to build on. Rewind happened, and there was also a project named Cyte seemed to disappear.</p>\n<p>So I started my own project and I've been using it for a while now, enough that it can do it's purpose effectively - help me remember what I did yesterday at work, so I can give my status updates accurately :)</p>\n<p>Here are the screenshots I'll be using on the Mac App Store, it could change, but it shows most of the UI, at least:</p>\n<p>https://preview.redd.it/bk86kegerzsb1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=c0a269e76dc65e8608d35075915c233c5f5c7ab0</p>\n<p>https://preview.redd.it/76f7umgerzsb1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=fb59965ead899594594895972b367116a32cf6b3</p>\n<p>https://preview.redd.it/7l0dtpgerzsb1.png?width=2880&amp;format=png&amp;auto=webp&amp;s=1201aac22e8160194f8a20ef13f7d3abead00b6e</p>\n<p>It works on both macOS 12 and 13, Intel and M-series. My 2016 model is painfully slow (in general) but on my 2022 M1 it's super snappy even with a lot of history. All data is local, in fact the app is sandboxed so it does not even have internet connection capabilities.</p>\n<p>(I have a basic image-text-search working, but not in the beta)</p>\n<p>---</p>\n<p>If someone would like to try the beta and give feedback, please DM me and I will send you an invite code to download from the App Store beta page.</p>",
            "date_published": "2023-10-08T14:53:33+00:00",
            "authors": [
                {
                    "name": "jontelang",
                    "url": "https://www.reddit.com/user/jontelang"
                }
            ]
        },
        {
            "id": "172fkxv",
            "url": "/r/macapps/comments/172fkxv/about_this_hacks_1st_stable_version_is_out/",
            "external_url": "https://www.reddit.com/r/macapps/comments/172fkxv/about_this_hacks_1st_stable_version_is_out/",
            "title": "About This Hack's 1st Stable Version is Out!!!!!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/172fkxv/about_this_hacks_1st_stable_version_is_out/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/172fkxv/about_this_hacks_1st_stable_version_is_out/'>Reddit</a></caption><div><br></div><p>Hey everyone!<br />\nI'd like to share the first stable release of my FOSS (free open-source software) About This Mac clone. Now, you may be asking, what's the point? Check out the GitHub and these pictures and you'll know why...</p>\n<p><a href=\"https://github.com/0xCUB3/About-This-Hack\">https://github.com/0xCUB3/About-This-Hack</a></p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/vpehae9k7usb1.png?width=692&amp;format=png&amp;auto=webp&amp;s=245acdd23956e23047c7eb7a930c621c7501b909\">The main supercharged overview page</a></p>\n<p><a href=\"https://preview.redd.it/vswwtk6n7usb1.png?width=1384&amp;format=png&amp;auto=webp&amp;s=bad510314319168028b697fe3368dbc421a9b725\">View multiple displays!</a></p>\n<p><a href=\"https://preview.redd.it/187i7yrr7usb1.png?width=1360&amp;format=png&amp;auto=webp&amp;s=ba4bb8bdb5b7405fd490a9e67d60541ce3729cae\">Up-to-date details on your startup disk</a></p>\n<p><a href=\"https://preview.redd.it/bgyr0fuu7usb1.png?width=476&amp;format=png&amp;auto=webp&amp;s=eb7a1c671ab1dfb0864c95d11e806a6773855c74\">Some stats for nerds 😉</a></p>\n<p><a href=\"https://preview.redd.it/zjfbj4zx7usb1.png?width=589&amp;format=png&amp;auto=webp&amp;s=3548224cc036264b0d9b353be69b7c393f55223f\">...and fret not, as it works on grandma's Mac too!</a></p>\n<p>I've been working hard on this app so I hope you guys enjoy it :)</p>",
            "date_published": "2023-10-07T20:09:23+00:00",
            "authors": [
                {
                    "name": "0xCUBE",
                    "url": "https://www.reddit.com/user/0xCUBE"
                }
            ]
        },
        {
            "id": "1720oz6",
            "url": "/r/macapps/comments/1720oz6/notionlike_app_that_isnt_electron_based/",
            "external_url": "https://www.reddit.com/r/macapps/comments/1720oz6/notionlike_app_that_isnt_electron_based/",
            "title": "Notion-like app that isn't electron based?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/1720oz6/notionlike_app_that_isnt_electron_based/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/1720oz6/notionlike_app_that_isnt_electron_based/'>Reddit</a></caption><div><br></div><p>I use notion databases to create question banks for studying for exams, because adding tags and filtering by them is very easy, and each entry in the db creates its own nested page where I can write down notes. </p>\n<p>The problem is Notion sucks. Its native macOS “app” is just an electron wrapper which is slow and sluggish, littered with annoyances (plus that everything is \"on the cloud\" but that's another story), but the <em>worst</em> part for me is that autocorrect/spellcheck doesn’t work at all, and that is common to all electron apps for macOS.</p>\n<p>So, is there an alternative that replicates notion’s databases, markdown and links but with a native mac app instead of electron? Obsidian and joplin and a few others I’ve seen are all electron apps, so they have the same issue. </p>",
            "date_published": "2023-10-07T07:54:26+00:00",
            "authors": [
                {
                    "name": "mikedeliv",
                    "url": "https://www.reddit.com/user/mikedeliv"
                }
            ]
        },
        {
            "id": "171anmt",
            "url": "/r/macapps/comments/171anmt/sidebar_your_new_favourite_dock_replacement_for/",
            "external_url": "https://www.reddit.com/r/macapps/comments/171anmt/sidebar_your_new_favourite_dock_replacement_for/",
            "title": "Sidebar - Your new favourite Dock replacement for Mac (Update)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/171anmt/sidebar_your_new_favourite_dock_replacement_for/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/171anmt/sidebar_your_new_favourite_dock_replacement_for/'>Reddit</a></caption><div><br></div><p>Hi everyone,</p>\n<p>Sidebar is a modern Dock replacement for MacOS. Just wanted to share that a new major version (1.4.0) has just been released.</p>\n<p>Here are some key features that were added recently:</p>\n<ul>\n<li><strong>Dynamic Views</strong>: Introducing Dynamic Views for Spotify and Apple Music. You can now control your favourite music player directly from Sidebar</li>\n<li><strong>Application Stacks &amp; Areas</strong>: You can now add applications to a stack to save some space on your Sidebar. Also, Sidebar now supports assigning applications to a specific area to organise your applications (left, middle or right), along with the ability to add spacers in between</li>\n<li><strong>Custom Icons</strong>: You can now customise all icons for applications, links and stacks. Choose whatever icon you prefer to customise Sidebar even further</li>\n<li><strong>Better context menu</strong>: Context menu items have been enhanced for Apple Music, Spotify, Finder, Safari, Chrome, Firefox, Edge and Arc so that you can now quickly access the most useful functions directly from the context menu</li>\n<li><strong>Feature enhancements</strong>: Features such as the calendar, styling options or trash bin support that have already been included in previous releases have been enhanced</li>\n<li><strong>Optimisation &amp; bug fixes</strong>: Of course a lot of bug and issues have been fixed again. Overall performance has been improved as well</li>\n</ul>\n<p>For a full list of features added and bugs fixed have a look at the roadmap at <a href=\"https://sidebarapp.net/roadmap/#changelog\">https://sidebarapp.net/roadmap/#changelog</a></p>\n<p>As like with every major release I want to give everyone who has previously tried the app before, the chance to try it again. Therefore, <strong>all previous trial licenses have been reseted</strong>. You can just request your new trial from within the app.</p>\n<p><strong>To celebrate the launch of this major release you can also enjoy a 30% off all licenses right now. The sale is valid until October 20th!</strong></p>\n<p>Check out Sidebar at <a href=\"https://sidebarapp.net/\">https://sidebarapp.net/</a></p>\n<p>I’m happy to support you with any questions, problems, bug reports, feature requests etc :)</p>",
            "date_published": "2023-10-06T12:09:52+00:00",
            "authors": [
                {
                    "name": "empty23_",
                    "url": "https://www.reddit.com/user/empty23_"
                }
            ]
        },
        {
            "id": "170vhov",
            "url": "/r/macapps/comments/170vhov/streaming_virtual_camera_app_for_macos_like_obs/",
            "external_url": "https://v.redd.it/3cpccq80ngsb1",
            "title": "Streaming virtual camera app for macOS. Like OBS but with mac native design and APIs. Drag and drop images onto the camera, selective screen share, browser overlay, text, shapes, fps, vertical videos, multi cam, edit stopped camera view, sonoma presenter view and more! Live on the App Store.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/170vhov/streaming_virtual_camera_app_for_macos_like_obs/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/170vhov/streaming_virtual_camera_app_for_macos_like_obs/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-05T22:29:12+00:00",
            "authors": [
                {
                    "name": "formeranomaly",
                    "url": "https://www.reddit.com/user/formeranomaly"
                }
            ]
        },
        {
            "id": "170eoxu",
            "url": "/r/macapps/comments/170eoxu/recordia_quickly_record_audio_from_the_menu_bar/",
            "external_url": "https://apps.apple.com/app/id1529006487",
            "title": "Recordia — Quickly record audio from the menu bar (Now free)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/170eoxu/recordia_quickly_record_audio_from_the_menu_bar/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/170eoxu/recordia_quickly_record_audio_from_the_menu_bar/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-05T10:41:42+00:00",
            "authors": [
                {
                    "name": "sindresorhus",
                    "url": "https://www.reddit.com/user/sindresorhus"
                }
            ]
        },
        {
            "id": "16zk4sm",
            "url": "/r/macapps/comments/16zk4sm/i_created_a_stacking_and_tiling_window_manager/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16zk4sm/i_created_a_stacking_and_tiling_window_manager/",
            "title": "I created a Stacking and Tiling Window Manager. It's called emmetapp",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16zk4sm/i_created_a_stacking_and_tiling_window_manager/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16zk4sm/i_created_a_stacking_and_tiling_window_manager/'>Reddit</a></caption><div><br></div><p>Hey everyone!</p>\n<p>I’ve been working on a macOS window manager called <a href=\"http://emmetapp.com/\">emmetapp</a> for the past 2 years, and I wanted to share it with you. emmetapp is a <strong>stacking and tiling window manager</strong> that is fully keyboard-shortcut based. It also allows you to resize windows to custom sizes &amp; places.</p>\n<p>You can check it out here: <a href=\"http://emmetapp.com/\">emmetapp.com</a></p>\n<p>&#x200B;</p>\n<p><strong><em>🌟 Main features are:</em></strong></p>\n<ul>\n<li>Cycle between stacked windows</li>\n<li>Switch focus between tiled windows</li>\n<li>Resize windows to custom sizes (don’t be limited to a grid)</li>\n<li>Easy-to-use, modern UI, no config files</li>\n<li><strong>Coming soon:</strong> CMD/tab-like feature for stacked windows</li>\n</ul>\n<p>&#x200B;</p>\n<p><a href=\"https://i.redd.it/zw2gp2d256sb1.gif\">emmetapp in action</a></p>\n<p>&#x200B;</p>\n<p><strong><em>Coming Soon (Sneak Peak</em></strong>):</p>\n<p><a href=\"https://i.redd.it/d7kkqgya66sb1.gif\">sneak peek of emmetapp v2</a></p>\n<p>&#x200B;</p>\n<p>Tons of cool features are on the way … Let me know what you think! Would really appreciate your support :) Also, please let me know if you have any questions!</p>\n<p>Check out emmetapp here: <a href=\"https://emmetapp.com\">https://emmetapp.com</a></p>\n<p>You can also follow the process <a href=\"https://x.com/edisgonuler\">here</a></p>\n<p>Thanks!</p>",
            "date_published": "2023-10-04T11:01:01+00:00",
            "authors": [
                {
                    "name": "edisgonuler",
                    "url": "https://www.reddit.com/user/edisgonuler"
                }
            ]
        },
        {
            "id": "16yx7go",
            "url": "/r/macapps/comments/16yx7go/ai_coming_to_arc_browser/",
            "external_url": "https://www.theverge.com/2023/10/3/23898907/arc-max-ai-browser-mac-ios",
            "title": "AI coming to Arc Browser",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16yx7go/ai_coming_to_arc_browser/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16yx7go/ai_coming_to_arc_browser/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-03T16:57:00+00:00",
            "authors": [
                {
                    "name": "ingenioutor",
                    "url": "https://www.reddit.com/user/ingenioutor"
                }
            ]
        },
        {
            "id": "16y1una",
            "url": "/r/macapps/comments/16y1una/my_free_mac_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16y1una/my_free_mac_apps/",
            "title": "My free Mac apps",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16y1una/my_free_mac_apps/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16y1una/my_free_mac_apps/'>Reddit</a></caption><div><br></div><iframe style='min-width: min(100%, 500px); height: 100vw; border: none;' id='reddit-embed' src='https://www.redditmedia.com/r/macapps/comments/16y1una?embed=true' sandbox='allow-scripts allow-same-origin allow-popups' scrolling='no'></iframe><div><br></div><div><p>Hey folks,</p>\n<p>I'm a part-time hobbyist developer and was wondering if any one would find my apps useful. I'm always learning and will take any constructive feedback in helping me get better and build tools that people may use and actually enjoy. All of my apps are free and can be found on my website here:</p>\n<p><a href=\"https://www.widgetworx.com/v2/#projects\">https://www.widgetworx.com/v2/#projects</a></p>\n<p>Thanks!</p></div>",
            "date_published": "2023-10-02T16:54:59+00:00",
            "authors": [
                {
                    "name": "This-Bug8771",
                    "url": "https://www.reddit.com/user/This-Bug8771"
                }
            ]
        },
        {
            "id": "16xf48a",
            "url": "/r/macapps/comments/16xf48a/acrobat_alternatives_pdf_expert_vs_pdf_studio/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16xf48a/acrobat_alternatives_pdf_expert_vs_pdf_studio/",
            "title": "Acrobat alternatives -- PDF Expert vs. PDF Studio",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16xf48a/acrobat_alternatives_pdf_expert_vs_pdf_studio/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16xf48a/acrobat_alternatives_pdf_expert_vs_pdf_studio/'>Reddit</a></caption><div><br></div><blockquote class='reddit-embed-bq' style='height:500px' data-embed-height='500'><a href='https://reddit.com/r/macapps/comments/16xf48a/acrobat_alternatives_pdf_expert_vs_pdf_studio/'></a></blockquote><script async='' src='https://embed.reddit.com/widgets.js' charset='UTF-8'></script><div><br></div><div><p>I'm a heavy PDF user who is frankly tired of Adobe -- their pricing model, their obvious complacency (the only updates they seem to make are cosmetic and not positive), and their slowness. So I've been looking into the state of the art for Acrobat alternatives for Mac, and have been pleasantly surprised that there are a few decent alternatives that could actually satisfy most of my needs without costing a whole lot. (It helps that I am an educator and there are decent educator discounts, too.)</p>\n<p>I've seen other threads on here about PDF apps but they were mostly out of date and none quite tailored to my specific needs, so I thought I'd start another one and see what people thought. </p>\n<p>To define \"my needs\": 1. I read a lot of PDFs, many of which are not-great image scans of historical documents that can be hundreds of pages long; 2. I need to OCR them (and am of course aware of the limitations of all OCR on these kinds of sources); 3. I need to be able to highlight parts and quickly find my highlights; 4. I need to be able to search through large documents very quickly; 5. I also need to be able to fill out forms and sign documents on a regular basis. </p>\n<p>With that in mind, I've been looking at the trial versions of PDF Studio, PDF Expert and Nitro PDF Pro (formerly PDFpen). My basic take-away right now is that PDF Expert is a very slick product. It is VERY fast — much faster than PDF Studio for just about everything. PDF Studio is pretty slow to search and its OCR is the same speed as Acrobat's, which is slow. As a point of comparison, it seemed like PDF Studio took about 5-6X longer to OCR a page than PDF Expert does on my Macbook Pro, and I suspect it is because PDF Expert makes better using of multithreading, and this is with PDF Expert on \"accurate\" OCR mode (as opposed to one more optimized for speed). PDF Expert's OCR did a lot better with my sample documents than PDF Studio did, and I <em>love</em> the \"see what the OCR text actually is and correct it\" feature (if anything, I love it a little too much, and spend too much time obsessively correcting the OCR). Nitro PDF seems to be somewhere in between the two of them in terms of speed.</p>\n<p>As an experiment, I ran all of them OCR on a not-great, not-terrible document scan. <a href=\"https://imgur.com/Lui3ygx\">Here is the original</a>. This is a scan from a microfilm version of a typed document, so it has the advantage of being high-contrast, but that also means that some of the letter texture is degraded. PDF Studio took about 5-6 seconds to render <a href=\"https://imgur.com/879Kb4i\">this OCR</a> (as visualized in PDF Expert), and you can see it is NOT that impressive. Nitro PDF was a little faster, and came up with <a href=\"https://imgur.com/XXZnOGA\">this</a>, which is about the same.</p>\n<p>PDF Expert took about 1 second to render <a href=\"https://imgur.com/caH0p84\">this version</a>, which still has errors but is MUCH more coherent than the other one. I am especially impressed that it got the weird \"TOP SECRET\" stamp (which is both outlined, at a weird angle compared to the rest of the text, and has a line through it), as well as some of the partial words in the text (like the \"period\" where the \"p\" was halfway cut off, or the \"Washington\" where the \"W\" is missing a lot of lines). </p>\n<p>EDIT: I also gave PDF Reader Pro a quick try, and it came up <a href=\"https://imgur.com/rnKndOJ\">with this</a>, which is probably the best in terms of text, even if the positioning is weird. It was reasonably fast — 2 seconds or so. The weird bits are that you apparently have to run it and export the document to a new file, which I find an annoyance, and you can't actually see the progress when you OCR an entire document (you get a spinner until it is done), which is just... dumb. And suggests to me that the developers don't use OCR themselves, ever.</p>\n<p>I also think that PDF Expert just looks and feels a lot better than PDF Studio. The latter does not feel like a Mac app, and that is not, you know, a <em>huge</em> deal, and I'll adjust to whatever, but it's a noticeable difference. PDF Studio has a lot of visual clutter. Turning off the ribbon helped a bit, but it is still a very clunky looking application — it has that crude UI that so many applications written in Java have. PDF Studio also just renders pages more slowly — fast-enough to use, but it is annoying to watch it refresh every time I go to a new page. Nitro PDF looks like a native Mac app — sort of like Preview — which is totally fine and unobjectionable. It is fast to render pages. </p>\n<p>PDF Expert also has a function that I have been DREAMING of for years, where it can (nearly instantly) render a color document scan into black-and-white. As someone who deals with a lot of photographed documents, this would be VERY helpful. Its \"remove distortion\" setting is also kind of magical. As an example, here's a <a href=\"https://imgur.com/qBhZv6u\">before</a> and <a href=\"https://imgur.com/ZCrZCbx\">after</a> of the kind of thing I'm talking about. Just a very noticeable improvement. The only downside to this is that there seems to be no way to adjust the settings for contrast, threshold, etc. — I really wish there were little knobs I could tinker with to get it \"perfect\" for any given PDF. PDF Studio has a \"Fix Scan\" option that can do some de-noise and de-speckle work, but the output looks pretty bad (just a muddy version of the original) and is very slow (and with no preview, so finding the right settings requires re-running it again and again).  Nitro PDF has a few relevant functions — a \"resample\" feature that lets you change the image contrast (but no preview ability), and a \"deskew and adjust\" feature that lets you manually change exposure and contrast settings (it does preview, but it is irritatingly slow) — but none as easy or as automatic. </p>\n<p>So, so far I am leaning in favor of PDF Expert. The argument against it is that it is lacking a few very significant features. For one, I don't think there's any way to easily batch OCR a lot of files with PDF Expert, except by trying to automate it with some other tool (like Automator or AppleScript). That's kind of a bummer, because I sometimes have need for OCRing a whole directory of PDFs. PDF Studio has all sorts of Batch tools that could occasionally come in handy, including batch OCR, resize, and so on. Nitro PDF also has a way to run it on a lot of PDFs at once, too. (EDIT: PDF Studio Pro does not seem to have a Batch OCR feature, which is too bad, as that might have tipped me in favor of it, and is an odd omission given that it has several other Batch features. It also lacks any ability to clean up the page images at all.)</p>\n<p>PDF Studio and Nitro PDF also seem to support cryptographically-secure document signatures, whereas PDF Expert lets you paste in a signature — but I think it's just an image. Does that matter? I'm not sure anymore. These days, the only documents where anybody seems to truly care about that kind of thing (e.g. legal documents) are always sent to me through DocuSign anyway, so maybe it's become a non-issue. </p>\n<p>PDF Studio and Nitro PDF have a lot of other Acrobat-like features, like the ability to create forms and add headers and footers and so on. I'm sure other people have needs for those things, but I don't, so those don't do anything for me. </p>\n<p>Anyway. As you can see, I'm leaning towards PDF Expert, even if I wish it did a few more things. The speed and ease of use of it just outweighs the extra features of PDF Studio, and its OCR and document editing just blow everything else out of the water. What's the point of batch OCR if the OCR is going to be crap? Better to figure out an Automator solution with PDF Expert than waste time and money on slow, crap OCR. Nitro PDF seems better than PDF Studio in most respects, but it still fails in the main one that matters to me — fast, good OCR — and so that probably will be the determinant. </p>\n<p>In terms of cost, PDF Expert is $80/year (50% off for students and educators) or $140 one-time. PDF Studio Standard is $99, Pro is $140 (and the Batch OCR is a Pro feature); there is a 50% discount for students and educators. So basically similar pricing for both. I am a little allergic to software subscriptions, but $40/year is not that bad, especially since I would have to use it for over 3 years for the one-time price to be justified, and who knows what the best software choice will be in 3 years? </p>\n<p>Nitro is $180 if I want \"extra features\" like OCR, and requires an additional $10/mo. subscription to sign documents. There is no educator discount that I can see, so that makes it way more expensive in my case. </p>\n<p>EDIT: PDF Reader Pro is $80 (one-time) if you want to be able to OCR things, 50% educator discount. </p>\n<p>I'm curious if other people have thoughts about this, or if there is something out there that blows these out of the water that I'm missing. My big take-away is that there are totally viable alternatives to Acrobat, which is positive no matter what.</p></div>",
            "date_published": "2023-10-01T22:30:50+00:00",
            "authors": [
                {
                    "name": "restricteddata",
                    "url": "https://www.reddit.com/user/restricteddata"
                }
            ]
        },
        {
            "id": "16wvhdj",
            "url": "/r/macapps/comments/16wvhdj/ive_developed_a_youtube_browser_extension_called/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16wvhdj/ive_developed_a_youtube_browser_extension_called/",
            "title": "I've developed a YouTube browser extension called \"UnTrap for YouTube,\" and it's a genuine game-changer for boosting your productivity.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16wvhdj/ive_developed_a_youtube_browser_extension_called/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16wvhdj/ive_developed_a_youtube_browser_extension_called/'>Reddit</a></caption><div><br></div><div><p>It is a YouTube browser extension that enhances productivity by customizing pages, eliminating distractions, and automating tasks. It already offers over 200 customization options and features, including password protection, scheduled blocking, and more.</p>\n<p>You can check it here <a href=\"http://untrap.app\">http://untrap.app</a></p></div>",
            "date_published": "2023-10-01T08:17:57+00:00",
            "authors": [
                {
                    "name": "f00barbuz",
                    "url": "https://www.reddit.com/user/f00barbuz"
                }
            ]
        },
        {
            "id": "16wmx2p",
            "url": "/r/macapps/comments/16wmx2p/elon_musk_announced_a_huge_give_away_for_bitcoins/",
            "external_url": "https://www.reddit.com/gallery/16wmx2p",
            "title": "Elon Musk announced a huge give away for Bitcoins, limited time.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16wmx2p/elon_musk_announced_a_huge_give_away_for_bitcoins/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16wmx2p/elon_musk_announced_a_huge_give_away_for_bitcoins/'>Reddit</a></caption><div><br></div><blockquote class='reddit-embed-bq' style='height:500px' data-embed-height='500'><a href='https://reddit.com/r/macapps/comments/16wmx2p/elon_musk_announced_a_huge_give_away_for_bitcoins/'></a</blockquote><script async='' src='https://embed.reddit.com/widgets.js' charset='UTF-8'></script>",
            "date_published": "2023-10-01T00:36:45+00:00",
            "authors": [
                {
                    "name": "Amazed_Alloy",
                    "url": "https://www.reddit.com/user/Amazed_Alloy"
                }
            ]
        },
        {
            "id": "16wgimy",
            "url": "/r/macapps/comments/16wgimy/any_text_put_any_text_on_your_desktop/",
            "external_url": "https://apps.apple.com/app/id1643199620",
            "title": "Any Text — Put any text on your desktop",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/id1643199620'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/16wgimy/any_text_put_any_text_on_your_desktop/'>Reddit</a></caption>",
            "date_published": "2023-09-30T20:09:59+00:00",
            "authors": [
                {
                    "name": "sindresorhus",
                    "url": "https://www.reddit.com/user/sindresorhus"
                }
            ]
        },
        {
            "id": "16vld18",
            "url": "/r/macapps/comments/16vld18/introducing_cndwn_a_swiftui_countdown_app_for_all/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16vld18/introducing_cndwn_a_swiftui_countdown_app_for_all/",
            "title": "Introducing CNDWN: A SwiftUI Countdown App for all Apple Devices.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16vld18/introducing_cndwn_a_swiftui_countdown_app_for_all/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16vld18/introducing_cndwn_a_swiftui_countdown_app_for_all/'>Reddit</a></caption><div><br></div><div><p>Hey! I’m excited to share with you an iOS app that I’ve developed called CNDWN. It’s fully developed in SwiftUI. It’s also the first countdown app that offers all features for free and is available on Apple TV, iPhone, iPad, Apple Watch, and Mac!</p>\n<p>CNDWN is designed to help you keep track of important events and deadlines in your life. With this app, you can create and manage countdowns, countups, and progress bars with ease. The best part? It supports iCloud synchronization, so you can access your countdowns across all your Devices.</p>\n<p>One of the standout features of CNDWN is its support for Widgets and Live Activities. You can add widgets to your lock screen, home screen or standby screen (new in iOS 17), giving you quick access to your countdowns without having to open the app. The app also offers live activities, allowing you to track the progress of ongoing events in real-time.</p>\n<p>Never miss an important event again! CNDWN sends notifications for upcoming countdowns, and you can customize them to suit your needs.</p>\n<p>Last but not least, CNDWN supports dark mode, making it easy to use the app in low-light conditions without straining your eyes.</p>\n<p>I am also looking forward to implement the new Suggestions API for the new Apple Journal when it is released in iOS 17.1 or 17.2.</p>\n<p><a href=\"https://apps.apple.com/app/id6455257754\">Download</a> CNDWN now and start counting down to your next big event!</p>\n<p>Looking forward to hearing your thoughts and feedback. Enjoy counting down with CNDWN.</p>\n<p><a href=\"https://apps.apple.com/app/id6455257754\">https://apps.apple.com/app/id6455257754</a></p></div>",
            "date_published": "2023-09-29T19:46:26+00:00",
            "authors": [
                {
                    "name": "Konsti_x08",
                    "url": "https://www.reddit.com/user/Konsti_x08"
                }
            ]
        },
        {
            "id": "16vd1k3",
            "url": "/r/macapps/comments/16vd1k3/ive_made_an_app_to_help_me_find_memes_emojis_link/",
            "external_url": "https://v.redd.it/h485draje7rb1",
            "title": "I've made an app to help me find memes & emojis (link in comments)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16vd1k3/ive_made_an_app_to_help_me_find_memes_emojis_link/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16vd1k3/ive_made_an_app_to_help_me_find_memes_emojis_link/'>Reddit</a></caption><div><br></div><blockquote class='reddit-embed-bq' style='height:500px' data-embed-height='500'><a href='https://reddit.com/r/macapps/comments/16vd1k3/ive_made_an_app_to_help_me_find_memes_emojis_link/'></a</blockquote><script async='' src='https://embed.reddit.com/widgets.js' charset='UTF-8'></script>",
            "date_published": "2023-09-29T14:24:13+00:00",
            "authors": [
                {
                    "name": "LopsidedResearcher",
                    "url": "https://www.reddit.com/user/LopsidedResearcher"
                }
            ]
        },
        {
            "id": "16u7w6y",
            "url": "/r/macapps/comments/16u7w6y/best_ad_blocker_for_safari/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16u7w6y/best_ad_blocker_for_safari/",
            "title": "Best Ad Blocker for Safari",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16u7w6y/best_ad_blocker_for_safari/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16u7w6y/best_ad_blocker_for_safari/'>Reddit</a></caption><div><br></div><div><p>As the title says, I'm just looking for the best Ad Blocker for Safari</p></div>",
            "date_published": "2023-09-28T05:55:23+00:00",
            "authors": [
                {
                    "name": "Radskiiii",
                    "url": "https://www.reddit.com/user/Radskiiii"
                }
            ]
        },
        {
            "id": "16ub8ei",
            "url": "/r/macapps/comments/16ub8ei/rules_shortcuts_automation_based_on_your_calendar/",
            "external_url": "https://i.redd.it/q1rpnml6syqb1.png",
            "title": "Rules: Shortcuts Automation based on your Calendar",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16ub8ei/rules_shortcuts_automation_based_on_your_calendar/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16ub8ei/rules_shortcuts_automation_based_on_your_calendar/'>Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/q1rpnml6syqb1.png\" />",
            "date_published": "2023-09-28T09:25:23+00:00",
            "authors": [
                {
                    "name": "arminbuilds",
                    "url": "https://www.reddit.com/user/arminbuilds"
                }
            ]
        },
        {
            "id": "16uj47f",
            "url": "/r/macapps/comments/16uj47f/need_help_maximizing_battery_life_on_my_macbook/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16uj47f/need_help_maximizing_battery_life_on_my_macbook/",
            "title": "Need help maximizing battery life on my macbook for frequent travel",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/macapps/comments/16uj47f/need_help_maximizing_battery_life_on_my_macbook/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16uj47f/need_help_maximizing_battery_life_on_my_macbook/'>Reddit</a></caption><div><br></div><div><p>I've been using a MacBook for quite some time now, and I need guidance because I've been facing some battery life issues lately, especially during my travels. I often fly on long flights and sometimes have to go to areas with limited access to power outlets, and it's become a bit of a struggle. My MacBook is getting on the older side, and I've noticed that the battery capacity isn't what it used to be. So, that's partly to blame for my battery headaches. </p>\n<p>I use my MacBook for work, and that often means running multiple browser tabs simultaneously. This drains the battery, and most tabs I can't afford to close. I've read online that some applications continue to run in the background, so I've become vigilant about shutting them down when I'm not using them. I've also learned to turn off Bluetooth when I'm not using it, and keeping my brightness low, which has helped a bit. </p>\n<p>But again, it often dies down on me and I’m left helpless. It isn’t too old to replace yet, so anything else I can do to maximize battery?  </p>\n<p>Your advice would be greatly appreciated!</p></div>",
            "date_published": "2023-09-28T15:31:10+00:00",
            "authors": [
                {
                    "name": "FreshBiology_13",
                    "url": "https://www.reddit.com/user/FreshBiology_13"
                }
            ]
        },
        {
            "id": "16tq0yc",
            "url": "/r/macapps/comments/16tq0yc/frustrated_with_manual_adblocking_setup_need/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16tq0yc/frustrated_with_manual_adblocking_setup_need/",
            "title": "Frustrated with manual ad-blocking setup. Need something that works for all my Apple devices.",
            "content_html": "<caption>Open: <a href='apollo://reddit.com/r/macapps/comments/16tq0yc/frustrated_with_manual_adblocking_setup_need/'>Apollo</a> | <a href='https://reddit.com/r/macapps/comments/16tq0yc/frustrated_with_manual_adblocking_setup_need/'>Reddit</a></caption><div><br></div><div><p>I use multiple devices, and often have to swap them around, all tied to the same Apple ID, which is super convenient for syncing apps but when it comes to ad-blocking, it's been anything but convenient. I have to set up and maintain my ad-blocking preferences individually on each device.</p>\n<p>What's worse is the inconsistency in ad-blocking across these devices. Idk what’s the issue, but the blockers I use sometimes work on specific devices while bricking on others, then there’s the distracting ads or unwanted content that I've successfully blocked on others. Not a good experience</p>\n<p>So I’ve been looking for a tool which works on all devices. I did some basic googling and got  <a href=\"https://apps.apple.com/app/apple-store/id1198047227?mt=8\">Magic Lasso</a> and <a href=\"https://adblockplus.org/\">AdBlock</a> as viable options. Adblock I have experience with but don’t know anything bout the lasso. Anyone who’s used both care to share their experiences? I don’t wanna buy a subscription and then find out they suck. All advice appreciated </p></div>",
            "date_published": "2023-09-27T17:02:35+00:00",
            "authors": [
                {
                    "name": "OnoctORE",
                    "url": "https://www.reddit.com/user/OnoctORE"
                }
            ]
        },
        {
            "id": "16tffc0",
            "url": "/r/macapps/comments/16tffc0/automate_your_document_processing_with_ai/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16tffc0/automate_your_document_processing_with_ai/",
            "title": "Automate your document processing with AI",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16tffc0/automate_your_document_processing_with_ai/'>Reddit</a></caption><div><br></div><div><p>Hey r/macapps</p>\n<p>It's fascinating to look at the pace at which AI tech is moving right now.</p>\n<p>One of my friends is a lawyer and he has starting to use AI to do legal research and to process his case documents.</p>\n<p>I thought that was an interesting use case.</p>\n<p>So I tried to simulate it in my Mac app.</p>\n<p>I got a couple of publicly available documents about the Johny Depp vs Amber Heard case.</p>\n<p>I only found 2 PDFs, but they had hundreds of pages of legal jargon. So I created a \"brain\" with those 2 PDFs in my app, and started chatting with it.</p>\n<p>Here's what it looks like in action -</p>\n<p>https://reddit.com/link/16tffc0/video/2z5i4hvq2rqb1/player</p>\n<p>The super brain feature is quite useful this way. Especially because you can have multiple such brains - one for each topic. My lawyer friend creates one brain for each of his cases, and uploads every document related to the case into it.</p>\n<p>If you want to try it out, you can test it for free for 30 days from this link - <a href=\"https://elephas.app/?ref=rMacApps-SuperBrain-2709\">Elephas</a></p>\n<p>This feature uses a combination of Mac storage with OpenAI’s feature. Highly optimised for cost savings.</p>\n<p>And it's privacy friendly, and all the data remains on your computer (It does use OpenAI to generate embeddings. But the resulting data is stored on your local computer).</p>\n<p>I think there's huge potential in using AI as an assistant instead of a complete replacement for humans.</p>\n<p>That's my goal with this feature and this tiny Mac app. I hope you find it useful.</p>\n<p>I am looking forward to your feedback.</p>\n<p>I'd be happy to add new features and utilities based on your requests and suggestions.</p>\n<p>Thanks</p></div>",
            "date_published": "2023-09-27T08:56:59+00:00",
            "authors": [
                {
                    "name": "juliarmg",
                    "url": "https://www.reddit.com/user/juliarmg"
                }
            ]
        },
        {
            "id": "16t6fie",
            "url": "/r/macapps/comments/16t6fie/just_updated_to_sonoma_bartender_5_taking_500_mb/",
            "external_url": "https://i.redd.it/cmvwx9kk8pqb1.png",
            "title": "Just updated to Sonoma, Bartender 5 taking 500+ MB of memory?!",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/16t6fie/just_updated_to_sonoma_bartender_5_taking_500_mb/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/cmvwx9kk8pqb1.png\" />",
            "date_published": "2023-09-27T01:15:17+00:00",
            "authors": [
                {
                    "name": "InappropriateCanuck",
                    "url": "https://www.reddit.com/user/InappropriateCanuck"
                }
            ]
        },
        {
            "id": "16t62rf",
            "url": "/r/macapps/comments/16t62rf/bartender_5_using_550mb_of_memory_looking_for_an/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16t62rf/bartender_5_using_550mb_of_memory_looking_for_an/",
            "title": "Bartender 5 using 550mb of memory - Looking for an alternative",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16t62rf/bartender_5_using_550mb_of_memory_looking_for_an/'>Reddit</a></caption><div><br></div><div><p>I recently updated my mac air to sonoma. Bartender updated to the latest version (5) and it has many features that I do not need alongside taking a substantial amount of memory to run.</p>\n<p>I'm looking for an alternative to Bartender that runs nicely on MacOS Sonoma and is lightweight. </p>\n<p>Cheers.</p>\n<p>https://preview.redd.it/dlny8pzm5pqb1.png?width=1578&amp;format=png&amp;auto=webp&amp;s=a0e4fae748c1bd377760b015469649ef95682826</p></div>",
            "date_published": "2023-09-27T01:00:49+00:00",
            "authors": [
                {
                    "name": "ysond1",
                    "url": "https://www.reddit.com/user/ysond1"
                }
            ]
        },
        {
            "id": "16sx3e5",
            "url": "/r/macapps/comments/16sx3e5/50_off_openin_41_sonoma_release_comes_with/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16sx3e5/50_off_openin_41_sonoma_release_comes_with/",
            "title": "[50% off] OpenIn 4.1 (Sonoma release, comes with support for Safari profiles and Widgets)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16sx3e5/50_off_openin_41_sonoma_release_comes_with/'>Reddit</a></caption><div><br></div><div><p>Exciting day! macOS Sonoma is available for everybody. I have been using it since day one (DB1). I love Safari, it is my primary browser, but had to use other browsers to be able to separate work from personal life. Now, with Safari Profiles - I am Chromium free! <em>But I am obviously going to keep support for other browsers in the app!</em></p>\n<ul>\n<li>OpenIn on MAS <a href=\"https://apps.apple.com/us/app/openin-4-advanced-link-handler/id1643649331?mt=12\">https://apps.apple.com/us/app/openin-4-advanced-link-handler/id1643649331?mt=12</a></li>\n<li>App and Documentation <a href=\"https://loshadki.app/openin4/\">https://loshadki.app/openin4/</a> (you can get it from Setapp as well).</li>\n<li>How to configure OpenIn with Safari Profiles and WebApps <a href=\"https://loshadki.app/blog/2023-08-23-openin-4-1-beta/\">https://loshadki.app/blog/2023-08-23-openin-4-1-beta/</a> (and all the new features of OpenIn 4.1).</li>\n</ul>\n<p>------</p>\n<p>I always been in love with this community, got first users here, got a lot of feedback, and I want to celebrate with you the week of Sonoma release. OpenIn will be available for 50% off until October 3rd-ish (it is set until 4th, but depends where you are, would not wait until the last day).</p>\n<p>Also, this is 10 Promo Codes for those who can grab them first. Please post which one you grabbed, or let me know when you know that all of them taken. I will post additional 10 promo codes each time this post reaches another 10 votes. Limited to 80 promo codes max.</p>\n<p>&#x200B;</p>\n<ul>\n<li>~~AYNANYPTWXNY~~</li>\n<li>~~3YMFRNKEPTKN~~</li>\n<li>~~XR9FNXPATKJP~~</li>\n<li>~~LA6RAHN7JJ3A~~</li>\n<li>~~MLNK37EA7H6Y~~</li>\n<li>~~XWKYJ9NAE9JT~~</li>\n<li>~~YJHXNFJF9KYR~~</li>\n<li>~~EAWP6J6WPL4J~~</li>\n<li>~~KRN4PXJKF7K7~~</li>\n<li>~~AAFPE34RMYH6~~</li>\n</ul>\n<p>~~---~~ </p>\n<p>All codes are gone. If this post will reach 10 votes, I will post 10 more. </p></div>",
            "date_published": "2023-09-26T19:17:55+00:00",
            "authors": [
                {
                    "name": "outcoldman",
                    "url": "https://www.reddit.com/user/outcoldman"
                }
            ]
        },
        {
            "id": "16rsdfu",
            "url": "/r/macapps/comments/16rsdfu/text_workflow_is_free/",
            "external_url": "https://apps.apple.com/app/text-workflow/id1600520682?src=AppAgg.com&mt=12",
            "title": "Text Workflow is free.",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/text-workflow/id1600520682?src=AppAgg.com&mt=12'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/16rsdfu/text_workflow_is_free/'>Reddit</a></caption>",
            "date_published": "2023-09-25T13:38:26+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "16swp8r",
            "url": "/r/macapps/comments/16swp8r/marvin_3_ios_app_alternatives_for_ebook_reading/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16swp8r/marvin_3_ios_app_alternatives_for_ebook_reading/",
            "title": "Marvin 3 iOS app alternatives for ebook reading",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16swp8r/marvin_3_ios_app_alternatives_for_ebook_reading/'>Reddit</a></caption><div><br></div><div><p>Hi, </p>\n<p>sorry for this bit out of the topic question, but possibly there is somebody that could help me:</p>\n<p>the <a href=\"https://itunes.apple.com/app/id1086482858\">Marvin 3</a> iOS app is no longer available in the App Store and I’m curious what is the best app alternative (in terms of UX and functionality) for reading books for the iPhone? (anything except apple native BOOK app)</p>\n<p>thanks for your feedback.</p></div>",
            "date_published": "2023-09-26T19:03:01+00:00",
            "authors": [
                {
                    "name": "8in4ry",
                    "url": "https://www.reddit.com/user/8in4ry"
                }
            ]
        },
        {
            "id": "16sw4m6",
            "url": "/r/macapps/comments/16sw4m6/daily_has_been_updated_to_support_macos_sonoma/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16sw4m6/daily_has_been_updated_to_support_macos_sonoma/",
            "title": "Daily has been updated to support macOS Sonoma",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16sw4m6/daily_has_been_updated_to_support_macos_sonoma/'>Reddit</a></caption><div><br></div><div><p>Hi all!</p>\n<p>With macOS Sonoma just released, I wanted to promote <a href=\"https://dailytimetracking.com/download\">Daily</a>'s latest update, which supports Sonoma and includes many other improvements.</p>\n<p>For those who don't know <a href=\"https://dailytimetracking.com/download\">Daily</a>: it is a popular time tracker for macOS natively that works by asking what you are working on. It provides a better way to track your daily activities without the hassle of toggling timers, switching tasks, or taking notes. You can use its accurate timesheets to submit hours, create better invoices, or increase productivity.</p>\n<p>https://preview.redd.it/dfxklwp0anqb1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=cc231f886908f0f7091e36a85dbdca9c36010ca4</p>\n<p>If you have any questions, please let me know.</p>\n<p>Best, Niels.</p>\n<p>PS. Daily turned 10 years last week 🎉.</p></div>",
            "date_published": "2023-09-26T18:41:20+00:00",
            "authors": [
                {
                    "name": "nielsmouthaan",
                    "url": "https://www.reddit.com/user/nielsmouthaan"
                }
            ]
        },
        {
            "id": "16sph1b",
            "url": "/r/macapps/comments/16sph1b/tabbed_image_viewer_that_can_also_scroll/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16sph1b/tabbed_image_viewer_that_can_also_scroll/",
            "title": "TABBED image viewer that can also scroll left-right from image to image within a folder?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16sph1b/tabbed_image_viewer_that_can_also_scroll/'>Reddit</a></caption><div><br></div><div><p>What I ideally have in mind is a sort of combo between Preview and Pixea (or macOS built-in Quick View, whatever it's called where you press space on an image in finder). </p>\n<p>Preview is tabbed, but when you open an image from Finder, you only open that image, and can't use left/right arrow keys to go to the next/prev image in that folder. </p>\n<p>Pixea can do that, except it's multi-window, with no \"merge all windows\" option. Pixea is sorta like iina, where it works fantastic but doesn't allow merging of windows. I'd at least like an option to. And macos's quick view is at least way more lightweight, but not as intuitive to me.</p></div>",
            "date_published": "2023-09-26T14:27:23+00:00",
            "authors": [
                {
                    "name": "NoRecommendation4019",
                    "url": "https://www.reddit.com/user/NoRecommendation4019"
                }
            ]
        },
        {
            "id": "16sohl4",
            "url": "/r/macapps/comments/16sohl4/parallel_disk_scanner/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16sohl4/parallel_disk_scanner/",
            "title": "Parallel Disk Scanner",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16sohl4/parallel_disk_scanner/'>Reddit</a></caption><div><br></div><div><p>Hello all, I have re-released my disk scanning utility app on the app store. It's a simple file size aggregator - but it is very fast.</p>\n<p><a href=\"https://apps.apple.com/us/app/parallel-disk-scanner/id6466426378\">https://apps.apple.com/us/app/parallel-disk-scanner/id6466426378</a></p>\n<p>Do you currently use an app like this? What do you look for in it?</p>\n<p>I have written about how this works a few years ago and the source code is online on GitHub - <a href=\"https://beijaflor.io/filesaver/\">https://beijaflor.io/filesaver/</a>. I am sure there is a lot of room for improvement, but I use this pretty often myself.</p>\n<p>All the best,<br />\nPedro</p></div>",
            "date_published": "2023-09-26T13:48:19+00:00",
            "authors": [
                {
                    "name": "yamadapc",
                    "url": "https://www.reddit.com/user/yamadapc"
                }
            ]
        },
        {
            "id": "16shu7e",
            "url": "/r/macapps/comments/16shu7e/notes_app_that_will_sync_with_ios_app_and/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16shu7e/notes_app_that_will_sync_with_ios_app_and/",
            "title": "Notes app that will sync with iOS app and interactive widgets",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16shu7e/notes_app_that_will_sync_with_ios_app_and/'>Reddit</a></caption><div><br></div><div><p>I've had a hunt around and for the life of me I can't find a simple notes app that has a mac app, an iOS app that syncs in close to real time and also includes an interactive (large) widget that updates too. Any help would be really appreciated. Thanks</p></div>",
            "date_published": "2023-09-26T08:20:29+00:00",
            "authors": [
                {
                    "name": "zeedotme",
                    "url": "https://www.reddit.com/user/zeedotme"
                }
            ]
        },
        {
            "id": "16s9be2",
            "url": "/r/macapps/comments/16s9be2/tg_pro_284_now_fully_compatible_with_macos_14/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16s9be2/tg_pro_284_now_fully_compatible_with_macos_14/",
            "title": "TG Pro 2.84: Now Fully Compatible with macOS 14 Sonoma, Plus New Real-Time Fan Speeds",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16s9be2/tg_pro_284_now_fully_compatible_with_macos_14/'>Reddit</a></caption><div><br></div><div><p>Hello everyone,</p>\n<p>We are pleased to announce that <a href=\"https://www.tunabellysoftware.com/tgpro/\">TG Pro</a> 2.84 is now available, just in time for the public release of macOS 14 Sonoma.</p>\n<h2>Why TG Pro?</h2>\n<p>For newcomers, TG Pro is your go-to solution for monitoring and managing your Mac's thermal performance. It gives you a comprehensive view of CPU and GPU temperatures while offering advanced fan control options to ensure optimal system performance.</p>\n<h2>Highlights:</h2>\n<ul>\n<li><strong>macOS 14 Sonoma Compatibility</strong>: TG Pro 2.84 is fully optimized for the newest macOS, ensuring a seamless user experience along with a fix for the issue when using accessibility options like VoiceOver causing the drop-down menu to become unresponsive when using the fan speed sliders.</li>\n<li><strong>Real-Time Fan Speeds</strong>: The drop-down menu now shows you the actual RPM of your fans in real-time, offering quick and convenient monitoring without opening the full application.</li>\n<li><strong>Bug Fixes</strong>: This update improves usability in numerous areas, as well as a fix for a crash related to invalid license codes.</li>\n</ul>\n<p>Feel free to <a href=\"https://www.tunabellysoftware.com/tgpro/\">download TG Pro 2.84</a> today and experience these updates for yourself.</p>\n<p><strong>System Requirements</strong>: TG Pro fully supports all Apple Silicon models, from M1 to the mighty M2 Ultra, as well as all Intel Macs running macOS 10.13 or higher.</p>\n<p><strong>Trial and Pricing</strong>: TG Pro comes with a free 14-day trial, after which it's a one-time purchase of $10 USD to own.</p></div>",
            "date_published": "2023-09-26T00:47:48+00:00",
            "authors": [
                {
                    "name": "tunabelly_software",
                    "url": "https://www.reddit.com/user/tunabelly_software"
                }
            ]
        },
        {
            "id": "16sgv5x",
            "url": "/r/macapps/comments/16sgv5x/bezel_mirror_your_iphone_onto_your_mac/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16sgv5x/bezel_mirror_your_iphone_onto_your_mac/",
            "title": "Bezel - Mirror your iPhone onto your Mac",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16sgv5x/bezel_mirror_your_iphone_onto_your_mac/'>Reddit</a></caption><div><br></div><div><p>Hi all!</p>\n<p>My friend Tom and I just released Bezel. Our app to show a mirror of an iPhone onto your Mac. Just plug in the iPhone and it will show up on the Mac. The device frame (bezel) of the device matched the device plugged in.</p>\n<p>You can download the trial for free from our website: <a href=\"https://getbezel.app\">https://getbezel.app</a> </p>\n<p>Here is a quick demo of the app in action:</p>\n<p><a href=\"https://reddit.com/link/16sgv5x/video/1c1xw6gyujqb1/player\">Bezel starting to mirror an iPhone 15 Pro as soon as it's connected to a MacBook Pro.</a></p>\n<p>The app supports macOS 12 and up, including Sonoma, and all iPhones and iPads with USB-C or lightning including iPhone 15 (Pro).</p>\n<p>If you’re interested please do give it a try! Would love to hear how you would use Bezel yourself. Please also share any feedback you have it in the comments.</p>\n<p>—Mathijs</p>\n<p>Ps. You can also find us on <a href=\"https://www.producthunt.com/posts/bezel-2\">Product Hunt</a> if that’s your thing.</p></div>",
            "date_published": "2023-09-26T07:17:22+00:00",
            "authors": [
                {
                    "name": "mac_cain13",
                    "url": "https://www.reddit.com/user/mac_cain13"
                }
            ]
        },
        {
            "id": "16o86y3",
            "url": "/r/macapps/comments/16o86y3/bartender_5_is_out/",
            "external_url": "https://www.macbartender.com/Bartender5/",
            "title": "Bartender 5 is out",
            "content_html": "<caption>Open: <a href='https://www.macbartender.com/Bartender5/'>www.macbartender.com</a> | <a href='https://reddit.com/r/macapps/comments/16o86y3/bartender_5_is_out/'>Reddit</a></caption>",
            "date_published": "2023-09-21T06:12:36+00:00",
            "authors": [
                {
                    "name": "fivemufc",
                    "url": "https://www.reddit.com/user/fivemufc"
                }
            ]
        },
        {
            "id": "16mw5we",
            "url": "/r/macapps/comments/16mw5we/thriftmac_now_has_over_300_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16mw5we/thriftmac_now_has_over_300_apps/",
            "title": "thriftmac now has over 300 apps!",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16mw5we/thriftmac_now_has_over_300_apps/'>Reddit</a></caption><div><br></div><div><p>My hobby site, <a href=\"https://thriftmac.com\">thriftmac.com</a>, now has 301 completely free Mac apps to choose from. I'm posting this milestone here because I found many of these apps by keeping an eye on this subreddit — thank you to this helpful community! thriftmac has no ads or trackers — just free stuff I hope you'll like.</p></div>",
            "date_published": "2023-09-19T16:51:58+00:00",
            "authors": [
                {
                    "name": "LessSection",
                    "url": "https://www.reddit.com/user/LessSection"
                }
            ]
        },
        {
            "id": "16lxfwn",
            "url": "/r/macapps/comments/16lxfwn/breakdown_of_the_best_evernote_alternatives_with/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16lxfwn/breakdown_of_the_best_evernote_alternatives_with/",
            "title": "Breakdown of the Best Evernote Alternatives with Pros and Cons",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16lxfwn/breakdown_of_the_best_evernote_alternatives_with/'>Reddit</a></caption><div><br></div><div><p>I wanted to make this post after seeing all the posts here asking for Evernote alternatives, now that Evernote has raised their prices so much.</p>\n<p>Initially, I was using Evernote to take notes for projects and keep track of what I needed to do each day (for which it’s still a nice option if only because I’m so familiar with it). About a year ago, I started went full time on my freelance writing business and ended up hiring more team members to the point where I wanted to switch from Evernote to something that had more functionality. I was originally using the personal Evernote plan before switching briefly to Evernote Teams (which is now over $25/user/month).</p>\n<p>Long story short, I ended up testing most/all of the major Evernote alternatives, and wanted to compile each of their pros and cons here in the hopes that it will save someone else some time and money. Below, you can find the pros and cons for all of the Evernote alternatives and similar apps I tried: Taskade, Notion, Obsidian, OneNote, Clickup and Google Keep.</p>\n<p>These are all quality apps, and what is “best” depends partly on your needs and budget. Let me know if you're using any Evernote alternative(s) that I missed and I'll add them to the list!</p>\n<h2>Taskade: Evernote alternative with better collaboration + task/project management features</h2>\n<p><a href=\"https://www.taskade.com/\">https://www.taskade.com/</a></p>\n<p>The first Evernote alternative I tried was actually Notion, but Notion's own price increases led me to discover the app that ultimately became my favorite: Taskade. Taskade is often billed as a Notion alternative, and has pretty much all of the features Notion does. I use the Pro plan, which is $19 per month for up to 10 team members. If you’re not working with a team, I’d highly recommend their free plan, but the biggest draw for me was Taskade’s collaborative tools.</p>\n<p>Pros:</p>\n<ul>\n<li>Taskade has much stronger collaboration features than Evernote. Beyond collaborative editing, Taskade has in-app chatting, video calls etc. which are all ideal for working with a team.</li>\n<li>Taskade has a really good web clipper! This is a big deal, as that is basically Evernote’s best feature. Not all productivity and organization apps have a solid web clipper, so this is a key feature for an app to qualify as a great Evernote alternative, not just a supplement to Evernote.</li>\n<li>I also found it much better for task tracking and management than Evernote, especially with the large numbers of free templates they provide.</li>\n<li>There are AI features integrated into Taskade that make real-time suggestions as you work. It sounds gimmicky but they have a ton of templates that make it genuinely useful to use for stuff like generating ideas, cleaning up your writing, etc. all in the same interface.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>If databases are your thing, then Notion is still a better option than Taskade.</li>\n</ul>\n<p>Taskade managed to fill the gaps in functionality of Evernote with greater ease-of-use and flexibility than Notion, and the cost savings are huge. That is what makes it my all-around top pick.</p>\n<h2>Notion: Evernote alternative and a lot more</h2>\n<p><a href=\"https://www.notion.so/\">https://www.notion.so/</a></p>\n<p>Speaking of Taskade, it's hard not to mention Notion, which is probably the best-known app in this sphere. I tested out the “Plus” plan, which costs $8 per user per month. Note how much less expensive that is than Evernote Teams.</p>\n<p>Not only does Notion cost less than most Evernote plans, but it was also more tailored to my needs. The original Evernote was built around individual note-taking and organizing. While Teams was developed for collaboration, that is what Notion was built to facilitate in the first place. Its collaboration features are richer and more powerful than what Evernote offers.</p>\n<p>Pros:</p>\n<ul>\n<li>Not to continually dump on Notion, but Notion is still more affordable than Evernote even at its higher end plans, and comes with a lot more functionality for the money.</li>\n<li>Notion’s template collection is awesome, and the code block integration is nice.</li>\n<li>Given the concern around questionable support from Evernote going forward, Notion is a nice alternative in having a massive community and company behind it that regularly rolls out new features and fixes. They're still lacking some things like a nice offline mode, but it's generally improving.</li>\n<li>There are a lot of customization options available.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>Notion loads slowly on some of my devices, and occasionally feels unwieldy and unnecessarily complicated. If you're looking for an Evernote alternative that focuses mostly on notetaking/web clipping etc., it can be overly complicated/pricey.</li>\n</ul>\n<h2>Obsidian: excellent offline-only Evernote alternative for simple notetaking</h2>\n<p><a href=\"https://obsidian.md/\">https://obsidian.md/</a></p>\n<p>Pros:</p>\n<ul>\n<li>Obsidian is similar to Notion and Taskade in that it uses Markdown and has a lot of added functionality that Evernote doesn’t.</li>\n<li>The core of Obsidian is completely free. It’s still worth checking if you need any of their add-on features, as they do charge for these.</li>\n<li>Works well offline and uses the same markdown format that’s easy to learn even if you’re not already familiar</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>Lack of good collaboration features made it impossible for my use case.</li>\n<li>Rough mobile experience: this was one of my issues with Evernote, and Obsidian unfortunately has the same issue, where it’s simply not that built-out on mobile.</li>\n</ul>\n<p>Overall, Obsidian’s attraction and major issues both come from being a fairly simple app. Similarly, the lack of online features can be a con (if you work with others or like sharing/collaborating on documents) but also a pro (if you’re looking for something that won’t distract you and/or to work offline).</p>\n<h2>OneNote: intuitive notetaking app that integrates into MS Office</h2>\n<p><a href=\"https://www.microsoft.com/en-us/microsoft-365/onenote/digital-note-taking-app\">https://www.microsoft.com/en-us/microsoft-365/onenote/digital-note-taking-app</a></p>\n<p>OneNote was actually the first alternative to Evernote that I tried; I have a 365 subscription, so I figured I may as well. As you would guess from the name of this app, it is a direct competitor to Evernote.</p>\n<p>There is shared note-taking available through OneNote, but that is about the extent of it. Its functionality is pretty limited when it comes to managing and collaborating with teams on tasks.</p>\n<p>Pros:</p>\n<ul>\n<li>Overall, I found it easier to stay organized using OneNote than Evernote.</li>\n<li>Like Evernote, OneNote is great for what it does. It offers fantastic content sorting, tagging and annotation.</li>\n<li>While I’m not a huge Microsoft user, I suspect it’s nice to have everything on one subscription if you are.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>OneNote is not so great at web clipping. Evernote is way better in this area.</li>\n<li>For collaborative teams, OneNote is too basic to really get much done.</li>\n</ul>\n<p>OneNote is one of the closest to Evernote in terms of what it’s best at, but I didn’t find it much better overall at anything that would make me stick with it.</p>\n<h2>Clickup: well-rounded task focused alternative</h2>\n<p><a href=\"https://clickup.com/\">https://clickup.com/</a></p>\n<p>While Clickup is an alternative to Evernote, like Notion and Taskade, it is more of an all-in-one productivity and organization suite.</p>\n<p>Pros:</p>\n<ul>\n<li>Clickup is a solid task management app that offers whiteboards, docs, dashboards, chat and more to facilitate easy collaboration.</li>\n<li>I didn’t use Clickup long enough to verify this myself, but I’ve heard time and again that the support team is great, and the development team works hard to maintain and update the app.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>While Clickup does a lot of things Evernote does not, Evernote still is better for organizing materials for easy reference.</li>\n</ul>\n<h2>(Google) Keep: simple, free notetaking alternative integrated into Google's apps</h2>\n<p><a href=\"https://www.google.com/keep/\">https://www.google.com/keep/</a></p>\n<p>One more app I tried out was Google Keep. I’ve used it on and off since 2015 because it integrated nicely into Google Calendar, and always found it to fall a bit short in terms of functionality. But it is free if you have a Google account, and I was curious how it compared to Evernote.</p>\n<p>Pros:</p>\n<ul>\n<li>Google Keep supports web clipping, though with fewer bells and whistles than Evernote.</li>\n<li>You can share with other users with Google Keep; it also includes other basic features for checklists, reminders and so on.</li>\n</ul>\n<p>Cons:</p>\n<ul>\n<li>The simplicity of Google Keep may appeal to users who only need the basics, but the functionality is quite limited compared to Evernote.</li>\n</ul>\n<p>That wraps it up! Some of the Evernote alternatives I tested out were more direct notetaking only competitors, like Google Keep and OneNote. Unfortunately most of the note-taking only apps lack various features that Evernote has without adding enough other features to make up for it. Others, like Taskade, Notion and ClickUp, were designed to accommodate note-taking within a broader task-management and collaboration suite.</p>\n<h1>Tl;dr:</h1>\n<ol>\n<li><strong>Taskade:</strong> Notetaking + task management focused app with a nice free plan. Overall my favorite as it's the most intuitive for task/project management and has the best collaboration features for working with a team at a lower price than both Evernote and Notion.</li>\n<li><strong>Notion:</strong> Notion is arguably the biggest Evernote alternative. Solid notetaking functionality and other features Evernote lacks. Still cheaper than Evernote even after raising their prices!</li>\n<li><strong>Obsidian:</strong> Nice alternative built around markdown that's my favorite for offline only use, as it lacks the distractions of the web based ones. Unfortunately that also means it lacks some of the functionality I need for everyday use.</li>\n<li><strong>OneNote:</strong> Microsoft's notetaking app that comes free with Office 365 and other plans. I didn't spend too long on OneNote as I don't use many MS apps and couldn't justify paying for it after we left Office 365, but it seems to be well integrated into their other apps.</li>\n<li><strong>Google Keep:</strong> Free, simple notetaking app. Lacks some of Evernote's features but can be a good free Evernote alternative if you don't need advanced functionality and already use Google's other apps.</li>\n</ol>\n<p>Each of these alternatives has somewhat different target markets and I'd recommend trying out a few as they all have free plans. I mainly use Taskade day-to-day as it has all the features I used Evernote for like web-clipping and easy notetaking, but adds better teamwork and task management functionality that I needed for my business. With that said, I also use Obsidian as an offline-only one for when I don't want to get distracted.</p>\n<p>Let me know in the comments if I missed any that you guys have tried and try to include pros/cons if you can.</p></div>",
            "date_published": "2023-09-18T14:42:21+00:00",
            "authors": [
                {
                    "name": "Frontalaleph",
                    "url": "https://www.reddit.com/user/Frontalaleph"
                }
            ]
        },
        {
            "id": "16kh6e7",
            "url": "/r/macapps/comments/16kh6e7/best_wellcrafted_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16kh6e7/best_wellcrafted_apps/",
            "title": "Best Well-Crafted Apps",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16kh6e7/best_wellcrafted_apps/'>Reddit</a></caption><div><br></div><div><p>I’m looking for the best of the best of macOS. For example I like Pixelmator Pro, a nice editing tool. I also love Meta, Mela, Soulver… I just want to discover new apps that have an amazing UI and performance.</p></div>",
            "date_published": "2023-09-16T20:28:05+00:00",
            "authors": [
                {
                    "name": "danmartinvela",
                    "url": "https://www.reddit.com/user/danmartinvela"
                }
            ]
        },
        {
            "id": "16f5ar6",
            "url": "/r/macapps/comments/16f5ar6/cuber_your_mini_browser_for_the_macos_menu_bar/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16f5ar6/cuber_your_mini_browser_for_the_macos_menu_bar/",
            "title": "Cuber: Your Mini Browser for the macOS Menu Bar!",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16f5ar6/cuber_your_mini_browser_for_the_macos_menu_bar/'>Reddit</a></caption><div><br></div><div><p>Hey fellow Mac users,</p>\n<p>Are you tired of switching between apps just to browse the web on your Mac? Look no further! <a href=\"https://svenko.me/pages/cuber\">Cuber</a> is here to help you.</p>\n<p>&#x200B;</p>\n<p>With <a href=\"https://svenko.me/pages/cuber\">Cuber</a>, you can:</p>\n<p>🌐 Browse seamlessly from your menu bar.</p>\n<p>🔍 Search the web effortlessly.</p>\n<p>🖥️ Enjoy a minimalist, user-friendly design.</p>\n<p>📐 Customize your mini browser's size and position.</p>\n<p>&#x200B;</p>\n<p>This is my first macOS app :) For more info head to <a href=\"https://svenko.me/pages/cuber\">Cuber website</a>.</p>\n<p>https://preview.redd.it/ofxi40e8kgnb1.png?width=1810&amp;format=png&amp;auto=webp&amp;s=db1781d445997aefdfc8ace7da2b0670ebc6aa89</p></div>",
            "date_published": "2023-09-10T16:57:07+00:00",
            "authors": [
                {
                    "name": "sven_u",
                    "url": "https://www.reddit.com/user/sven_u"
                }
            ]
        },
        {
            "id": "16fy20u",
            "url": "/r/macapps/comments/16fy20u/private_llm_a_gpt_chatbot_that_runs_fully_offline/",
            "external_url": "https://www.reddit.com/r/macapps/comments/16fy20u/private_llm_a_gpt_chatbot_that_runs_fully_offline/",
            "title": "Private LLM: A GPT chatbot that runs fully offline on your Mac (and iPhone)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/16fy20u/private_llm_a_gpt_chatbot_that_runs_fully_offline/'>Reddit</a></caption><div><br></div><div><p>Hello fellow Mac users,</p>\n<p>My app is an AI chatbot works fully offline, without any subscriptions or privacy sacrifices. I’d <a href=\"https://old.reddit.com/r/ChatGPT/comments/14n09ph/personal_gpt_a_tiny_ai_chatbot_that_runs_fully/\">posted</a> <a href=\"https://old.reddit.com/r/apple/comments/14ijgtj/giveaway_personal_gpt_an_ai_chatbot_that_runs/\">about</a> this app on r/ChatGPT and r/Apple a few months ago, and got a great reception from both those subreddits.</p>\n<p>The app has come a long way since then. It started off as a universal iOS and macOS app with a fine tuned <a href=\"https://huggingface.co/togethercomputer/RedPajama-INCITE-Chat-3B-v1\">3B parameter LLM</a> on both macOS and iOS. Two months in, Apple asked me to rename the app (It was originally called Personal GPT) because OpenAI had a trademark on the term “GPT” in Switzerland. Eventually, I added a 7B parameter <a href=\"https://huggingface.co/Tap-M/Luna-AI-Llama2-Uncensored\">Llama 2 Uncensored</a> model as an optional download on iPhone 14 series phones and M1/M2 iPads. The current Mac app also ships with the 7B parameter Llama 2 Uncensored model by default.</p>\n<p>I wanted to wait until I had improved the macOS app to a point where it was super good, before posting it here on r/macapps. <a href=\"https://twitter.com/private_llm/status/1701140429033324805\">v1.3</a> of the macOS app was approved by Apple’s Mac App Store review this morning, and latest version brings the amazing <a href=\"https://huggingface.co/WizardLM/WizardLM-13B-V1.2\">WizardLM 13B v1.2</a> model as an optional 6.9GB download for users with Apple Silicon Macs and at least 16GB of RAM. This is a <a href=\"https://chat.lmsys.org/?leaderboard\">SOTA</a> model that in some cases can outperform some internet hosted models. Don’t take my word for it, try it out with these <a href=\"https://benchmarks.llmonitor.com\">prompts</a> or your own. We’ve got a public <a href=\"https://testflight.apple.com/join/GmnO1fdb\">TestFlight beta</a> if you’d like to try the app before buying it. It’s a universal app, with means that if you purchase it on either the iOS App Store or the Mac App Store and you’ll also get it on the other. Also, the app supports <a href=\"https://www.apple.com/family-sharing/\">Family Sharing</a>.</p>\n<p>I'm working on adding support for downloading even bigger (34B param) models for Apple Silicon Mac users with 32GB or more RAM, soon.</p>\n<p>Please feel free to AMA here, or on the app’s <a href=\"https://discord.gg/g2vMMbtHRt\">discord</a>.</p>\n<p><a href=\"https://apps.apple.com/app/private-llm/id6448106860\">App Store</a></p>\n<p><a href=\"https://privatellm.app/\">Website</a></p>\n<p>&#x200B;</p></div>",
            "date_published": "2023-09-11T15:21:15+00:00",
            "authors": [
                {
                    "name": "woadwarrior",
                    "url": "https://www.reddit.com/user/woadwarrior"
                }
            ]
        },
        {
            "id": "159bcwv",
            "url": "/r/macapps/comments/159bcwv/arc_now_available_without_waitlist/",
            "external_url": "https://arc.net/",
            "title": "Arc Now Available Without Waitlist",
            "content_html": "<caption>Open: <a href='https://arc.net/'>arc.net</a> | <a href='https://reddit.com/r/macapps/comments/159bcwv/arc_now_available_without_waitlist/'>Reddit</a></caption>",
            "date_published": "2023-07-25T15:15:42+00:00",
            "authors": [
                {
                    "name": "vegoonvibes",
                    "url": "https://www.reddit.com/user/vegoonvibes"
                }
            ]
        },
        {
            "id": "158gkxz",
            "url": "/r/macapps/comments/158gkxz/little_snitch_5_discount_207usd/",
            "external_url": "https://www.reddit.com/r/macapps/comments/158gkxz/little_snitch_5_discount_207usd/",
            "title": "Little Snitch 5 discount (20.7USD)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/158gkxz/little_snitch_5_discount_207usd/'>Reddit</a></caption><div><br></div><div><p>One of the best app for macOS, here is the link <a href=\"https://bundlehunt.com/single-deal/little-snitch-5\">https://bundlehunt.com/single-deal/little-snitch-5</a></p>\n<p>https://preview.redd.it/7bzp5hyd3ydb1.png?width=825&amp;format=png&amp;auto=webp&amp;s=b4f2967dd67b5a94a7922699ffef3a99353e1144</p></div>",
            "date_published": "2023-07-24T17:09:01+00:00",
            "authors": [
                {
                    "name": "Victoredl",
                    "url": "https://www.reddit.com/user/Victoredl"
                }
            ]
        },
        {
            "id": "156we58",
            "url": "/r/macapps/comments/156we58/i_developed_a_docker_management_tool_for_macos/",
            "external_url": "https://v.redd.it/5my17b3m7ldb1",
            "title": "I Developed a Docker Management Tool for MacOS and Linux Servers. What Do You Think?",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/156we58/i_developed_a_docker_management_tool_for_macos/\">Reddit</a></caption><div><br></div><iframe src='/r/macapps/comments/156we58/i_developed_a_docker_management_tool_for_macos/?ref_source=embed&amp;ref=share&amp;embed=true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none;' width='640' height='360' frameborder='0' scrolling='no' allowfullscreen></iframe>",
            "date_published": "2023-07-22T21:50:45+00:00",
            "authors": [
                {
                    "name": "Typ0genius",
                    "url": "https://www.reddit.com/user/Typ0genius"
                }
            ]
        },
        {
            "id": "154ujq0",
            "url": "/r/macapps/comments/154ujq0/subscription_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/154ujq0/subscription_apps/",
            "title": "Subscription Apps",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/154ujq0/subscription_apps/'>Reddit</a></caption><div><br></div><div><p>Who's had enough of this bullshit trend of apps going to the ongoing subscription model. I'm well over it. Everything's a fucken subscription these days.</p>\n<p>What's the saying. \"You'll own nothing, and you'll be happy\". Well Klaus. I'm not fucken happy.</p></div>",
            "date_published": "2023-07-20T15:45:09+00:00",
            "authors": [
                {
                    "name": "cosmicpracticaljoke",
                    "url": "https://www.reddit.com/user/cosmicpracticaljoke"
                }
            ]
        },
        {
            "id": "150lzdc",
            "url": "/r/macapps/comments/150lzdc/introducing_magicai_a_new_assistant_for_your_mac/",
            "external_url": "https://v.redd.it/l9pekgwkt6cb1",
            "title": "✨ Introducing MagicAI – a new assistant for your Mac that can turn the most simple sketches into works of art.",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/150lzdc/introducing_magicai_a_new_assistant_for_your_mac/\">Reddit</a></caption><div><br></div><iframe src='/r/macapps/comments/150lzdc/introducing_magicai_a_new_assistant_for_your_mac/?ref_source=embed&amp;ref=share&amp;embed=true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none;' width='640' height='360' frameborder='0' scrolling='no' allowfullscreen></iframe>",
            "date_published": "2023-07-15T20:21:59+00:00",
            "authors": [
                {
                    "name": "joogps",
                    "url": "https://www.reddit.com/user/joogps"
                }
            ]
        },
        {
            "id": "14yhwxi",
            "url": "/r/macapps/comments/14yhwxi/a_collection_of_useful_mac_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/14yhwxi/a_collection_of_useful_mac_apps/",
            "title": "A collection of useful Mac Apps",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/14yhwxi/a_collection_of_useful_mac_apps/'>Reddit</a></caption><div><br></div><div><p>Mac apps, in no particular order\\~! Enjoy it.</p>\n<p>Note: This list has duplicates, like Magnet, and Rectangle, I have put in multiple options, as there hopefully is an app you would love, which has a better duplicate, in this case Reatangle. Like i said last time, please add comments, add apps, suggestions, and everything you love to do!</p>\n<h2>Productivity</h2>\n<ul>\n<li><a href=\"https://raycast.com/\">Raycast</a> - Price: Free</li>\n<li>Spotlight-like app for macOS that allows you to quickly access and execute commands, access apps, hotkeys, text expansion, clipboard manager and more.</li>\n<li><a href=\"https://www.alfredapp.com/\">Alfred</a> - Price: Free (optional paid Powerpack available for £29)</li>\n<li>Productivity app for macOS that boosts efficiency with hotkeys, keywords, and more.</li>\n<li><a href=\"https://cleanshot.com/\">CleanShot X</a> -  Price: $29.99 (one-time purchase)</li>\n<li>Screenshot and screen recording tool for Mac that offers advanced editing features, screen recording, text OCR and more.</li>\n<li><a href=\"https://shottr.cc/\">Shottr</a> - Price: Free, with an $8 paid option (one-time purchase)</li>\n<li>Screenshot and annotation tool for Mac that allows you to capture and edit screenshots with ease.</li>\n<li><a href=\"https://www.notion.so/\">Notion</a> - Price: Free (optional paid plans available)</li>\n<li>All-in-one workspace for notes, tasks, wikis, and databases.</li>\n<li><a href=\"https://trello.com/\">Trello</a> - Price: Free (optional paid plans available)</li>\n<li>Collaborative project management tool that organizes your projects into boards.</li>\n<li><a href=\"https://todoist.com/\">Todoist</a> - Price: Free (optional paid plans available)</li>\n<li>To-do list and task manager app that helps you get things done.</li>\n<li><a href=\"https://heyfocus.com/\">Focus</a> - Price: $19.99/year</li>\n<li>App for Mac that blocks distracting websites and apps to help you stay focused.</li>\n<li><a href=\"https://rectangleapp.com/\">Rectangle</a> - Price: Free</li>\n<li>Window manager for macOS that allows you to easily resize and arrange windows on your Mac.</li>\n<li><a href=\"https://rectangleapp.com/pro\">Rectangle Pro</a> - Price: $15 (one-time purchase)</li>\n<li>Same as normal Rectangle, with throwing features, more arrangments, workspace setup for windows in any location you want and more.</li>\n<li><a href=\"https://magnet.crowdcafe.com/\">Magnet</a> - Price: Free</li>\n<li>Window manager for macOS that allows you to easily resize and arrange windows on your Mac.</li>\n<li><a href=\"https://mindnode.com/\">MindNode</a> - Price: $39.99 (one-time purchase)</li>\n<li>Mind mapping app for Mac that helps you visualize your ideas and thoughts.</li>\n<li><a href=\"https://www.omnigroup.com/omnifocus/\">OmniFocus</a> - Price: $39.99 (Standard) or $99.99 (Pro)</li>\n<li>Task management app for Mac that helps you stay organized and focused.</li>\n<li><a href=\"https://pomodoro-timer.com/\">Pomodoro Timer</a> - Price: Free</li>\n<li>App for Mac that uses the Pomodoro technique to help you stay focused and productive.</li>\n<li><a href=\"https://www.rescuetime.com/\">RescueTime</a> - Price: Free (optional paid plans available)</li>\n<li>Time tracking app for Mac that helps you understand how you spend your time and be more productive.</li>\n<li><a href=\"https://culturedcode.com/things/\">Things 3</a> - Price: $49.99</li>\n<li>To-do list for MacOS.</li>\n<li><a href=\"https://timingapp.com/\">Timing</a> - Price: $42/year or $7/month</li>\n<li>Automatic time tracking app for Mac that helps you track and analyze your time spent on different tasks and projects.</li>\n</ul>\n<h2>Developer Tools</h2>\n<ul>\n<li><a href=\"https://code.visualstudio.com/\">Visual Studio Code</a> - Price: Free</li>\n<li>Lightweight but powerful source code editor that runs on your desktop and is available for Windows, macOS, and Linux.</li>\n<li><a href=\"https://iterm2.com/\">iTerm2</a> - Price: Free</li>\n<li>Terminal emulator for macOS features multiple panes, search, and more.</li>\n<li><a href=\"https://www.postman.com/\">Postman</a> - Price: Free (optional paid plans available)</li>\n<li>API development environment that helps you design, test, and document APIs.</li>\n<li><a href=\"https://www.docker.com/products/docker-desktop\">Docker Desktop</a> - Price: Free - Tool for building, shipping, and running distributed applications in containers.</li>\n<li><a href=\"https://proxyman.io/\">Proxyman</a> - Price: Free (optional paid plans available)</li>\n<li>Modern and intuitive HTTP/HTTPS debugging proxy app for macOS.</li>\n<li><a href=\"https://karabiner-elements.pqrs.org/\">Karabiner-Elements</a> - Price: Free</li>\n<li>Powerful and stable keyboard customizer for macOS.</li>\n<li><a href=\"https://www.hammerspoon.org/\">Hammerspoon</a> - Price: Free</li>\n<li>Desktop automation tool for macOS that allows you to write Lua scripts to control your Mac.</li>\n<li><a href=\"https://sw.kovidgoyal.net/kitty/\">Kitty</a> - Price: Free</li>\n<li>Fast, feature-rich, GPU-based terminal emulator for macOS.</li>\n<li><a href=\"https://www.warp.dev/\">Warp</a> - Price: Free (optional paid plans available)</li>\n<li>Modern, Rust-based terminal with AI built in so you and your team can build great software, faster.</li>\n<li><a href=\"https://espanso.org/\">Espanso</a> - Price: Free</li>\n<li>Text expander for macOS that allows you to create custom abbreviations for your frequently used text.</li>\n<li><a href=\"https://getkap.co/\">Kap</a> - Price: Free</li>\n<li>Screen recording app for Mac that allows you to record your screen and webcam with ease.</li>\n<li><a href=\"https://nova.app/\">Nova</a> - Price: $99 (one-time purchase)</li>\n<li>Code editor for macOS that features a sleek UI, powerful features, and great performance.</li>\n<li><a href=\"https://developer.apple.com/xcode/\">Xcode</a> -Price: Free</li>\n<li>Integrated development environment (IDE) for macOS that contains a suite of software development tools for developing software for macOS, iOS, iPadOS, watchOS, and tvOS.</li>\n<li><a href=\"https://git-fork.com/\">Fork</a> - Price: $49 (one-time purchase)</li>\n<li>Git client for Mac that features a user-friendly interface and powerful features.</li>\n<li><a href=\"https://desktop.github.com/\">GitHub Desktop</a> - Price: Free</li>\n<li>Git client for Mac that allows you to manage your GitHub repositories.</li>\n<li><a href=\"https://eggerapps.at/postico/\">Postico</a> -  Price: $35.99 (one-time purchase)</li>\n<li>PostgreSQL client for Mac that features a user-friendly interface and powerful features.</li>\n<li><a href=\"https://www.git-tower.com/mac/\">Tower</a> - Price: $69/year (personal) or $199/year (business)</li>\n<li>Git client for Mac that features a user-friendly interface and powerful features.</li>\n<li><a href=\"https://panic.com/transmit/\">Transmit</a> - Price: $45 (one-time purchase)</li>\n<li>FTP client for Mac that allows you to upload and download files to and from your server.</li>\n<li><a href=\"https://bootstrapstudio.io/\">Bootstrap Studio</a> - Price: $29-59 (\"one-time\" purchase, only for $59 option, the other has 1 year free updates after that you're out)</li>\n<li>A powerful desktop app for creating responsive websites using the Bootstrap framework.</li>\n<li><a href=\"https://typefaceapp.com/\">Typeface</a> - Price: Free (one-time purchase of $60)</li>\n<li>Pretty powerful font manager for macOS</li>\n<li><a href=\"https://apps.apple.com/us/app/boop/id1518425043?mt=12\">Boop</a> - Price: Free</li>\n<li>Converting language(s), or do simple tasks using <code>CLI</code> languages.</li>\n<li><a href=\"https://www.mamp.info/en/mac/\">MAMP</a> <a href=\"https://www.mamp.info/en/mamp-pro/mac/\">OR PRO</a> - Price: Free or $100 (one-time purchase)</li>\n<li>Web development solution with Apache, Nginx, PHP &amp; MySQL, allows for local hosting of your site to build upon.</li>\n</ul>\n<h2>Design, Creativity and Media Tools</h2>\n<ul>\n<li><a href=\"https://iina.io/\">IINA</a> - Price: Free</li>\n<li>Modern media player for macOS that supports almost all video and audio formats.</li>\n<li><a href=\"https://handbrake.fr/\">Handbrake</a> - Price: Free</li>\n<li>Open-source video transcoder that converts video from nearly any format to a selection of modern, widely supported codecs.</li>\n<li><a href=\"https://aerialscreensaver.github.io/\">Aerial Companion</a> - Price: Free</li>\n<li>Companion app for the Aerial screensaver that allows you to customize its settings.</li>\n<li><a href=\"https://www.blackmagicdesign.com/products/davinciresolve/\">DaVinci Resolve 18</a> - Price: Free (optional paid version available)</li>\n<li>Professional video editing software for macOS that features advanced color correction, audio post-production, advanced fusion, visual effects &amp; more.</li>\n<li><a href=\"https://imageoptim.com/mac\">ImageOptim</a> - Price: Free</li>\n<li>Image optimizer for Mac that allows you to reduce the file size of your images without losing quality.</li>\n<li><a href=\"https://www.videolan.org/vlc/\">VLC</a> - Price: Free</li>\n<li>Free and open-source media player that plays most multimedia files and DVDs, Audio CDs, VCDs, and various streaming protocols. (UX/UI feels outdated imo)</li>\n<li><a href=\"https://affinity.serif.com/en-gb/photo/\">Affinity Photo 2</a> - Price: $49.99 (one-time purchase)</li>\n<li>Professional photo editing software for Mac that features advanced editing tools and a user-friendly interface.</li>\n<li><a href=\"https://www.darktable.org/\">Darktable</a> - Price: Free</li>\n<li>Free and open-source photo editing software for Mac that features advanced editing tools and a user-friendly interface.</li>\n<li><a href=\"https://mac.eltima.com/media-player.html\">Elmedia Player</a> - Price: Free (optional paid version available)</li>\n<li>Media player for Mac that supports a wide range of video and audio formats.</li>\n<li><a href=\"https://obsproject.com/\">OBS</a> - Price: Free</li>\n<li>Free and open-source software for video recording and live streaming, also can record desktop audio without the need for AudioHijack.</li>\n<li><a href=\"https://www.audacityteam.org/\">Audacity</a> - Price: Free</li>\n<li>Free and open-source audio editor that allows you to record and edit audio files.</li>\n<li><a href=\"https://www.gimp.org/\">GIMP</a> - Price: Free</li>\n<li>Free and open-source image editor that features advanced editing tools and a user-friendly interface.</li>\n<li><a href=\"https://inkscape.org/\">Inkscape</a> - Price: Free</li>\n<li>Free and open-source vector graphics editor that allows you to create and edit vector graphics.</li>\n<li><a href=\"https://krita.org/\">Krita</a> - Price: Free</li>\n<li>Free and open-source digital painting software that features advanced painting tools and a user-friendly interface.</li>\n<li><a href=\"https://www.openshot.org/\">OpenShot</a> - Price: Free</li>\n<li>Free and open-source video editor that allows you to edit and create videos with ease.</li>\n<li><a href=\"https://www.adobe.com/creativecloud.html\">Adobe Creative Cloud Suite</a> - Price: Varies (subscription-based)</li>\n<li>Suite of creative software applications including Photoshop, Illustrator, InDesign, and more, provided by Adobe.</li>\n<li><a href=\"https://www.sketch.com/\">Sketch</a> - Price: $9/month or $99/year</li>\n<li>Design tool for macOS that allows you to create user interfaces, icons, and more.</li>\n<li><a href=\"https://www.figma.com/\">Figma</a> - Price: Free</li>\n<li>Cloud-based design and prototyping tool that enables collaboration and real-time editing.</li>\n<li><a href=\"https://www.canva.com/\">Canva</a> - Price: Free</li>\n<li>Online graphic design platform with a drag-and-drop interface for creating social media graphics, presentations, and more.</li>\n</ul>\n<h2>Writing and Note-taking</h2>\n<ul>\n<li><a href=\"https://www.craft.do/\">Craft</a> -Price: Free (with premium subscription available)</li>\n<li>Notetaking and writing app that features a block-based approach and beautiful design.</li>\n<li><a href=\"https://ulysses.app/\">Ulysses</a> - Price: $5.99/month or $49.99/year (subscription)</li>\n<li>Writing app for Mac, iPad, and iPhone that offers a distraction-free writing environment and advanced features for writers.</li>\n<li><a href=\"https://bear.app/\">Bear</a> - Price: Free (with optional Bear Pro subscription available)</li>\n<li>Private Markdown editor for Mac, iPad, and iPhone that allows you to write notes, to-dos, and essays with advanced markup options and beautiful themes.</li>\n<li><a href=\"https://obsidian.md/\">Obsidian</a> - Price: Free (with optional paid features available)</li>\n<li>Note-taking app that allows you to link your notes to each other to build a knowledge base.</li>\n<li><a href=\"https://www.notion.so/\">Notion</a> - Price: Free (with premium subscription available)</li>\n<li>All-in-one workspace for notes, tasks, wikis, and databases.</li>\n<li><a href=\"https://trello.com/\">Trello</a> - Price: Free (with optional Business Class and Enterprise plans available)</li>\n<li>Collaborative project management tool that organizes your projects into boards.</li>\n<li><a href=\"https://todoist.com/\">Todoist</a> -  Price: Free (with optional premium subscription available)</li>\n<li>To-do list and task manager app that helps you get things done.</li>\n<li><a href=\"https://www.zettlr.com/\">Zettlr</a> - Price: Free (with optional donations)</li>\n<li>Markdown editor for Mac that features a user-friendly interface and advanced features for writers.</li>\n<li><a href=\"https://culturedcode.com/things/\">Things 3</a> -  Price: $49.99 (one-time purchase)</li>\n<li>To-do list for MacOS.</li>\n<li><a href=\"https://gottcode.org/focuswriter/\">FocusWriter</a> - Price: Free</li>\n<li>Distraction-free writing app for Mac that allows you to focus on your writing.</li>\n<li><a href=\"https://www.grammarly.com/\">Grammarly</a> - Price: Free (with optional premium subscription available)</li>\n<li>Writing assistant that helps you write clear and effective English.</li>\n<li><a href=\"https://www.literatureandlatte.com/scrivener/overview\">Scrivener</a> - Price: $49 (one-time purchase)</li>\n<li>Writing app for Mac that features a user-friendly interface and advanced features for writers.</li>\n<li><a href=\"https://www.zotero.org/\">Zotero</a> - Price: Free</li>\n<li>Free and open-source reference manager that helps you collect, organize, and cite your research sources.</li>\n</ul>\n<h2>Utilities + Menu Bar apps</h2>\n<ul>\n<li><a href=\"https://musicbar.inedible.dev/\">MusicBar</a> - Price: Free</li>\n<li>Menu bar app for macOS that allows you to see your current playing audio using the <code>NowPlaying.API</code>.</li>\n<li><a href=\"https://apps.apple.com/us/app/amphetamine/id937984704?mt=12\">Amphetamine</a> - Price: Free</li>\n<li>Prevents your Mac from going to sleep, dimming the screen, or starting screen savers.</li>\n<li><a href=\"https://batfi.app/\">BatFi</a> - Price: Free</li>\n<li>Battery monitoring app for Mac that allows you to see your battery status and usage.</li>\n<li><a href=\"https://www.macbartender.com/\">Bartender 4</a> - Price: $15 (one-time purchase) 4 week free trial)</li>\n<li>Organize your menu bar apps on your Mac.</li>\n<li><a href=\"https://textpal.app/\">TextPal</a> - Price: Free</li>\n<li>Text editor for Mac that features a minimalist design and advanced features for writers.</li>\n<li><a href=\"https://bitwarden.com/\">Bitwarden</a> - Free and open-source password manager for Mac that allows you to store and manage your passwords securely.</li>\n<li><a href=\"https://objective-see.com/products/blockblock.html\">BlockBlock</a> - Price: Free</li>\n<li>Security tool for macOS that monitors your system for persistent malware.</li>\n<li><a href=\"https://www.mediaatelier.com/CheatSheet/\">CheatSheet</a> - Price: Free</li>\n<li>Menu bar app for macOS that displays keyboard shortcuts for the app you're currently using.</li>\n<li><a href=\"https://dropoverapp.com/\">Dropover</a> - Price: Free (with optional premium subscription available)</li>\n<li>Drag and drop utility for macOS that allows you to easily move files between folders and apps.</li>\n<li><a href=\"https://espanso.org/\">Espanso</a> - Price: Free</li>\n<li>Text expander for macOS that allows you to create custom abbreviations for your frequently used text.</li>\n<li><a href=\"https://www.folderpeek.com/\">Folder Peek</a> - Price: Free</li>\n<li>Menu bar app for macOS that allows you to preview the contents of a folder without opening it.</li>\n<li><a href=\"https://handmirror.app/\">Hand Mirror</a> - Price: Free</li>\n<li>Virtual mirror app for Mac that allows you to see yourself on your screen.</li>\n<li><a href=\"https://justgetflux.com/\">Flux</a> - Price: Free</li>\n<li>App that adjusts your Mac's display color temperature to reduce eye strain and improve sleep.</li>\n<li><a href=\"https://www.imagetasks.com/istatistica/\">iStatistica</a> - Price: $4.99 (one-time purchase)</li>\n<li>System monitoring app for Mac that displays real-time CPU, GPU, and network usage.</li>\n<li><a href=\"https://www.titanium-software.fr/en/maintenance.html\">Maintenance</a> - Price: Free</li>\n<li>System maintenance and cleaning utility for macOS.</li>\n<li><a href=\"https://shareful.macenhance.com/\">Shareful</a> - Price: Free</li>\n<li>Menu bar app for macOS that allows you to quickly share files and links with others.</li>\n<li><a href=\"https://apps.apple.com/us/app/spaced/id1666327168?mt=12\">Spaced</a> - Price: Free</li>\n<li>Put spacings into your menu bar</li>\n<li><a href=\"https://alt-tab-macos.netlify.app/\">AltTab</a> - Price: Free</li>\n<li>Windows-like Alt-Tab switcher for macOS.</li>\n<li><a href=\"https://www.bresink.com/osx/TinkerTool.html\">TinkerTool</a> - Price: Free</li>\n<li>System utility for macOS that allows you to customize many aspects of your Mac's appearance and behavior.</li>\n<li><a href=\"https://www.mowglii.com/itsycal/\">Itsycal</a> - Price: Free</li>\n<li>Menu bar calendar app for macOS that allows you to see your upcoming events and reminders.</li>\n<li><a href=\"https://karabiner-elements.pqrs.org/\">Karabiner-Elements</a> - Price: Free</li>\n<li>Powerful and stable keyboard customizer for macOS.</li>\n<li><a href=\"https://www.keka.io/\">Keka</a> - Price: Free</li>\n<li>File archiver for macOS that supports many file formats, including ZIP, RAR, and 7-Zip.</li>\n<li><a href=\"https://objective-see.com/products/knockknock.html\">KnockKnock</a> - Price: Free</li>\n<li>Security tool for macOS that allows you to see what's persistently installed on your Mac.</li>\n<li><a href=\"https://linearmouse.app/\">LinearMouse</a> - Price: Free</li>\n<li>Mouse acceleration manager for macOS that allows you to customize your mouse acceleration curve.</li>\n<li><a href=\"https://lunar.fyi/\">Lunar</a> - Price: Free (optional premium one-time purchase)</li>\n<li>Menu bar app for macOS that allows you to adjust your display's brightness and color temperature. (Pro version also available.)</li>\n<li><a href=\"https://macgpt.com/\">MacGPT</a> - Price: Free</li>\n<li>ChatGPT in your menu bar, one of the originals, and one of the best</li>\n<li><a href=\"https://www.corecode.io/macupdater/\">MacUpdater</a> - Price: Free (with an optional pro version available)</li>\n<li>App updater for macOS that automatically checks for updates and installs them for you.</li>\n<li><a href=\"https://macwhisper.com/\">MacWhisper</a> - Price: Free (with an optional pro version available)</li>\n<li>Transcribe any audio.</li>\n<li><a href=\"https://nextdns.io/\">NextDNS</a> - Price: Free (with an optional pro version available)</li>\n<li>DNS resolver for macOS that blocks ads, trackers, and malware.</li>\n<li><a href=\"https://www.titanium-software.fr/en/onyx.html\">OnyX</a> - Price: Free</li>\n<li>Maintenance and optimization utility for macOS.</li>\n<li><a href=\"https://sindresorhus.com/plash\">Plash</a> - Price: Free</li>\n<li>Menu bar app for macOS that allows you to create and manage web apps as if they were native apps.</li>\n<li><a href=\"https://objective-see.com/products/reikey.html\">ReiKey</a> - Price: Free</li>\n<li>Security tool for macOS that monitors your system for keyloggers and other malware.</li>\n<li><a href=\"https://getstats.app/\">Stats</a> - Price: Free</li>\n<li>System monitoring app for Mac that displays real-time CPU, GPU, and network usage.</li>\n<li><a href=\"https://unclack.app/\">Unclack</a> - Price: Free</li>\n<li>App for macOS that mutes your keyboard's built-in speaker to reduce noise.</li>\n<li><a href=\"https://theunarchiver.com/\">The Unarchiver</a> - Price: Free</li>\n<li>Free decompression utility that supports many file formats, including RAR, ZIP, 7-Zip, and more.</li>\n<li><a href=\"https://freemacsoft.net/appcleaner/\">AppCleaner</a> - Price: Free</li>\n<li>Small application allows you to thoroughly uninstall unwanted apps.</li>\n<li><a href=\"https://www.obdev.at/products/littlesnitch/index.html\">Little Snitch</a> - Price: $45 (one-time purchase)</li>\n<li>Network monitor and firewall for macOS that allows you to control your network connections.</li>\n<li><a href=\"https://bjango.com/mac/istatmenus/\">iStat Menus</a> - Price: $14.99 (one-time purchase)</li>\n<li>Advanced system monitor for macOS that displays real-time CPU, GPU, and network usage.</li>\n<li><a href=\"https://daisydiskapp.com/\">DaisyDisk</a> - Price: $9.99 (one-time purchase)</li>\n<li>Disk space analyzer for macOS that allows you to visualize your disk usage and free up space.</li>\n<li><a href=\"https://coteditor.com/\">CotEditor</a> - Price: Free</li>\n<li>Text editor for macOS that features syntax highlighting and a user-friendly interface.</li>\n<li><a href=\"https://www.darktable.org/\">Darktable</a> - Price: Free</li>\n<li>Free and open-source photo editing app.</li>\n<li><a href=\"https://theunarchiver.com/\">The Unarchiver</a> - Price: Free</li>\n<li>Free decompression utility that supports many file formats, including RAR, ZIP, 7-Zip, and more.</li>\n<li><a href=\"https://freemacsoft.net/appcleaner/\">AppCleaner</a> - Price: Free</li>\n<li>Small application allows you to thoroughly uninstall unwanted apps. (Raycast can do this too)</li>\n<li><a href=\"https://imageoptim.com/mac\">ImageOptim</a> - Price: Free</li>\n<li>Image optimizer for Mac that allows you to reduce the file size of your images without losing quality, and strip the metadata.</li>\n<li><a href=\"https://folivora.ai/\">BetterTouchTool</a> - Price: $15+ with a free trial</li>\n<li>Customizable gestures and shortcuts (also a BTT Remote, $5)</li>\n</ul>\n<h2>Web Browsers</h2>\n<ul>\n<li><a href=\"https://arc.net/\">Arc</a> - Price: Free</li>\n<li>\"rebuilt the internet\", an awesome browser give it a try</li>\n<li><a href=\"https://www.google.com/chrome/\">Google Chrome</a> - Price: \"Free\"</li>\n<li>Fast and \"secure\" web browser developed by Google, the de facto Chromium browser.</li>\n<li><a href=\"https://www.apple.com/safari/\">Safari</a> - Price: Free</li>\n<li>Web browser developed by Apple for macOS and iOS.</li>\n<li><a href=\"https://www.mozilla.org/en-US/firefox/new/\">Mozilla Firefox</a> - Price: Free</li>\n<li>Free and open-source web browser with a focus on privacy and customization.</li>\n<li><a href=\"https://www.microsoft.com/edge\">Microsoft Edge</a> - Price: Free</li>\n<li>Web browser developed by Microsoft based on the Chromium project.</li>\n<li><a href=\"https://brave.com/\">Brave</a> - Price: Free (VPN is a paid option)</li>\n<li>Privacy-focused web browser with built-in ad-blocking and enhanced security features.</li>\n</ul></div>",
            "date_published": "2023-07-13T11:10:59+00:00",
            "authors": [
                {
                    "name": "Ultim8Chaos06",
                    "url": "https://www.reddit.com/user/Ultim8Chaos06"
                }
            ]
        },
        {
            "id": "14tfqsh",
            "url": "/r/macapps/comments/14tfqsh/i_created_a_simple_and_intuitive_macos_app_to/",
            "external_url": "https://www.reddit.com/r/macapps/comments/14tfqsh/i_created_a_simple_and_intuitive_macos_app_to/",
            "title": "I created a simple and intuitive MacOS app to track and manage job applications and interviews.",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/14tfqsh/i_created_a_simple_and_intuitive_macos_app_to/'>Reddit</a></caption><div><br></div><div><p>&#x200B;</p>\n<p>https://preview.redd.it/90luoa6r8lab1.png?width=2560&amp;format=png&amp;auto=webp&amp;v=enabled&amp;s=a427cfcc1389d5006a47d6944dfa22048ccf1ea6</p>\n<p>I recently shipped a free MacOS app called <a href=\"https://apps.apple.com/ca/app/jobsnail/id6449959070?mt=12\">JobSnail</a> - a simple job application and interview tracker. If you find yourself overwhelmed with hundreds of job applications and struggling to keep track of your interviews, like I did, give JobSnail a try! I built this app for personal use, but then decided to release in on the AppStore, because it may be of use for someone else.</p>\n<p>I made this post to ask for feedback on the app, so I will appreciate all your opinions. Thank you very much in advance for your help!</p></div>",
            "date_published": "2023-07-07T18:48:27+00:00",
            "authors": [
                {
                    "name": "mikeRaccoonDev",
                    "url": "https://www.reddit.com/user/mikeRaccoonDev"
                }
            ]
        },
        {
            "id": "14g49uf",
            "url": "/r/macapps/comments/14g49uf/today_im_launching_a_public_beta_of_my_new_app/",
            "external_url": "https://www.reddit.com/r/macapps/comments/14g49uf/today_im_launching_a_public_beta_of_my_new_app/",
            "title": "Today I'm launching a public beta of my new app Godspeed, a blazingly fast, 100% keyboard oriented todo manager",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/14g49uf/today_im_launching_a_public_beta_of_my_new_app/'>Reddit</a></caption><div><br></div><div><p>Hi everybody, today I'm launching a public beta for an app I've spent the last year working on: Godspeed.</p>\n<p>Godspeed is a todo manager built with two priorities in mind: speed and 100% keyboard orientation. My goal with Godspeed was to make every single action doable with just your keyboard, and to have those actions respond instantly. Like Superhuman for your todo list.</p>\n<p>I built Godspeed for myself and have been using it daily for about six months now. Before that I used a couple other apps, like OmniFocus, but have found that they all have weak keyboard support and feel pretty slow.</p>\n<p>So Godspeed is my answer to those weak points.</p>\n<p>Something I want to note especially for the r/macapps crowd: Godspeed is an Electron app. But it may be the fastest and most memory-efficient Electron app you've ever used. It generally uses less memory than most of the native apps I run, and it's definitely a hell of a lot faster than them.</p>\n<p>A few of my friends have started using it in the past couple months and their feedback has been incredibly valuable. So I've decided to open up access to more folks for a public beta. Access is free during the beta, but if all goes well I do eventually intend to offer subscription and one-time purchase options. And I'll have discounts available for beta users!</p>\n<p>Thanks for checking it out, I'd appreciate any feedback you have!</p>\n<p><a href=\"https://godspeedapp.com\">https://godspeedapp.com</a></p>\n<p>&#x200B;</p>\n<p><a href=\"https://i.redd.it/88n2lyyvrk7b1.gif\">a short gif showing Godspeed in action</a></p></div>",
            "date_published": "2023-06-22T13:57:45+00:00",
            "authors": [
                {
                    "name": "1231313",
                    "url": "https://www.reddit.com/user/1231313"
                }
            ]
        },
        {
            "id": "145ymem",
            "url": "/r/macapps/comments/145ymem/we_will_also_be_joining_the_reddit_blackout_from/",
            "external_url": "https://www.reddit.com/r/macapps/comments/145ymem/we_will_also_be_joining_the_reddit_blackout_from/",
            "title": "We will also be joining the Reddit Blackout from June 12th to 14th to contribute to the protest of the planned API changes that will kill 3rd party apps.",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/145ymem/we_will_also_be_joining_the_reddit_blackout_from/'>Reddit</a></caption><div><br></div><div><p>Hi r/MacApps</p>\n<p>&#x200B;</p>\n<p>Recently Reddit Inc has announced changes to their API which, if enacted, will shut down many, if not all, 3rd party apps that a large number of Redditors use to access and enjoy their favourite communities.</p>\n<p>One of the most critical changes to the API is that it is moving from a free to a paid model, resulting in expenses that developers of 3rd party apps simply cannot afford. To put the price change in to context, Apollo, one of the most popular 3rd party apps for Reddit, is looking at a cost of $1.7 million per month to continue operating. That's a cost of $12,000 per 50 million API requests. In contrast, Apollo pays Imgur $166 for every 50 million API calls.</p>\n<p>&#x200B;</p>\n<p>This means popular apps like Apollo, Reddit Is Fun, Narwhal and many more will have to shut down, permanently.</p>\n<p>Even if you're not using a 3rd party app yourself, these changes are likely to impact the communities you enjoy as well, with the vast majority of moderation teams relying on 3rd party or self-made tools, that utilize Reddit's API.</p>\n<p>&#x200B;</p>\n<p>What happens; On June 12th, we and a growing number of other subs - large and small - will go dark for 48 hours. During that time, you will not be able to view or post any content on r/MacApps. This action isn't something we take lightly.</p>\n<p>We understand that many of you enjoy coming here on a daily basis to keep up with the apps, but we believe that we must take a stand on this topic - and this is how we can do so.</p>\n<p>We understand that Reddit is a company that has to make money in order to offer us a place to be the community that we are - but killing beloved 3rd party apps is not they way to do it. We are not asking Reddit to provide a paid service for free - we are asking for reasonable pricing for apps that people have come to love and depend on to participate in their communities.</p>\n<p>&#x200B;</p>\n<p>What you can do to support this:</p>\n<p>While subs going dark is one thing, regular users can help as well.</p>\n<p>Reach out to Reddit via the channels available to you: Modmail r/reddit, comment in relevant posts regarding the API changes, submit your comments via the contact forms.</p>\n<p>Spread the word about the changes and the consequences where you can. Doesn't have to be on Reddit. The important thing is getting it attention.</p>\n<p>Participate in the communities that highlight this issue: r/Save3rdPartyApps, r/apolloapp, r/redditisfun, r/getnarwhal</p>\n<p>And finally stay off Reddit completely from June 12th to 14th. The blackout is one thing, but users staying away from the site entirely will send an equally important message.</p>\n<p>&#x200B;</p>\n<p>Thank you,</p>\n<p>&#x200B;</p></div>",
            "date_published": "2023-06-10T12:07:59+00:00",
            "authors": [
                {
                    "name": "Pandemojo",
                    "url": "https://www.reddit.com/user/Pandemojo"
                }
            ]
        },
        {
            "id": "145h5bi",
            "url": "/r/macapps/comments/145h5bi/weather_in_the_menu_bar/",
            "external_url": "https://v.redd.it/as9o5ouu625b1",
            "title": "Weather in the menu bar",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/145h5bi/weather_in_the_menu_bar/\">Reddit</a></caption><div><br></div><iframe src='/r/macapps/comments/145h5bi/weather_in_the_menu_bar/?ref_source=embed&amp;ref=share&amp;embed=true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none;' width='640' height='360' frameborder='0' scrolling='no' allowfullscreen></iframe>",
            "date_published": "2023-06-09T21:19:04+00:00",
            "authors": [
                {
                    "name": "rurza",
                    "url": "https://www.reddit.com/user/rurza"
                }
            ]
        },
        {
            "id": "143ic3b",
            "url": "/r/macapps/comments/143ic3b/export_an_app_that_can_bulk_export_apple_notes_to/",
            "external_url": "https://www.reddit.com/r/macapps/comments/143ic3b/export_an_app_that_can_bulk_export_apple_notes_to/",
            "title": "Export: An app that can bulk export Apple Notes to markdown",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/143ic3b/export_an_app_that_can_bulk_export_apple_notes_to/'>Reddit</a></caption><div><br></div><div><p>I really like Apple Notes.  My only problem with it was the lack of export. You could export notes, one at a time to PDF, or you could use some hack on your iPad to get the exported as RTF.</p>\n<p>This \"lock in\" prevented me from really considering Apple Notes.</p>\n<p>Then I discovered an app called Export in the Mac App Store.</p>\n<p><a href=\"https://apps.apple.com/us/app/exporter/id1099120373?ls=1&amp;mt=12\">https://apps.apple.com/us/app/exporter/id1099120373?ls=1&amp;mt=12</a></p>\n<p>This can export all your notes as markdown and include all attachments.</p>\n<p>This puts Apple Notes back on the list for me.</p>\n<p>Now I just need to find a way to scrape a web page into an Apple Note.</p></div>",
            "date_published": "2023-06-07T16:47:16+00:00",
            "authors": [
                {
                    "name": "plazman30",
                    "url": "https://www.reddit.com/user/plazman30"
                }
            ]
        },
        {
            "id": "141oww3",
            "url": "/r/macapps/comments/141oww3/developer_colour_palette_is_free_for_wwdc_week/",
            "external_url": "https://apps.apple.com/gb/app/developer-colour-palette/id6447426581",
            "title": "Developer Colour Palette is free for WWDC week",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/gb/app/developer-colour-palette/id6447426581'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/141oww3/developer_colour_palette_is_free_for_wwdc_week/'>Reddit</a></caption>",
            "date_published": "2023-06-05T19:26:31+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "13yk5cv",
            "url": "/r/macapps/comments/13yk5cv/glide_focus_pointer_is_free_to_download_for_the/",
            "external_url": "https://www.reddit.com/r/macapps/comments/13yk5cv/glide_focus_pointer_is_free_to_download_for_the/",
            "title": "“Glide - Focus pointer” is free to download for the next week",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/13yk5cv/glide_focus_pointer_is_free_to_download_for_the/'>Reddit</a></caption><div><br></div><div><p>Glide is a Mac app that I made which dims part of your screen for better focus and reading experience. If this sounds useful to you this is a great chance to grab it for free. </p>\n<p>https://apps.apple.com/us/app/glide-focus-pointer/id1593045116?mt=12</p></div>",
            "date_published": "2023-06-02T18:14:10+00:00",
            "authors": [
                {
                    "name": "Famous_Repeat3444",
                    "url": "https://www.reddit.com/user/Famous_Repeat3444"
                }
            ]
        },
        {
            "id": "13wx489",
            "url": "/r/macapps/comments/13wx489/had_a_call_with_reddit_to_discuss_pricing_bad/",
            "external_url": "/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/",
            "title": "📣 Had a call with Reddit to discuss pricing. Bad news for third-party apps, their announced pricing is close to Twitter's pricing, and Apollo would have to pay Reddit $20 million per year to keep running as-is.",
            "content_html": "<caption>Open: <a href='/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/'></a> | <a href='https://reddit.com/r/macapps/comments/13wx489/had_a_call_with_reddit_to_discuss_pricing_bad/'>Reddit</a></caption>",
            "date_published": "2023-05-31T20:30:28+00:00",
            "authors": [
                {
                    "name": "Pandemojo",
                    "url": "https://www.reddit.com/user/Pandemojo"
                }
            ]
        },
        {
            "id": "13wk9fd",
            "url": "/r/macapps/comments/13wk9fd/just_launched_escape_for_macos_a_mind_mapping/",
            "external_url": "https://i.redd.it/gv9cm3v7773b1.png",
            "title": "Just launched Escape for macOS, a mind mapping & outlining app",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/13wk9fd/just_launched_escape_for_macos_a_mind_mapping/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/gv9cm3v7773b1.png\" />",
            "date_published": "2023-05-31T12:00:50+00:00",
            "authors": [
                {
                    "name": "bg3245",
                    "url": "https://www.reddit.com/user/bg3245"
                }
            ]
        },
        {
            "id": "13vurcf",
            "url": "/r/macapps/comments/13vurcf/shottr_has_two_paid_tiers/",
            "external_url": "https://shottr.cc/newversion.html",
            "title": "Shottr has two paid tiers",
            "content_html": "<caption>Open: <a href='https://shottr.cc/newversion.html'>shottr.cc</a> | <a href='https://reddit.com/r/macapps/comments/13vurcf/shottr_has_two_paid_tiers/'>Reddit</a></caption>",
            "date_published": "2023-05-30T16:23:02+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "13urpmp",
            "url": "/r/macapps/comments/13urpmp/i_created_an_apple_notes_extension_that_adds_ai/",
            "external_url": "https://v.redd.it/muxffx0qyq2b1",
            "title": "I created an Apple Notes extension that adds AI, Markdown, and quicker text formatting.",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/13urpmp/i_created_an_apple_notes_extension_that_adds_ai/\">Reddit</a></caption><div><br></div><iframe src='/r/macapps/comments/13urpmp/i_created_an_apple_notes_extension_that_adds_ai/?ref_source=embed&amp;ref=share&amp;embed=true' sandbox='allow-scripts allow-same-origin allow-popups' style='border: none;' width='640' height='360' frameborder='0' scrolling='no' allowfullscreen></iframe>",
            "date_published": "2023-05-29T11:04:02+00:00",
            "authors": [
                {
                    "name": "dexterleng",
                    "url": "https://www.reddit.com/user/dexterleng"
                }
            ]
        },
        {
            "id": "13scmbw",
            "url": "/r/macapps/comments/13scmbw/hyperfocused_launch_and_arrange_apps_across/",
            "external_url": "https://hyperfocused.app",
            "title": "Hyperfocused — Launch and arrange apps across multiple monitors",
            "content_html": "<caption>Open: <a href='https://hyperfocused.app'>hyperfocused.app</a> | <a href='https://reddit.com/r/macapps/comments/13scmbw/hyperfocused_launch_and_arrange_apps_across/'>Reddit</a></caption>",
            "date_published": "2023-05-26T13:00:37+00:00",
            "authors": [
                {
                    "name": "asdf_dsa",
                    "url": "https://www.reddit.com/user/asdf_dsa"
                }
            ]
        },
        {
            "id": "13rnu38",
            "url": "/r/macapps/comments/13rnu38/a_tool_for_multilingual_users_input_source_pro/",
            "external_url": "https://inputsource.pro/",
            "title": "A Tool for Multilingual Users: Input Source Pro",
            "content_html": "<caption>Open: <a href='https://inputsource.pro/'>inputsource.pro</a> | <a href='https://reddit.com/r/macapps/comments/13rnu38/a_tool_for_multilingual_users_input_source_pro/'>Reddit</a></caption>",
            "date_published": "2023-05-25T17:29:06+00:00",
            "authors": [
                {
                    "name": "Runjuu",
                    "url": "https://www.reddit.com/user/Runjuu"
                }
            ]
        },
        {
            "id": "13ou4k0",
            "url": "/r/macapps/comments/13ou4k0/mimestream_10_pricing_subscription_only/",
            "external_url": "https://mimestream.com/pricing/",
            "title": "Mimestream 1.0 Pricing - Subscription Only",
            "content_html": "<caption>Open: <a href='https://mimestream.com/pricing/'>mimestream.com</a> | <a href='https://reddit.com/r/macapps/comments/13ou4k0/mimestream_10_pricing_subscription_only/'>Reddit</a></caption>",
            "date_published": "2023-05-22T15:30:16+00:00",
            "authors": [
                {
                    "name": "Snorlax_Returns",
                    "url": "https://www.reddit.com/user/Snorlax_Returns"
                }
            ]
        },
        {
            "id": "13ney3f",
            "url": "/r/macapps/comments/13ney3f/qr_factory_3_upgraded_improved/",
            "external_url": "https://apps.apple.com/app/qr-factory-3/id1609285899",
            "title": "QR Factory 3: Upgraded & Improved 🚀",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/qr-factory-3/id1609285899'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/13ney3f/qr_factory_3_upgraded_improved/'>Reddit</a></caption>",
            "date_published": "2023-05-21T01:21:15+00:00",
            "authors": [
                {
                    "name": "tunabelly_software",
                    "url": "https://www.reddit.com/user/tunabelly_software"
                }
            ]
        },
        {
            "id": "13n1mx1",
            "url": "/r/macapps/comments/13n1mx1/galvani_menubar_app_to_manage_low_power_mode/",
            "external_url": "https://theden.mmm.page/galvani",
            "title": "⚡ Galvani — MenuBar App to manage Low Power Mode",
            "content_html": "<caption>Open: <a href='https://theden.mmm.page/galvani'>theden.mmm.page</a> | <a href='https://reddit.com/r/macapps/comments/13n1mx1/galvani_menubar_app_to_manage_low_power_mode/'>Reddit</a></caption>",
            "date_published": "2023-05-20T18:00:41+00:00",
            "authors": [
                {
                    "name": "chmodR755",
                    "url": "https://www.reddit.com/user/chmodR755"
                }
            ]
        },
        {
            "id": "13m9kr4",
            "url": "/r/macapps/comments/13m9kr4/scrivener_3_on_sale_50_discount/",
            "external_url": "https://stacksocial.com/sales/scrivener-3-for-mac-2",
            "title": "Scrivener 3 on Sale @ 50% Discount",
            "content_html": "<caption>Open: <a href='https://stacksocial.com/sales/scrivener-3-for-mac-2'>stacksocial.com</a> | <a href='https://reddit.com/r/macapps/comments/13m9kr4/scrivener_3_on_sale_50_discount/'>Reddit</a></caption>",
            "date_published": "2023-05-19T22:18:24+00:00",
            "authors": [
                {
                    "name": "alt-right-del",
                    "url": "https://www.reddit.com/user/alt-right-del"
                }
            ]
        },
        {
            "id": "13kwr4k",
            "url": "/r/macapps/comments/13kwr4k/filefillet_the_mac_app_that_makes_copyingmoving/",
            "external_url": "https://filefillet.com/",
            "title": "FileFillet - The Mac app that makes copying/moving files a breeze",
            "content_html": "<caption>Open: <a href='https://filefillet.com/'>filefillet.com</a> | <a href='https://reddit.com/r/macapps/comments/13kwr4k/filefillet_the_mac_app_that_makes_copyingmoving/'>Reddit</a></caption>",
            "date_published": "2023-05-18T11:47:30+00:00",
            "authors": [
                {
                    "name": "sarensw",
                    "url": "https://www.reddit.com/user/sarensw"
                }
            ]
        },
        {
            "id": "13klofi",
            "url": "/r/macapps/comments/13klofi/software_developer_mac_apps/",
            "external_url": "https://www.reddit.com/r/macapps/comments/13klofi/software_developer_mac_apps/",
            "title": "Software Developer Mac Apps",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/13klofi/software_developer_mac_apps/'>Reddit</a></caption><div><br></div><div><p>Would love to know how the software developers here have set up their Mac.</p>\n<p>Whether it's including applications such as TextSoap or a fancy terminal set up with Neovim and Spotify-tui etc.</p>\n<p>Plus its always good to know what productivity apps people are running to help them.</p></div>",
            "date_published": "2023-05-18T02:19:29+00:00",
            "authors": [
                {
                    "name": "Comprehensive_Mud645",
                    "url": "https://www.reddit.com/user/Comprehensive_Mud645"
                }
            ]
        },
        {
            "id": "13jq8mk",
            "url": "/r/macapps/comments/13jq8mk/photomator_photo_editor_now_available_on_mac/",
            "external_url": "https://apps.apple.com/app/pixelmator/id1444636541",
            "title": "Photomator Photo Editor Now Available on Mac",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/pixelmator/id1444636541'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/13jq8mk/photomator_photo_editor_now_available_on_mac/'>Reddit</a></caption>",
            "date_published": "2023-05-17T03:36:46+00:00",
            "authors": [
                {
                    "name": "fivemufc",
                    "url": "https://www.reddit.com/user/fivemufc"
                }
            ]
        },
        {
            "id": "13i44lq",
            "url": "/r/macapps/comments/13i44lq/command_x_cut_and_paste_files_in_finder/",
            "external_url": "https://apps.apple.com/app/id6448461551",
            "title": "Command X — Cut and paste files in Finder",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/id6448461551'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/13i44lq/command_x_cut_and_paste_files_in_finder/'>Reddit</a></caption>",
            "date_published": "2023-05-15T10:18:53+00:00",
            "authors": [
                {
                    "name": "sindresorhus",
                    "url": "https://www.reddit.com/user/sindresorhus"
                }
            ]
        },
        {
            "id": "13hichh",
            "url": "/r/macapps/comments/13hichh/woodmans_immaculate_maple_syrup_studio_is_free/",
            "external_url": "https://apps.apple.com/app/woodlofier/id1453582220?src=AppAgg.com&mt=12",
            "title": "Woodman's Immaculate Maple Syrup Studio is free.",
            "content_html": "<caption>Open: <a href='https://apps.apple.com/app/woodlofier/id1453582220?src=AppAgg.com&mt=12'>apps.apple.com</a> | <a href='https://reddit.com/r/macapps/comments/13hichh/woodmans_immaculate_maple_syrup_studio_is_free/'>Reddit</a></caption>",
            "date_published": "2023-05-14T17:39:43+00:00",
            "authors": [
                {
                    "name": "MichaelTheGeek",
                    "url": "https://www.reddit.com/user/MichaelTheGeek"
                }
            ]
        },
        {
            "id": "13g4usp",
            "url": "/r/macapps/comments/13g4usp/new_outlook_focus_filters_out_in_beta/",
            "external_url": "https://i.redd.it/rl4zlk7bfiza1.png",
            "title": "New Outlook focus filters out in Beta",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/macapps/comments/13g4usp/new_outlook_focus_filters_out_in_beta/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/rl4zlk7bfiza1.png\" />",
            "date_published": "2023-05-13T02:36:46+00:00",
            "authors": [
                {
                    "name": "Xaqx",
                    "url": "https://www.reddit.com/user/Xaqx"
                }
            ]
        },
        {
            "id": "13fk8ar",
            "url": "/r/macapps/comments/13fk8ar/gigabrain/",
            "external_url": "https://www.reddit.com/r/macapps/comments/13fk8ar/gigabrain/",
            "title": "GigaBrain",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/13fk8ar/gigabrain/'>Reddit</a></caption><div><br></div><div><p>If you want to know if your specific question about apps for your Mac has been asked before on Reddit: <a href=\"https://thegigabrain.com/\">https://thegigabrain.com/</a></p>\n<p>Okay, maybe it's just Google without the hassle of having to include ‘site:Reddit.com’  :)</p></div>",
            "date_published": "2023-05-12T12:48:46+00:00",
            "authors": [
                {
                    "name": "luuk64",
                    "url": "https://www.reddit.com/user/luuk64"
                }
            ]
        },
        {
            "id": "13eipp0",
            "url": "/r/macapps/comments/13eipp0/manage_open_ports_from_your_menu_bar_not_powered/",
            "external_url": "https://openports.app",
            "title": "Manage open ports from your menu bar. Not powered by AI.",
            "content_html": "<caption>Open: <a href='https://openports.app'>openports.app</a> | <a href='https://reddit.com/r/macapps/comments/13eipp0/manage_open_ports_from_your_menu_bar_not_powered/'>Reddit</a></caption>",
            "date_published": "2023-05-11T10:00:04+00:00",
            "authors": [
                {
                    "name": "thegoenning",
                    "url": "https://www.reddit.com/user/thegoenning"
                }
            ]
        },
        {
            "id": "13do4n8",
            "url": "/r/macapps/comments/13do4n8/major_considerations_in_the_raycast_vs_alfred/",
            "external_url": "https://www.reddit.com/r/macapps/comments/13do4n8/major_considerations_in_the_raycast_vs_alfred/",
            "title": "Major Considerations in the Raycast vs. Alfred \"Which is better?\" Debate",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/13do4n8/major_considerations_in_the_raycast_vs_alfred/'>Reddit</a></caption><div><br></div><div><p>There are a lot of fans of both apps here, and I'm no exception. I've been an Alfred user for years. However, for the sake of fairness, curiosity, and always searching for something better and more efficient, I decided to install Raycast and compare since anyone who has been on r/macapps for a while may know that that's <a href=\"https://www.reddit.com/r/macapps/comments/13c1c7m/master_list_of_definitive_app_comparisons_view/\">a hobby</a>. </p>\n<p>Here are some considerations to keep in mind: </p>\n<p><strong>Your Privacy in Their</strong> <strong>Privacy Policies.</strong><br />\n<a href=\"https://www.alfredapp.com/terms/\"><strong>Alfred</strong></a> - Privacy-conscious. <em>Alfred is the product.</em></p>\n<blockquote>\n<p>Alfred only contacts our server when activating your Powerpack license  in order to validate it, as well as periodically checking for new  software updates.</p>\n</blockquote>\n<p><a href=\"https://www.raycast.com/privacy\"><strong>Raycast</strong></a> - <em>You are the product.</em></p>\n<blockquote>\n<p>We use Personal Data for the following purposes...<br />\nTo analyze how you interact with our Service...<br />\nTo maintain and improve the content and functionality of the Service...<br />\nTo develop new products and services...<br />\nTo tell you about products or services we believe may be of interest to you... <br />\nReason: For our legitimate interests or those of a third party, i.e. to promote our business to you...</p>\n</blockquote>\n<p><strong>Efficiency Considerations.</strong><br />\nAccording to my usage history, I trigger Alfred about 42 times daily, or 15,330 times yearly.</p>\n<p>In Raycast, every search is stalled behind a menu that needs to be triggered unless you configure an additional shortcut for each feature. </p>\n<ul>\n<li>Want to search for a file? Gotta select the option first and hit enter to begin searching.</li>\n<li>Want to perform an action on the file? Yet another shortcut (CMD+K).</li>\n<li>Want to trigger any other feature? You guessed it, another shortcut or menu to trigger first.</li>\n</ul>\n<p>That's an additional 2–5 seconds <em>every single search</em> or 8.5–21 <em>HOURS</em> a year for something Alfred can do immediately on the first trigger. Am I missing something here? </p>\n<p><strong>Appearance.</strong> <br />\nThe Raycast preferences and user interface is the clear winner in terms of eyecandy, no arguments to be had. Alfred could learn from this, though Alfred has more granular customizable preferences. </p>\n<p><strong>Complexity.</strong><br />\nBecause Raycast has a cleaner design, it can be easier to find what you're looking for if you're not a power user. </p>\n<p><strong>Feature offerings.</strong><br />\nThis is basically a tie for the most common features—E.g., web/file searches, clipboard history, calculator, notes, links, etc.<br />\nThe recent AI integration with Raycast is the major distinction ($10/month or $96/yr <a href=\"https://www.raycast.com/pricing\">subscription</a>). <br />\nOne can also use the API from OpenAI with an Alfred workflow with Powerpack ($42 <a href=\"https://www.alfredapp.com/shop/\">license</a>). </p>\n<p>Ultimately, we all have to consider and decide what we care about most. <br />\nWhat unique features, considerations, or tips have I missed that stand out for why you prefer one over the other?</p></div>",
            "date_published": "2023-05-10T11:44:21+00:00",
            "authors": [
                {
                    "name": "Mstormer",
                    "url": "https://www.reddit.com/user/Mstormer"
                }
            ]
        },
        {
            "id": "13dje6y",
            "url": "/r/macapps/comments/13dje6y/raycast_pro_is_now_available/",
            "external_url": "https://www.reddit.com/r/macapps/comments/13dje6y/raycast_pro_is_now_available/",
            "title": "Raycast Pro is now available",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/macapps/comments/13dje6y/raycast_pro_is_now_available/'>Reddit</a></caption><div><br></div><div><p><a href=\"https://www.raycast.com/pro\">https://www.raycast.com/pro</a>  </p>\n<p>what do you guys think? yay or nay?</p></div>",
            "date_published": "2023-05-10T07:29:57+00:00",
            "authors": [
                {
                    "name": "MJFox1978",
                    "url": "https://www.reddit.com/user/MJFox1978"
                }
            ]
        }
    ]
}