{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nba",
    "description": "A subreddit dedicated to NBA news and discussion.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nba.json",
    "icon": "https://raw.githubusercontent.com/jonathanlaniado/images/master/slack/reddit.png",
    "favicon": "https://raw.githubusercontent.com/jonathanlaniado/images/master/slack/reddit.png",
    "items": [
        {
            "id": "oo29xr",
            "url": "/r/nba/comments/oo29xr/metta_world_peace_i_love_the_olympics_i_was_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/oo29xr/metta_world_peace_i_love_the_olympics_i_was_a/",
            "title": "Metta World Peace: \"I love the Olympics. I was a head case and a real volatile player when I did play, I just always felt like I should have had an opportunity to play. I even told them I would get the water. I literally called the office. I told my agent, 'Can I even be the water boy? Something?'\"",
            "content_html": "<p><a href=\"https://www.basketballnews.com/stories/metta-world-peace-on-team-usa\">Source</a></p>\n<p><em>On the subject of international basketball, you played a season overseas and played under FIBA rules. We’re about to start the Olympics with Team USA undergoing some changes. Bradley Beal is off the team. Kevin Love is off the team. Keldon Johnson and JaVale McGee joined the team. How do you see the Olympics playing out for Team USA?</em></p>\n<blockquote>\n<p>Metta World Peace: “For me, the Olympics is a bitter situation for me. I love the Olympics, and I feel like I’ve been shortchanged. Even though I was a head case and a real volatile player when I did play, I just always felt like I should have had an opportunity to play [for Team USA]. The year I was going to play, I got suspended - and when you talk about legacy, that gold medal is very important to legacy. And I was a player, third-team All-NBA. I should have had a tryout. I remember when I didn’t get called for the Olympics, and I thought at least I’d play on the team that played against the people who got selected (the Select Team). And when that didn’t happen, I called my agent and said, ‘What the hell is going on here?!’ And we could not get no response. So then, I had to call the Olympic office myself. And I got no return call. And I was like, ‘Just let me try out.’ I understand I wasn’t the greatest player to be around at that time and some players did not want to play with me, but I was like, ‘Give me a chance to take that player’s spot.' At that time, in that era, my defense was so incredible, I was going to take someone’s spot. I’m 100 percent sure.”</p>\n</blockquote>\n<p><em>That would have been the 2004 Olympics in Athens when the U.S. lost to Puerto Rico by 19 in the opener and ended up taking home the bronze.</em></p>\n<blockquote>\n<p>Metta World Peace: “Yeah, you see what I’m saying? We [wouldn’t have] taken home a bronze. We’d have a gold. I wasn’t on that team. The USA had a goal in 2004 and there’s no way we lose with me on that team. There’s no way. How? I’m averaging 24 and the best defender in the world at that point in time. I got Defensive Player of the Year in between sharks and blue whales, Ben Wallace and Duncan and Garnett. This is who I had to navigate through in order to get that award. Hall of Famers. With that being said, I understand why. But I just want people to hear: If I could rewind time, that is something that is supposed to be on my resume. Now, granted, a lot of things are not on my resume because of me, but I got Defensive Player of the Year, I was close to being MVP one year, I got champion, All-Star, everything but the Olympics. But I’ve been to the Olympics in high school. I got the USA high school history. One day, I hope they pick me. Sometimes they pick veterans, they pick guys who don’t play [anymore]. I hope I can play in the Olympics; I deserve it just as much as anybody, I believe. Some people would argue that other people deserve it also. That’s true, but I am the one yapping about it. So hopefully one day an honorary jersey, end of the bench. I even told them I would get the water. I literally called the office. I told my agent, ‘Can I even be the water boy? Something?’ So every time someone brings up the Olympians, I rant, I rant I rant. I am an Olympian, for sure. I am an Olympian, a gold medalist, and I truly believe that.</p>\n<p>“When you look at it from a basketball standpoint, in terms of being that professional at that age, I wasn’t. But I was a hell of a basketball player, and I felt like a hell of an American basketball player, one of the best American basketball players in the world. And although I’m very much from Queensbridge and as urban as it gets in the NBA, at the same time I always wanted to represent the USA. And another reason why I wanted to represent the USA: Chris Mullin was an Olympian, I went to St. John’s. Vern Fleming was a gold medalist Olympian, and Vern Fleming is from my neighborhood and everybody knows where I’m from. Vern Fleming experienced all the things I talked about, just picture those situation with Vern Fleming, and he was an Olympian. He’s from the same block, the same exact block as me. There’s a lot of reasons why I wanted to be an Olympian. No matter what anybody says, I am an Olympian, I am a gold medalist. I didn’t cut myself from that team.”</p>\n</blockquote>",
            "date_published": "2021-07-20T13:42:42+00:00",
            "authors": [
                {
                    "name": "GuyCarbonneauGOAT",
                    "url": "https://www.reddit.com/user/GuyCarbonneauGOAT",
                    "avatar": "https://styles.redditmedia.com/t5_1a54v8/styles/profileIcon_l5go51zb6i641.jpg"
                }
            ]
        },
        {
            "id": "oo2jr5",
            "url": "/r/nba/comments/oo2jr5/oconnor_few_team_executives_expect_a_dame_deal_to/",
            "external_url": "https://www.reddit.com/r/nba/comments/oo2jr5/oconnor_few_team_executives_expect_a_dame_deal_to/",
            "title": "[O'Connor] Few team executives expect a Dame deal to happen this offseason. But multiple front-office sources say the Heat, Kings, Knicks, Rockets, and Sixers have recently been the most aggressive suitors.",
            "content_html": "<p>Source: https://www.theringer.com/nba/2021/7/20/22584360/damian-lillard-trade-portland-trail-blazers-ben-simmons</p>\n<blockquote>\n<p>Few team executives expect a Dame deal to happen this offseason. But multiple front-office sources say the Heat, Kings, Knicks, Rockets, and Sixers have recently been the most aggressive suitors.</p>\n<p>Front-office executives say that if the Blazers eventually move Lillard, they can expect a return rivaling or surpassing what the Nets gave up for James Harden: multiple young players, plus three first-round picks and four first-round pick swaps. Harden is a former MVP, but he had only two guaranteed seasons left on his contract at the time of the trade. Portland could do even better because Lillard has four seasons remaining on his contract worth a grand total of $176 million. The long-term security in Lillard’s contract could lead to more interest from teams and more return in a trade.</p>\n</blockquote>",
            "date_published": "2021-07-20T13:57:50+00:00",
            "authors": [
                {
                    "name": "nonbiasednbafan",
                    "url": "https://www.reddit.com/user/nonbiasednbafan",
                    "avatar": "https://styles.redditmedia.com/t5_3ginor/styles/profileIcon_snooe162fcdc-8737-4e6d-ba40-9927a35bad58-headshot.png"
                }
            ]
        },
        {
            "id": "oo32od",
            "url": "/r/nba/comments/oo32od/richard_jefferson_endorses_a_tweet_from_kenny/",
            "external_url": "https://www.reddit.com/r/nba/comments/oo32od/richard_jefferson_endorses_a_tweet_from_kenny/",
            "title": "[Richard Jefferson] endorses a tweet from Kenny Beecham about Game 3: \"Legitimate question: I know Scott Foster has a terrible rep vs CP3 teams. But I haven't seen anything to “blame the refs.” Suns missed a ton of shots. What are y'all seeing to blame refs?\"",
            "content_html": "<p><a href=\"https://twitter.com/Rjeff24/status/1417483653718945795\">RJ</a></p>\n<blockquote>\n<p>🗣Preach</p>\n</blockquote>\n<p><a href=\"https://twitter.com/KOT4Q/status/1414394470389461018\">Kenny</a></p>\n<blockquote>\n<p>Legitimate question: i know Scott Foster has a terrible rep vs CP3 teams. But I havent seen anything to “blame the refs.” Suns missed a ton of shots. What are yall seeing to blame refs?</p>\n</blockquote>\n<p><strong>Context:</strong> CP3 is 0-12 in the playoffs when Scott Foster is officiating. </p>\n<p>Tonight’s crew features Scott Foster.</p>",
            "date_published": "2021-07-20T14:25:48+00:00",
            "authors": [
                {
                    "name": "GuyCarbonneauGOAT",
                    "url": "https://www.reddit.com/user/GuyCarbonneauGOAT",
                    "avatar": "https://styles.redditmedia.com/t5_1a54v8/styles/profileIcon_l5go51zb6i641.jpg"
                }
            ]
        }
    ]
}