{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nba",
    "description": "A subreddit dedicated to NBA news and discussion.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nba.json",
    "icon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "favicon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "items": [
        {
            "id": "1nnu23h",
            "url": "/r/nba/comments/1nnu23h/rankin_kevin_durant_on_the_luka_doncic_trade_you/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nnu23h/rankin_kevin_durant_on_the_luka_doncic_trade_you/",
            "title": "[Rankin] Kevin Durant on the Luka Doncic trade: “You see another team trade away somebody like that. This got to be the biggest trade I've seen since I've been in the league or since I've been watching the sport.  This is insane”",
            "content_html": "<p>Source: https://www.azcentral.com/story/sports/nba/suns/2025/09/18/candid-kevin-durant-addresses-when-phoenix-suns-put-him-on-market-for-trade/86216910007/</p>\n<p>Durant spoke on the idea of teams making huge trades Feb. 1, after learning about the Dallas Mavericks dealing Luka Doncic to the Los Angeles Lakers and getting Anthony Davis in return.</p>\n<p>“You start seeing stuff like that, as an organization, you might get a little more courage to do some stuff,” he said after Phoenix lost at Portland. “You see another team trade away somebody like that. This got to be the biggest trade I've seen since I've been in the league or since I've been watching the sport.  This is insane. So yeah, every other team might get confidence and say (expletive) it, I'll trade a few of my top players if this ain't working.”</p>",
            "date_published": "2025-09-22T18:13:35+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1nntcb6",
            "url": "/r/nba/comments/1nntcb6/kevin_harlan_to_take_reduced_nba_broadcast_load/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nntcb6/kevin_harlan_to_take_reduced_nba_broadcast_load/",
            "title": "Kevin Harlan to Take Reduced NBA Broadcast Load Under Amazon Deal",
            "content_html": "<p>Kevin Harlan has agreed to a three-year deal with Amazon’s Prime Video, where he’ll call NBA games starting this season. As part of the new role, Harlan will cut back his overall workload—he’ll still do NFL games for CBS and radio broadcasts for Westwood One, but his NBA schedule will be lighter than in past years. The move gives him more balance while keeping him active on some of the biggest stages in sports broadcasting. He’ll call just one game in October, one in November, and one in December before moving into a fuller slate beginning in January. </p>\n<p>https://www.sportsmediawatch.com/2025/09/kevin-harlan-reduced-schedule-nba-prime-video/</p>",
            "date_published": "2025-09-22T17:47:29+00:00",
            "authors": [
                {
                    "name": "_massaiwalker",
                    "url": "https://www.reddit.com/user/_massaiwalker"
                }
            ]
        },
        {
            "id": "1nn116u",
            "url": "/r/nba/comments/1nn116u/bam_adebayo_surprised_his_girlfriend_aja_wilson/",
            "external_url": "https://streamable.com/fd0z9w",
            "title": "Bam Adebayo surprised his girlfriend A’ja Wilson with her FOURTH WNBA MVP trophy",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 125.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fd0z9w\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-21T19:22:59+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1nmzyb4",
            "url": "/r/nba/comments/1nmzyb4/dennis_rodman_once_went_to_detroits_arena_with_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nmzyb4/dennis_rodman_once_went_to_detroits_arena_with_a/",
            "title": "Dennis Rodman once went to Detroit’s arena with a shotgun, planning to kill himself after a divorce caused by his wife’s affair with a teammate.",
            "content_html": "<blockquote>\n<p>“So one day, I wrote a note and went to the parking lot of the Palace. I had a gun rack, and I had a gun in my car. I had it in my hand,” Rodman told Bleacher Report. “But for some reason, I played this music. I put it on, and I was listening to this song and this music, and I was just debating. It didn't have anything to do with basketball. It had to do with this love that I wanted, and it suddenly just left me.</p>\n<p>”And this song came on. It was Pearl Jam. ‘Even Flow’ and ‘Black’ and stuff like that. And I had the gun in my lap, and next thing you know, I fell asleep listening to Pearl Jam. Then I woke up, and all the cops and everyone was there. I didn't know what was going on. I totally forgot I had a gun in my hand. They got me out of the car. That was pretty much what it was. It wasn't about the game of basketball. It was about feeling betrayed, because I wanted to be loved so much in my life.”</p>\n<p>”Rodman lamented the fact there weren’t as many options to get help then as there are in today’s NBA. He told Bleacher Report that if he had the same options, he wouldn’t have gone that far.”</p>\n</blockquote>\n<p><a href=\"https://www.foxnews.com/sports/dennis-rodman-1993-suicide-attempt-nba.amp\">Source</a></p>",
            "date_published": "2025-09-21T18:42:23+00:00",
            "authors": [
                {
                    "name": "JetSky81",
                    "url": "https://www.reddit.com/user/JetSky81"
                }
            ]
        },
        {
            "id": "1nmevm0",
            "url": "/r/nba/comments/1nmevm0/jaylen_brown_tried_calling_five_different_celtics/",
            "external_url": "https://streamable.com/6l9n9b",
            "title": "Jaylen Brown tried calling FIVE different Celtics teammates and nobody picked up",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 75.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/6l9n9b\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-21T01:09:52+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1nm1ncq",
            "url": "/r/nba/comments/1nm1ncq/nba_referees_have_arrived_at_their_referee/",
            "external_url": "https://streamable.com/b84nup",
            "title": "NBA Referees have arrived at their Referee Preseason meeting! Throughout the next week, they will be studying and reviewing points of emphasis for the upcoming season, conducting health exams and tests, team building, completing rulebook exams and meeting with NBA Commissioner Adam Silver",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/b84nup\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-20T15:48:13+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1nlfdar",
            "url": "/r/nba/comments/1nlfdar/morganstern_cj_mccollum_people_who_have_been_in/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nlfdar/morganstern_cj_mccollum_people_who_have_been_in/",
            "title": "[Morganstern] CJ McCollum: \"People who have been in the United States for 10 years, even 30 years, and are either being detained on farms or being detained outside of courthouses. Some people have even had court cases scheduled, then the court case gets dismissed and they're arrested.\"",
            "content_html": "<p>Which is more frustrating, an NBA ref or U.S. Wine laws?</p>\n<p>U.S. wine laws by far. A ref’s accuracy is like 90%. They get a lot of slack and they don't get enough credit for their ability to execute in those tight environments. But these wine laws. A lot of them are from so long ago and some of them should be changed. We're in a different time now.</p>\n<p>You’ve joined the board of Oregon LIVE Certified. Why was that important to you?</p>\n<p>Sustainability has always been important to my family, not just on the wine side but because we care about the environment. We want this place to be better than it is now. And better than it was when we found it after we leave. We care about the future of our society and especially, with having kids, we want them to be able to live in a safe, healthy environment.</p>\n<p>We also want to make sure that the employees and people that are on the farms are paid well and treated well. Obviously lately there's been a situation where a lot of the farm workers who are not from the United States are in difficult positions. People who have been in the United States for 10 years, even 30 years, and are either being detained on farms or being detained outside of courthouses. Some people have even had court cases scheduled, then the court case gets dismissed and they're arrested.</p>\n<p>How vital is this workforce to the wine industry?</p>\n<p>Immigrants are vital to not only wine, but so many different parts of society. I think people are starting to realize that. But for those of us in the wine business, understanding the importance of harvest and farming land and how many people play a vital role in that — the business won't survive without immigrants.</p>\n<p>Who have been some of your favorite NBA colleagues to share wine with?</p>\n<p>I'm from Ohio, so I've obviously drank wine with LeBron. Kevin Love has a great palate. He drinks a variety of wine. Channing Frye. Carmelo Anthony always brings some unique wines and he’s heavy on white burgundy. Terry Stotts has a good palate. Coach Willie Green enjoys his wine. I've shared some different Pinots with him. It’s cool to drink with players, but I would say I enjoy drinking wine with my wife the most. We've got special occasion bottles. Birthday and celebratory bottles. Birth year bottles. We enjoy opening a bottle and sharing stories. We've had some unique experiences over the course of our life.</p>\n<p>Would you be happy if one day someone knew nothing about your sports career and said ‘you're the guy that makes that wine?’</p>\n<p>That would be cool. That’s something that takes time. Maybe 15 years from now someone will say ‘he played basketball? I thought he was the guy from that winery.’ That would be a great moment. One day I’ll just be Jacobi and Margaux’s dad and the guy who makes wine. That’s fine.</p>\n<p>Source: https://www.forbes.com/sites/adammorganstern/2025/09/19/drinking-and-making-oregon-wines-with-nba-star-cj-mccollum/</p>",
            "date_published": "2025-09-19T21:01:30+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1nl80sf",
            "url": "/r/nba/comments/1nl80sf/michael_beasley_pat_riley_treated_me_like_a_son/",
            "external_url": "https://streamable.com/l7s6o2",
            "title": "Michael Beasley: \"Pat (Riley) treated me like a son. You know how, like, 'Come on, Dad, don't kiss me in front of the guys.' 'Dad, I don't want to talk to you today.' But he made me sit in his office every fuckin' week.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/l7s6o2\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-19T16:19:06+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1nl5aaj",
            "url": "/r/nba/comments/1nl5aaj/steph_curry_reportedly_made_35m_for_60_hours_of/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nl5aaj/steph_curry_reportedly_made_35m_for_60_hours_of/",
            "title": "Steph Curry reportedly made $35M for 60 hours of work for FTX",
            "content_html": "<p>Source: https://www.sfgate.com/warriors/article/steph-curry-reportedly-made-35-million-ftx-18402096.php</p>\n<blockquote>\n<p>\"Brady and Curry's connection to all of this is that they were each hired to star in commercials, and serve as spokespeople, for Bankman-Fried's now-defunct exchange. Lewis said he got a look at internal FTX documents during his time shadowing Bankman-Fried that showed how much the two celebrity endorsers received.</p>\n<p>\"He paid Tom Brady $55 million for 20 hours a year for three years,\" Lewis said. \"He paid Steph Curry $35 million for [the] same thing for three years.\"\"</p>\n</blockquote>\n<p>The Golden State Warriors were sponsored by FTX during this same time period. Just thought this was an interesting story that went under the radar about the extent of pay for an endorsement deal that was by a company that also sponsored the same NBA team as its player and also ended up being a fraudulent company where the founder ended up in jail for fraud.</p>",
            "date_published": "2025-09-19T14:36:07+00:00",
            "authors": [
                {
                    "name": "Liverpoolclippers",
                    "url": "https://www.reddit.com/user/Liverpoolclippers"
                }
            ]
        },
        {
            "id": "1nl2vr1",
            "url": "/r/nba/comments/1nl2vr1/aldridge_if_cap_circumvention_is_found_in_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nl2vr1/aldridge_if_cap_circumvention_is_found_in_the/",
            "title": "[Aldridge] If cap circumvention is found in the Clippers’ case, many of the league’s other teams want the Clippers to pay, significantly. “Either you have a severe punishment,” a longtime NBA executive said Tuesday, “or you’re giving everyone a road map of how to do it.”",
            "content_html": "<p>Everyone around the league will be watching to see if the investigation by the firm Wachtell, Lipton, Rosen &amp; Katz, which led the league’s investigation into the Sterling tape, will, if cap circumvention is proven, lead to severe sanctions against the NBA’s richest owner.</p>\n<p>You may recall when the league suspended former Suns governor Robert Sarver for a year and fined him $10 million in 2022, after a 10-month investigation by Wachtell, Lipton into allegations of a toxic work environment for women and minorities in the Suns’ organization, LeBron James and Chris Paul expressed disappointment with the NBA’s discipline. If cap circumvention is found in the Clippers’ case, many of the league’s other teams want the Clippers to pay, significantly.</p>\n<p>“Either you have a severe punishment,” a longtime NBA executive said Tuesday, “or you’re giving everyone a road map of how to do it.”</p>\n<p>Of course, Ballmer, who strongly maintains his and his team’s innocence, deserves due process, as does anyone else. Of course, the Clippers have denied they’ve done anything wrong. Of course, the burden of proof is on the league to prove malfeasance up near Playa Vista, Calif., where the Clippers were headquartered in 2021, when all this began.</p>\n<p>Smoking guns tend to be hard to find, though Torre’s dogged work over the last several months has unearthed quite the road map toward one.</p>\n<p>If the NBA finds the Clippers guilty, it can’t do what it did in 2018 to the Mavericks, after a seven-month investigation that was initiated by the team, with league oversight, corroborated the findings of a Sports Illustrated story detailing a toxic work environment for women throughout the organization. The Mavs’ “punishment,” such as it was, was what the league obliquely called a $10 million “donation” that Cuban would make toward organizations “committed to supporting the leadership and development of women in the sports industry and combating domestic violence.”</p>\n<p>Which was noble, and helpful, but did not include the word “fine” anywhere.</p>\n<p>There was no such equivocating when Silver threw Sterling out of the league in 2014, after the disclosure of the infamous audio tape between Sterling and his mistress by the website TMZ. The tape didn’t detail any specific illegal action on Sterling’s part. Sterling didn’t break any laws with his words.</p>\n<p>They were just … disgusting.</p>\n<p>Yet the NBA and Wachtell, Lipton only needed three days to begin and conclude an investigation, which seemed to have exactly one question at its core:</p>\n<p>“Donald, is this you on the tape?”</p>\n<p>“Yes, it is.”</p>\n<p>“No further questions.”</p>\n<p>This took, again, all of 72 hours, from start to finish.</p>\n<p>Of course, the comments and investigation also came during the first round of the playoffs, which included Sterling’s Clippers, who were playing the Warriors in the first round. And Silver was faced with the likelihood of a league-wide boycott of its three playoff games the night of April 29, by players on all six teams scheduled to play that evening, if he didn’t drop the hammer on Sterling. Which, he did.</p>\n<p>The Kawhi business, of course, will take longer. There is a third party involved — Aspiration, which went bankrupt earlier this year, and whose co-founder, Joe Sanberg, agreed to plead guilty to one count of wire fraud and one count of conspiracy to commit wire fraud in August, amid allegations that Sanberg defrauded Aspiration’s investors, including Ballmer, out of a collective $248 million. This appears to be the crux of Ballmer’s argument: I was duped like everyone else.</p>\n<p>But Torre’s reporting unearthed an unusually united recollection from people in Aspiration’s financial department at the time the deal with Leonard was consummated: many former employees Torre spoke with believed, adamantly, that Leonard’s deal with Aspiration was a) a “no-show” arrangement, in which Leonard wouldn’t have to do any work to get the $28 million Aspiration agreed to pay him over four years, and b) clearly designed to circumvent the NBA’s cap. There are also c), the disclosure that Leonard’s deal with Aspiration would be voided if he left the Clippers, and d) evidence that Robertson, Leonard’s representative, asked for similar workarounds from other teams before Leonard signed with the Clippers in 2021.</p>\n<p>Aspiration’s co-founder, Andrei Cherny, told The Athletic last week via e-mail that Leonard’s job was not a no-show one, though he didn’t provide specifics about Leonard’s job responsibilities or answer why there is no record of anything that Leonard did on behalf of the company. (And, other high-ranking executives in the company recall details about the arrangement with Leonard differently than Cherny does.)</p>\n<p>Again, this will be long and complicated. Aspiration’s former C Suite does not answer to the NBA and does not have to cooperate; the NBA does not have subpoena power. Multiple people at different levels of the company will have to talk. To get the clearest picture possible, Leonard and/or Robertson will have to talk. The Clippers, of course, will have to cooperate: not just Ballmer, but any other executives who had knowledge — assuming they did — of Leonard’s arrangement with Aspiration.</p>\n<p>“When they talk to the NBA,” the longtime NBA exec said of the Clippers’ executives, “they better come up with a better answer” than Ballmer did in his interview with ESPN last month.</p>\n<p>Yet there is another, equally important principle at stake aside from whether Ballmer and the Clippers violated Article 13.1 of the NBA’s Collective Bargaining Agreement.</p>\n<p>In our current times, objective truth is, far too often, smashed into bits, and is rarely put back together into a coherent whole. Our ecosystem has been poisoned by misinformation, a virus injected into every aspect of our lives. Whatever it is we believe, you can rest assured that there is someone or something — a reasonably well-paid human, or an unpaid bot — doing their level best to make you doubt that what you saw or heard is actually what you saw or heard. They do this for their own, selfish reasons; I leave it to you to determine who benefits most from such an arrangement. The assault on truth is designed to destroy our notion of shared, accepted belief.</p>\n<p>Journalism of the type Torre is providing is not designed to prove something beyond a shadow of a doubt. But journalism, good journalism, points you in a clear direction. It says, “Here is what I know now. Tomorrow, I hope to know more.”</p>\n<p>Al Pacino, as “60 Minutes” producer Lowell Bergman in the movie “The Insider,” put the journalist’s credo into stark relief as he pressed an official for more information: “I’m getting two things: pissed off, and curious.”</p>\n<p>Yes, the NBA’s System Arbitrator will, technically, rule on whether or not the investigation by Wachtell, Lipton proves prima facie circumvention. But it will ultimately be up to Adam Silver to decide Ballmer’s fate. If he determines Ballmer and the Clippers broke the rules, he will have to unleash afterward the resolve he displayed a decade ago, when he threw the book at Sterling based not on broken laws, but righteous anger, and didn’t look back. Because he knew what was true.</p>\n<p>Source: <a href=\"https://www.nytimes.com/athletic/6634171/2025/09/19/kawhi-leonard-clippers-investigation-adam-silver-nba/\">https://www.nytimes.com/athletic/6634171/2025/09/19/kawhi-leonard-clippers-investigation-adam-silver-nba/</a></p>",
            "date_published": "2025-09-19T12:58:40+00:00",
            "authors": [
                {
                    "name": "aingenevalostatrade",
                    "url": "https://www.reddit.com/user/aingenevalostatrade"
                }
            ]
        },
        {
            "id": "1nk39qk",
            "url": "/r/nba/comments/1nk39qk/kawhi_and_aspiration_needed_cash_ballmer_and_the/",
            "external_url": "https://www.youtube.com/watch?v=4_ow9i3obDE",
            "title": "Kawhi and Aspiration Needed Cash. Ballmer and the Clippers Sent $118M in 18 Months",
            "content_html": "",
            "date_published": "2025-09-18T09:04:21+00:00",
            "authors": [
                {
                    "name": "Meowsli",
                    "url": "https://www.reddit.com/user/Meowsli"
                }
            ]
        },
        {
            "id": "1njnnyr",
            "url": "/r/nba/comments/1njnnyr/an_anonymous_member_of_the_clippers_organisation/",
            "external_url": "https://www.reddit.com/r/nba/comments/1njnnyr/an_anonymous_member_of_the_clippers_organisation/",
            "title": "An anonymous member of the Clippers organisation on Kawhi’s tenure: “This has been a nightmare. He’s an incredibly talented player when he’s healthy, but as everyone knows, he’s rarely healthy and his camp is just so difficult to deal with. His time here, thankfully, is coming to an end soon.”",
            "content_html": "<p>Source: https://dallashoopsjournal.com/p/los-angeles-clippers-kawhi-leonard-nba-trade-rumors-news-aspiration/</p>",
            "date_published": "2025-09-17T20:02:26+00:00",
            "authors": [
                {
                    "name": "Proof-Umpire-7718",
                    "url": "https://www.reddit.com/user/Proof-Umpire-7718"
                }
            ]
        },
        {
            "id": "1njcu6j",
            "url": "/r/nba/comments/1njcu6j/marchand_stephen_a_smith_is_pushing_40m_a_year_in/",
            "external_url": "https://www.reddit.com/r/nba/comments/1njcu6j/marchand_stephen_a_smith_is_pushing_40m_a_year_in/",
            "title": "[Marchand] Stephen A. Smith is pushing $40M a year in earnings, sources tell The Athletic. And ultimately, he wants as big a voice in politics as he has in sports. On Wednesday, Smith will formally launch his bid as a political pundit, if not a Presidential candidate.",
            "content_html": "<p>Source: https://www.nytimes.com/athletic/6634775/2025/09/17/stephen-a-smith-espn-politics-sirius/?source=user_shared_article</p>\n<blockquote>\n<p>Stephen A. Smith is already probably the most influential sports commentator in the media game. His salary proves it, as he is pushing $40 million a year in earnings, sources briefed on his contracts told The Athletic.</p>\n<p>Smith, 57, has been mentioned as a potential future presidential candidate, but with that job paying $400,000 a year, it seems highly unlikely he would attempt that for a while, if ever. He is entrepreneurial and wants to expand his horizon in business and in the opinion game. He has been into politics for a little while, sharing his thoughts on his podcast, along with appearances on Fox News, NewsNation and other forums.</p>\n<p>Smith voted for Kamala Harris, but after Trump’s inauguration, Smith said he felt like a “damn fool” for doing so, adding that Harris would not have won a real primary.</p>\n<p>Smith has already emerged as a notable voice in politics, to go along with his well-established prominence in sports talk. From 10-noon ET daily, he continues on ESPN’s “First Take” and, after an hour for lunch, it is a sports-talk show from 1-3 p.m. ET on SiriusXM. On many nights, he adds his YouTube show that addresses everything from sports to politics to anyone who criticizes him. With annual earnings approaching $40 million, he has created a lucrative and growing business.</p>\n</blockquote>",
            "date_published": "2025-09-17T13:14:21+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1njc3im",
            "url": "/r/nba/comments/1njc3im/caught_in_4k_sidebyside_video_of_nba_commissioner/",
            "external_url": "https://streamable.com/9zbzzp",
            "title": "[Caught in 4K] Side-by-side video of NBA commissioner Adam Silver blatantly lying about not knowing anything about Clippers sponsor Aspiration.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/9zbzzp\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-17T12:43:13+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1nj0p34",
            "url": "/r/nba/comments/1nj0p34/westbrook_on_kd_leaving_okc_im_pissed_im_livid_i/",
            "external_url": "https://streamable.com/8rivps",
            "title": "Westbrook on KD leaving OKC: “I’m pissed. I’m livid. I feel like we let that opportunity slip away. I start laughing instantly I’m like this can’t be true, nah no way (KD) would go to that team, they just beat us.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 53.75%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/8rivps\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-17T02:04:41+00:00",
            "authors": [
                {
                    "name": "Classic-Carpet7609",
                    "url": "https://www.reddit.com/user/Classic-Carpet7609"
                }
            ]
        },
        {
            "id": "1nirgk2",
            "url": "/r/nba/comments/1nirgk2/torre_calls_out_silver_for_lying_about_never/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nirgk2/torre_calls_out_silver_for_lying_about_never/",
            "title": "Torre calls out Silver for lying about never hearing about Aspiration: “Just obtained a copy of Aspiration’s $300M+ “Founding Sponsorship Agreement” — which “must be submitted prior to its execution for NBA’s approval and shall not be effective until it is expressly approved by the NBA.”",
            "content_html": "<p>Happened on the forbidden app.</p>\n<p>Source: https://imgur.com/a/GgLEjQJ</p>\n<blockquote>\n<p>After the 9/10 NBA owners meeting, Adam Silver said: “I’d frankly never heard of the company Aspiration before. And I’d never heard a whiff of anything around an endorsement deal with Kawhi, or anything around engagement with the Los Angeles Clippers. So it was all new to me.”</p>\n<p>But @pablofindsout just obtained a copy of Aspiration’s $300M+ “Founding Sponsorship Agreement” — which “must be submitted prior to its execution for NBA’s approval and shall not be effective or enforceable until it is expressly approved by the NBA.”</p>\n<p>Two immediate questions:</p>\n<p>1) Why did Steve Ballmer’s $300M+ Aspiration partnership not reach Adam Silver's office before it was \"expressly approved\"?</p>\n<p>2) Did no one inform Silver that Bloomberg reported on 1/18/24 that Aspiration was being investigated by the federal government?</p>\n<p>Over the first two seasons of their sponsorship (21-22 + 22-23), Aspiration had to put $7.5M/yr into the Clippers.</p>\n<p>Meanwhile: Steve Ballmer and the Clippers kept putting millions into Aspiration — which owed Kawhi Leonard $7M/yr in a secret deal nobody ever spoke publicly about.</p>\n<p>Fraudsters running companies like Aspiration or FTX keep sportswashing for a reason: hugely visible deals with pro sports teams and leagues create the public impression of trust and credibility. As if such deals must have been vetted by the teams and leagues. But apparently not?</p>\n</blockquote>",
            "date_published": "2025-09-16T19:37:57+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1nievqj",
            "url": "/r/nba/comments/1nievqj/charania_warriors_owner_went_out_and_sat_face_to/",
            "external_url": "https://streamable.com/xzk6qe",
            "title": "Charania: \"Warriors owner went out and sat face to face with Jonathan Kuminga in the last month, and Joe Lacob essentially asked Kuminga, 'Do you want to be here? Do you want to be with the Warriors?' and Kuminga flipped that really and said, 'Do you even want me?'\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/xzk6qe\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-16T11:31:43+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1ni5rxm",
            "url": "/r/nba/comments/1ni5rxm/luka_doncic_says_im_gonna_make_first_try_watch/",
            "external_url": "https://streamable.com/bckvtb",
            "title": "Luka Doncic says \"I'm gonna make first try, watch\" and hits a really insane shot on his real first try. From \"Dude Perfect\" - behind the scenes",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 61.962%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/bckvtb\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-16T02:38:38+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1ni0k2y",
            "url": "/r/nba/comments/1ni0k2y/hunterbrook_hunterbrooks_next_big_investigation/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ni0k2y/hunterbrook_hunterbrooks_next_big_investigation/",
            "title": "[Hunterbrook] Hunterbrook's next big investigation is dropping — and it's a collaboration with Pablo Torre and Pablo Finds Out. It's... a crazy one.",
            "content_html": "<p>Announcement from the app that’s forbidden.</p>\n<p>Screenshot: https://imgur.com/a/SeYfJ5s</p>\n<blockquote>\n<p>Hunterbrook's next big investigation is dropping — and it's a collaboration with Pablo Torre and Pablo Finds Out. It's... a crazy one.</p>\n</blockquote>\n<p>Hunterbrook is an investigative news outlet, investment firm, and litigation business. It was founded by Sam Koppelman and Nathaniel Horwitz in 2023. Hunterbrook monetizes its reporting through financial trading and litigation.</p>\n<p>Who will this new investigation be about? He has hinted about doing a Brunson episode before. </p>",
            "date_published": "2025-09-15T22:41:55+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1nhppfk",
            "url": "/r/nba/comments/1nhppfk/allaccess_nba_players_weigh_in_on_who_they_think/",
            "external_url": "https://v.redd.it/z00d84nmocpf1",
            "title": "[All-Access] NBA players weigh in on who they think is the league’s best golfer",
            "content_html": "",
            "date_published": "2025-09-15T15:55:00+00:00",
            "authors": [
                {
                    "name": "nba",
                    "url": "https://www.reddit.com/user/nba"
                }
            ]
        },
        {
            "id": "1nhonkc",
            "url": "/r/nba/comments/1nhonkc/lebron_and_dr_j_at_the_2003_espys_its_kinda_funny/",
            "external_url": "https://streamable.com/dwp64z",
            "title": "LeBron and Dr. J at the 2003 ESPYs: \"It's kinda funny we're presenting college athlete of the year. You old-school, I'm no-school\" \"Not exactly, that A you got in Economics is gonna come in handy\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 66.852%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/dwp64z\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-15T15:16:18+00:00",
            "authors": [
                {
                    "name": "kurruchi",
                    "url": "https://www.reddit.com/user/kurruchi"
                }
            ]
        },
        {
            "id": "1nh11fg",
            "url": "/r/nba/comments/1nh11fg/germany_are_eurobasket_2025_champions/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nh11fg/germany_are_eurobasket_2025_champions/",
            "title": "Germany are EuroBasket 2025 champions",
            "content_html": "<p>Germany defeat Türkiye 88–83 in the final to claim the EuroBasket 2025 crown</p>\n<p>Source: https://www.fiba.basketball/en/events/fiba-eurobasket-2025/games/123033-TUR-GER</p>",
            "date_published": "2025-09-14T19:53:03+00:00",
            "authors": [
                {
                    "name": "TrenAt14",
                    "url": "https://www.reddit.com/user/TrenAt14"
                }
            ]
        },
        {
            "id": "1ngt70d",
            "url": "/r/nba/comments/1ngt70d/ja_morants_daughter_kaari_cooking_jaren_jackson/",
            "external_url": "https://streamable.com/v6jckk",
            "title": "Ja Morant’s daughter Kaari cooking Jaren Jackson Jr. at his basketball camp",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/v6jckk\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-14T14:48:27+00:00",
            "authors": [
                {
                    "name": "erichama",
                    "url": "https://www.reddit.com/user/erichama"
                }
            ]
        },
        {
            "id": "1ngq44f",
            "url": "/r/nba/comments/1ngq44f/bg_the_case_is_embarrassing_for_the_league_and/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ngq44f/bg_the_case_is_embarrassing_for_the_league_and/",
            "title": "[BG] The case is embarrassing for the league and questions whether the NBA has full control over their billionaire governors who have the financial acumen to funnel money to free agents. It’s difficult to believe the league’s most unemotional personality [Kawhi] garnering a $48 mill endorsement deal",
            "content_html": "<p>Source: https://www.bostonglobe.com/2025/09/13/sports/sunday-basketball-notes-clippers-kawhi-leonard/</p>\n<p>The case is embarrassing for the league, and also questions whether Silver and the NBA have full control over their billionaire governors, who perhaps have the financial and business acumen to funnel money to free agents as a means of long-term contractual commitments. There have been reports that Leonard asked the Raptors for ownership pieces of the NHL’s Maple Leafs if he were to re-sign.</p>\n<p>Was the Aspiration endorsement a way for the Clippers to keep Leonard from pursuing free agency? It’s difficult to believe one of the league’s most mercurial and unemotional personalities could garner a $48 million endorsement deal.</p>",
            "date_published": "2025-09-14T12:32:18+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1ngpm5k",
            "url": "/r/nba/comments/1ngpm5k/manfred_from_2014_mark_cuban_says_were_all_racist/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ngpm5k/manfred_from_2014_mark_cuban_says_were_all_racist/",
            "title": "[Manfred] From 2014: Mark Cuban says: We’re All Racist, Bigoted, Calls Donald Sterling Ruling 'A Slippery Slope'",
            "content_html": "<p>Source: https://www.businessinsider.com/mark-cuban-donald-sterling-2014-5</p>\n<p>Dallas Mavericks owner Mark Cuban talked about the NBA's decision to ban Donald Sterling and force him to sell the Clippers in a new interview at Inc.'s GrowCo conference in Nashville.</p>\n<p>While he acknowledged that NBA commissioner Adam Silver \"had to do it,\" he reiterated his statement that forcing Sterling to sell the team for making racist comments is \"a slippery slope.\"</p>\n<p>In a supplemental interview on Inc.com, he said that everyone, including himself, holds prejudices:</p>\n<p><strong>\"We're all prejudiced in one way or the other. If I see a black kid in a hoodie and it's late at night, I'm walking to the other side of the street. And on that side of the street there's a guy who has tattoos all over his face — white guy, bald head, tattoos everywhere — I'm walking back to the other side of the street ... I know that I'm not perfect. I know I live in a glass house and it's not appropriate for me to throw stones.\"</strong></p>",
            "date_published": "2025-09-14T12:07:17+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1ng3g82",
            "url": "/r/nba/comments/1ng3g82/dave_dufour_with_the_athletic_if_youre_going_to/",
            "external_url": "https://streamable.com/cs0ez1",
            "title": "Dave DuFour with the Athletic: \"If you're going to have rules in place, and they can just be ignored, then why can't the Memphis Grizzlies play with six guys on the court? Why can't the Warriors add a four-point line? If the rules are arbitrary, then you no longer have a sport.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.294%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/cs0ez1\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-13T17:30:32+00:00",
            "authors": [
                {
                    "name": "Classic-Carpet7609",
                    "url": "https://www.reddit.com/user/Classic-Carpet7609"
                }
            ]
        },
        {
            "id": "1ng03wi",
            "url": "/r/nba/comments/1ng03wi/pablo_torre_good_morning_according_to_9_sources/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ng03wi/pablo_torre_good_morning_according_to_9_sources/",
            "title": "Pablo Torre: Good morning. According to 9 sources with direct knowledge of the deal, Clippers owner Steve Ballmer personally invested another $10M into Aspiration in March 2023 — the same month Kawhi Leonard was owed his quarterly payment. (First reported by The Athletic.)",
            "content_html": "<p>Pablo with another bomb today morning after the additional $10 million dollar payment that Steve Balmer came out.</p>\n<blockquote>\n<p>Good morning.</p>\n<p>According to 9 sources with direct knowledge of the deal, Clippers owner Steve Ballmer personally invested another $10M into Aspiration in March 2023 — the same month Kawhi Leonard was owed his quarterly payment. (First reported by @TheAthletic.)</p>\n<p>More to come 👀</p>\n</blockquote>",
            "date_published": "2025-09-13T15:17:56+00:00",
            "authors": [
                {
                    "name": "TheRealPdGaming",
                    "url": "https://www.reddit.com/user/TheRealPdGaming"
                }
            ]
        },
        {
            "id": "1nfy0b9",
            "url": "/r/nba/comments/1nfy0b9/sanberg_text_to_his_aspiration_cofounder_cherney/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nfy0b9/sanberg_text_to_his_aspiration_cofounder_cherney/",
            "title": "Sanberg text to his Aspiration co-founder Cherney in November 2020: \"Figure out how to get me the money tomorrow or I’ll be in default... This will give you a good taste of what I have to experience every day. I hate you and I hate this company and I don’t want to work anymore with you.\"",
            "content_html": "<p>Source is SEC complaint against Sanberg and Aspiration: https://www.sec.gov/files/litigation/complaints/2025/comp26382.pdf</p>\n<p>Full excerpt</p>\n<blockquote>\n<p>on November 29, 2020, Sanberg texted Aspiration’s cofounder and Chief Executive Officer (“CEO”): “Figure out how to get me the money tomorrow or I’ll be in default. It’s your turn to do what needs to be done. . . . But if you don’t get me the money tomorrow we are all f…ed. Get me the money. Your turn to figure it out like I have for so long. Wire it to the [Sanberg-entity] account. If you don’t then [the lender] will foreclose. This will give you a good taste of what I have to experience every day. I hate you and I hate this company and I don’t want to work anymore with you [ ]. You are so oblivious to what you’ve forced me to have to do.”</p>\n</blockquote>\n<p>It's so funny to see the childish tantrum \"I hate you\" line in what is otherwise a very angry threat in a very serious document. The whole thing is surprisingly understandable to a layperson</p>\n<p>The quote pre-dates known interactions with Ballmer/Clippers/Kawhi so it's not directly related to the NBA story in that way, but it is a look behind the curtain at the company at the center of this. They were always running out of money and the co-founders were not on good terms. Less than a year later, they had seemingly saved the company and were happily posing for photo-ops with Steve Ballmer celebrating the Clippers partnership and large investment. </p>\n<p>The rest of the complaint does reference events and figures more directly related to the NBA story. There is an \"Investor 1\" that is likely Ballmer and some documented correspondence between his chief investment officer and Sanberg that's interesting to read. It also lays out when the company's accounting firm resigned over fraud concerns and concerns the company's CFO had throughout.</p>",
            "date_published": "2025-09-13T13:50:40+00:00",
            "authors": [
                {
                    "name": "refreshing_yogurt",
                    "url": "https://www.reddit.com/user/refreshing_yogurt"
                }
            ]
        },
        {
            "id": "1nffsx5",
            "url": "/r/nba/comments/1nffsx5/vorkunov_clippers_owner_steve_ballmer_invested/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nffsx5/vorkunov_clippers_owner_steve_ballmer_invested/",
            "title": "[Vorkunov] Clippers owner Steve Ballmer invested additional $10M in company sponsoring Kawhi Leonard",
            "content_html": "<blockquote>\n<p>In March 2023, LA Clippers owner Steve Ballmer invested almost $10 million into financial technology and sustainability services company Aspiration, according to legal filings reviewed by The Athletic and corroborated by a former Aspiration executive.</p>\n<p>The previously unreported investment came 18 months after Ballmer’s $50 million investment in the firm now at the heart of an NBA investigation into whether Clippers star Kawhi Leonard made a side deal to circumvent the NBA’s salary cap, allegations first reported by the “Pablo Torre Finds Out” podcast last week.</p>\n<p>In December 2022, Wong invested almost $2 million in Aspiration through DEA 88 Investments LLP. Days later, according to reporting by “Pablo Torre Finds Out,” Aspiration paid Leonard $1.75 million.</p>\n<p>Three months later, according to court documents in a civil suit, Ballmer invested $9,999,997.92 in the company. Aspiration had been struggling financially, with just $12.2 million in cash as of Feb. 17, 2023 and running through more than $2 million a week. The Clippers declined to comment on the March 2023 investment. </p>\n<p>It’s unclear if Aspiration continued paying Leonard, who is listed as a creditor in Aspiration’s bankruptcy filings for $7 million, as are two companies representing the Clippers for a combined $50 million.</p>\n</blockquote>\n<p>https://www.nytimes.com/athletic/6624269/2025/09/12/clippers-steve-ballmer-kawhi-leonard-aspiration-investment-sponsorship/</p>",
            "date_published": "2025-09-12T21:42:34+00:00",
            "authors": [
                {
                    "name": "Knightbear49",
                    "url": "https://www.reddit.com/user/Knightbear49"
                }
            ]
        },
        {
            "id": "1nf8mk7",
            "url": "/r/nba/comments/1nf8mk7/pablo_torre_on_his_reporting_on_one_side_of_this/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nf8mk7/pablo_torre_on_his_reporting_on_one_side_of_this/",
            "title": "Pablo Torre on his reporting: “On one side of this story is one of the 10 richest people in the world, and on the other side of the story, is me, you and our lawyer... I’m actively trying to confirm this stuff in the event of litigation or factual correction.”",
            "content_html": "<p><a href=\"https://open.spotify.com/episode/5yVYaVx49ObdEzjOEWhLpk?si=J8hd4WvTTfaMOXScMGsMJw&amp;t=620&amp;context=spotify%3Acollection%3Apodcasts%3Aepisodes\">Source</a></p>\n<blockquote>\n<p>I am somebody who will only publish things if I have the factual backing that meets the highest standards of publishing.</p>\n<p>The crazy part about this, for this who do not understand the power dynamic here, is that on one side of this story is one of the 10 richest people in the world, and on the other side of the story, is me, you [Meadowlark Media] and our lawyer.</p>\n<p>So the whole question of “when am I comfortable publishing something?”  It’s not like I’m holding back everything I got. I’m actively trying to confirm this stuff in the event of litigation or factual correction.</p>\n<p>The smile I had is the smile of knowing that I think I could get this. This is a bad look for them, because they’re not taking the first report seriously — and I don’t think they did, frankly. And so I get to prove, and hold them to account using whatever they want to communicate to the public.</p>\n</blockquote>",
            "date_published": "2025-09-12T17:00:16+00:00",
            "authors": [
                {
                    "name": "cleo22270",
                    "url": "https://www.reddit.com/user/cleo22270"
                }
            ]
        },
        {
            "id": "1nedm05",
            "url": "/r/nba/comments/1nedm05/fischer_multiple_team_strategists_say_that_if_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nedm05/fischer_multiple_team_strategists_say_that_if_the/",
            "title": "[Fischer] Multiple team strategists say that if the Clippers aren't docked multiple 1RPs and Leonard's contract isn't voided while his salary remains on the Clippers' books—they will feel emboldened to seek out their own version of shell companies to provided additional compensation to their players",
            "content_html": "<p>Source: https://open.substack.com/pub/marcstein/p/adam-silver-says-the-onus-is-on-the?r=nuq3a&amp;utm_medium=ios</p>\n<blockquote>\n<p>Leading up to Silver's first public comments on the matter, I spoke to so many people from various NBA outposts who were openly outraged and likewise convinced that the Clippers are poised to receive some type of penalty. The general perception of their alleged transgressions is that negative. I've spoken to multiple team strategists, for example, who told me, with chests puffed, that if the Clippers aren't docked multiple first-round picks — if Leonard's contract isn't voided while his salary obligations remain on the Clippers' books — they will feel emboldened to seek out their own version of shell companies to provided additional compensation to their players.</p>\n<p>That might be the extreme (and emotional) end of the spectrum in terms of leaguewide reaction to this controversy ... but it's out there.</p>\n</blockquote>",
            "date_published": "2025-09-11T16:37:46+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1ne7f1b",
            "url": "/r/nba/comments/1ne7f1b/torre_dennis_j_wong_chairman_of_the_la_clippers/",
            "external_url": "https://streamable.com/h6uc76",
            "title": "[Torre] Dennis J. Wong, chairman of the LA Clippers and the entity who invested $2M into Aspiration — as it was struggling financially— 9 days before Leonard received $1.75M, had a daughter who worked at Aspiration under the title “Project Manager, Operations and Strategy”.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 57.103%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/h6uc76\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-11T12:25:12+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1ne51h5",
            "url": "/r/nba/comments/1ne51h5/pablo_torre_dennis_wong_only_other_clippers/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ne51h5/pablo_torre_dennis_wong_only_other_clippers/",
            "title": "[Pablo Torre] Dennis Wong, only other Clippers co-owner, invested $2M into Aspiration, just a few days before the second quarterly $1.75M payment to Kawhi was wired to him",
            "content_html": "<p>Title says it all. Second PTFO installment is another bombshell.</p>\n<p>Source: <a href=\"https://www.youtube.com/watch?v=mKJyKFdT8rQ\">https://www.youtube.com/watch?v=mKJyKFdT8rQ</a></p>",
            "date_published": "2025-09-11T10:18:37+00:00",
            "authors": [
                {
                    "name": "archieboy",
                    "url": "https://www.reddit.com/user/archieboy"
                }
            ]
        },
        {
            "id": "1ndg05f",
            "url": "/r/nba/comments/1ndg05f/sbj_nba_has_hired_the_law_firm_of_wachtell_lipton/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ndg05f/sbj_nba_has_hired_the_law_firm_of_wachtell_lipton/",
            "title": "[SBJ] NBA has hired the law firm of Wachtell, Lipton, Rosen & Katz to investigate the Clippers. “Oh my God, these guys are animals,” said one NBA team executive about NBA-led investigations. “It’s a league of lawyers. They investigate. You’d rather be investigated by the DOJ than the NBA.”",
            "content_html": "<p>Source: https://www.sportsbusinessjournal.com/Articles/2025/09/10/clippers-gate-hangs-over-nba-bog-meeting-today/</p>\n<p>Adam Silver’s first test as NBA commissioner in 2014 was: what to do about Donald Sterling and the Clippers. Now it’s what to do with Steve Ballmer and the Clippers.</p>\n<p>The league’s BOG has convened in N.Y. with a supposed laundry list of updates regarding NBA Europe, local TV, the NBA All-Star Game and expansion. Instead, they are expected to discuss the dirty laundry of Ballmer, Kawhi Leonard, the eco-friendly company Aspiration and a potentially circumvented salary cap.</p>\n<p>At question is the reported $28M that Aspiration committed to Leonard for a no-show job shortly after Leonard signed with the Clippers four years ago -- plus $20M promised to him in company stock -- and $50M Ballmer invested in Aspiration to potentially fund the payments. Ballmer has said none of it is interconnected, but the NBA has nonetheless hired the law firm of Wachtell, Lipton, Rosen &amp; Katz to investigate. Silver will certainly be asked to weigh in at today’s post-BOG news conference.</p>\n<p>“Oh my God, these guys are animals,” said one NBA team executive about NBA-led investigations. “It’s a league of lawyers. They investigate. You’d rather be investigated by the DOJ than the NBA.”</p>\n<p>According to CBA by-laws, Silver has the ability to void Leonard’s Clippers contract, take away draft picks, fine the team up to $7.5M, fine Leonard up to $350,000 or suspend Clippers personnel who were complicit. None of that will be figured out today, but Clippers-gate is the obvious cloud hanging over today’s BOG session.</p>",
            "date_published": "2025-09-10T14:38:54+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1nden3b",
            "url": "/r/nba/comments/1nden3b/bloom_ballmers_scandal_shows_how_media_hails/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nden3b/bloom_ballmers_scandal_shows_how_media_hails/",
            "title": "[Bloom] Ballmer’s scandal shows how media hails billionaires as visionaries while their fortunes rest on monopoly, exploitation and illusion. If journalism is to serve the public, it must puncture the myths of genius and demand accountability from those who profit most from monopoly and exploitation",
            "content_html": "<p>Source: https://www.commondreams.org/opinion/media-billionaires</p>\n<p><strong>Ballmer’s career at Microsoft is often painted as the story of a bold leader guiding a tech giant through the new millennium. In reality, it was a case study in how to crush rivals and protect a monopoly. Under his watch, Microsoft racked up record fines from regulators; perfected its notorious strategy of “embrace, extend, extinguish;” and enforced a cutthroat internal culture that stifled collaboration. This wasn’t innovation. It was domination dressed up as genius.</strong></p>\n<p>When Ballmer became Microsoft’s CEO in 2000, the company was already facing a bruising US antitrust case over its efforts to crush competitors like Netscape and RealNetworks. European regulators soon followed, hitting Microsoft with record fines for abusing its monopoly. The Commission found that Microsoft had deliberately abused its dominant position by tying Windows Media Player to its operating system and undermining competition in server software.</p>\n<p>At the center of these cases was a clear pattern: Microsoft used its dominance not to compete fairly but to block competitors, extend its monopoly, and extract rents from consumers and developers.</p>\n<p><strong>Internally, Ballmer presided over the now-notorious “stack ranking” system, in which managers were forced to rank employees against each other, ensuring that some were always labeled failures regardless of performance. Vanity Fair reported that this system was described by employees as “the most destructive process inside of Microsoft.” It encouraged backstabbing, punished collaboration, and destroyed morale.</strong></p>\n<p><strong>Yet Ballmer’s reputation in the business press was rarely tarnished. Microsoft’s aggressive tactics and toxic culture were downplayed as part of the “rough and tumble” of the tech industry. Instead of being recognized as symptoms of a deeply flawed corporate ethos, they were cast as evidence of toughness, discipline, or even strategic brilliance.</strong></p>\n<p><strong>Ballmer’s career is a perfect case in point. Few in the press asked whether Microsoft’s dominance strangled innovation or whether his leadership undermined workers and consumers. Instead, the coverage painted him as a colorful eccentric, a lovable billionaire, and above all a success story—as if his rise were earned brilliance rather than brute monopoly power.</strong></p>\n<p><strong>Pablo Torre’s remarkable reporting on the Aspiration scandal is a reminder of what real journalism can do when it asks hard questions instead of recycling corporate talking points. His work not only exposes the hidden machinery of sports business but also shows why we need the same relentless scrutiny of CEOs and executives across industries. If journalism is to serve the public, it must puncture the myths of genius and demand accountability from those who profit most from monopoly and exploitation.</strong></p>\n<p>The NBA investigation may or may not conclude that Ballmer violated the rules. But the larger scandal here is not limited to basketball. It is about how our culture treats men like Ballmer as role models—how we conflate wealth with competence, market share with innovation, and ruthless opportunism with genius.</p>\n<p>The real lesson of this scandal is that we must break the spell of billionaire mythology. Ballmer is not a singular villain; he is an emblem of an age in which billionaires are lauded as saviors while their empires rest on monopoly, exploitation, and illusion. The media has played a crucial role in maintaining this façade, selling the public a narrative of “genius” to justify inequality.</p>\n<p>A more honest narrative would recognize that the wealth of men like Ballmer was built on systems of exclusion, not innovation. It would expose the ways that corporate culture, whether in Big Tech or in the world of “ethical finance,” uses the language of progress to mask exploitation. And it would challenge the very legitimacy of an economy in which billionaires can fail upward, celebrated as geniuses even as their companies and investments leave wreckage behind.</p>",
            "date_published": "2025-09-10T13:45:42+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1ncs2tf",
            "url": "/r/nba/comments/1ncs2tf/charania_just_in_restricted_free_agent_josh/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ncs2tf/charania_just_in_restricted_free_agent_josh/",
            "title": "[Charania]: Just in: Restricted free agent Josh Giddey has reached agreement on a four-year, $100 million deal to re-sign with the Chicago Bulls, agent Daniel Moldovan of Lighthouse Sports Management tells ESPN.",
            "content_html": "<p>Shams Charania has posted the following: </p>\n<blockquote>\n<p>Just in: Restricted free agent Josh Giddey has reached agreement on a four-year, $100 million deal to re-sign with the Chicago Bulls, agent Daniel Moldovan of Lighthouse Sports Management tells ESPN.</p>\n</blockquote>\n<p>Source to the story: https://bsky.app/profile/shamsbot.bsky.social/post/3lyggeokvco2j</p>\n<p>Stats: </p>\n<blockquote>\n<p>Giddey is coming off a career season in Chicago, scoring 14.6 points per game while averaging career-highs in rebounds (8.1), assists (7.2), steals (1.2) and 3-pointers (37.8%) — and averaged 21.2 points, 10.7 rebounds, 9.3 assists on 50% shooting and 46% on 3s after All-Star.</p>\n</blockquote>\n<p>Edit: Source to the Stats: https://bsky.app/profile/shamsbot.bsky.social/post/3lyggeokvco2j</p>",
            "date_published": "2025-09-09T19:12:41+00:00",
            "authors": [
                {
                    "name": "TrenAt14",
                    "url": "https://www.reddit.com/user/TrenAt14"
                }
            ]
        },
        {
            "id": "1ncmjfv",
            "url": "/r/nba/comments/1ncmjfv/bruce_arthur_in_2019_kawhi_asked_the_raptors_for/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ncmjfv/bruce_arthur_in_2019_kawhi_asked_the_raptors_for/",
            "title": "Bruce Arthur: In 2019, Kawhi asked the Raptors for a no-show job worth 10M a year, plus shares in the Maple Leafs",
            "content_html": "<p>Full story here: https://www.thestar.com/sports/raptors/inside-kawhi-leonard-s-bizarre-list-of-secret-demands-from-raptors-and-how-they-line/article_9f1b0398-0ebd-4193-bc06-798efda95023.html</p>\n<p>Key passages:</p>\n<p>But multiple sources with knowledge of Toronto’s contract negotiations with Leonard in 2019 told the Star that Leonard’s uncle and representative, Dennis Robertson, made demands that line up almost perfectly with what Leonard reportedly got from Aspiration. According to those sources, who were granted anonymity in order to speak freely about the negotiations, Robertson’s list was long, and absurd. It included a trade for George, which featured an exorbitant price tag. It included a slice of ownership of the Toronto Maple Leafs, which Robertson was told was impossible.</p>\n<p>But two details stand out, in retrospect. One, Robertson asked for ownership stakes in outside companies: not just the Leafs, which he seemed to believe was separate, but with other companies with whom MLSE had a relationship. And two, the Raptors were told they needed to match at least $10 million per year in extra sponsorship income. Teams are allowed to introduce players to team sponsors; teams cannot negotiate deals, and MLSE was aware of that fact.</p>\n<p>But it didn’t end there. As one source put it, when told about all the corporate sponsors in Toronto who would be happy to have Leonard as a pitchman, his camp said, “We don’t want to do anything.” Raptors representatives said any sponsor would want to shoot ads or arrange appearances; Robertson reiterated Leonard didn’t want to do anything for the money.</p>\n<p>That’s when the Raptors realized Leonard wasn’t asking to be introduced to Toronto’s lucrative corporate community; they were being asked to arrange no-show jobs, and arrange no-investment investments. MLSE rejected both proposals.</p>",
            "date_published": "2025-09-09T15:48:27+00:00",
            "authors": [
                {
                    "name": "Team_Ed",
                    "url": "https://www.reddit.com/user/Team_Ed"
                }
            ]
        },
        {
            "id": "1nclak0",
            "url": "/r/nba/comments/1nclak0/elhassan_mark_cubans_defense_of_steve_ballmer_was/",
            "external_url": "https://youtu.be/BQfRf7DkvR8?si=QEO9X4Ln2rn4rJkA",
            "title": "[Elhassan] Mark Cuban’s defense of Steve Ballmer was: ‘Hey, rich people don’t know how much money they have or how much money they’re investing,’ infantilizing him like he was a victim. All the texts I got from people around the league were along the lines of, ‘I think the Clippers are screwed.’",
            "content_html": "",
            "date_published": "2025-09-09T15:01:10+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1nckkwa",
            "url": "/r/nba/comments/1nckkwa/zach_lowe_rival_teams_remain_furious_about_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nckkwa/zach_lowe_rival_teams_remain_furious_about_the/",
            "title": "[Zach Lowe] Rival teams remain furious about the optics here regardless of CBA language/what investigation turns up; do not expect this to go away anytime soon. As Kirk Goldsberry said (relating thoughts from a team exec): \"The integrity of the league is at stake.\"",
            "content_html": "<p>Source: https://imgur.com/a/6jKcmGn</p>\n<p>Two ZL Shows on Kawhi/Ballmer/Clips -- feel like we have hit on every angle as best we can at this early stage: </p>\n<p>Would recommend listening to them in tandem to get the full lay of the land/range of reactions</p>\n<p>Rival teams remain furious about the optics here regardless of CBA language/what investigation turns up; do not expect this to go away anytime soon. As @kirkgoldsberry said (relating thoughts from a team exec): \"The integrity of the league is at stake.\"</p>",
            "date_published": "2025-09-09T14:33:55+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1nc0rip",
            "url": "/r/nba/comments/1nc0rip/israels_coach_when_asked_about_whats_the_best_way/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nc0rip/israels_coach_when_asked_about_whats_the_best_way/",
            "title": "Israel's coach when asked about what's the best way to stop Giannis Antetokounmpo in the Eurobasket :\n\n \"You'd need to bring an M-16, I think. That would be easiest way\"",
            "content_html": "<p><a href=\"https://www.haaretz.com/israel-news/sports/2025-09-07/ty-article/.premium/israels-coach-jokes-youll-need-an-m-16-to-contain-giannis-before-greece-showdown/00000199-211e-d1da-a3df-b51e10840000\">Source</a></p>\n<p>Giannis put up 37 points, 10 rebounds to take Greece to the next round</p>\n<p>Israel's coach on how to stop Giannis: \"You'd need to bring an M-16, I think. That would be easiest way\"</p>",
            "date_published": "2025-09-08T21:41:10+00:00",
            "authors": [
                {
                    "name": "oklolzzzzs",
                    "url": "https://www.reddit.com/user/oklolzzzzs"
                }
            ]
        },
        {
            "id": "1nbrn07",
            "url": "/r/nba/comments/1nbrn07/miami_heat_reveal_new_point_guard_adam_sandler/",
            "external_url": "https://streamable.com/fhh5e3",
            "title": "Miami Heat Reveal New Point Guard, Adam Sandler",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fhh5e3\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-08T15:59:41+00:00",
            "authors": [
                {
                    "name": "AashyLarry",
                    "url": "https://www.reddit.com/user/AashyLarry"
                }
            ]
        },
        {
            "id": "1nbpd0t",
            "url": "/r/nba/comments/1nbpd0t/tyrese_haliburton_on_his_favorite_luka_pass_he/",
            "external_url": "https://streamable.com/1fsv0e",
            "title": "Tyrese Haliburton on his favorite Luka pass: \"He threw that pass against us on the baseline when he was trapped, and he jumped and whipped it, the ball... like... bent. I was behind him. He threw it, turned around, and looked at me. I said, 'Nah, that was special. You are special, that was crazy.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/1fsv0e\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-08T14:33:34+00:00",
            "authors": [
                {
                    "name": "WhenMachinesCry",
                    "url": "https://www.reddit.com/user/WhenMachinesCry"
                }
            ]
        },
        {
            "id": "1nbpkiy",
            "url": "/r/nba/comments/1nbpkiy/jj_redick_perk_is_that_you_moaning_in_my_ear_over/",
            "external_url": "https://streamable.com/h5zffk",
            "title": "JJ Redick: \"Perk, is that you moaning in my ear over and over again?\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 150.158%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/h5zffk\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-08T14:41:50+00:00",
            "authors": [
                {
                    "name": "aingenevalostatrade",
                    "url": "https://www.reddit.com/user/aingenevalostatrade"
                }
            ]
        },
        {
            "id": "1nbpakz",
            "url": "/r/nba/comments/1nbpakz/hollinger_ive_seen_some_people_speculate_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1nbpakz/hollinger_ive_seen_some_people_speculate_the/",
            "title": "Hollinger: “I’ve seen some people speculate the other owners aren’t going to want too much light on this because they’re worried about their own cheating. Nobody is doing shit like this… If this is Ballmer putting $50m in the business as a way to pay Kawhi outside of the books, that is SMU stuff.”",
            "content_html": "<p><a href=\"https://open.spotify.com/episode/2zEjxmvOYR4xBmjLXNq9i0?si=TYC9RJX6T3eH--P2KJZUaA&amp;t=728&amp;ct=642&amp;context=spotify%3Acollection%3Apodcasts%3Aepisodes\">Source</a></p>\n<blockquote>\n<p>There’s one other thing I need to address on this, because I’ve seen some people speculate the other owners aren’t going to want too much light on this because they’re worried about their own cheating. No. Nobody is doing shit like this. </p>\n<p>This type of stuff is not happening. If this is Ballmer putting $50m in the business as a way to pay Kawhi Leonard outside of the books, that is SMU stuff. They are going to get absolutely hammered to the full extent that the league possibly can.</p>\n</blockquote>",
            "date_published": "2025-09-08T14:30:53+00:00",
            "authors": [
                {
                    "name": "cleo22270",
                    "url": "https://www.reddit.com/user/cleo22270"
                }
            ]
        },
        {
            "id": "1naee4d",
            "url": "/r/nba/comments/1naee4d/miami_heat_owner_micky_arison_in_2010_with_dwyane/",
            "external_url": "https://streamable.com/dlijiw",
            "title": "Miami Heat owner Micky Arison: \"In 2010, with Dwyane, LeBron and Chris Bosh we knew we could win. Not 1, not 2... I guess it was just 2.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/dlijiw\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-06T23:44:14+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1naah7x",
            "url": "/r/nba/comments/1naah7x/post_game_thread_lauri_markkanen_and_finland_pull/",
            "external_url": "https://www.reddit.com/r/nba/comments/1naah7x/post_game_thread_lauri_markkanen_and_finland_pull/",
            "title": "[Post Game Thread] Lauri Markkanen and Finland pull off the SHOCKING upset and beat Jokic and Serbia 92 - 86 as Lauri scores 29 & 7 against Jokic’s 33 points & 8 Rebs",
            "content_html": "<p>This is the greatest win in the history of Finnish Basketball. The Wolf pack of Finland pull off a MAJOR win against Serbia to eliminate the Gold Medal favorite and move on to the next round. </p>\n<p>Lauri was good but the real hero is Elias Valtonen who hit clutch shot after clutch shot en route to 13 points, almost all of which came in the 4th quarter. I LOVE BASKETBALL BABY! </p>\n<p>Boxscore: https://www.fiba.basketball/en/events/fiba-eurobasket-2025/games/123019-SRB-FIN#boxscore</p>",
            "date_published": "2025-09-06T20:51:51+00:00",
            "authors": [
                {
                    "name": "NathanFielderFriend",
                    "url": "https://www.reddit.com/user/NathanFielderFriend"
                }
            ]
        },
        {
            "id": "1na32l0",
            "url": "/r/nba/comments/1na32l0/tyrese_halliburton_when_asked_where_to_find_a/",
            "external_url": "https://streamable.com/pgu4yh",
            "title": "Tyrese Halliburton when asked where to find a “no-show job” like Kawhi Leonard: “I don’t know but tell them to find me too!”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 51.064%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/pgu4yh\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-06T15:55:08+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1na0e8x",
            "url": "/r/nba/comments/1na0e8x/samson_ballmer_made_an_investment_sat_next_to_the/",
            "external_url": "https://streamable.com/keaxjd",
            "title": "[Samson] “Ballmer made an investment, sat next to the founder who had done the $300 mill sponsorship deal like they were bosom buddies and Aspiration looks around and they say We don't need to talk to Steve about it. Let's just sign Kawhi to a $28 mill 4-yr deal. Do you realize how absurd that is?”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/keaxjd\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-06T14:04:59+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1n961x3",
            "url": "/r/nba/comments/1n961x3/fitz_if_your_answer_to_transparency_is_putting/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n961x3/fitz_if_your_answer_to_transparency_is_putting/",
            "title": "[Fitz] If your answer to transparency is putting Steve Ballmer on ESPN, then I would say shame on you. Why would you send Steve Ballmer to Ramona Shelburne when Pablo Torre is the one that has spent months preparing this entire report. Instead, you go to the softest landing spot you can get.",
            "content_html": "<p>Source: https://sports.yahoo.com/video/steve-ballmer-sit-down-only-132025852.html</p>\n<p>And the problem here is we're not gonna get any transparency.</p>\n<p>The one thing that you have to have when you have been caught with your hand in the cookie jar is transparency about what happened, why it happened, and what you're going to do moving forward.</p>\n<p>We're not getting any of that.</p>\n<p>And if your answer to transparency is putting Steve Ballmer on ESPN.</p>\n<p>Yeah, then I would say shame on you.</p>\n<p>Why would you send Steve Ballmer to Ramona Shelburne, who, by the way, is a legend and a friend.</p>\n<p>Why would you send Steve Ballmer to Ramona Shelburne for this interview when Pablo Torre is the one that has spent months preparing this entire report.</p>\n<p>If you really want to be transparent, Steve Ballmer in the NBA, then you need to sit down with Pablo, who has months of research involved in this and has so much knowledge on the case that he can actually give you the thorough interview that you need and want to get down to the core of what actually happened.</p>\n<p>Instead, you go to the softest landing spot you can.</p>\n<p>Any of us that are trying to chase our tails to get this amount of information digested, consumed, and then be able to do an interview on it would be behind the eight ball from the outset because it's a ton of information to try and process.</p>\n<p>The only person in the world that could actually do a fair, reasonable, and thorough, uh, interview.</p>\n<p>With Steve Ballmer is Pablo, but that's not what the Clippers did.</p>\n<p>And what have we heard from the NBA so far?</p>\n<p>Basically nothing.</p>\n<p>If you want anybody to trust the way you run your league, especially when you are a league that has literally had referees thrown in jail for throwing games.</p>\n<p>If you want people to trust your product, you have got to be transparent.</p>\n<p>That is all I can scream right now to Steve Ballmer, to the Clippers, and to the NBA.</p>\n<p>We deserve.</p>\n<p>As a public that consumes your product, transparency on what you knew, how you knew it.</p>\n<p>If you didn't know anything, how is that humanly possible?</p>\n<p>Every ounce of this needs to be uncovered and it needs to be done in the biggest possible way where they laid their cards face up on the table if you want any of us to believe that your salary cap system is actually for real.</p>\n<p>We're waiting, NBA.</p>\n<p>We're waiting on you to say something to somebody that isn't just a soft landing spot.</p>",
            "date_published": "2025-09-05T14:00:03+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1n94ts6",
            "url": "/r/nba/comments/1n94ts6/murray_ballmer_i_dont_know_why_they_did_what_they/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n94ts6/murray_ballmer_i_dont_know_why_they_did_what_they/",
            "title": "[Murray] Ballmer: “I don’t know why they did what they did. These are guys who committed fraud. They conned me. I made an investment thinking it was on the up and up, and they con me. I have no ability to predict why they might have done anything they did, let alone the specific contract with Kawhi”",
            "content_html": "<p>Source: https://www.nytimes.com/athletic/6600547/2025/09/05/steve-ballmer-kawhi-leonard-endorsement-deal-clippers/</p>\n<p>Ballmer sat down with ESPN reporter Ramona Shelburne for a 16-minute interview and said he did not know anything about star forward Kawhi Leonard’s reported endorsement deal with Aspiration, a now-bankrupt environmental company the Clippers signed a massive sponsorship deal with in 2021. Ballmer added that Leonard’s 2021 contract with the Clippers was not related to the team’s association with Aspiration and that the Clippers “have abided by the salary-cap circumvention rules because that’s the right thing to do.”</p>\n<p>“Pablo’s podcast, I don’t know anything about the court documents on this,” Ballmer said Thursday night. “I haven’t seen them, and I don’t know. I don’t know why they did what they did, and I don’t know how different it is. I really don’t. And frankly, any speculation would be crazy.</p>\n<p>“These are guys who committed fraud. How would I be able — look, they conned me. They conned me. I made an investment in these guys, thinking it was on the up and up, and they con me. At this stage, I have no ability to predict why they might have done anything they did, let alone the specific contract with Kawhi.”</p>",
            "date_published": "2025-09-05T13:08:33+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1n8xd81",
            "url": "/r/nba/comments/1n8xd81/pablo_torre_ptfo_can_now_confirm_that_aspiration/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n8xd81/pablo_torre_ptfo_can_now_confirm_that_aspiration/",
            "title": "[Pablo Torre] PTFO can now confirm that Aspiration gave Kawhi a secret $20M side-deal. Combined with Kawhi’s secret $28M no-show endorsement deal: that’s $48M. PTFO previously reported that Steve Ballmer’s personal Aspiration investment was... $50M.",
            "content_html": "<p>Source: https://imgur.com/a/Z8hchbE</p>\n<p>Just now from Pablo Torre after Steve Ballmer’s interview </p>\n<p>Hi. PTFO can now confirm that Aspiration gave Kawhi a secret $20M side-deal, as first reported by @BostonSportsBSJ.</p>\n<p>Combined with Kawhi’s secret $28M no-show endorsement deal: that’s $48M.</p>\n<p>PTFO previously reported that Steve Ballmer’s personal Aspiration investment was... $50M.</p>",
            "date_published": "2025-09-05T06:00:13+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1n88o3y",
            "url": "/r/nba/comments/1n88o3y/luka_dončić_was_ready_to_leave_practice_with_his/",
            "external_url": "https://streamable.com/q9hv5y",
            "title": "Luka Dončić was ready to leave practice with his backpack on when his teammate Alen Omić bet that he’d do 50 push-ups if Luka scored from the sideline. Luka then proceeded to casually drain the shot with his backpack still on.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/q9hv5y\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-04T12:23:47+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1n7kbyy",
            "url": "/r/nba/comments/1n7kbyy/espn_report_clippers_skirted_nba_salary_cap_with/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n7kbyy/espn_report_clippers_skirted_nba_salary_cap_with/",
            "title": "[ESPN] Report: Clippers skirted NBA salary cap with Kawhi Leonard payment",
            "content_html": "<blockquote>\n<p>The LA Clippers reportedly have been accused of circumventing the NBA's salary cap by paying $28 million to Kawhi Leonard for a \"no-show job.\"</p>\n<p>Pablo Torre, a podcaster and former ESPN contributor, reported Wednesday that the Clippers paid Leonard through a now-bankrupt company owned by Clippers owner Steve Ballmer.</p>\n<p>Citing legal documents purportedly involving the tree-planting service Aspiration, Torre reported that Ballmer paid Leonard without requiring the Clippers star to do any marketing or endorsements for the company.</p>\n<p>An unnamed employee who purportedly worked for Aspiration told Torre that the payment to Leonard \"was to circumvent the salary cap.\"</p>\n</blockquote>\n<p>There is no additional reporting beyond what's in Torre's podcast but ESPN has found it newsworthy enough to highlight the story, putting it at the top of their front page with a bright red \"Breaking News\" banner in the graphic.</p>\n<p>https://imgur.com/a/FBXMmE2</p>\n<p>Source: https://www.espn.com/nba/story/_/id/46146871/report-clippers-skirted-nba-salary-cap-kawhi-leonard-payment</p>\n<p>Edit: The article was previously a short brief with no credited author, most of which was quoted here. It's been updated to be a much longer article now, featuring more surrounding details and is now credited to ESPN reporter Baxter Holmes.</p>",
            "date_published": "2025-09-03T16:57:20+00:00",
            "authors": [
                {
                    "name": "refreshing_yogurt",
                    "url": "https://www.reddit.com/user/refreshing_yogurt"
                }
            ]
        },
        {
            "id": "1n7f4y7",
            "url": "/r/nba/comments/1n7f4y7/media_blackout_regarding_ballmerclippers_alleged/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n7f4y7/media_blackout_regarding_ballmerclippers_alleged/",
            "title": "Media blackout regarding Ballmer/Clippers alleged NBA cap-circumvention for Kawhi?",
            "content_html": "<p>It's been almost 4 hours since news broke and only Yahoo Sports and USA Today seem to have picked up the news? No articles, tweets, postings, and scoops from major Sports Media outlets like ESPN, Bleacher Report, Barstool, or even The Ringer? Other major media outlets haven't shared the news as well. This seems really strange given the nature of sports media and how those major outlets usually republish versions of major news within minutes of it coming out.</p>",
            "date_published": "2025-09-03T13:41:17+00:00",
            "authors": [
                {
                    "name": "PotassiumAlum",
                    "url": "https://www.reddit.com/user/PotassiumAlum"
                }
            ]
        },
        {
            "id": "1n6rrcn",
            "url": "/r/nba/comments/1n6rrcn/paul_george_and_streamercontent_creator/",
            "external_url": "https://streamable.com/80r592",
            "title": "Paul George and Streamer/Content Creator IShowSpeed Link Up: Speed: “You from Philly?” Paul George: “HELL NAH” Speed: “What you in Philly for?” Paul George: “I play here.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 125.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/80r592\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-02T18:40:27+00:00",
            "authors": [
                {
                    "name": "A_MASSIVE_PERVERT",
                    "url": "https://www.reddit.com/user/A_MASSIVE_PERVERT"
                }
            ]
        },
        {
            "id": "1n6pnfl",
            "url": "/r/nba/comments/1n6pnfl/allaccess_lebrons_message_to_the_2008_usa/",
            "external_url": "https://v.redd.it/xo56lqwjcsmf1",
            "title": "[All-Access] LeBron’s message to the 2008 USA Basketball Men’s National Team before their gold-medal run: \"When we go across these waters and we go play, we gotta be a no-excuse team.\"",
            "content_html": "",
            "date_published": "2025-09-02T17:22:12+00:00",
            "authors": [
                {
                    "name": "nba",
                    "url": "https://www.reddit.com/user/nba"
                }
            ]
        },
        {
            "id": "1n5r6ib",
            "url": "/r/nba/comments/1n5r6ib/lebron_james_new_ad_for_nike_he_carried_the/",
            "external_url": "https://streamable.com/q9h5ag",
            "title": "LeBron James’ new ad for Nike: “He carried the weight of every expectation on his shoulders. But he never broke. We were all witnesses. Every rival was defeated. Every idol was destroyed. He took the crown and kept it.”",
            "content_html": "<p>Do you believe every idol [Steph Curry/Kevin Durant Warriors] was destroyed? Did he take the crown [from Michael Jordan] and keep it? </p><div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/q9h5ag\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-09-01T15:06:32+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1n511lm",
            "url": "/r/nba/comments/1n511lm/charania_thanasis_antetokounmpo_is_signing_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n511lm/charania_thanasis_antetokounmpo_is_signing_a/",
            "title": "[Charania] Thanasis Antetokounmpo is signing a guaranteed one-year, $2.9 million deal to return to the Milwaukee Bucks, sources tell ESPN. Antetokounmpo played for Bucks from 2019-24. This also means after a summer of exploring options, Giannis is staying in Milwaukee to start the season.",
            "content_html": "<p>Shams Charania has posted the following on ESPN: Thanasis Antetokounmpo is signing a guaranteed one-year, $2.9 million deal to return to the Milwaukee Bucks, sources tell ESPN. Antetokounmpo played for Bucks from 2019-24. This also means after a summer of exploring options, Giannis is staying in Milwaukee to start the season.</p>\n<p>Source: https://www.espn.com/contributor/shams-charania/688a1850854fe</p>",
            "date_published": "2025-08-31T17:44:13+00:00",
            "authors": [
                {
                    "name": "TrenAt14",
                    "url": "https://www.reddit.com/user/TrenAt14"
                }
            ]
        },
        {
            "id": "1n4zui8",
            "url": "/r/nba/comments/1n4zui8/fan_greets_nico_harrison_at_a_restaurant_and/",
            "external_url": "https://streamable.com/zpiscw",
            "title": "Fan greets Nico Harrison at a restaurant and reminds him that everyone still hates him",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.222%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/zpiscw\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-31T16:56:35+00:00",
            "authors": [
                {
                    "name": "WittyKittieKat",
                    "url": "https://www.reddit.com/user/WittyKittieKat"
                }
            ]
        },
        {
            "id": "1n4gqhj",
            "url": "/r/nba/comments/1n4gqhj/jeremy_lin_has_retired_from_basketball/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n4gqhj/jeremy_lin_has_retired_from_basketball/",
            "title": "Jeremy Lin has retired from Basketball",
            "content_html": "<p>via his instagram(@jlin7): As athletes, we are always aware that the possibility of retirement is never far away. I’ve spent my 15 year career knowing that one day I would have to walk away, and yet actually saying goodbye to basketball today has been the hardest decision I’ve ever made.</p>\n<p>It's been the honor of a lifetime to compete against the fiercest competitors under the brightest lights and to challenge what the world thought was possible for someone who looks like me. I've lived out my wildest childhood dreams to play in front of fans all around the world. I will forever be the kid who felt fully alive everytime I touched a basketball.</p>\n<p>So many people have sacrificed and poured into my journey, more than I could ever repay. Thank you all for believing in me, for walking with me, for celebrating my highs and picking me up in my lows. This is a ride I never wanted to end but I know it’s time. I will forever miss playing basketball in front of you all but our time will go beyond just playing. Here’s to what’s ahead.</p>\n<p>Love you all ❤️</p>",
            "date_published": "2025-08-31T00:16:51+00:00",
            "authors": [
                {
                    "name": "Doge_the_alt",
                    "url": "https://www.reddit.com/user/Doge_the_alt"
                }
            ]
        },
        {
            "id": "1n43lzq",
            "url": "/r/nba/comments/1n43lzq/revealed_major_nba_brands_linked_to_forced_labor/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n43lzq/revealed_major_nba_brands_linked_to_forced_labor/",
            "title": "Revealed : Major NBA brands linked to forced labor in China",
            "content_html": "<p>Li-Ning , Anta and 361 Degrees all own facilities linked to Uyghur oppression – With Nike’s supply chain also tainted</p>\n<p>https://www.theguardian.com/sport/2025/aug/30/revealed-major-nba-brands-linked-to-forced-labor-in-china</p>",
            "date_published": "2025-08-30T14:53:11+00:00",
            "authors": [
                {
                    "name": "Shroft",
                    "url": "https://www.reddit.com/user/Shroft"
                }
            ]
        },
        {
            "id": "1n42i49",
            "url": "/r/nba/comments/1n42i49/dennis_schroder_lithuanian_fans_made_racist/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n42i49/dennis_schroder_lithuanian_fans_made_racist/",
            "title": "Dennis Schroder: Lithuanian fans made racist remarks against German players",
            "content_html": "<p>Germany’s star Dennis Schroder said Lithuanian fans directed racist remarks at German players during the game, including monkey noises, which led to an altercation in the arena corridor between players and staff members.</p>\n<p>During halftime of the EuroBasket 2025 game between Lithuania and Germany, a verbal altercation broke out in the arena corridor between players and staff members.</p>\n<p>https://basketnews.com/news-230334-dennis-schroder-lithuanian-fans-made-racist-remarks-against-german-players.html</p>",
            "date_published": "2025-08-30T14:07:09+00:00",
            "authors": [
                {
                    "name": "SernyRanders",
                    "url": "https://www.reddit.com/user/SernyRanders"
                }
            ]
        },
        {
            "id": "1n3giie",
            "url": "/r/nba/comments/1n3giie/lauri_markkanen_checks_out_of_the_game_against/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n3giie/lauri_markkanen_checks_out_of_the_game_against/",
            "title": "Lauri Markkanen checks out of the game against the United Kingdom with 43 points in 23 minutes with 80% True shooting",
            "content_html": "<p>Lauri is silently becoming one of the best players in international basketball ever. </p>\n<p>Somebody get this man in an actual Nba team with a decent point guard. </p>\n<p>Source: https://www.fiba.basketball/en/events/fiba-eurobasket-2025/games/123007-FIN-GBR#boxscore</p>",
            "date_published": "2025-08-29T19:16:43+00:00",
            "authors": [
                {
                    "name": "nuuskatonttu",
                    "url": "https://www.reddit.com/user/nuuskatonttu"
                }
            ]
        },
        {
            "id": "1n3co7b",
            "url": "/r/nba/comments/1n3co7b/jaylen_brown_got_clamped_by_a_principal_so_he/",
            "external_url": "https://streamable.com/qdzj48",
            "title": "Jaylen Brown got clamped by a principal, so he proceeded to dunk on him the next play",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 133.333%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/qdzj48\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-29T16:50:38+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1n39hqw",
            "url": "/r/nba/comments/1n39hqw/laker_legend_robert_horry_on_why_luka_will_never/",
            "external_url": "https://streamable.com/qva253",
            "title": "Laker legend Robert Horry on why Luka will never be a Top 5 player to him: \"No, Luka would never make that... I'm old school. You got to be able to play defense for me. I love Luka's game, but look at guys like MJ, Kobe, Olajuwon, Duncan, LeBron, Kareem. All these guys, to me, played on both ends\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/qva253\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-29T14:49:37+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1n2fuii",
            "url": "/r/nba/comments/1n2fuii/espn_replacing_doris_burke_with_tim_legler_on_nba/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n2fuii/espn_replacing_doris_burke_with_tim_legler_on_nba/",
            "title": "ESPN replacing Doris Burke with Tim Legler on NBA Finals broadcast team: Sources",
            "content_html": "<blockquote>\n<p>ABC/ESPN has demoted Hall of Famer Doris Burke from its NBA Finals team and promoted longtime network commentator, Tim Leger, to its No. 1 team, sources briefed on the decision told The Athletic.</p>\n<p>Legler will pair with longtime lead play-by-player Mike Breen and Richard Jefferson on The Finals. Jefferson recently agreed to a new contract with ESPN after working his first Finals in June. Burke was on the Finals’ team for two years, becoming the first woman in history to be an analyst on one of the traditional four major American sports (NBA, NFL, MLB and NHL).</p>\n<p>ESPN declined to comment.</p>\n<p>ESPN is discussing a contract extension with Burke, whose contract ends after this upcoming season. She could likely end up on ESPN’s No. 2 broadcast team.</p>\n</blockquote>\n<p>https://www.nytimes.com/athletic/6581644/2025/08/28/doris-burke-tim-legler-nba-finals-espn-broadcast/</p>",
            "date_published": "2025-08-28T15:45:57+00:00",
            "authors": [
                {
                    "name": "Knightbear49",
                    "url": "https://www.reddit.com/user/Knightbear49"
                }
            ]
        },
        {
            "id": "1n2fg0i",
            "url": "/r/nba/comments/1n2fg0i/kyrie_im_building_towards_becoming_1_of_the/",
            "external_url": "https://streamable.com/3nmrb8",
            "title": "Kyrie: \"I'm building towards becoming 1 of the biggest farmers ever, like I'm just going to put it out there: 1 of the biggest farmers ever. I wanna be able to supply food and groceries to the world in the best way I can and create small holistic wellness villages where people can retire\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/3nmrb8\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-28T15:30:45+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1n13gsp",
            "url": "/r/nba/comments/1n13gsp/tyrese_haliburton_gets_asked_about_his_haliban/",
            "external_url": "https://streamable.com/dkxzte",
            "title": "Tyrese Haliburton gets asked about his \"Haliban\" nickname: \"It's unfortunate... the Taliban is a terrible group of people and it's unfortunate that on social media it's become the thing, obviously I could never publicly acknowledge it or respond, people will come in my twitch chat and spam that\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/dkxzte\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-27T01:04:40+00:00",
            "authors": [
                {
                    "name": "A_MASSIVE_PERVERT",
                    "url": "https://www.reddit.com/user/A_MASSIVE_PERVERT"
                }
            ]
        },
        {
            "id": "1n0vsa8",
            "url": "/r/nba/comments/1n0vsa8/kawhi_when_i_shoot_the_ball_and_i_know_its_going/",
            "external_url": "https://streamable.com/gnagbz",
            "title": "Kawhi: When I shoot the ball and I know it's going in, I say, ‘Wet Ball\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 174.167%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/gnagbz\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-26T19:45:17+00:00",
            "authors": [
                {
                    "name": "Jimmy0034",
                    "url": "https://www.reddit.com/user/Jimmy0034"
                }
            ]
        },
        {
            "id": "1n0te0w",
            "url": "/r/nba/comments/1n0te0w/russell_westbrook_spotted_practicing_his_shot_on/",
            "external_url": "https://streamable.com/eivea9",
            "title": "Russell Westbrook spotted practicing his shot on a yacht",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 126.389%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/eivea9\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-26T18:13:19+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1n0krhi",
            "url": "/r/nba/comments/1n0krhi/phil_jackson_in_1995_scottie_is_such_an_unselfish/",
            "external_url": "https://streamable.com/zl2occ",
            "title": "Phil Jackson in 1995: \"Scottie is such an unselfish player; he's the greatest all-around player in the NBA right now... Now no one can score like Michael, and scoring is a wonderful thing to do, but it's not the end-all, end-all.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.69%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/zl2occ\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-26T12:41:38+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1n0iw9e",
            "url": "/r/nba/comments/1n0iw9e/michael_jordan_has_scored_at_least_25_points_in/",
            "external_url": "https://www.reddit.com/r/nba/comments/1n0iw9e/michael_jordan_has_scored_at_least_25_points_in/",
            "title": "Michael Jordan has scored at least 25 points in 73.6% of his career games, which is the highest rate in NBA history.",
            "content_html": "<p>Per @NBAcrazystats: </p>\n<p>Michael Jordan has scored at least 25 points in 73.6% of his career games, which is the highest rate in NBA history.</p>\n<p>(Excluding the Wizards' seasons, he had 25+ points in 78,8%)</p>\n<p>➖➖➖</p>",
            "date_published": "2025-08-26T11:10:23+00:00",
            "authors": [
                {
                    "name": "Successful_Archer_66",
                    "url": "https://www.reddit.com/user/Successful_Archer_66"
                }
            ]
        },
        {
            "id": "1mzq9tc",
            "url": "/r/nba/comments/1mzq9tc/rudy_gobert_touches_the_microphones_during_the/",
            "external_url": "https://streamable.com/x92qr9",
            "title": "Rudy Gobert touches the microphones during the Covid-19 pandemic, soon before testing positive for Covid-19",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/x92qr9\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-25T13:18:45+00:00",
            "authors": [
                {
                    "name": "Proof-Umpire-7718",
                    "url": "https://www.reddit.com/user/Proof-Umpire-7718"
                }
            ]
        },
        {
            "id": "1mzlwrq",
            "url": "/r/nba/comments/1mzlwrq/in_2014_dirk_nowitzki_was_offered_92_million/",
            "external_url": "https://www.reddit.com/r/nba/comments/1mzlwrq/in_2014_dirk_nowitzki_was_offered_92_million/",
            "title": "In 2014, Dirk Nowitzki was offered $92 million deals by both the Lakers and Rockets... He declined both offers and signed a 3-year, $25 million deal to stay in Dallas.",
            "content_html": "<p><a href=\"https://www.espn.com/dallas/nba/story/_/id/11219095/dirk-nowitzki-takes-larger-pay-cut-expected-dallas-mavericks-agrees-3-year-deal-worth-25-million\">https://www.espn.com/dallas/nba/story/_/id/11219095/dirk-nowitzki-takes-larger-pay-cut-expected-dallas-mavericks-agrees-3-year-deal-worth-25-million</a></p>",
            "date_published": "2025-08-25T09:34:33+00:00",
            "authors": [
                {
                    "name": "xSmoothx",
                    "url": "https://www.reddit.com/user/xSmoothx"
                }
            ]
        },
        {
            "id": "1mz4ueu",
            "url": "/r/nba/comments/1mz4ueu/dennis_rodman_on_the_goat_debate_michael_jordan/",
            "external_url": "https://streamable.com/fuyyvj",
            "title": "Dennis Rodman on the GOAT debate: “Michael Jordan & LeBron at their prime: Michael Jordan was too sexy; when he had the bald head. LeBron’s like goddamn fucking dump truck.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fuyyvj\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-24T19:23:34+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1myxo5x",
            "url": "/r/nba/comments/1myxo5x/marques_haynes_handles_from_the_1940s_in_48_he/",
            "external_url": "https://streamable.com/9ko945",
            "title": "Marques Haynes handles from the 1940s: In ‘48, he led the Globetrotters to an upset win over all-white champion Minneapolis Lakers (led by George Mikan), forcing the league towards integration. He was later offered the second biggest contract in the NBA behind Mikan, but turned it down to barnstorm",
            "content_html": "<p>Haynes was offered 35k per year by the Philadelphia Warriors, which is roughly about the equivalent of 470k today. Obviously, things have changed</p>\n<p>Here are some clips of Haynes clowning the Lakers while beating them in 48 https://m.youtube.com/watch?v=-wJxY2RkLwY</p><div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/9ko945\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-24T14:53:34+00:00",
            "authors": [
                {
                    "name": "Pickleskennedy1",
                    "url": "https://www.reddit.com/user/Pickleskennedy1"
                }
            ]
        },
        {
            "id": "1mylc0r",
            "url": "/r/nba/comments/1mylc0r/fresh_grad_roasts_nico_harrison_in_her/",
            "external_url": "https://streamable.com/lfw9fc",
            "title": "Fresh grad roasts Nico Harrison in her commencement speech: “It wasn’t all fond memories. After Christmas came the worst day of the year, February 1st. Around midnight, news spread that the Mavericks had inexplicably traded Luka Dončić. Everyone blamed Nico Harrison, who’s somehow still employed.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 89.164%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/lfw9fc\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-24T03:38:03+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1mxqz0u",
            "url": "/r/nba/comments/1mxqz0u/a_kid_is_going_viral_on_tiktok_for_naming_every/",
            "external_url": "https://streamable.com/w78doc",
            "title": "A Kid is going viral on Tiktok for naming every NBA Finals MVP since 1969",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/w78doc\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-23T03:34:56+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1mxo697",
            "url": "/r/nba/comments/1mxo697/shaq_on_pat_riley_he_wanted_to_kick_me_out_of/",
            "external_url": "https://streamable.com/y8fzz1",
            "title": "Shaq on Pat Riley: “He wanted to kick me out of practice… I told him ‘Make me leave then’… I got traded the next day.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 65.556%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/y8fzz1\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-23T01:13:21+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1mx8tw1",
            "url": "/r/nba/comments/1mx8tw1/wayne_rooney_us_olympic_basketball_team_came_into/",
            "external_url": "https://streamable.com/3x0fhd",
            "title": "Wayne Rooney: \"U.S. Olympic basketball team came into this bar where we was... I went over to say hello (to LeBron), and the security went: 'Please step away from the table sir.' So I was like, 'It's OK'. So I went to the toilet so I come back and he (LeBron) sees me and shouts me over.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/3x0fhd\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-22T14:59:20+00:00",
            "authors": [
                {
                    "name": "aingenevalostatrade",
                    "url": "https://www.reddit.com/user/aingenevalostatrade"
                }
            ]
        },
        {
            "id": "1mwi3bg",
            "url": "/r/nba/comments/1mwi3bg/michael_porter_jr_says_nikola_jokić_texted_him/",
            "external_url": "https://streamable.com/cry7qp",
            "title": "[Michael Porter Jr.] says Nikola Jokić texted him, “Make sure you wear condom out there,” after his trade to Brooklyn",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/cry7qp\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-21T17:51:16+00:00",
            "authors": [
                {
                    "name": "AashyLarry",
                    "url": "https://www.reddit.com/user/AashyLarry"
                }
            ]
        },
        {
            "id": "1mwerc2",
            "url": "/r/nba/comments/1mwerc2/jaylen_browns_dad_arrested_for_attempted_murder/",
            "external_url": "https://www.reddit.com/r/nba/comments/1mwerc2/jaylen_browns_dad_arrested_for_attempted_murder/",
            "title": "Jaylen Brown's Dad Arrested For Attempted Murder ... After Apparent Parking Lot Dispute",
            "content_html": "<blockquote>\n<p>Boston Celtics superstar Jaylen Brown's dad -- former boxer Marselles Brown -- was arrested for attempted murder after allegedly stabbing a youth football coach in a dispute over a parking spot, TMZ Sports has learned.</p>\n<p>Las Vegas Metro Police is investigating a stabbing that went down at All American Park on Wednesday ... stating two men were in a verbal altercation over a parking space when the suspect stabbed the victim in the stomach.</p>\n<p>Officials say the suspect fled the scene ... but he was tracked down later and taken into custody. Brown has a court appearance scheduled for Thursday afternoon.</p>\n<p>The coach was rushed to a nearby hospital and required surgery. His condition is unknown.</p>\n</blockquote>\n<p>https://www.tmz.com/2025/08/21/jaylen-brown-dad-arrested-attempted-murder-parking-spot-dispute/</p>",
            "date_published": "2025-08-21T15:49:56+00:00",
            "authors": [
                {
                    "name": "Turbostrider27",
                    "url": "https://www.reddit.com/user/Turbostrider27"
                }
            ]
        },
        {
            "id": "1mwchwv",
            "url": "/r/nba/comments/1mwchwv/stern_dennis_schröder_i_know_its_a_great_honor/",
            "external_url": "https://www.reddit.com/r/nba/comments/1mwchwv/stern_dennis_schröder_i_know_its_a_great_honor/",
            "title": "[Stern] Dennis Schröder: \"I know: It's a great honor, but it will never be the same for me as it was for Dirk. I won't receive the same love in this country (Germany) because I'm dark-skinned.\"\"",
            "content_html": "<p>Translated from German</p>\n<p>Dennis Schröder has an ambivalent relationship with his hometown. Nevertheless, it's clear where he'll live after his time in the NBA.</p>\n<p>Dirk Nowitzki and Dennis Schröder have one thing in common: They both carried the German flag at the Olympic Games. Yet Schröder sees a big difference:</p>\n<p>\"I was already sitting in front of the TV at the age of 14 when Dirk Nowitzki carried the flag at the 2008 Summer Games in Beijing. Back then, I thought: How cool, there can't be a greater appreciation,\" said the current captain of the national basketball team in an interview with \"Stern.\" \"Today, however, I know: It's a great honor, but it will never be the same for me as it was for Dirk. I won't receive the same love in this country because I'm dark-skinned.\"</p>\n<p>German expectations</p>\n<p>Germans have certain ideas about how stars should behave. He never fit into that image, especially when he was younger, as he occasionally indulged in expensive watches and luxury cars. \"I've made mistakes, I'm not perfect. Nevertheless, it's wrong to judge someone you don't know well,\" Schröder said.</p>\n<p>\"This is a societal problem, and social media only exacerbates this superficiality and hatred,\" said the 31-year-old. \"The fact that I was allowed to be a flag-bearer doesn't make this story any better.\"</p>\n<p>Return to Braunschweig</p>\n<p>Despite these negative experiences, Schröder intends to return to his hometown of Braunschweig after his time in the NBA . \"Braunschweig is my home; I'm needed here. That's why I bought the basketball club there, and that's why we're planning academies, camps, and schools for young people there,\" said Schröder. \"Many professionals stay in the US after their playing careers and enjoy their fame. But I belong in Germany.\"</p>\n<p>First up for Schröder, however, is the European Championship in Finland and Latvia, which begins on August 27th, and then the next NBA season with his new club, the Sacramento Kings. The point guard has clear expectations for the European Championship. \"We will win the title. If I wasn't convinced of that, I wouldn't play in the tournament and would rather spend my time in Braunschweig.\"</p>\n<p>Source: https://www.stern.de/gesellschaft/regional/niedersachsen-bremen/vor-der-basketball-em--schroeder--werde-nie-gleiche-liebe-wie-nowitzki-bekommen-35986550.html</p>",
            "date_published": "2025-08-21T14:28:49+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1mw9bqo",
            "url": "/r/nba/comments/1mw9bqo/highlight_hakeem_olajuwon_drains_a_beautiful/",
            "external_url": "https://streamable.com/fo18vp",
            "title": "[Highlight] Hakeem Olajuwon drains a beautiful fadeaway over Shaq (1995, NBA Finals).",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fo18vp\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-21T12:18:15+00:00",
            "authors": [
                {
                    "name": "ToronoRapture",
                    "url": "https://www.reddit.com/user/ToronoRapture"
                }
            ]
        },
        {
            "id": "1mvih23",
            "url": "/r/nba/comments/1mvih23/klay_thompson_reveals_that_megan_thee_stallions/",
            "external_url": "https://streamable.com/1v54f7",
            "title": "Klay Thompson reveals that Megan Thee Stallion's catfish and spaghetti is his new favorite meal",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/1v54f7\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-20T15:46:35+00:00",
            "authors": [
                {
                    "name": "Alternatively_Built_",
                    "url": "https://www.reddit.com/user/Alternatively_Built_"
                }
            ]
        },
        {
            "id": "1mvhmss",
            "url": "/r/nba/comments/1mvhmss/manu_ginóbili_scores_29_points_on_88_ts_to_lead/",
            "external_url": "https://streamable.com/5mf1xx",
            "title": "Manu Ginóbili scores 29 points on 88 TS% to lead Argentina to victory over USA en route to gold in the 2004 Olympics",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/5mf1xx\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-20T15:16:03+00:00",
            "authors": [
                {
                    "name": "Alternatively_Built_",
                    "url": "https://www.reddit.com/user/Alternatively_Built_"
                }
            ]
        },
        {
            "id": "1mvbo73",
            "url": "/r/nba/comments/1mvbo73/shaq_confirmed_that_he_will_walk_dwight_howard/",
            "external_url": "https://streamable.com/cugdhn",
            "title": "Shaq confirmed that he will walk Dwight Howard out for his Hall of Fame induction",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 125.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/cugdhn\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-20T11:03:48+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1mul52f",
            "url": "/r/nba/comments/1mul52f/charania_after_11_seasons_john_wall_says_he_has/",
            "external_url": "https://www.reddit.com/r/nba/comments/1mul52f/charania_after_11_seasons_john_wall_says_he_has/",
            "title": "[Charania] After 11 seasons, John Wall says he has retired from basketball. Wall, a five-time NBA All-Star out of Kentucky, played for the Washington Wizards, Los Angeles Clippers and Houston Rockets.",
            "content_html": "<p>[Charania] After 11 seasons, John Wall says he has retired from basketball. Wall, a five-time NBA All-Star out of Kentucky, played for the Washington Wizards, Los Angeles Clippers and Houston Rockets.</p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lwr6z7lh4j27</p>",
            "date_published": "2025-08-19T15:09:26+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1mujhx6",
            "url": "/r/nba/comments/1mujhx6/stein_breaking_pacers_coach_rick_carlisle_has/",
            "external_url": "https://www.reddit.com/r/nba/comments/1mujhx6/stein_breaking_pacers_coach_rick_carlisle_has/",
            "title": "[Stein] BREAKING: Pacers coach Rick Carlisle has agreed to a multiyear extension after coaching Indiana to last season’s NBA finals.",
            "content_html": "<p>Source: https://open.substack.com/pub/marcstein/p/the-official-2025-nba-all-lefty-team?r=nuq3a&amp;utm_medium=ios</p>\n<blockquote>\n<p>BREAKING: Pacers coach Rick Carlisle has agreed to a multiyear extension after coaching Indiana to last season’s NBA finals.</p>\n</blockquote>",
            "date_published": "2025-08-19T14:09:05+00:00",
            "authors": [
                {
                    "name": "YujiDomainExpansion",
                    "url": "https://www.reddit.com/user/YujiDomainExpansion"
                }
            ]
        },
        {
            "id": "1mui02v",
            "url": "/r/nba/comments/1mui02v/cartoon_network_nba_all_star_slam_2004/",
            "external_url": "https://streamable.com/6xn8wz",
            "title": "Cartoon Network NBA All Star Slam 2004",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 75.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/6xn8wz\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-19T13:10:29+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1mtpv5t",
            "url": "/r/nba/comments/1mtpv5t/shaq_with_one_of_the_most_disrespectful_moves_ever/",
            "external_url": "https://streamable.com/ehvknr",
            "title": "Shaq with one of the most disrespectful moves ever",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/ehvknr\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-18T15:51:04+00:00",
            "authors": [
                {
                    "name": "FastBreakPhenom",
                    "url": "https://www.reddit.com/user/FastBreakPhenom"
                }
            ]
        },
        {
            "id": "1msz36o",
            "url": "/r/nba/comments/1msz36o/a_commercial_featuring_a_young_damian_lillard/",
            "external_url": "https://streamable.com/9kakxy",
            "title": "A commercial featuring a young Damian Lillard poking fun at players who never won a championship ring.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.632%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/9kakxy\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-17T18:48:28+00:00",
            "authors": [
                {
                    "name": "must_TATAKAE",
                    "url": "https://www.reddit.com/user/must_TATAKAE"
                }
            ]
        },
        {
            "id": "1msww45",
            "url": "/r/nba/comments/1msww45/bleacher_report_tmz_sports_reported_that_the_fbi/",
            "external_url": "https://www.reddit.com/r/nba/comments/1msww45/bleacher_report_tmz_sports_reported_that_the_fbi/",
            "title": "[Bleacher Report] TMZ Sports reported that the FBI released a heavily-redacted 17-page document detailing a 2003 plot in which a Swiss bodybuilder offered Kobe Bryant $3M to silence accuser",
            "content_html": "<blockquote>\n<p>Bodybuilder Patrick Graber sent a letter via FedEx to Los Angeles Lakers guard Kobe Bryant in 2003 offering to k**l the woman who accused Bryant of sexual assault if he paid Graber $3,000,000. </p>\n<p>TMZ Sports reported that the FBI released a heavily-redacted 17-page document earlier this month detailing the case. They also noted that Bryant's team immediately contacted authorities after receiving the letter.</p>\n<p>Per Scott Schwebke of the Orange County Register, an undercover Los Angeles County detective spoke twice with Graber, who admitted to the murder-for-hire scheme and said he would \"execute Bryant’s accuser leaving no evidence.\"</p>\n<p>In the meantime, officials also traveled to the woman's residence in Colorado to make her aware of the threat.</p>\n<p>Los Angeles County sheriff’s deputies and FBI agents arrested Graber on Sept. 18, 2003 as part of a setup to collect the first $1 million, according to Schwebke.</p>\n<p>The bodybuilder reached into a car for a bag of movie studio prop money before 30 officers surrounded him in an El Segundo, California supermarket parking lot and arrested him.</p>\n<p>The Swiss national, who was 31 years old when he sent the letter, pleaded no contest to grand theft in 2004, per Schwebke. Prosecutors dropped other charges, including solicitation to commit murder.</p>\n<p>Graber was sentenced to three years in prison, and he was ordered to be deported upon his release.</p>\n<p>Bryant was arrested in 2003 after a 19-year-old woman said he raped her at the Vail, Colorado, hotel where the Lakers star was staying prior to a scheduled knee surgery. He said the sexual encounter with the woman, who worked at the hotel, was consensual.</p>\n</blockquote>\n<p>The criminal case was dropped after the woman decided not to testify. She and Bryant later settled out of court in a civil suit she filed against him.</p>\n<p><a href=\"https://bleacherreport.com/articles/10012061-patrick-graber-allegedly-offered-to-kill-kobe-bryants-rape-accuser-for-3m-in-2003\">Article</a></p>",
            "date_published": "2025-08-17T17:25:33+00:00",
            "authors": [
                {
                    "name": "National-Fold-2375",
                    "url": "https://www.reddit.com/user/National-Fold-2375"
                }
            ]
        },
        {
            "id": "1msshvl",
            "url": "/r/nba/comments/1msshvl/jokic_acrobatic_dunk_in_warmups_before_the/",
            "external_url": "https://streamable.com/6n2l7f",
            "title": "Jokic acrobatic dunk in warm-ups before the Serbia-Germany game",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/6n2l7f\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-17T14:34:07+00:00",
            "authors": [
                {
                    "name": "JakGrealish",
                    "url": "https://www.reddit.com/user/JakGrealish"
                }
            ]
        },
        {
            "id": "1msb8jv",
            "url": "/r/nba/comments/1msb8jv/mo_bamba_talks_about_his_friend_roasting_him/",
            "external_url": "https://streamable.com/s20ge0",
            "title": "Mo Bamba talks about his friend roasting him after the Utah Jazz waived him: \"This n***a is an asshole... he sent me an unemployment link bro.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 55.982%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/s20ge0\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-16T23:23:06+00:00",
            "authors": [
                {
                    "name": "kurruchi",
                    "url": "https://www.reddit.com/user/kurruchi"
                }
            ]
        },
        {
            "id": "1mrz0sp",
            "url": "/r/nba/comments/1mrz0sp/giannis_antetokounmpo_delivers_a_hard_slap_to_the/",
            "external_url": "https://streamable.com/wp1xth",
            "title": "Giannis Antetokounmpo delivers a hard slap to the back of his Greek teammate's head",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/wp1xth\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-16T15:49:01+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1mrxbtn",
            "url": "/r/nba/comments/1mrxbtn/sga_signs_429_autographs_before_game_2_of_the_nba/",
            "external_url": "https://streamable.com/3bcmke",
            "title": "SGA signs 429 autographs before Game 2 of the NBA finals. A real appreciation for the fans.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/3bcmke\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-16T14:47:05+00:00",
            "authors": [
                {
                    "name": "Naweezy",
                    "url": "https://www.reddit.com/user/Naweezy"
                }
            ]
        },
        {
            "id": "1mrfte2",
            "url": "/r/nba/comments/1mrfte2/tim_duncan_certified_menace_to_society_gets/",
            "external_url": "https://streamable.com/b6frdf",
            "title": "Tim Duncan, certified menace to society, gets ejected for laughing",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 75.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/b6frdf\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-16T00:43:35+00:00",
            "authors": [
                {
                    "name": "Classic-Carpet7609",
                    "url": "https://www.reddit.com/user/Classic-Carpet7609"
                }
            ]
        },
        {
            "id": "1mqz3wj",
            "url": "/r/nba/comments/1mqz3wj/denzel_on_sports_media_we_live_in_a_world_of/",
            "external_url": "https://streamable.com/3mluke",
            "title": "Denzel on sports media: “We live in a world of opinionaires. Sitting around getting fat, thinking they know how to do it. Just coz you sit at a desk & chit-chat doesn't mean you can do a damn thing. Skinny kid who never played a day in his life & now he can get back at everybody coz he's got a mic.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/3mluke\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-15T14:15:58+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1mq9ybq",
            "url": "/r/nba/comments/1mq9ybq/denzel_washington_rips_the_talking_heads_of/",
            "external_url": "https://streamable.com/rv4lhs",
            "title": "Denzel Washington rips the talking heads of sports media- \"All the shows are a bunch of guys who haven't played.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/rv4lhs\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-08-14T19:06:33+00:00",
            "authors": [
                {
                    "name": "dman6233",
                    "url": "https://www.reddit.com/user/dman6233"
                }
            ]
        }
    ]
}