{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nba",
    "home_page_url": "https://jonathanlaniado.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nba.json",
    "items": [
        {
            "id": "omxw1c",
            "url": "https://www.reddit.com/r/nba/comments/omxw1c/the_buck_have_won_as_many_games_this_postseason/",
            "title": "The Buck have won as many games this postseason as they did their first year with Giannis & Khris",
            "content_text": "That season was their 2013-14 season, and the team was coached by Larry Drew.  \n\nThe owner of the Bucks was Herb Kohl.\n\nWe played in the Bradley Center.\n\nTickets were $7 to a game.\n\nBrandon Knight led the team in scoring.\n\nAnd the Bucks were 15-67, with two promising young pickups in Giannis Antetokounmpo and Khris Middleton.\n\nEdit: formatting",
            "authors": [
                "The_Sign_of_Zeta"
            ]
        },
        {
            "id": "omyhqn",
            "url": "https://www.reddit.com/r/nba/comments/omyhqn/wsj_steve_kerr_on_ted_lasso_if_there_is_a_lesson/",
            "title": "[WSJ] Steve Kerr on “Ted Lasso”: “If there is a lesson on the show, it is that culture beats scheme.”",
            "content_text": "[Source](https://www.wsj.com/articles/ted-lasso-nba-coaches-11626232223)\n\n>Utah Jazz coach Quin Snyder needed some help dealing with a tricky situation at work not long ago. He took advice from one of his favorite television shows. \n\n>“I don’t know if you watch ‘Ted Lasso,’ ” he said. “But sometimes your favorite animal is a goldfish because it has a memory of 10 seconds. That’s where we need to be.” \n\n\n>There was something curious about one of the NBA’s brightest minds borrowing a Ted Lasso pep talk. He could have leaned on decades of experience to get his basketball team past a stressful moment in the playoffs. He decided to invoke the folksy wisdom of a fictional American football coach managing an English soccer club. \n\n>It turns out he’s not the only person in professional sports channeling his inner Ted Lasso these days.\n\n>“It should be required watching for coaches,” Snyder said. \n\n&nbsp;\n\n>The model for modern coaches evolving from Lombardi to Lasso is a reflection of the shifting power dynamics in sports and how much has changed in management strategies over the past decade. Not every coach is relentlessly cheerful or comes to the office with freshly baked cookies for his boss. But it’s hard to look around the business world and not see hints of Jason Sudeikis’s character. \n\n>“I think it used to be an accepted leadership tactic to essentially abuse people,” said Brendan Hunt, one of the show’s creators and writers who also plays Coach Beard, Lasso’s sidekick. “I’m sure there are people who are, like, Now we’re soft. We’re not soft. We’re just not morons. We see better ways to get the best out of people. Humiliating them in front of their peers is probably not high on the list.” \n\n>Tyranny is out. Empathy is in. Coaches are getting the most of players by relating to them, not dictating to them, while keeping them accountable without coddling them. They are behaving more like Ted Lasso. \n\n>There is a takeaway from the series, now in its second season on Apple TV+, that applies to any line of work: The best coaches are the best managers of people.\n\n>It doesn’t matter that Lasso doesn’t know anything about the sport. What happens on the pitch is the least demanding part of his job. He soothes the neuroses of his star players. He injects his role players with confidence. He uses his superpower of emotional intelligence to balance competing personalities, foster an environment where everyone is capable of good work and build the culture of a team initially resistant to his charms. \n\n&nbsp;\n\n>The show found an early supporter in someone else who believes that winning should be fun, Golden State Warriors coach Steve Kerr, who tweeted his praise for the series when most people were ready to dismiss it. He also has another reason to be a fan: One of his children happens to work at “Ted Lasso.”\n\n>“If there is a lesson on the show, it is that culture beats scheme,” Kerr said in an email. “The guy knows nothing about soccer but he has created a great atmosphere with the club that leads to winning.” \n\n>Chris Paul was binging the show between film sessions as the overachieving Phoenix Suns made the NBA Finals. Meanwhile his coach sounded like he was interviewing for Lasso’s staff as he discussed the bond he’s developed with his players. “When they make fun of me,” Monty Williams said, “that’s a sign that we’re tight.” \n\nI'm glad to see Ted has fans in the NBA",
            "authors": [
                "GuyCarbonneauGOAT"
            ]
        },
        {
            "id": "omyt3n",
            "url": "https://sixerswire.usatoday.com/2021/07/16/bradley-beal-wizards-exposed-sixers-star-ben-simmons-poor-foul-shooting/",
            "title": "Beal says Wizards exposed Ben Simmons: “We kind of exposed the move of fouling Ben putting him on the line a few times. Granted, I think in our series he actually made a few...Ben was more or less aggressive in our series, the first couple games, and then it kind of died down and trickled down.”",
            "content_text": "",
            "authors": [
                "efranklin13"
            ]
        }
    ]
}