{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nba",
    "description": "A subreddit dedicated to NBA news and discussion.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nba.json",
    "icon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "favicon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "items": [
        {
            "id": "1lsalnm",
            "url": "/r/nba/comments/1lsalnm/afseth_donnie_nelson_on_luka_trade_during_my/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lsalnm/afseth_donnie_nelson_on_luka_trade_during_my/",
            "title": "[Afseth] Donnie Nelson on Luka trade “During my years in Dallas, we always considered what was important to that community, And we looked at the players being a part of that. It was never like we went to one of our ATMs, took out a player, used him until he was most useful, and then threw him away”",
            "content_html": "<p>Source: https://dallashoopsjournal.com/p/donnie-nelson-dirk-nowitzki-luka-doncic-dallas-mavericks-comparison/</p>\n<p>Donnie Nelson, the former longtime Dallas Mavericks executive who helped build the team around Dirk Nowitzki and Luka Dončić, believes the two franchise icons should have been treated the same, and weren’t.</p>\n<p><strong>In an exclusive interview with Ekipa 24, Nelson reflected on the organization’s legacy of loyalty with Nowitzki and expressed disappointment over how Dončić’s time in Dallas ended with a February 2025 trade to the Los Angeles Lakers.</strong></p>\n<p><strong>“We were with Dirk Nowitzki for 21 years, and the last three years were out of pure respect,” Nelson told Ekipa 24. “People like that deserve to say goodbye on their own terms and according to their wishes, and everyone deserves a decent funeral – figurative or literal.”</strong></p>\n<p>Nelson said the Mavericks used to operate with a community-first mindset — valuing long-term relationships, loyalty, and the cultural significance of a star’s connection to the city.</p>\n<p>“During my years in Dallas, we always considered what was important to that community,” Nelson said. “And we looked at the players being a part of that. It was never like we went to one of our ATMs, took out a player, used him until he was most useful, and then threw him away.”</p>\n<p>While Nowitzki was celebrated with a farewell tour and ultimately had a statue erected outside American Airlines Center, Dončić — who became the face of the franchise and an international superstar under Nelson’s leadership — was traded at age 25 in the prime of his career.</p>\n<p><strong>“Of course, this is the NBA, and trades can happen; players come and go,” Nelson said. “But with all due respect, you have to understand that some players are different, special, and even more important to the environment and the community. It’s important to treat those players with respect.”</strong></p>\n<p>Nelson didn’t directly criticize the front office but clarified that Dončić’s exit didn’t reflect the values that had defined the Mavericks during his tenure.</p>\n<p><strong>“That’s why there was so much disappointment after what happened to Luka,” he said. “Not just my disappointment, but a universal disappointment. Could this happen to Real [Madrid]? Never. And it wouldn’t have happened when I was in Dallas.”</strong></p>\n<p>Nelson served as the Mavericks’ general manager and president of basketball operations during Nowitzki’s entire career and was the driving force behind the trade that brought Dončić to Dallas in 2018. He parted ways with the organization in 2021 but has publicly supported both players.</p>\n<p>Dončić is now focused on the Lakers for the next chapter of his career. At the same time, Nelson has re-entered the international basketball world as a strategic advisor for the Slovenian national team ahead of EuroBasket 2025.</p>\n<p>“These things — the relationships, the values — they last forever,” Nelson said.</p>",
            "date_published": "2025-07-05T14:03:08+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1lrmtjx",
            "url": "/r/nba/comments/1lrmtjx/lebron_james_tries_golf_for_the_second_time_as_he/",
            "external_url": "https://streamable.com/1vcqjk",
            "title": "LeBron James tries golf for the second time, as he posted these videos on Instagram",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 133.333%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/1vcqjk\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-07-04T16:21:59+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1lr6mlv",
            "url": "/r/nba/comments/1lr6mlv/espn_good_news_basketball_fans_red_panda_intends/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lr6mlv/espn_good_news_basketball_fans_red_panda_intends/",
            "title": "[ESPN] Good news, basketball fans: Red Panda intends to be ready for next season. Red Panda's recovery should take a few months, her agency said the day after she fell off her unicycle and crashed to the court during halftime of the WNBA Commissioner's Cup final.",
            "content_html": "<p>Good news, basketball fans: Red Panda intends to be ready for next season.</p>\n<p>Red Panda, the popular performer who fell off her unicycle and crashed to the court during halftime of the WNBA Commissioner's Cup final between the Indiana Fever and Minnesota Lynx on Tuesday, has a broken left wrist and will need further consultation with an orthopedic surgeon, the agency that represents her said Wednesday</p>\n<p>https://www.espn.com/wnba/story/_/id/45649875/red-panda-broken-wrist-hospital-fall</p>",
            "date_published": "2025-07-04T01:37:47+00:00",
            "authors": [
                {
                    "name": "urfaselol",
                    "url": "https://www.reddit.com/user/urfaselol"
                }
            ]
        },
        {
            "id": "1lqs8tq",
            "url": "/r/nba/comments/1lqs8tq/magic_johnson_shows_off_his_massive_yacht_whilst/",
            "external_url": "https://streamable.com/3ga6iq",
            "title": "Magic Johnson shows off his massive yacht whilst on vacation.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/3ga6iq\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-07-03T15:18:50+00:00",
            "authors": [
                {
                    "name": "ToronoRapture",
                    "url": "https://www.reddit.com/user/ToronoRapture"
                }
            ]
        },
        {
            "id": "1lqpz96",
            "url": "/r/nba/comments/1lqpz96/dua_that_is_the_worst_draft_trade_i_have_seen_in/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lqpz96/dua_that_is_the_worst_draft_trade_i_have_seen_in/",
            "title": "[Dua] “That is the worst draft trade I have seen in over a decade,” one Exec lamented. “They should all be fired next year when that becomes a top 5 pick,”  ”Man they were killing them up there,” one agent told me “They think the Pelicans got F—in idiots in charge. It got so bad, I just felt sorry.”",
            "content_html": "<p>Source: https://intheno.substack.com/p/queens-gambit-inside-the-pelicans</p>\n<p>Interesting article on the disastrous Pelicans Front Office:</p>\n<p>From that moment on, text after text rolled in from league execs, agents, and friends. The friends were simply conducting a wellness check. The execs and agents? They were less friendly.</p>\n<p>”That is the worst draft trade I have seen in over a decade,” one Eastern Conference executive lamented.</p>\n<p>“They should all be fired next year when that becomes a top 5 pick,” relayed another.</p>\n<p>One after another— it was a ruthless bombardment. ”Are they not aware of how good that pick is gonna be?” This line of questioning from one high level executive left me searching for answers across the next few days. Here is what I was able to dig up.</p>\n<p>The League Does Not Respect Pelicans’ Decision Makers:</p>\n<p>The league wide skepticism on the Pelicans started when Joe Dumars was named the head of basketball operations and only grew when Troy Weaver was brought into the fold. When the Pelicans traveled up to Chicago for the NBA Draft Combine a month prior, the league had already placed a target on their back.</p>\n<p>”Man they were killing them up there,” one agent told me, referring to rival front offices. “They think they (the Pelicans) got F—in idiots in charge. It got so bad, I just felt sorry.” Teams were already jockeying for the privilege to conduct the first trade with the Pelicans as more than one executive jokingly expressed to me that the Pelicans are going to be their first call.</p>\n<p>It was the Indiana Pacers that ended up gaining the privilege of being first. When the Pelicans traded the lightly protected 2026 pick from the Pacers for the rights to pick 23 in this draft, rival executives raised their eyebrows. What was the rush to conduct this move while the Pacers were still in the finals? Just hours after Shams broke the trade, the Pacers announced Haliburton has been diagnosed with a calf strain. The optics pointed to a team that had been duped.</p>\n<p>Haliburton would go on to tear his Achilles tendon just a few days later, lending credibility to criticisms being levied by rival teams regarding the Pelicans’ decision making. The trade should have been executed after the finals. There was no reason the same deal would not have been on the table. The miscalculation was not a grave one, but it was one big enough to reinforce the priors for other teams— the Pelicans are a mark and do not understand risk.</p>\n<p>Sure enough, the league’s collective belief on the Pelicans’ lack of risk assessment would be proven true. The Pelicans would trade the unprotected 2026 draft pick which was the better of their own and Milwaukee to move up 10 spots in the draft— to draft a player Troy Weaver was fixated on in Derik Queen. In totality, the Pelicans traded away three shots at top 10 pick for the 13th overall pick. All three shots featured a team with a starting point guard who had suffered a torn Achilles.</p>\n<p>One league executive would tell me their internal models valued the traded pick as having the second highest probability for becoming number one overall next season. Suffice to say— the league was stunned, and so was Atlanta.</p>\n<p>The Hawks could not believe their good fortune. While the Pelicans would spend the next 24 hours facing enormous backlash for their reckless decision making, Hawks executives weren’t shy about sharing the details behind deal’s lopsided structure with rival teams.</p>\n<p>One Eastern executive with knowledge of how the conversation went from Atlanta’s perspective described a perplexing scene. When Senior Vice President Troy Weaver made the call to Atlanta’s Bryson Graham, Graham couldn’t believe what was actually being offered. Graham asked for clarification multiple times to confirm the unprotected pick was indeed part of the deal. It got to the point where Hawks General Manager, Onsi Saleh, called Joe Dumars directly to confirm for himself. The Hawks waited nervously for Dumars to confirm, hoping he would not realize what was going on and walk the trade back. But the Pelicans persisted and the Hawks got their steal.</p>",
            "date_published": "2025-07-03T13:44:51+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1lq83fe",
            "url": "/r/nba/comments/1lq83fe/charania_breaking_deandre_ayton_has_agreed_to/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lq83fe/charania_breaking_deandre_ayton_has_agreed_to/",
            "title": "[Charania] BREAKING: Deandre Ayton has agreed to sign with the Los Angeles Lakers, sources tell ESPN. Between Portland and L.A., Ayton will earn $34 million next season. Agents Nima Namakian of Innovate Sports and Bill Duffy of WME Sports reached the deal with Lakers president Rob Pelinka.",
            "content_html": "<blockquote>\n<p>BREAKING: Deandre Ayton has agreed to sign with the Los Angeles Lakers, sources tell ESPN. Between Portland and L.A., Ayton will earn $34 million next season. Agents Nima Namakian of Innovate Sports and Bill Duffy of WME Sports reached the deal with Lakers president Rob Pelinka.</p>\n<p>The Lakers find their starting center in Ayton, the 2018 No. 1 overall pick who is the only player in NBA history to average 15+ points and 60%+ shooting in the postseason. He has career averages of 16.4 points and 10.5 rebounds on 59% shooting over the last seven seasons.</p>\n<p>Ayton will sign a two-year deal with the Lakers, with a player option, sources tell ESPN.</p>\n</blockquote>\n<p><a href=\"https://www.espn.com/contributor/shams-charania/501947c8bec83\">Source</a></p>",
            "date_published": "2025-07-02T21:37:04+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1lq1ef5",
            "url": "/r/nba/comments/1lq1ef5/charania_breaking_the_new_york_knicks_are/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lq1ef5/charania_breaking_the_new_york_knicks_are/",
            "title": "[Charania] BREAKING: The New York Knicks are expected to land on two-time NBA Coach of the Year Mike Brown as the franchise's next head coach, sources tell ESPN.",
            "content_html": "<p>[Charania] BREAKING: The New York Knicks are expected to land on two-time NBA Coach of the Year Mike Brown as the franchise's next head coach, sources tell ESPN.</p>\n<p>Update: Knicks president Leon Rose underwent a thorough process since the firing of Tom Thibdoeau a month ago. The Knicks requested permission for five NBA head coaches and were denied, then interviewed several available coaches and went through multi-round stages with candidates.</p>\n<p>Update 2: Brown is a four-time champion as a top assistant in Golden State and San Antonio under Steve Kerr and Gregg Popovich and has coached an array of superstars across three decades coaching in the NBA. Most recently in 2022-23, Brown's Kings had the best-rated offense in the NBA.</p>\n<p>Source: </p>\n<p>1) https://www.espn.com/contributor/shams-charania/e590d79302d48 and https://bsky.app/profile/shamsbot.bsky.social/post/3lsypaxzuks2d</p>\n<p>2) https://bsky.app/profile/shamsbot.bsky.social/post/3lsypbucgu22d</p>\n<p>3) https://bsky.app/profile/shamsbot.bsky.social/post/3lsypclcvb22d</p>",
            "date_published": "2025-07-02T17:08:14+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lpis6r",
            "url": "/r/nba/comments/1lpis6r/injury_red_panda_fell_off_her_unicycle_during_the/",
            "external_url": "https://streamable.com/iw7cg2",
            "title": "[Injury] Red Panda fell off her unicycle during the WNBA Commissioner's Cup final. She is being attended by medical personnel after being wheeled off the court.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/iw7cg2\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-07-02T01:03:03+00:00",
            "authors": [
                {
                    "name": "StalkingDwarf",
                    "url": "https://www.reddit.com/user/StalkingDwarf"
                }
            ]
        },
        {
            "id": "1lp4cko",
            "url": "/r/nba/comments/1lp4cko/charania_just_in_the_milwaukee_bucks_are_waiving/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lp4cko/charania_just_in_the_milwaukee_bucks_are_waiving/",
            "title": "[Charania] Just in: The Milwaukee Bucks are waiving Damian Lillard and stretching the remaining $113 million on his contract in order to acquire Myles Turner, sources tell ESPN. Lillard's two seasons in Milwaukee come to an end as he rehabilitates a torn Achilles tendon.",
            "content_html": "<p>Source: https://www.espn.com/contributor/shams-charania/56e7d7d989b6e</p>\n<blockquote>\n<p>Just in: The Milwaukee Bucks are waiving Damian Lillard and stretching the remaining $113 million on his contract in order to acquire Myles Turner, sources tell ESPN. Lillard's two seasons in Milwaukee come to an end as he rehabilitates a torn Achilles tendon.</p>\n</blockquote>",
            "date_published": "2025-07-01T15:17:42+00:00",
            "authors": [
                {
                    "name": "PlayaSlayaX",
                    "url": "https://www.reddit.com/user/PlayaSlayaX"
                }
            ]
        },
        {
            "id": "1lp443f",
            "url": "/r/nba/comments/1lp443f/charania_breaking_free_agent_center_myles_turner/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lp443f/charania_breaking_free_agent_center_myles_turner/",
            "title": "[Charania] BREAKING: Free agent center Myles Turner has agreed to a four-year, $107 million deal with the Milwaukee Bucks, plus a player option for year four in 2028-29 and a full 15% trade kicker, sources tell ESPN. Stunner.",
            "content_html": "<p>[Charania] BREAKING: Free agent center Myles Turner has agreed to a four-year, $107 million deal with the Milwaukee Bucks, plus a player option for year four in 2028-29 and a full 15% trade kicker, sources tell ESPN. Stunner.</p>\n<p>Update: Turner, the longest tenured Pacer, made it known he wished to remain in Indiana. Since the Game 7 exit, Turner’s reps pushed to get a deal done. Ultimately, Indiana’s aversion to the tax, which grew after Tyrese Haliburton’s injury, allowed Bucks to get the new franchise center.</p>\n<p>Update 2: Bucks GM Jon Horst and CAA Co-Head of Basketball Austin Brown partnered on executing a massive deal in a market scarce of salary cap space during the opening days of free agency. Milwaukee retools aggressively around Giannis Antetokounmpo again.</p>\n<p>Source: </p>\n<p>1) https://bsky.app/profile/shamsbot.bsky.social/post/3lsvy4d5q4c2g</p>\n<p>2) https://bsky.app/profile/shamsbot.bsky.social/post/3lsvy5cw7hc2g</p>\n<p>3) https://bsky.app/profile/shamsbot.bsky.social/post/3lsvy5wc3fc2g</p>",
            "date_published": "2025-07-01T15:08:38+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lp2hlr",
            "url": "/r/nba/comments/1lp2hlr/charania_breaking_nba_mvp_shai_gilgeousalexander/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lp2hlr/charania_breaking_nba_mvp_shai_gilgeousalexander/",
            "title": "[Charania] BREAKING: NBA MVP Shai Gilgeous-Alexander has agreed to a four-year, $285 million super maximum contract extension with the championship Oklahoma City Thunder through 2030-31, sources tell ESPN. This is now the richest annual salary for a player in league history.",
            "content_html": "<p>[Charania] BREAKING: NBA MVP Shai Gilgeous-Alexander has agreed to a four-year, $285 million super maximum contract extension with the championship Oklahoma City Thunder through 2030-31, sources tell ESPN. This is now the richest annual salary for a player in league history.</p>\n<p>Update: Shai Gilgeous-Alexander has signed two contract extensions now as a member of the Thunder, cementing both sides' partnership and trust since he arrived to OKC in 2019. He joined an exclusive club of players to win the MVP and Finals MVP in the same season.</p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lsvul4p7js2g and https://www.espn.com/contributor/shams-charania/ea06e49edc9f7</p>",
            "date_published": "2025-07-01T14:02:41+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lom69r",
            "url": "/r/nba/comments/1lom69r/charania_breaking_the_denver_nuggets_are_trading/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lom69r/charania_breaking_the_denver_nuggets_are_trading/",
            "title": "[Charania] \"BREAKING: The Denver Nuggets are trading Michael Porter Jr. and an unprotected 2032 first-round pick to the Brooklyn Nets for Cam Johnson, sources tell ESPN.\"",
            "content_html": "<p>Shams Charania has posted the following:</p>\n<blockquote>\n<p>\"BREAKING: The Denver Nuggets are trading Michael Porter Jr. and an unprotected 2032 first-round pick to the Brooklyn Nets for Cam Johnson, sources tell ESPN.\"</p>\n</blockquote>\n<p>Link to the story: <a href=\"https://bsky.app/profile/shamsbot.bsky.social/post/3lsuceo24lk2c\">https://bsky.app/profile/shamsbot.bsky.social/post/3lsuceo24lk2c</a></p>",
            "date_published": "2025-06-30T23:06:53+00:00",
            "authors": [
                {
                    "name": "TrenAt14",
                    "url": "https://www.reddit.com/user/TrenAt14"
                }
            ]
        },
        {
            "id": "1lo770f",
            "url": "/r/nba/comments/1lo770f/wembanyama_pulls_off_a_flawless_freekick_in/",
            "external_url": "https://streamable.com/rwc6pg",
            "title": "Wembanyama pulls off a flawless free-kick in pick-up soccer.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/rwc6pg\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-30T13:13:27+00:00",
            "authors": [
                {
                    "name": "Piats99",
                    "url": "https://www.reddit.com/user/Piats99"
                }
            ]
        },
        {
            "id": "1lnwhlt",
            "url": "/r/nba/comments/1lnwhlt/charania_breaking_deandre_ayton_is_finalizing_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lnwhlt/charania_breaking_deandre_ayton_is_finalizing_a/",
            "title": "[Charania] Breaking: Deandre Ayton is finalizing a contract buyout with the Portland Trail Blazers to become a free agent, sources tell ESPN.",
            "content_html": "<p>https://www.espn.com/contributor/shams-charania/1e5e49cb15ab7</p>\n<p>Breaking: Deandre Ayton is finalizing a contract buyout with the Portland Trail Blazers to become a free agent, sources tell ESPN.</p>\n<p>Breaking: Deandre Ayton is finalizing a contract buyout with the Portland Trail Blazers to become a free agent, sources tell ESPN.</p>",
            "date_published": "2025-06-30T02:36:10+00:00",
            "authors": [
                {
                    "name": "PlayaSlayaX",
                    "url": "https://www.reddit.com/user/PlayaSlayaX"
                }
            ]
        },
        {
            "id": "1lni3mv",
            "url": "/r/nba/comments/1lni3mv/charania_breaking_the_us_district_attorneys/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lni3mv/charania_breaking_the_us_district_attorneys/",
            "title": "[Charania] BREAKING: The U.S. District Attorney’s office is investigating Detroit Pistons guard Malik Beasley on allegations of gambling related to NBA games and prop bets, sources told ESPN. Serious development surrounding one of the top NBA free agents.",
            "content_html": "<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lsqzuk565s2v</p>\n<blockquote>\n<p>BREAKING: The U.S. District Attorney’s office is investigating Detroit Pistons guard Malik Beasley on allegations of gambling related to NBA games and prop bets, sources told ESPN. Serious development surrounding one of the top NBA free agents.</p>\n<p>“An investigation is not a charge,” Beasley’s attorney, Steve Haney, told ESPN. “Malik is afforded the same right of the presumption of innocence as anyone else under the U.S. constitution. As of now he has not been charged with anything.”</p>\n<p>Beasley and the Pistons were in serious talks on a new three-year, $42 million contract to bring the free agent sharpshooter back to Detroit, but now talks are on pause, sources said.</p>\n</blockquote>",
            "date_published": "2025-06-29T15:56:57+00:00",
            "authors": [
                {
                    "name": "PlayaSlayaX",
                    "url": "https://www.reddit.com/user/PlayaSlayaX"
                }
            ]
        },
        {
            "id": "1lnh29v",
            "url": "/r/nba/comments/1lnh29v/charania_breaking_los_angeles_lakers_lebron_james/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lnh29v/charania_breaking_los_angeles_lakers_lebron_james/",
            "title": "[Charania] \"Breaking: Los Angeles Lakers' LeBron James is opting into his $52.6 million player option for the 2025-26 season, Klutch Sports CEO Rich Paul told ESPN. Paul adds: LeBron \"knows the Lakers are building for the future ... but he values a realistic chance of winning it all.\"\"",
            "content_html": "<p>Shams Charania has posted the following:</p>\n<blockquote>\n<p>\"Breaking: Los Angeles Lakers' LeBron James is opting into his $52.6 million player option for the 2025-26 season, Klutch Sports CEO Rich Paul told ESPN. </p>\n</blockquote>\n<p>Paul adds: </p>\n<blockquote>\n<p>LeBron \"knows the Lakers are building for the future ... but he values a realistic chance of winning it all.\"\"</p>\n<p>Rich Paul: \"We understand the difficulty in winning now while preparing for the future. We do want to evaluate what's best for LeBron at this stage in his life and career.\" </p>\n</blockquote>\n<p>Link to the story: <a href=\"https://bsky.app/profile/shamsbot.bsky.social/post/3lsqxg6axts2v\">https://bsky.app/profile/shamsbot.bsky.social/post/3lsqxg6axts2v</a></p>",
            "date_published": "2025-06-29T15:13:07+00:00",
            "authors": [
                {
                    "name": "TrenAt14",
                    "url": "https://www.reddit.com/user/TrenAt14"
                }
            ]
        },
        {
            "id": "1lmozon",
            "url": "/r/nba/comments/1lmozon/charania_breaking_the_chicago_bulls_are_trading/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lmozon/charania_breaking_the_chicago_bulls_are_trading/",
            "title": "[Charania] BREAKING: The Chicago Bulls are trading Lonzo Ball to the Cleveland Cavaliers for Isaac Okoro, sources tell ESPN.",
            "content_html": "<p>[Charania] BREAKING: The Chicago Bulls are trading Lonzo Ball to the Cleveland Cavaliers for Isaac Okoro, sources tell ESPN.</p>\n<p>Source: https://www.espn.com/contributor/shams-charania/403b4db38667d</p>",
            "date_published": "2025-06-28T15:05:42+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lmnunf",
            "url": "/r/nba/comments/1lmnunf/dave_mcmenamin_lebron_james_is_expected_to_pick/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lmnunf/dave_mcmenamin_lebron_james_is_expected_to_pick/",
            "title": "[Dave McMenamin] LeBron James is expected to pick up the final year of his contract for $52.6 million, sources told ESPN.",
            "content_html": "<p>Source: https://www.espn.com/nba/story/_/id/45598239/nba-offseason-2025-hearing-luka-lebron-los-angeles-lakers-offseason</p>\n<p>From the article:</p>\n<p>The only mechanism the Lakers are projected to have in free agency is the taxpayer midlevel exception, worth $5.7 million, because James is expected to pick up the final year of his contract for $52.6 million, sources told ESPN.</p>\n<p>On DFS:</p>\n<p>A source familiar with the talks told ESPN that while Finney-Smith has interest in returning to L.A., he could look elsewhere for a multiyear deal if the only way to stay with the Lakers is to opt into his deal. <strong>But his departure would allow L.A. to open up the full midlevel exception of $14.1 million, which could be split up to pursue multiple free agents seeking a premium contract above the veteran minimum. And if the Lakers didn't use all of the midlevel exception, they could take on more salary in a trade and absorb the extra money into whatever they have left of the MLE.</strong></p>",
            "date_published": "2025-06-28T14:16:06+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1lmlluy",
            "url": "/r/nba/comments/1lmlluy/zhou_qi_advises_yang_hansen_to_be_prepared_to/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lmlluy/zhou_qi_advises_yang_hansen_to_be_prepared_to/",
            "title": "Zhou Qi advises Yang Hansen to be prepared to endure the subtle disdain of Black players.",
            "content_html": "<p><a href=\"https://www.sohu.com/a/894309123_121608687\">https://www.sohu.com/a/894309123_121608687</a></p>\n<p>I came across this while searching about Yang, but since I'm not very familiar with Chinese, I used ChatGPT to translate it — though there might be some subtle nuances that were lost in translation.</p>\n<p>--<br />\nOn the show, Yang Yi asked Zhou Qi if he had any advice for Yang Hansen as he prepares to play in the NBA. Zhou Qi thought for a moment and said:</p>\n<p>\"If I were to give any advice, I think the most important thing is to maintain a balanced mindset. The U.S. and Australia are quite different. In the U.S., there are a lot of Black players. Their playing style, physicality, and ways of expressing themselves are all very different from ours. Once you get to the NBA, to be honest, they don't really respect us deep down. They may not say it outright, but they'll express it in other ways.\"</p>\n<p>Hearing this, Yang Yi immediately said, “So he’s definitely going to get bullied!”</p>\n<p>Zhou Qi nodded and continued,<br />\n\"Exactly. That’s why mindset is especially important at that point. How you perceive your own role or position will shape your mentality over there.\"</p>\n<p>Zhou Qi then added,<br />\n\"Later on, I spent some time in Australia, and it was only after coming back to China that I truly felt the difference. There aren’t many Black players in Australia, and I also played there for a while.\"</p>\n<p>--</p>",
            "date_published": "2025-06-28T12:26:20+00:00",
            "authors": [
                {
                    "name": "Existing-Sky9914",
                    "url": "https://www.reddit.com/user/Existing-Sky9914"
                }
            ]
        },
        {
            "id": "1llth8w",
            "url": "/r/nba/comments/1llth8w/charania_breaking_masai_ujiri_is_out_as_vice/",
            "external_url": "https://www.reddit.com/r/nba/comments/1llth8w/charania_breaking_masai_ujiri_is_out_as_vice/",
            "title": "[Charania] BREAKING: Masai Ujiri is out as Vice Chairman and President of the Toronto Raptors, sources tell ESPN.",
            "content_html": "<p>[Charania] BREAKING: Masai Ujiri is out as Vice Chairman and President of the Toronto Raptors, sources tell ESPN.</p>\n<p>Source: https://www.espn.com/contributor/shams-charania/ccc7dd704209c</p>\n<p>UPDATE: Maple Leaf Sports &amp; Entertainment and Masai Ujiri have decided to part ways, as Ujiri was entering the final year of his contract, sources tell ESPN.</p>",
            "date_published": "2025-06-27T13:09:32+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lkltdd",
            "url": "/r/nba/comments/1lkltdd/highlight_fan_attending_the_draft_loudly_shouts/",
            "external_url": "https://streamable.com/crbn17",
            "title": "[Highlight] Fan attending the draft loudly shouts out: “DALLAS WAS RIGGED!”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 55.867%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/crbn17\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-26T00:08:06+00:00",
            "authors": [
                {
                    "name": "A_MASSIVE_PERVERT",
                    "url": "https://www.reddit.com/user/A_MASSIVE_PERVERT"
                }
            ]
        },
        {
            "id": "1lk9x0o",
            "url": "/r/nba/comments/1lk9x0o/charania_houston_rockets_guard_fred_vanvleet/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lk9x0o/charania_houston_rockets_guard_fred_vanvleet/",
            "title": "[Charania] Houston Rockets guard Fred VanVleet intends to sign a two-year, $50 million contract to stay with the franchise, with a player option in 2026-27, sources tell ESPN. Rockets are declining VanVleet's $44.9 million team option and land the new deal with Klutch Sports CEO Rich Paul.",
            "content_html": "<p>Shams Charania:</p>\n<p>Houston Rockets guard Fred VanVleet intends to sign a two-year, $50 million contract to stay with the franchise, with a player option in 2026-27, sources tell ESPN. Rockets are declining VanVleet's $44.9 million team option and land the new deal with Klutch Sports CEO Rich Paul. </p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lsgyxnb7js2g</p>",
            "date_published": "2025-06-25T16:14:13+00:00",
            "authors": [
                {
                    "name": "Turbostrider27",
                    "url": "https://www.reddit.com/user/Turbostrider27"
                }
            ]
        },
        {
            "id": "1ljckhr",
            "url": "/r/nba/comments/1ljckhr/jon_lewis_nba_will_be_better_off_without_stephen/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ljckhr/jon_lewis_nba_will_be_better_off_without_stephen/",
            "title": "Jon Lewis: \"NBA will be better off without Stephen A. Smith\"",
            "content_html": "<p><a href=\"https://www.sportsmediawatch.com/2025/06/nba-better-off-without-stephen-a-smith/\">Source</a></p>\n<blockquote>\n<p>Yet if one were evaluating his contributions to the game of basketball, it would be difficult to identify those that were positive. Certainly, Smith and his tag team partner Skip Bayless contributed the rings-above-all mindset to the NBA and trashed multiple generations of stars along the way. Certainly, they have disparaged and demeaned, ranted and raged, all under the guise of ‘debate.’ What else?</p>\n<p>He takes far more from the NBA than he has ever given; the only time he gives as good as he gets is when he is exchanging barbs with the league’s biggest stars. That includes just this week during the NBA Finals, when he made a point of diminishing Pacers G Tyrese Haliburton over a perceived slight. He went further earlier in the year, threatening to air dirty laundry of LeBron James and then making references to disputed claims about James’ attendance at Kobe Bryant’s 2020 memorial service — an insinuation for which he later apologized.</p>\n<p>Smith’s threats are a particularly bizarre character trait. Whether Kevin Durant years ago or James earlier this season, Smith appears to believe he has something on these players — that his bully pulpit is one he can weaponize to not just criticize players when warranted, but to shame them; to harm their public standing, perceptions of their ability, and their careers.</p>\n</blockquote>",
            "date_published": "2025-06-24T14:28:20+00:00",
            "authors": [
                {
                    "name": "luka274",
                    "url": "https://www.reddit.com/user/luka274"
                }
            ]
        },
        {
            "id": "1lj0iif",
            "url": "/r/nba/comments/1lj0iif/kramer_tyrese_haliburton_makes_an_incredible/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lj0iif/kramer_tyrese_haliburton_makes_an_incredible/",
            "title": "[Kramer] Tyrese Haliburton makes an incredible statement following his surgery today:",
            "content_html": "<p><a href=\"https://bsky.app/profile/ipacers.bsky.social/post/3lsd4tsauss2a\">Source</a></p>\n<p>Text of Haliburton's statement:</p>\n<blockquote>\n<p>Man. Don’t know how to explain it other than shock. Words cannot express the pain of this letdown. The frustration is unfathomable. I’ve worked my whole life to get to this moment and this is how it ends? Makes no sense.</p>\n<p>Now that I’ve gotten surgery, I wish I could count the number of times people will tell me I’m going to “come back stronger”. What a cliche lol, this shit sucks. My foot feels like dead weight fam. But what’s hurting most I think is my mind. Feel like I’m rambling, but I know this is something I’ll look back on when I’m through this, as something I’m proud I fought through. It feels good to let this shit out without y’all seeing the kid ugly cry.</p>\n<p>At 25, I’ve already learned that God never gives us more than we can handle. I know I’ll come out on the other side of this a better man and a better player. And honestly, right now, torn Achilles and all, I don’t regret it. I’d do it again, and again after that, to fight for this city and my brothers. For the chance to do something special.</p>\n<p>Indy, I’m sorry. If any fan base doesn’t deserve this, it’s y’all. But together we are going to fight like hell to get back to this very spot, and get over this hurdle. I don’t doubt for a second that y’all have my back, and I hope you guys know that I have yours. I think Kobe said it best when in this same situation. “There are far greater issues/challenges in the world then a torn achilles. Stop feeling sorry for yourself, find the silver lining and get to work with the same belief, same drive and same conviction as ever.” And that’s exactly right. I will do everything in my power to get back right.</p>\n<p>My journey to get to where I am today wasn’t by happenstance, I’ve pushed myself every day to be great. And I will continue to do just that. The most important part of this all, is that I’m grateful. I’m grateful for every single experience that’s led me here. I’m grateful for all the love from the hoop world. I don’t “have to” go through this, I get to go through this. I’m grateful for the road that lies ahead. Watch how I come back from this. So, give me some time, I’ll dust myself off and get right back to being the best version of Tyrese Haliburton.</p>\n<p>- 0<br />\nProverbs 3:5-6 “Trust in the Lord with all your heart, and lean not on your own understanding; in all your ways acknowledge Him, and He will make your paths straight.\"</p>\n</blockquote>",
            "date_published": "2025-06-24T03:14:24+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1li2z5p",
            "url": "/r/nba/comments/1li2z5p/injury_haliburton_suffers_painful_noncontact_leg/",
            "external_url": "https://streamable.com/jq8hh1",
            "title": "[Injury] Haliburton suffers painful non-contact leg injury",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/jq8hh1\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-23T00:25:51+00:00",
            "authors": [
                {
                    "name": "Growsomedope",
                    "url": "https://www.reddit.com/user/Growsomedope"
                }
            ]
        },
        {
            "id": "1lhsabd",
            "url": "/r/nba/comments/1lhsabd/charania_breaking_the_phoenix_suns_are_trading/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lhsabd/charania_breaking_the_phoenix_suns_are_trading/",
            "title": "[Charania] BREAKING: The Phoenix Suns are trading two-time NBA Finals MVP Kevin Durant to the Houston Rockets for Jalen Green, Dillon Brooks, the No. 10 pick in the 2025 draft and five second-round picks, sources tell ESPN.",
            "content_html": "<p>BREAKING: The Phoenix Suns are trading two-time NBA Finals MVP Kevin Durant to the Houston Rockets for Jalen Green, Dillon Brooks, the No. 10 pick in the 2025 draft and five second-round picks, sources tell ESPN.  </p>\n<p>https://www.espn.com/contributor/shams-charania/e066da0c064c6</p>",
            "date_published": "2025-06-22T16:39:57+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1lfs25t",
            "url": "/r/nba/comments/1lfs25t/highlight_haliburton_steals_the_ball_from_jalen/",
            "external_url": "https://streamable.com/lczkg1",
            "title": "[Highlight] Haliburton steals the ball from Jalen Williams, and Siakam finishes the play with an emphatic dun",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/lczkg1\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-20T01:46:54+00:00",
            "authors": [
                {
                    "name": "Growsomedope",
                    "url": "https://www.reddit.com/user/Growsomedope"
                }
            ]
        },
        {
            "id": "1lfezb1",
            "url": "/r/nba/comments/1lfezb1/charania_houston_rockets_head_coach_ime_udoka_has/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lfezb1/charania_houston_rockets_head_coach_ime_udoka_has/",
            "title": "[Charania] Houston Rockets head coach Ime Udoka has agreed to a long-term contract extension with the franchise that makes him one of the highest paid NBA coaches, after a 52-win season and top-2 seed for the first time in seven years, sources tell ESPN.",
            "content_html": "<p>Houston Rockets head coach Ime Udoka has agreed to a long-term contract extension with the franchise that makes him one of the highest paid NBA coaches, after a 52-win season and top-2 seed for the first time in seven years, sources tell ESPN.</p>\n<p>https://www.espn.com/contributor/shams-charania/de94b427010eb</p>",
            "date_published": "2025-06-19T16:21:14+00:00",
            "authors": [
                {
                    "name": "Knightbear49",
                    "url": "https://www.reddit.com/user/Knightbear49"
                }
            ]
        },
        {
            "id": "1les82s",
            "url": "/r/nba/comments/1les82s/charania_breaking_the_buss_family_is_entering_an/",
            "external_url": "https://www.reddit.com/r/nba/comments/1les82s/charania_breaking_the_buss_family_is_entering_an/",
            "title": "[Charania] BREAKING: The Buss family is entering an agreement to sell majority ownership of the Los Angeles Lakers to Mark Walter, the CEO and chairman of diversified holding company TWG Global, sources tell ESPN. Jeanie Buss will continue to serve in her role as Governor after the sale.",
            "content_html": "<p>[Charania] BREAKING: The Buss family is entering an agreement to sell majority ownership of the Los Angeles Lakers to Mark Walter, the CEO and chairman of diversified holding company TWG Global, sources tell ESPN. Jeanie Buss will continue to serve in her role as Governor after the sale.</p>\n<p>Source: https://www.espn.com/contributor/shams-charania/a943897ff910f</p>",
            "date_published": "2025-06-18T20:50:13+00:00",
            "authors": [
                {
                    "name": "MembershipSingle7137",
                    "url": "https://www.reddit.com/user/MembershipSingle7137"
                }
            ]
        },
        {
            "id": "1lehg65",
            "url": "/r/nba/comments/1lehg65/dejounte_murray_says_pop_tried_to_use_his_own/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lehg65/dejounte_murray_says_pop_tried_to_use_his_own/",
            "title": "Dejounte Murray says Pop tried to use his own money to move Dejounte’s mom to San Antonio after she got shot",
            "content_html": "<p>It was so crazy—a lot of my people don’t even know this. From family, friends, and the penitentiary… Pop didn’t want me to go to Seattle. When I first got drafted, I wouldn’t go to Seattle. And that was a man who cared about me. That was a man who wanted me to reach my full potential in life first—then as a basketball player. He’s so real. He tried to move my mom to San Antonio with his own money after she got shot. My mom was shot in the leg my rookie year. He called her himself—without me knowing until after the fact. ‘We want to move you here. No—not with his money, with my money.’ That sounds like a dude that cares about me and loves me, right?</p>\n<p>Source: https://youtu.be/dyrl_4Q1tLA?si=GVlL1o5XAIG5h_gn</p>",
            "date_published": "2025-06-18T13:42:49+00:00",
            "authors": [
                {
                    "name": "WEMBY_F4N",
                    "url": "https://www.reddit.com/user/WEMBY_F4N"
                }
            ]
        },
        {
            "id": "1le7n8i",
            "url": "/r/nba/comments/1le7n8i/desmond_bane_this_facility_is_different_bro_the/",
            "external_url": "https://streamable.com/lyvicm",
            "title": "[Desmond Bane] “This facility is different bro. The one in Memphis we ain’t have not one window… we joked around and called it the Dungeon… this is a breath of fresh air.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 57.371%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/lyvicm\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-18T04:00:57+00:00",
            "authors": [
                {
                    "name": "AashyLarry",
                    "url": "https://www.reddit.com/user/AashyLarry"
                }
            ]
        },
        {
            "id": "1ldq4qp",
            "url": "/r/nba/comments/1ldq4qp/mind_the_game_lebron_on_nbas_ring_culture_its/",
            "external_url": "https://streamable.com/5l1h3o",
            "title": "[Mind the Game] LeBron on NBA's ring culture: \"It's like saying Peyton Manning can't be in the same room with Brady or Mahomes because he has only 1 ring. They don't never discuss that in their sport...A ring is a team accomplishment.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 75.869%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/5l1h3o\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-17T15:28:26+00:00",
            "authors": [
                {
                    "name": "th31whoknocks",
                    "url": "https://www.reddit.com/user/th31whoknocks"
                }
            ]
        },
        {
            "id": "1lctdja",
            "url": "/r/nba/comments/1lctdja/lee_4785_thats_how_much_it_costs_to_be_a_sports/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lctdja/lee_4785_thats_how_much_it_costs_to_be_a_sports/",
            "title": "[Lee]: $4785. That’s How Much It Costs To Be A Sports Fan",
            "content_html": "<p>Source: https://www.nytimes.com/2025/06/16/opinion/sports-nba-mlb-leagues-streaming-fan.html</p>\n<p>Key quotes:</p>\n<p>“For most of my life, sports was one of the most accessible forms of entertainment in America. You turned on the TV, flipped to the game and cheered or booed — with your family, your neighborhood, your city. Being a fan was simple. It was community.”</p>\n<p>“This community is dying, because some of its shared moments are disappearing. Take the N.B.A. playoffs. Wanted to watch the Denver Nuggets? </p>\n<p>You needed to shell out at least $8.99 a month for NBA TV — unless you happened to live in Denver, in which case you had to spend an additional $20 a month for a regional basketball streaming subscription.”</p>\n<p>“For decades, our national sports leagues — the National Football League, the National Basketball Association, Major League Baseball, the National Hockey League — operated more like civic institutions. </p>\n<p>These organizations may have always chased the mighty dollar, but they also wanted their sports to last. </p>\n<p>And as such, they cared about strengthening such powerful intangibles as local pride, generational fandom and public ritual. Tradition was good business. Community built loyalty. Loyalty built value.</p>\n<p>Then came the streaming wars. Starting in the early 2010s, live sports events were one of the last types of programming that guaranteed hundreds of thousands if not millions of real-time viewers, and the leagues began to be flooded with requests from streamers, such as Amazon Prime, Peacock and Max, begging for a piece of the pie. </p>\n<p>At the same time, the leagues were looking for a way to raise the cash required to invest in the lucrative opportunities offered by overseas expansion. </p>\n<p>And that’s when the business of sustaining sports in America took a back seat, and our country’s sports leagues stopped acting like caretakers and started thinking like asset managers.</p>\n<p>The result is that dozens if not hundreds of games that make up America’s national pastimes are being sliced and diced and sold off to the highest bidder — be that a cable giant, or a streaming upstart, or a regional sports network or a subscription app. </p>\n<p>Games jump from one service to another with so little notice or apparent logic that even some of the biggest superfans struggle to track what’s available where.”</p>",
            "date_published": "2025-06-16T13:52:29+00:00",
            "authors": [
                {
                    "name": "Proof-Umpire-7718",
                    "url": "https://www.reddit.com/user/Proof-Umpire-7718"
                }
            ]
        },
        {
            "id": "1lc2kf2",
            "url": "/r/nba/comments/1lc2kf2/charania_breaking_the_memphis_grizzlies_are/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lc2kf2/charania_breaking_the_memphis_grizzlies_are/",
            "title": "[Charania] BREAKING: The Memphis Grizzlies are trading Desmond Bane to the Orlando Magic for Kentavious Caldwell-Pope, Cole Anthony, four unprotected first-round picks and one first-round pick swap, sources tell ESPN.",
            "content_html": "<p>Shams Charania:</p>\n<p>BREAKING: The Memphis Grizzlies are trading Desmond Bane to the Orlando Magic for Kentavious Caldwell-Pope, Cole Anthony, four unprotected first-round picks and one first-round pick swap, sources tell ESPN. </p>\n<p>Source: https://www.espn.com/contributor/shams-charania/205d7f0adb0fa</p>",
            "date_published": "2025-06-15T15:09:24+00:00",
            "authors": [
                {
                    "name": "Turbostrider27",
                    "url": "https://www.reddit.com/user/Turbostrider27"
                }
            ]
        },
        {
            "id": "1lbfhlm",
            "url": "/r/nba/comments/1lbfhlm/charania_just_in_houston_rockets_center_steven/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lbfhlm/charania_just_in_houston_rockets_center_steven/",
            "title": "[Charania] Just In: Houston Rockets center Steven Adams has agreed to a three-year, $39 million contract extension to stay with the franchise, sources tell ESPN. After playing a key rotation and leadership role in the Rockets' playoff run, the new deal keeps a top center out of free agency.",
            "content_html": "<p>Just In: Houston Rockets center Steven Adams has agreed to a three-year, $39 million contract extension to stay with the franchise, sources tell ESPN. After playing a key rotation and leadership role in the Rockets' playoff run, the new deal keeps a top center out of free agency.</p>\n<p>https://www.espn.com/contributor/shams-charania/5972a54fd9b47</p>",
            "date_published": "2025-06-14T18:26:43+00:00",
            "authors": [
                {
                    "name": "Knightbear49",
                    "url": "https://www.reddit.com/user/Knightbear49"
                }
            ]
        },
        {
            "id": "1laywoe",
            "url": "/r/nba/comments/1laywoe/stephen_a_smith_playing_solitaire_during_game_4/",
            "external_url": "https://streamable.com/nwrl91",
            "title": "Stephen A. Smith playing solitaire during Game 4 of the NBA Finals",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/nwrl91\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-14T03:26:43+00:00",
            "authors": [
                {
                    "name": "Hot-Adagio-1667",
                    "url": "https://www.reddit.com/user/Hot-Adagio-1667"
                }
            ]
        },
        {
            "id": "1lajd6t",
            "url": "/r/nba/comments/1lajd6t/shelburne_tyrese_haliburton_and_caitlin_clark/",
            "external_url": "https://www.reddit.com/r/nba/comments/1lajd6t/shelburne_tyrese_haliburton_and_caitlin_clark/",
            "title": "[Shelburne] Tyrese Haliburton and Caitlin Clark aren’t just friends, they’re pushing each other to be better and making Indiana the center of the basketball universe. “Ty and I would both tell you this is where we hope to stay the rest of our careers,\" Clark told ESPN",
            "content_html": "<p>Tyrese Haliburton and Caitlin Clark aren’t just friends, they’re pushing each other to be better and making Indiana the center of the basketball universe. “Ty and I would both tell you this is where we hope to stay the rest of our careers,\" Clark told ESPN</p>\n<p>Well as a Pelicans fan who is grateful for how OKC rallied around the team and arguably saved the franchise after Katrina hit some 20 years ago, I'd like to see the Thunder rally and win. But the revival of hoops in Indiana is great for basketball, I must concede.</p>\n<p>Source:</p>\n<p><a href=\"https://www.espn.com/nba/story/_/id/45501463/nba-finals-2025-tyrese-haliburton-caitlin-clark-most-powerful-friendship-basketball\">https://www.espn.com/nba/story/_/id/45501463/nba-finals-2025-tyrese-haliburton-caitlin-clark-most-powerful-friendship-basketball</a></p>",
            "date_published": "2025-06-13T15:49:39+00:00",
            "authors": [
                {
                    "name": "Kimber80",
                    "url": "https://www.reddit.com/user/Kimber80"
                }
            ]
        },
        {
            "id": "1l9c4p7",
            "url": "/r/nba/comments/1l9c4p7/post_game_thread_the_indiana_pacers_defend_home/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l9c4p7/post_game_thread_the_indiana_pacers_defend_home/",
            "title": "[Post Game Thread] The Indiana Pacers defend home court, winning Game 3 against the Oklahoma City Thunder 116-107, behind Haliburton's 22 points and 11 assists and Mathurin's 27 points as they take a 2-1 series lead.",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/OKC\"></a> <strong>107 -  116</strong> <a href=\"/IND\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/OKC-vs-IND-0042400403/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>NBA Finals - Game 3 - Series tied 1-1</strong>|\n|<strong>Location:</strong> Gainbridge Fieldhouse|\n|<strong>Officials:</strong> Tony Brothers, James Capers, Courtney Kirkland, and Tyler Ford|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|32|28|29|18|107|\n|Indiana Pacers|24|40|20|32|116|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|107|37-79|46.8%|10-22|45.5%|23-30|76.7%|9|52|16|20|6|17|4|\n|Indiana Pacers|116|44-85|51.8%|9-27|33.3%|19-22|86.4%|7|41|24|24|13|13|11|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/OKC\"></a> Oklahoma City Thunder</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Luguentz Dort^SF|35:45|12|4-8|4-5|0-0|1|3|4|0|0|0|0|3|1|\n|Jalen Williams^PF|36:27|26|9-18|1-2|7-11|2|4|6|3|1|0|4|3|-9|\n|Chet Holmgren^C|34:41|20|6-15|0-6|8-9|1|9|10|2|1|0|1|0|1|\n|Cason Wallace^SG|24:19|7|3-5|0-1|1-2|1|3|4|1|1|1|2|2|-10|\n|Shai Gilgeous-Alexander^PG|42:01|24|9-20|1-3|5-6|2|6|8|4|0|3|6|2|-3|\n|Alex Caruso|32:13|8|2-5|2-2|2-2|1|4|5|4|2|0|1|3|-15|\n|Aaron Wiggins|09:39|0|0-2|0-0|0-0|1|1|2|2|0|0|1|3|-5|\n|Isaiah Hartenstein|18:13|4|2-3|0-0|0-0|0|3|3|0|1|0|2|2|-4|\n|Isaiah Joe|04:13|6|2-2|2-2|0-0|0|0|0|0|0|0|0|2|0|\n|Jaylin Williams|00:20|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|1|\n|Kenrich Williams|02:03|0|0-1|0-1|0-0|0|0|0|0|0|0|0|0|-2|\n|Ousmane Dieng|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Dillon Jones|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ajay Mitchell|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Nikola Topić|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/IND\"></a> Indiana Pacers</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Aaron Nesmith^SF|22:06|7|3-5|1-2|0-0|1|1|2|0|1|1|0|6|1|\n|Pascal Siakam^PF|31:57|21|8-14|0-2|5-6|0|6|6|4|2|1|0|3|8|\n|Myles Turner^C|29:44|9|3-11|1-4|2-2|0|2|2|1|1|5|2|2|-8|\n|Andrew Nembhard^SG|33:25|8|3-5|1-2|1-2|1|3|4|1|0|0|3|5|3|\n|Tyrese Haliburton^PG|36:19|22|9-17|4-8|0-0|1|8|9|11|2|1|4|1|1|\n|Obi Toppin|27:48|8|4-8|0-3|0-0|1|5|6|1|0|2|1|3|18|\n|Ben Sheppard|18:05|4|2-5|0-2|0-0|1|1|2|0|2|0|0|1|-2|\n|T.J. McConnell|15:06|10|3-8|0-1|4-4|1|0|1|5|5|0|2|1|12|\n|Thomas Bryant|03:04|0|0-0|0-0|0-0|0|0|0|0|0|0|0|2|-4|\n|Bennedict Mathurin|22:24|27|9-12|2-3|7-8|1|3|4|1|0|1|1|0|16|\n|Tony Bradley|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Johnny Furphy|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Isaiah Jackson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|James Johnson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jarace Walker|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-06-12T03:15:28+00:00",
            "authors": [
                {
                    "name": "sptagnew",
                    "url": "https://www.reddit.com/user/sptagnew"
                }
            ]
        },
        {
            "id": "1l95g04",
            "url": "/r/nba/comments/1l95g04/charania_another_one_the_new_york_knicks_have/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l95g04/charania_another_one_the_new_york_knicks_have/",
            "title": "[Charania] Another one: The New York Knicks have requested permission to speak with Atlanta Hawks head coach Quin Snyder, but were firmly denied, sources tell ESPN.",
            "content_html": "<p>https://www.espn.com/contributor/shams-charania/da6a8f823b69c</p>\n<blockquote>\n<p>Another one: The New York Knicks have requested permission to speak with Atlanta Hawks head coach Quin Snyder, but were firmly denied, sources tell ESPN.</p>\n</blockquote>\n<p>Another one: The New York Knicks have requested permission to speak with Atlanta Hawks head coach Quin Snyder, but were firmly denied, sources tell ESPN.</p>",
            "date_published": "2025-06-11T21:57:23+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1l8sipt",
            "url": "/r/nba/comments/1l8sipt/charania_the_new_york_knicks_requested_permission/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l8sipt/charania_the_new_york_knicks_requested_permission/",
            "title": "[Charania] The New York Knicks requested permission Wednesday morning to speak to Mavericks coach Jason Kidd – and Dallas gave a firm rejection, sources tell ESPN. Knicks have been denied now on Kidd, Minnesota's Chris Finch and Houston's Ime Udoka",
            "content_html": "<blockquote>\n<p>The New York Knicks requested permission Wednesday morning to speak to Mavericks coach Jason Kidd – and Dallas gave a firm rejection, sources tell ESPN. Knicks have been denied now on Kidd, Minnesota's Chris Finch and Houston's Ime Udoka.</p>\n</blockquote>\n<p>Source: https://www.espn.com/contributor/shams-charania/d734ae5813cc8</p>",
            "date_published": "2025-06-11T13:20:36+00:00",
            "authors": [
                {
                    "name": "mastermind208",
                    "url": "https://www.reddit.com/user/mastermind208"
                }
            ]
        },
        {
            "id": "1l7ytm7",
            "url": "/r/nba/comments/1l7ytm7/caplan_kobe_and_gigi_bryants_mural_is_vandalized/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l7ytm7/caplan_kobe_and_gigi_bryants_mural_is_vandalized/",
            "title": "[Caplan] Kobe and Gigi Bryant's Mural Is Vandalized for the Second Time in a Month. Now the Artist Says He's Moving It :\"We didn't want that disrespect to L.A. right here, and for people to see that, especially Vanessa...Kobe has brought nothing but light and insight and inspiration to the youth.\"",
            "content_html": "<p>A mural depicting the late Kobe Bryant and his daughter Gianna has been vandalized for the second time in a span of a month.</p>\n<p>The mural, located in Downtown Los Angeles, was tagged with white spray paint after it was restored to its pre-vandalized state on Friday, May 30, according to KNBC-TV.   </p>\n<p>The “Mambas Forever” mural on Main and 14th Street by Los Angeles-based artist Sloe Motions was first vandalized in April.</p>\n<p>The artist, whose real name is Louie Palsino, told the news station that he will now work to move the installation to another location.</p>\n<p>“Everything happens for a reason and we now want to reach out and get this piece done in collaboration with another business or foundation, all donated by us and no charge to the new location,” Palsino said in a statement. “The project will be better than the last with a proper wall, whether indoor or outdoor, for our community and people to appreciate.”</p>\n<p>The artwork depicts Kobe in his Lakers uniform kissing his daughter Gigi, who holds a basketball. The words \"Mambas Forever\" are written next to them.</p>\n<p>Shortly after the mural was initially vandalized, Palsino established a GoFundMe to help with restoration — and Lakers star Luka Dončić promptly donated the entire $5,000 goal.</p>\n<p>\"Kobe is L.A. He and Gigi mean so much to this city, to the Lakers organization and to me personally,\" Dončić said in a statement at the time. \"I'm happy to do anything to help make sure he and his daughter are honored.\"</p>\n<p>For Palsino, the incidents are not only marring his own tribute to the basketball icon, but also he fears they are affecting Bryant’s legacy, he told CBS affiliate KCAL-TV.</p>\n<p><strong>\"We didn't want that disrespect to L.A. right here, and for people to see that, especially Vanessa,\" he said. \"Kobe has brought nothing but light and insight and inspiration to the youth.\"</strong></p>\n<p>Source: <a href=\"https://people.com/kobe-bryant-gigi-bryant-mural-vandalized-second-time-in-month-11748065\">https://people.com/kobe-bryant-gigi-bryant-mural-vandalized-second-time-in-month-11748065</a></p>",
            "date_published": "2025-06-10T13:32:00+00:00",
            "authors": [
                {
                    "name": "th31whoknocks",
                    "url": "https://www.reddit.com/user/th31whoknocks"
                }
            ]
        },
        {
            "id": "1l7o6tl",
            "url": "/r/nba/comments/1l7o6tl/demarcus_cousins_crashed_out_in_puerto_rico/",
            "external_url": "https://streamable.com/064s6p",
            "title": "Demarcus Cousins crashed out in Puerto Rico basketball league 😳 - LeagueAlerts via X",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.586%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/064s6p\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-10T03:00:04+00:00",
            "authors": [
                {
                    "name": "OmegaLxgend",
                    "url": "https://www.reddit.com/user/OmegaLxgend"
                }
            ]
        },
        {
            "id": "1l6e978",
            "url": "/r/nba/comments/1l6e978/mind_the_game_pod_lebron_i_see_it_on_social_media/",
            "external_url": "https://streamable.com/dn57r5",
            "title": "[Mind The Game Pod] LeBron: I see it on Social Media all the time 'LeBron has no bag'.... and I’m sitting here like, 'I got 50 billion points'.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.782%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/dn57r5\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-08T15:02:53+00:00",
            "authors": [
                {
                    "name": "TheRealPdGaming",
                    "url": "https://www.reddit.com/user/TheRealPdGaming"
                }
            ]
        },
        {
            "id": "1l5q485",
            "url": "/r/nba/comments/1l5q485/zach_harper_there_have_been_whispers_and_rumors/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l5q485/zach_harper_there_have_been_whispers_and_rumors/",
            "title": "[Zach Harper] There have been whispers and rumors within the last year that the Suns [ownership] might not have money. Ishbia might not have cash. There’s questions about his business [United Wholesale Mortgage] and how liquid it was.",
            "content_html": "<p><a href=\"https://open.spotify.com/episode/2PZn8tw131Y8YCUJyJgVdI?si=B4MCwElLRfaZbBiQxgglYA&amp;context=spotify%3Aplaylist%3A37i9dQZF1FgnTBfUlzkeKt\">Quote at the 37:50 mark</a></p>\n<p>There have been whispers and rumors within the last year that the Suns [ownership] might not have money. Ishbia might not have cash. There’s questions about his business [United Wholesale Mortgage] and how liquid it was. </p>",
            "date_published": "2025-06-07T17:22:10+00:00",
            "authors": [
                {
                    "name": "cleo22270",
                    "url": "https://www.reddit.com/user/cleo22270"
                }
            ]
        },
        {
            "id": "1l4i33s",
            "url": "/r/nba/comments/1l4i33s/highlight_tyrese_haliburton_puts_the_pacers_up_1/",
            "external_url": "https://streamable.com/oyiugx",
            "title": "[Highlight] Tyrese Haliburton puts the Pacers up 1 in the first game of the finals with 0.3 left vs the Thunder!",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/oyiugx\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-06T03:04:58+00:00",
            "authors": [
                {
                    "name": "fbreaker",
                    "url": "https://www.reddit.com/user/fbreaker"
                }
            ]
        },
        {
            "id": "1l3zy1e",
            "url": "/r/nba/comments/1l3zy1e/jared_mccain_does_the_call_to_say_good_morning/",
            "external_url": "https://streamable.com/o2bro5",
            "title": "[Jared McCain] does the \"call to say Good Morning\" trend to Kyle Lowry",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 125.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/o2bro5\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-05T14:01:11+00:00",
            "authors": [
                {
                    "name": "mastermind208",
                    "url": "https://www.reddit.com/user/mastermind208"
                }
            ]
        },
        {
            "id": "1l2ju8g",
            "url": "/r/nba/comments/1l2ju8g/charania_breaking_the_new_york_knicks_are/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l2ju8g/charania_breaking_the_new_york_knicks_are/",
            "title": "[Charania] BREAKING: The New York Knicks are relieving Tom Thibodeau of his duties as head coach, sources tell ESPN. Thibodeau led the Knicks to their first East Finals in 25 years, made playoffs in 4 of 5 years and led Knicks to consecutive 50+ win seasons for first time since the 1990s.",
            "content_html": "<p>[Charania] BREAKING: The New York Knicks are relieving Tom Thibodeau of his duties as head coach, sources tell ESPN. Thibodeau led the Knicks to their first East Finals in 25 years, made playoffs in 4 of 5 years and led Knicks to consecutive 50+ win seasons for first time since the 1990s.  </p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lqpwv4p2h22p</p>",
            "date_published": "2025-06-03T18:40:36+00:00",
            "authors": [
                {
                    "name": "mvanigan",
                    "url": "https://www.reddit.com/user/mvanigan"
                }
            ]
        },
        {
            "id": "1l2ezir",
            "url": "/r/nba/comments/1l2ezir/shaq_on_giannis_big_market_doesnt_matter_social/",
            "external_url": "https://streamable.com/gl3r50",
            "title": "Shaq on Giannis: \"Big Market doesn't matter, social media's the market now. You go to LA, that's 50% of your contract to taxes, more pressure, more articles, more stress. When I was coming up [market size mattered] but now every market is the same. He's making the super max, no need for big market\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/gl3r50\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-03T15:33:16+00:00",
            "authors": [
                {
                    "name": "jabronified",
                    "url": "https://www.reddit.com/user/jabronified"
                }
            ]
        },
        {
            "id": "1l2c6v4",
            "url": "/r/nba/comments/1l2c6v4/steve_kerr_on_his_role_in_the_suns_2007_salary/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l2c6v4/steve_kerr_on_his_role_in_the_suns_2007_salary/",
            "title": "Steve Kerr on his role in the Sun’s 2007 salary dump of Kurt Thomas: “I was a young GM. I’m put in this position that I have to make this deal. Business is business. We ended up giving up two unprotected firsts.”",
            "content_html": "<p><a href=\"https://www.nytimes.com/athletic/6397881/2025/06/03/steve-kerr-sam-presti-thunder-trade/?source=user_shared_article\">Article: Tracing the Thunder’s rise back to a 2007 trade Sam Presti made with Steve Kerr</a></p>\n<blockquote>\n<p>In the summer of 2007, Steve Kerr was the recently elevated general manager of the Phoenix Suns. In his first month, he was given a mandate from owner Robert Sarver: Shed enough salary to escape the luxury tax.</p>\n<p>“We were, like, exactly eight million over the tax,” Kerr recalled recently to The Athletic. “Just trading Kurt Thomas got us under the tax. And there was only one team, literally one team in the entire league, that could absorb his salary into a slot.”</p>\n<p>“Sam knew exactly what he was doing,” Kerr said. “I knew how smart he was and how well-prepared for the job he was just from being with (Gregg Popovich) and R.C. (Buford) and learning the ropes from them. I was a young GM. I’m put in this position that I have to make this deal. Business is business. We ended up giving up two unprotected firsts.”</p>\n<p>Kerr traded Phoenix’s 2008 and 2010 first-round picks along with Thomas’ contract. The Suns finished that next season 55-27, delivering Presti and the Thunder not a premium asset, but a valuable tool if utilized correctly.</p>\n<p>Presti used the 24th pick on Serge Ibaka, a young power forward flashing some upside in Europe. </p>\n<p>After Ibaka’s seventh season, on draft night of 2016, Presti sent him to the Magic for Victor Oladipo and the 11th pick. He’d immediately use that draft pick on Domantas Sabonis, bringing in a young starting shooting guard and what appeared to be Ibaka’s long-term replacement at power forward.</p>\n<p>Presti pulled the trigger on a trade the following summer (2017) for Paul George, the replacement co-star next to Westbrook. To acquire George, he sent Oladipo and Sabonis to the Indiana Pacers, the exact package he received for Ibaka.</p>\n<p>Presti traded George to the LA Clippers for a package that included Shai Gilgeous-Alexander and a war chest of draft assets. One of those picks, the No. 12 pick in 2022, was used on Jalen Williams.</p>\n</blockquote>",
            "date_published": "2025-06-03T13:40:42+00:00",
            "authors": [
                {
                    "name": "cleo22270",
                    "url": "https://www.reddit.com/user/cleo22270"
                }
            ]
        },
        {
            "id": "1l1jk37",
            "url": "/r/nba/comments/1l1jk37/obama_talking_about_the_pacers_and_how_they/",
            "external_url": "https://streamable.com/o30lsh?src=player-page-share",
            "title": "Obama talking about the Pacers and how they remind him of the Warriors/Spurs",
            "content_html": "<p>Reuploaded because idk how to post videos lol</p>\n<p>Source: YMT on YouTube (https://youtu.be/RosinuEpucU?si=VFN-Fmj3F8YjYrmj)</p><div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/o30lsh\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-06-02T14:32:22+00:00",
            "authors": [
                {
                    "name": "Kyrie01010011",
                    "url": "https://www.reddit.com/user/Kyrie01010011"
                }
            ]
        },
        {
            "id": "1l0e8wn",
            "url": "/r/nba/comments/1l0e8wn/the_new_york_knicks_have_been_eliminated_from/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l0e8wn/the_new_york_knicks_have_been_eliminated_from/",
            "title": "THE NEW YORK KNICKS HAVE BEEN ELIMINATED FROM CHAMPIONSHIP CONTENTION",
            "content_html": "<p>The Knicks came up short against the Pacers and lose in the Eastern Conference Finals 2-4.  The Knicks made their deepest playoff run since 2000, and will look to contend again next season in a wide-open Eastern Conference.  Fade 'em.</p>",
            "date_published": "2025-06-01T02:36:04+00:00",
            "authors": [
                {
                    "name": "ItsN0tTheB0at",
                    "url": "https://www.reddit.com/user/ItsN0tTheB0at"
                }
            ]
        },
        {
            "id": "1l00051",
            "url": "/r/nba/comments/1l00051/tmz_moriah_mills_has_contacted_tony_buzbee_in/",
            "external_url": "https://www.reddit.com/r/nba/comments/1l00051/tmz_moriah_mills_has_contacted_tony_buzbee_in/",
            "title": "[TMZ] Moriah Mills has contacted Tony Buzbee in consideration of filing a lawsuit against Zion Williamson in the wake of the Pelicans star being accused of sexual assault",
            "content_html": "<p><a href=\"https://www.tmz.com/2025/05/31/moriah-mills-moriah-mills-contacts-tony-buzbee-mulling-zion-williamson-lawsuit/\">Source</a></p>\n<blockquote>\n<p>Moriah Mills -- the influencer/model who claimed to have a fling with Zion Williamson back in 2023 -- has contacted Tony Buzbee ... and is mulling a lawsuit against the NBA superstar, TMZ Sports has learned.</p>\n<p>Buzbee -- the famed attorney best known for representing Deshaun Watson and Diddy accusers -- told us on Friday just hours after a Jane Doe filed a rape suit against Williamson in Los Angeles that Mills has reached out to him over the potential of filing her own litigation against the 24-year-old New Orleans Pelicans forward.</p>\n<p>Buzbee stated for now, he is in the process of \"evaluating her claims.\"</p>\n<p>Mills, of course, unleashed a slew of unflattering claims against Williamson on her X page roughly two years ago ... at one point even alleging he had been intimate with her just days before he announced he was expecting a baby with another woman.</p>\n<p>When we ran into her in Downtown L.A. on Friday, she declined to get into details of what she would be asking for in a potential suit -- but she did offer her prayers to Williamson's latest accuser.</p>\n<p>For Williamson's part, he's vehemently denied the claims in the lawsuit filed Thursday ... calling it a money grab.</p>\n<p>Mills, meanwhile, sent a message to Zion ... saying, in part, \"I just hope you change your ways because your job and your family and your legacy is on the line.\"</p>\n</blockquote>",
            "date_published": "2025-05-31T15:38:09+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1kz6zer",
            "url": "/r/nba/comments/1kz6zer/nba_star_zion_williamson_accused_of_rape/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kz6zer/nba_star_zion_williamson_accused_of_rape/",
            "title": "NBA star Zion Williamson accused of rape",
            "content_html": "<p>https://thespun.com/nba/nba-star-zion-williamson-accused-of-rape</p>\n<blockquote>\n<p>Eriq Gardner of Puck News revealed that Williamson has been accused of rape. A woman claiming to be his ex-girlfriend filed a lawsuit in Los Angeles on Thursday. </p>\n<p>Williamson has been accused of showing \"abusive, controlling, and threatening behavior\" toward the plaintiff. </p>\n<p>\"This was submitted to Los Angeles Superior Court yesterday: NBA superstar Zion Williamson accused of rape. Plaintiff says she was in a dating relationship with him at Duke—before it got abusive,\" Gardner wrote on X.</p>\n</blockquote>",
            "date_published": "2025-05-30T15:22:43+00:00",
            "authors": [
                {
                    "name": "The_Blind_Bomber",
                    "url": "https://www.reddit.com/user/The_Blind_Bomber"
                }
            ]
        },
        {
            "id": "1kyrcqq",
            "url": "/r/nba/comments/1kyrcqq/spike_i_would_give_up_an_academy_award_oscar_for/",
            "external_url": "https://streamable.com/927jb7",
            "title": "Spike: \"I would give up an Academy Award. Oscar, for the Knicks to win a Championship.\" Chuck: \"Well you're gonna keep 'em!\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/927jb7\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-30T00:59:49+00:00",
            "authors": [
                {
                    "name": "Hot-Adagio-1667",
                    "url": "https://www.reddit.com/user/Hot-Adagio-1667"
                }
            ]
        },
        {
            "id": "1ky06zw",
            "url": "/r/nba/comments/1ky06zw/the_minnesota_timberwolves_have_been_eliminated/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ky06zw/the_minnesota_timberwolves_have_been_eliminated/",
            "title": "THE MINNESOTA TIMBERWOLVES HAVE BEEN ELIMINATED FROM 2025 NBA CHAMPIONSHIP CONTENTION",
            "content_html": "<p>With a blowout loss against the Oklahoma City Thunder, the Minnesota Timberwolves are eliminated from 2025 NBA championship contention in the Western Conference Finals.</p>\n<p>Fade 'em.</p>",
            "date_published": "2025-05-29T02:57:44+00:00",
            "authors": [
                {
                    "name": "drecz",
                    "url": "https://www.reddit.com/user/drecz"
                }
            ]
        },
        {
            "id": "1kx4reg",
            "url": "/r/nba/comments/1kx4reg/barkley_hey_espn_i_love_you_guys_dont_try_to_make/",
            "external_url": "https://streamable.com/fsvsw5",
            "title": "[Barkley] “Hey ESPN, I love you guys — Don't try to make Anthony Edwards the face of the NBA. The face of the NBA is Shai Gilgeous-Alexander, Joker, and Giannis. You can't give it to people, they have to take it — and Shai Gilgeous-Alexander is taking it.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fsvsw5\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-28T01:32:56+00:00",
            "authors": [
                {
                    "name": "AashyLarry",
                    "url": "https://www.reddit.com/user/AashyLarry"
                }
            ]
        },
        {
            "id": "1kwt3ly",
            "url": "/r/nba/comments/1kwt3ly/docs_pacers_fan_charged_after_stabbing_2_knicks/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kwt3ly/docs_pacers_fan_charged_after_stabbing_2_knicks/",
            "title": "Docs: Pacers fan charged after stabbing 2 Knicks fans at Carmel brewery",
            "content_html": "<p>https://fox59.com/news/indycrime/docs-pacers-fan-charged-after-stabbing-2-knicks-fans-at-carmel-brewery/</p>\n<blockquote>\n<p>CARMEL, Ind. — A Carmel man has been charged after he reportedly stabbed two New York Knicks fans at a brewery during Game 2 of the NBA’s Eastern Conference Finals earlier this month.</p>\n<p>According to court documents filed on Tuesday in Hamilton County, 24-year-old Jarrett Funke has been charged with:</p>\n<ul>\n<li>\n<p>One count of battery by means of a deadly weapon, a Level 5 felony</p>\n</li>\n<li>\n<p>One count of battery resulting in serious bodily injury, a Level 5 felony</p>\n</li>\n<li>\n<p>One count of criminal recklessness committed with a deadly weapon, a Level 6 felony</p>\n</li>\n</ul>\n<p>Officers with the Carmel Police Department were called to a brewery on the evening of May 23 on a reported disturbance. That evening, the Indiana Pacers were facing the New York Knicks in Game 2 of the NBA’s Eastern Conference Finals, a game that the Pacers won 114-109 at Madison Square Garden in New York City.</p>\n<p>Initially, police were called because of an alleged fight involving a man, later identified as Jarrett Funke. However, once Funke left the brewery, the caller stated that police did not need to respond.</p>\n<p>Minutes later, an employee of the brewery called police, stating that Funke had reportedly returned to the brewery’s patio. The caller stated that Funke reportedly stabbed a man in the back and was attempting to leave.</p>\n<p>When police arrived, they found two individuals with wounds. The court documents said that one had a stab wound in the back while the other had a laceration in his lower leg.</p>\n<p>In interviews with the two victims, they alleged that Funke approached them at the bar. Funke reportedly “smacked” the Knicks hat off of one of the victims onto the ground. Funke was then reportedly taken outside as he yelled “f— you, you still have a f—— problem. Take this outside.” to the two individuals.</p>\n<p>Around five minutes later, the two Knicks fans were outside on the patio when Funke reportedly “stormed through the fence” of the brewery and began attacking the two individuals. One of the victims told police that he “briefly displayed a black folding pocket knife to deter (Funke) but repocketed it, as he had no intention of using it.”</p>\n<p>A verbal altercation reportedly evolved into a physical one, ending with the two victims being allegedly stabbed by Funke. In an interview with Funke, he reportedly told police that the two Knicks fans were “talking s—” and claimed that they were the ones who began the altercation.</p>\n<p>Funke claims that one of the Knicks fans pushed him to the ground and “began punching him in the face.” The documents said that Funke claims that he “retrieved his pocketknife from his hoodie and swung it around towards (one of the Knicks fans) back with his right hand.”</p>\n<p>However, the documents said that there were multiple witnesses who stated that Funke was the “primary aggressor in this incident.”</p>\n<p>According to court documents, Funke’s initial hearing is scheduled for Tuesday afternoon in Hamilton County.</p>\n<p>As of this story’s publication, the Indiana Pacers lead the NBA Eastern Conference Finals against the New York Knicks 2-1, with Game 4 scheduled for 8 p.m. on Tuesday at Gainbridge Fieldhouse in downtown Indianapolis.</p>\n</blockquote>",
            "date_published": "2025-05-27T17:21:42+00:00",
            "authors": [
                {
                    "name": "HokageEzio",
                    "url": "https://www.reddit.com/user/HokageEzio"
                }
            ]
        },
        {
            "id": "1kvib2l",
            "url": "/r/nba/comments/1kvib2l/kenny_smith_on_the_knicks_rotations_thibodeau/",
            "external_url": "https://streamable.com/zq2srm",
            "title": "Kenny Smith on the Knicks' rotations: \"Thibodeau wouldn't play 9 guys in a baseball game\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/zq2srm\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-26T01:24:50+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1kuj7qu",
            "url": "/r/nba/comments/1kuj7qu/im_tired_of_the_homophobia_expressed_towards_karl/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kuj7qu/im_tired_of_the_homophobia_expressed_towards_karl/",
            "title": "I'm tired of the homophobia expressed towards Karl Anthony Towns",
            "content_html": "<p>bro is just soft spoken and doing his thing. It doesn't fucking matter what his sexuality is because there are no out players in the nba. I can see why - any time someone slightly dips into a high voice, or dresses different,  they are ostracized. I have seen multiple clips of NYC street interviews, 'give us your best KAT impression,\" they're doing the same gay voice that was a played joke 10 years ago when I was in high school. You can hear the hate dripping from it. Just got a clip of Lonzo Ball getting interviewed by Cameron Brink - egging him on to make fun of KAT and he won't and Brink just starts doing the voice. What the hell is wrong with people? Do they just not understand how fucking rude they seem? it's funny to see clips of Kat, whatever, but the entire media apparatus is borderline bullying bro right now for something he doesn't even publicly identify as. It's disgusting.</p>\n<p>edit: all the replies too scared to say some real choice words and catch a reddit ban. we used to have a word for \"zesty\" online in the 2010s too, and it wasn't necessarily coming from a place of bigotry - we just used it to keep other guys in check about what was acceptable behavior. same thing happening here, just being typed by way softer hands who can't stand behind what they're actually making fun of.</p>",
            "date_published": "2025-05-24T19:04:54+00:00",
            "authors": [
                {
                    "name": "Immediate_Map235",
                    "url": "https://www.reddit.com/user/Immediate_Map235"
                }
            ]
        },
        {
            "id": "1ktxke8",
            "url": "/r/nba/comments/1ktxke8/uthayakumar_40yearold_lebron_james_just_became/",
            "external_url": "https://bsky.app/profile/keerthikau.bsky.social/post/3lpurg3czs22m",
            "title": "[Uthayakumar] 40-year-old LeBron James just became the oldest player to be named to an All-NBA team in NBA history, passing 39-year-old LeBron James.",
            "content_html": "",
            "date_published": "2025-05-23T23:22:23+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1ksgd7w",
            "url": "/r/nba/comments/1ksgd7w/highlight_haliburton_hits_the_buzzer_beater/",
            "external_url": "https://streamable.com/7fo1br",
            "title": "[Highlight] Haliburton hits the buzzer beater! (2-pointer on review)",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/7fo1br\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-22T02:53:05+00:00",
            "authors": [
                {
                    "name": "Growsomedope",
                    "url": "https://www.reddit.com/user/Growsomedope"
                }
            ]
        },
        {
            "id": "1ks7a8g",
            "url": "/r/nba/comments/1ks7a8g/charania_breaking_oklahoma_city_thunder_star_shai/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ks7a8g/charania_breaking_oklahoma_city_thunder_star_shai/",
            "title": "[Charania] Breaking: Oklahoma City Thunder star Shai Gilgeous-Alexander has won the NBA MVP award, sources tell ESPN.",
            "content_html": "<p>Breaking: Oklahoma City Thunder star Shai Gilgeous-Alexander has won the NBA MVP award, sources tell ESPN.</p>\n<p>Breaking: Oklahoma City Thunder star Shai Gilgeous-Alexander has won the NBA MVP award, sources tell ESPN.</p>\n<p>https://www.espn.com/contributor/shams-charania/e65db8e627a0f</p>",
            "date_published": "2025-05-21T19:50:53+00:00",
            "authors": [
                {
                    "name": "Knightbear49",
                    "url": "https://www.reddit.com/user/Knightbear49"
                }
            ]
        },
        {
            "id": "1krla98",
            "url": "/r/nba/comments/1krla98/highlight_doris_burke_calls_sga_a_free_throw/",
            "external_url": "https://streamable.com/9s53dz",
            "title": "[Highlight] Doris Burke calls SGA a free throw merchant",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/9s53dz\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-21T00:59:43+00:00",
            "authors": [
                {
                    "name": "herbjonesmybeloved",
                    "url": "https://www.reddit.com/user/herbjonesmybeloved"
                }
            ]
        },
        {
            "id": "1kr7une",
            "url": "/r/nba/comments/1kr7une/lebron_on_the_boston_celtics_sometimes_they_get_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kr7une/lebron_on_the_boston_celtics_sometimes_they_get_a/",
            "title": "LeBron on the Boston Celtics: “Sometimes they get a little bored because of how great they are.”",
            "content_html": "<p>LeBron (starting at 30:49) on Mind the Game with Steve Nash:</p>\n<blockquote>\n<p>“You think they get bored sometimes? Like, they’ve been doing this shit so long. It seems like they get bored sometimes with the – I don’t want to say the process – they are who they are. When you look at Tatum and Brown, this is years and years and years and years. They’ve punched their 10,000 hours, but sometimes it seems like… sometimes they get a little bored because of how great they are, not only as those two as individuals, but them as a team. And sometimes, it looks like they get bored.”</p>\n</blockquote>\n<p><a href=\"https://youtu.be/LW7bNrFmck4\">Source</a></p>",
            "date_published": "2025-05-20T15:33:01+00:00",
            "authors": [
                {
                    "name": "iksnet",
                    "url": "https://www.reddit.com/user/iksnet"
                }
            ]
        },
        {
            "id": "1kqdwgq",
            "url": "/r/nba/comments/1kqdwgq/shaq_in_1992_i_meet_mr_david_stern_he_pulled_me/",
            "external_url": "https://streamable.com/zyxrew",
            "title": "Shaq: \"In 1992... I meet Mr. [David] Stern... he pulled me to the side, 'You want to play where it's cold or where it's hot?' And I was like, 'hot.' And he smiled and I smiled... Orlando, Florida was No. 1.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 125.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/zyxrew\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-19T15:01:26+00:00",
            "authors": [
                {
                    "name": "The_Blind_Bomber",
                    "url": "https://www.reddit.com/user/The_Blind_Bomber"
                }
            ]
        },
        {
            "id": "1kpvq2g",
            "url": "/r/nba/comments/1kpvq2g/the_denver_nuggets_have_been_eliminated_from/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kpvq2g/the_denver_nuggets_have_been_eliminated_from/",
            "title": "THE DENVER NUGGETS HAVE BEEN ELIMINATED FROM CHAMPIONSHIP CONTENTION",
            "content_html": "<p>The Nuggets ran out of gas in game 7 against the Thunder, ending a tumultuous season.  With a thin roster around Nikola Jokic, Jamal Murray, and Aaron Gordon and new leadership coming in the Front Office &amp; on the bench, Denver has a busy offseason ahead.  Fade 'em.</p>",
            "date_published": "2025-05-18T22:01:48+00:00",
            "authors": [
                {
                    "name": "ItsN0tTheB0at",
                    "url": "https://www.reddit.com/user/ItsN0tTheB0at"
                }
            ]
        },
        {
            "id": "1koijl5",
            "url": "/r/nba/comments/1koijl5/the_boston_celtics_have_been_eliminated_from/",
            "external_url": "https://www.reddit.com/r/nba/comments/1koijl5/the_boston_celtics_have_been_eliminated_from/",
            "title": "THE BOSTON CELTICS HAVE BEEN ELIMINATED FROM CHAMPIONSHIP CONTENTION",
            "content_html": "<p>The Boston Celtics lose Game 6 at Madison Square Garden to the New York Knicks, eliminating them from championship contention.</p>\n<p>Fade 'em.</p>",
            "date_published": "2025-05-17T02:35:35+00:00",
            "authors": [
                {
                    "name": "edgykitty",
                    "url": "https://www.reddit.com/user/edgykitty"
                }
            ]
        },
        {
            "id": "1knqwom",
            "url": "/r/nba/comments/1knqwom/post_game_thread_the_denver_nuggets_33_force_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1knqwom/post_game_thread_the_denver_nuggets_33_force_a/",
            "title": "[Post Game Thread] The Denver Nuggets (3-3) force a game 7 as they defeat the Oklahoma City Thunder (3-3), 119 - 107, behind 25/8/7 from Jamal Murray and 29/14/8 from Nikola Jokic",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/OKC\"></a> <strong>107 -  119</strong> <a href=\"/DEN\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/OKC-vs-DEN-0042400226/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>West Conf. Semifinals - Game 6 - OKC leads 3-2</strong>|\n|<strong>Location:</strong> Ball Arena|\n|<strong>Officials:</strong> Sean Corbin, Marc Davis, Kevin Scott, and Mitchell Ervin|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|28|33|21|25|107|\n|Denver Nuggets|31|27|32|29|119|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|107|43-92|46.7%|11-40|27.5%|10-16|62.5%|7|45|25|28|11|11|4|\n|Denver Nuggets|119|40-86|46.5%|12-32|37.5%|27-32|84.4%|11|61|27|16|8|14|6|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/OKC\"></a> Oklahoma City Thunder</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Jalen Williams^SF|37:46|6|3-16|0-4|0-0|1|6|7|10|3|1|3|3|-8|\n|Chet Holmgren^PF|30:03|19|8-14|2-7|1-3|1|10|11|1|1|1|0|2|3|\n|Isaiah Hartenstein^C|25:06|8|4-4|0-0|0-0|2|4|6|0|0|0|1|4|-17|\n|Luguentz Dort^SG|21:01|10|4-9|2-7|0-0|1|1|2|1|1|0|1|2|-18|\n|Shai Gilgeous-Alexander^PG|34:57|32|11-16|2-4|8-11|0|3|3|6|0|0|2|4|-8|\n|Alex Caruso|27:20|10|4-9|2-5|0-0|0|0|0|4|2|1|1|5|-4|\n|Cason Wallace|26:49|10|4-9|2-5|0-0|0|4|4|0|3|0|1|3|-12|\n|Jaylin Williams|14:27|8|3-5|1-2|1-2|2|3|5|2|1|0|1|4|-1|\n|Aaron Wiggins|12:28|2|1-6|0-4|0-0|0|1|1|1|0|1|1|1|1|\n|Isaiah Joe|07:59|2|1-3|0-2|0-0|0|1|1|0|0|0|0|0|4|\n|Dillon Jones|00:40|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ousmane Dieng|00:40|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ajay Mitchell|00:40|0|0-1|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Kenrich Williams|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Nikola Topić|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/DEN\"></a> Denver Nuggets</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Michael Porter Jr.^SF|28:57|10|4-9|2-5|0-0|0|4|4|0|1|1|1|1|5|\n|Aaron Gordon^PF|38:14|5|2-7|1-4|0-0|2|5|7|7|1|0|1|0|17|\n|Nikola Jokić^C|40:49|29|9-14|1-3|10-12|1|13|14|8|2|1|1|4|11|\n|Christian Braun^SG|39:18|23|8-14|3-6|4-4|2|9|11|5|3|1|2|4|14|\n|Jamal Murray^PG|42:20|25|9-19|2-6|5-6|1|7|8|7|0|1|5|3|28|\n|Julian Strawther|19:30|15|4-8|3-4|4-4|1|1|2|0|0|0|0|3|4|\n|Russell Westbrook|16:55|8|3-8|0-2|2-4|3|0|3|0|0|1|4|0|-9|\n|Peyton Watson|13:52|4|1-7|0-2|2-2|1|2|3|0|1|1|0|1|-10|\n|Vlatko Čančar|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|DeAndre Jordan|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Zeke Nnaji|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jalen Pickett|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Dario Šarić|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|DaRon Holmes II|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Hunter Tyson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-05-16T03:14:14+00:00",
            "authors": [
                {
                    "name": "Nyhrox",
                    "url": "https://www.reddit.com/user/Nyhrox"
                }
            ]
        },
        {
            "id": "1knao2a",
            "url": "/r/nba/comments/1knao2a/highlight_wolves_fan_is_a_little_too_happy_about/",
            "external_url": "https://streamable.com/meebkx",
            "title": "[Highlight] Wolves fan is a little too happy about Wolves advancing to the WCF and appears to snort a line on live TV",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.604%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/meebkx\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-15T15:11:46+00:00",
            "authors": [
                {
                    "name": "The_Blind_Bomber",
                    "url": "https://www.reddit.com/user/The_Blind_Bomber"
                }
            ]
        },
        {
            "id": "1kmwl7n",
            "url": "/r/nba/comments/1kmwl7n/highlight_td_garden_puts_jalen_brunson_on_the/",
            "external_url": "https://streamable.com/8dp2mm",
            "title": "[Highlight] TD Garden puts Jalen Brunson on the jumbotron after fouling out and he gives a wave to the crowd",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/8dp2mm\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-15T01:50:45+00:00",
            "authors": [
                {
                    "name": "HokageEzio",
                    "url": "https://www.reddit.com/user/HokageEzio"
                }
            ]
        },
        {
            "id": "1klwwe5",
            "url": "/r/nba/comments/1klwwe5/charania_breaking_boston_celtics_allnba_star/",
            "external_url": "https://www.reddit.com/r/nba/comments/1klwwe5/charania_breaking_boston_celtics_allnba_star/",
            "title": "[Charania] BREAKING: Boston Celtics All-NBA star Jayson Tatum underwent surgery to repair a torn right Achilles tendon. Catastrophic season-ending injury for one of the NBA's young faces and the Celtics, with a long rehab awaiting.",
            "content_html": "<p>[Charania] BREAKING: Boston Celtics All-NBA star Jayson Tatum underwent surgery to repair a torn right Achilles tendon. Catastrophic season-ending injury for one of the NBA's young faces and the Celtics, with a long rehab awaiting.</p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lp3dzl7dwk2l<br />\nESPN Link: https://www.espn.com/contributor/adam-schefter/09d05f040c4ed</p>",
            "date_published": "2025-05-13T20:45:07+00:00",
            "authors": [
                {
                    "name": "mvanigan",
                    "url": "https://www.reddit.com/user/mvanigan"
                }
            ]
        },
        {
            "id": "1kluq0f",
            "url": "/r/nba/comments/1kluq0f/lowe_on_the_flattened_lottery_odds_they_voted_291/",
            "external_url": "https://youtube.com/clip/Ugkxqj9BVl0yR7CyVXl-3yhgYq3AiQQ2PXkR",
            "title": "Lowe on the flattened lottery odds: \"They voted 29-1 [for this]. Remember who was the only dissenter, I think— Oklahoma City. And Presti's viewpoint on this was, 'This is the only way small markets can get superstars. And you are minimizing our chances of doing it, through lottery flattening\"",
            "content_html": "",
            "date_published": "2025-05-13T19:17:45+00:00",
            "authors": [
                {
                    "name": "sewsgup",
                    "url": "https://www.reddit.com/user/sewsgup"
                }
            ]
        },
        {
            "id": "1kl78n6",
            "url": "/r/nba/comments/1kl78n6/poe_no_freaking_way_the_dallas_mavericks_land_the/",
            "external_url": "https://bsky.app/profile/juliapoe.bsky.social/post/3loz4iy2a7s2l",
            "title": "[Poe] No freaking way. The Dallas Mavericks land the No. 1 pick in the draft.",
            "content_html": "",
            "date_published": "2025-05-12T23:25:26+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1kkrmfq",
            "url": "/r/nba/comments/1kkrmfq/charania_twotime_nba_mvp_giannis_antetokounmpo/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kkrmfq/charania_twotime_nba_mvp_giannis_antetokounmpo/",
            "title": "[Charania] Two-time NBA MVP Giannis Antetokounmpo has not made any firm decisions, but for the first time in his career, he is open-minded about whether his best fit is remaining in Milwaukee – or playing elsewhere, league sources told ESPN",
            "content_html": "<blockquote>\n<p>Two-time NBA MVP Giannis Antetokounmpo has not made any firm decisions, but for the first time in his career, he is open-minded about whether his best fit is remaining in Milwaukee – or playing elsewhere, league sources told ESPN</p>\n</blockquote>\n<p>https://www.espn.com/contributor/shams-charania/e7cd7725dded6</p>",
            "date_published": "2025-05-12T12:46:31+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1kkgjgp",
            "url": "/r/nba/comments/1kkgjgp/russo_indiana_pacers_have_tied_the_nba_record_for/",
            "external_url": "https://bsky.app/profile/flybyknite.bsky.social/post/3lowsj432bc2n",
            "title": "[Russo] Indiana Pacers have tied the NBA record for the largest halftime lead in playoff history, 41. The team who holds the record alongside them is the 2017 Cleveland Cavaliers, who led Boston by 41 on May 19 in Game 2 of the Eastern Conference Finals.",
            "content_html": "",
            "date_published": "2025-05-12T01:22:09+00:00",
            "authors": [
                {
                    "name": "Kimber80",
                    "url": "https://www.reddit.com/user/Kimber80"
                }
            ]
        },
        {
            "id": "1kkbh1u",
            "url": "/r/nba/comments/1kkbh1u/highlight_the_nuggets_have_their_first_lead_of/",
            "external_url": "https://streamable.com/owfnj2",
            "title": "[Highlight] The Nuggets have their first lead of the game off a 3 from Mr. Nugget. Timeout Thunder",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/owfnj2\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-11T21:10:28+00:00",
            "authors": [
                {
                    "name": "Jailbrick3d",
                    "url": "https://www.reddit.com/user/Jailbrick3d"
                }
            ]
        },
        {
            "id": "1kj2f6s",
            "url": "/r/nba/comments/1kj2f6s/post_game_thread_the_denver_nuggets_take_a_21/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kj2f6s/post_game_thread_the_denver_nuggets_take_a_21/",
            "title": "[Post Game Thread] The Denver Nuggets take a 2-1 series lead as they defeat the Oklahoma City Thunder in OT, 113 - 104, behind 27/4/8 from Jamal Murray",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/OKC\"></a> <strong>104 -  113</strong> <a href=\"/DEN\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/OKC-vs-DEN-0042400223/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>West Conf. Semifinals - Game 3 - Series tied 1-1</strong>|\n|<strong>Location:</strong> Ball Arena|\n|<strong>Officials:</strong> James Capers, Eric Dalen, Ben Taylor, and Ray Acosta|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>OT</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|28|28|27|19|2|104|\n|Denver Nuggets|22|29|29|22|11|113|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Oklahoma City Thunder|104|40-104|38.5%|9-35|25.7%|15-22|68.2%|18|62|24|21|7|11|6|\n|Denver Nuggets|113|39-85|45.9%|16-40|40.0%|19-24|79.2%|5|60|25|21|9|14|7|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/OKC\"></a> Oklahoma City Thunder</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Jalen Williams^SF|43:20|32|11-21|3-7|7-8|1|2|3|5|0|0|3|1|-11|\n|Chet Holmgren^PF|40:02|18|7-19|1-6|3-4|5|11|16|0|1|3|3|2|-8|\n|Isaiah Hartenstein^C|30:26|10|5-14|0-0|0-1|4|6|10|4|1|1|2|4|-4|\n|Luguentz Dort^SG|33:54|3|1-6|0-4|1-2|3|1|4|3|0|1|1|6|-7|\n|Shai Gilgeous-Alexander^PG|44:38|18|7-22|1-6|3-5|3|10|13|7|2|0|1|1|-4|\n|Jaylin Williams|13:43|5|2-3|1-1|0-0|0|0|0|0|0|0|0|1|-1|\n|Alex Caruso|22:59|7|2-9|2-5|1-2|0|2|2|2|1|0|0|2|-4|\n|Cason Wallace|19:30|2|1-3|0-2|0-0|1|2|3|1|1|0|1|1|-5|\n|Isaiah Joe|03:10|2|1-2|0-1|0-0|0|1|1|0|1|0|0|2|-1|\n|Aaron Wiggins|12:30|7|3-5|1-3|0-0|1|1|2|2|0|1|0|1|0|\n|Ousmane Dieng|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Dillon Jones|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ajay Mitchell|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Kenrich Williams|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Nikola Topić|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/DEN\"></a> Denver Nuggets</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Michael Porter Jr.^SF|42:08|21|7-10|5-6|2-2|1|7|8|1|0|0|1|4|7|\n|Aaron Gordon^PF|46:12|22|7-11|4-6|4-4|0|7|7|5|1|0|1|2|15|\n|Nikola Jokić^C|43:42|20|8-25|0-10|4-4|2|14|16|6|2|2|8|2|5|\n|Christian Braun^SG|42:51|8|3-8|2-6|0-0|0|7|7|1|0|2|1|5|6|\n|Jamal Murray^PG|47:45|27|9-19|2-5|7-8|0|4|4|8|4|1|2|2|14|\n|Russell Westbrook|22:06|8|3-8|1-4|1-2|0|1|1|4|2|0|0|4|-2|\n|Peyton Watson|16:29|7|2-4|2-3|1-4|2|4|6|0|0|2|1|2|7|\n|Zeke Nnaji|02:59|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|-7|\n|Vlatko Čančar|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|DeAndre Jordan|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jalen Pickett|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Dario Šarić|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Julian Strawther|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Hunter Tyson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|DaRon Holmes II|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-05-10T05:00:21+00:00",
            "authors": [
                {
                    "name": "Nyhrox",
                    "url": "https://www.reddit.com/user/Nyhrox"
                }
            ]
        },
        {
            "id": "1kioijr",
            "url": "/r/nba/comments/1kioijr/lebron_on_the_lakers_losing_to_the_timberwolves/",
            "external_url": "https://streamable.com/apt4t3",
            "title": "LeBron on the Lakers losing to the Timberwolves: “I’ve definitely learned over the years that teams win championships. Always… I don’t lose sleep over that like, ‘F***, how did me and Luka lose?’ Well, there’s 8 other guys on the floor.”",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 54.525%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/apt4t3\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-09T17:40:59+00:00",
            "authors": [
                {
                    "name": "Classic-Carpet7609",
                    "url": "https://www.reddit.com/user/Classic-Carpet7609"
                }
            ]
        },
        {
            "id": "1khshyd",
            "url": "/r/nba/comments/1khshyd/paul_pierce_begins_his_long_walk_to_the_studio_in/",
            "external_url": "https://streamable.com/febm30",
            "title": "Paul Pierce begins his long walk to the studio in his robe because of the Celtics loss. His latest update he said he was 4 miles in (1.5 hours of walking).",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 137.356%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/febm30\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-08T15:10:28+00:00",
            "authors": [
                {
                    "name": "kurruchi",
                    "url": "https://www.reddit.com/user/kurruchi"
                }
            ]
        },
        {
            "id": "1khe607",
            "url": "/r/nba/comments/1khe607/post_game_thread_the_new_york_knicks_take_a/",
            "external_url": "https://www.reddit.com/r/nba/comments/1khe607/post_game_thread_the_new_york_knicks_take_a/",
            "title": "[Post Game Thread] The New York Knicks take a commanding 2-0 series lead over the Boston Celtics, 91-90. Karl Anthony-Towns roars for 21/17/1, Josh Hart adds 23/6/3.",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/NYK\"></a> <strong>91 -  90</strong> <a href=\"/BOS\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/NYK-vs-BOS-0042400212/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>East Conf. Semifinals - Game 2 - NYK leads 1-0</strong>|\n|<strong>Location:</strong> TD Garden|\n|<strong>Officials:</strong> James Capers, Mark Lindsay, and Kevin Scott|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|\n|New York Knicks|13|28|20|30|91|\n|Boston Celtics|24|26|23|17|90|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|New York Knicks|91|37-86|43.0%|9-31|29.0%|8-10|80.0%|10|54|19|16|11|15|5|\n|Boston Celtics|90|34-94|36.2%|10-40|25.0%|12-15|80.0%|16|60|17|17|9|16|5|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/NYK\"></a> New York Knicks</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|OG Anunoby^SF|38:14|5|2-9|1-4|0-0|1|4|5|1|4|1|3|3|-11|\n|Josh Hart^PF|42:50|23|9-15|3-6|2-2|3|3|6|3|0|2|2|4|-7|\n|Karl-Anthony Towns^C|34:48|21|9-16|0-1|3-3|3|14|17|1|0|1|4|4|-2|\n|Mikal Bridges^SG|42:47|14|6-18|2-8|0-0|0|7|7|5|3|0|2|2|-6|\n|Jalen Brunson^PG|37:30|17|6-19|2-9|3-4|0|3|3|7|0|1|2|2|-1|\n|Mitchell Robinson|22:19|6|3-5|0-0|0-1|3|5|8|0|3|0|2|0|19|\n|Miles McBride|16:37|5|2-3|1-2|0-0|0|0|0|1|1|0|0|1|9|\n|Cameron Payne|04:52|0|0-1|0-1|0-0|0|0|0|1|0|0|0|0|4|\n|Precious Achiuwa|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Pacôme Dadiet|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ariel Hukporti|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Tyler Kolek|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Landry Shamet|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|P.J. Tucker|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Delon Wright|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/BOS\"></a> Boston Celtics</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Jaylen Brown^SF|41:23|20|8-23|2-7|2-4|4|2|6|1|2|0|6|2|3|\n|Jayson Tatum^PF|41:59|13|5-19|1-5|2-2|1|13|14|5|3|1|3|2|3|\n|Al Horford^C|29:04|4|2-11|0-5|0-0|2|2|4|0|3|1|1|4|-11|\n|Derrick White^SG|40:00|20|6-17|3-11|5-5|3|6|9|5|0|2|0|2|-2|\n|Jrue Holiday^PG|34:04|10|4-6|0-2|2-3|2|1|3|5|1|0|4|3|-1|\n|Payton Pritchard|21:59|9|3-9|3-9|0-0|1|2|3|1|0|0|1|0|1|\n|Luke Kornet|17:37|6|3-4|0-0|0-0|0|8|8|0|0|1|0|1|11|\n|Kristaps Porziņģis|13:53|8|3-5|1-1|1-1|3|1|4|0|0|0|1|3|-9|\n|Torrey Craig|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|JD Davison|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Sam Hauser|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Neemias Queta|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Baylor Scheierman|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Xavier Tillman|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jordan Walsh|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-05-08T01:24:46+00:00",
            "authors": [
                {
                    "name": "ItsN0tTheB0at",
                    "url": "https://www.reddit.com/user/ItsN0tTheB0at"
                }
            ]
        },
        {
            "id": "1kglt6w",
            "url": "/r/nba/comments/1kglt6w/highlight_tyrese_haliburton_misses_the_free_throw/",
            "external_url": "https://streamable.com/nd9f9v",
            "title": "[Highlight] Tyrese Haliburton misses the free throw but gets the rebound and hits the triple to put the Pacers up 1 vs the Cavaliers and win the game!",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/nd9f9v\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-07T01:47:44+00:00",
            "authors": [
                {
                    "name": "fbreaker",
                    "url": "https://www.reddit.com/user/fbreaker"
                }
            ]
        },
        {
            "id": "1kfvyhp",
            "url": "/r/nba/comments/1kfvyhp/highlight_aaron_gordon_with_the_gamewinner/",
            "external_url": "https://streamable.com/r5vs22",
            "title": "[Highlight] Aaron Gordon with the game-winner 3-pointer to beat OKC in game!",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/r5vs22\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-06T04:26:51+00:00",
            "authors": [
                {
                    "name": "MrBuckBuck",
                    "url": "https://www.reddit.com/user/MrBuckBuck"
                }
            ]
        },
        {
            "id": "1kft3fb",
            "url": "/r/nba/comments/1kft3fb/post_game_thread_the_new_york_knicks_rally_in_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kft3fb/post_game_thread_the_new_york_knicks_rally_in_the/",
            "title": "[Post Game Thread] The New York Knicks rally in the 2nd half and take a 1-0 series lead in OT over the Boston Celtics, 108-105. Jalen Brunson leads the way with 29/4/5, OG Anunoby adds a playoff career high 29/4/2.",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/NYK\"></a> <strong>108 -  105</strong> <a href=\"/BOS\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/NYK-vs-BOS-0042400211/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>East Conf. Semifinals - Game 1 - Series tied 0-0</strong>|\n|<strong>Location:</strong> TD Garden|\n|<strong>Officials:</strong> JB DeRosa, Marc Davis, and Ben Taylor|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>OT</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|:--|\n|New York Knicks|25|20|30|25|8|108|\n|Boston Celtics|26|35|23|16|5|105|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|New York Knicks|108|37-87|42.5%|17-37|45.9%|17-31|54.8%|12|62|19|19|10|12|2|\n|Boston Celtics|105|34-97|35.1%|15-60|25.0%|22-26|84.6%|19|69|18|22|4|13|5|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/NYK\"></a> New York Knicks</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|OG Anunoby^SF|45:49|29|10-20|6-11|3-4|1|3|4|3|1|0|3|1|-1|\n|Josh Hart^PF|45:14|14|5-9|1-5|3-6|5|6|11|3|2|0|1|4|5|\n|Karl-Anthony Towns^C|31:28|14|6-13|0-1|2-2|4|9|13|0|1|0|2|5|8|\n|Mikal Bridges^SG|51:02|8|3-13|2-5|0-0|0|6|6|7|3|2|1|2|3|\n|Jalen Brunson^PG|43:31|29|9-23|5-9|6-7|1|3|4|5|2|0|4|4|2|\n|Miles McBride|18:36|11|4-8|3-6|0-0|0|2|2|1|1|0|0|1|-6|\n|Mitchell Robinson|20:53|3|0-0|0-0|3-10|1|6|7|0|0|0|0|1|13|\n|Cameron Payne|03:18|0|0-0|0-0|0-2|0|0|0|0|0|0|1|1|-2|\n|Precious Achiuwa|05:06|0|0-1|0-0|0-0|0|2|2|0|0|0|0|0|-7|\n|Pacôme Dadiet|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Ariel Hukporti|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Tyler Kolek|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Landry Shamet|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|P.J. Tucker|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Delon Wright|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/BOS\"></a> Boston Celtics</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Jaylen Brown^SF|44:53|23|7-20|1-10|8-10|2|5|7|5|0|0|1|3|1|\n|Jayson Tatum^PF|44:14|23|7-23|4-15|5-7|0|16|16|6|2|1|5|2|-5|\n|Kristaps Porziņģis^C|12:58|0|0-4|0-0|0-0|4|0|4|1|0|0|1|0|0|\n|Derrick White^SG|44:05|19|6-18|5-16|2-2|1|10|11|2|0|2|3|2|0|\n|Jrue Holiday^PG|38:56|16|7-14|2-7|0-0|5|1|6|3|1|0|1|3|2|\n|Al Horford|34:21|7|2-6|1-5|2-2|3|4|7|0|0|1|0|4|0|\n|Payton Pritchard|24:21|13|3-6|2-5|5-5|0|3|3|1|0|0|1|2|1|\n|Luke Kornet|17:14|4|2-4|0-0|0-0|4|1|5|0|1|1|1|5|-7|\n|Sam Hauser|03:57|0|0-2|0-2|0-0|0|0|0|0|0|0|0|1|-7|\n|Torrey Craig|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|JD Davison|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Neemias Queta|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Baylor Scheierman|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Xavier Tillman|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jordan Walsh|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-05-06T01:50:51+00:00",
            "authors": [
                {
                    "name": "ItsN0tTheB0at",
                    "url": "https://www.reddit.com/user/ItsN0tTheB0at"
                }
            ]
        },
        {
            "id": "1kfg9ax",
            "url": "/r/nba/comments/1kfg9ax/gregg_popovich_im_no_longer_a_coach_im_el_jefe/",
            "external_url": "https://streamable.com/fwydbu",
            "title": "Gregg Popovich: \"I'm no longer a coach. I'm El Jefe.\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/fwydbu\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-05T16:40:24+00:00",
            "authors": [
                {
                    "name": "urfaselol",
                    "url": "https://www.reddit.com/user/urfaselol"
                }
            ]
        },
        {
            "id": "1kfftka",
            "url": "/r/nba/comments/1kfftka/greg_popovich_speaking_publicly_for_the_first/",
            "external_url": "https://streamable.com/z8dm4g",
            "title": "Greg Popovich speaking publicly for the first time since suffering his mild stroke in November. Says things have gotten better since his stroke, but ‘not good enough’",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/z8dm4g\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-05T16:22:51+00:00",
            "authors": [
                {
                    "name": "urfaselol",
                    "url": "https://www.reddit.com/user/urfaselol"
                }
            ]
        },
        {
            "id": "1kf00r3",
            "url": "/r/nba/comments/1kf00r3/highlight_draymond_green_with_the_normal_reaction/",
            "external_url": "https://streamable.com/exdv2n",
            "title": "[Highlight] Draymond Green with the normal reaction to the reach-in-foul",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/exdv2n\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-05T01:35:35+00:00",
            "authors": [
                {
                    "name": "DameBucka",
                    "url": "https://www.reddit.com/user/DameBucka"
                }
            ]
        },
        {
            "id": "1keyr20",
            "url": "/r/nba/comments/1keyr20/post_game_thread_the_indiana_pacers_race_to_a_10/",
            "external_url": "https://www.reddit.com/r/nba/comments/1keyr20/post_game_thread_the_indiana_pacers_race_to_a_10/",
            "title": "[Post Game Thread] The Indiana Pacers race to a 1-0 series lead against the Cleveland Cavaliers, 121-112. Tyrese Haliburton orchestrates a balanced attack with 22/3/13, Andrew Nembhard chips in 23 & 6.",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/IND\"></a> <strong>121 -  112</strong> <a href=\"/CLE\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/IND-vs-CLE-0042400201/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>East Conf. Semifinals - Game 1 - Series tied 0-0</strong>|\n|<strong>Location:</strong> Rocket Arena|\n|<strong>Officials:</strong> Zach Zarba, Sean Wright, Tre Maddox, and Gediminas Petraitis|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|\n|Indiana Pacers|36|28|28|29|121|\n|Cleveland Cavaliers|25|33|32|22|112|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Indiana Pacers|121|44-83|53.0%|19-36|52.8%|14-15|93.3%|7|47|30|20|6|16|9|\n|Cleveland Cavaliers|112|45-98|45.9%|9-38|23.7%|13-18|72.2%|13|51|25|16|8|7|1|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/IND\"></a> Indiana Pacers</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Aaron Nesmith^SF|24:37|17|5-8|4-6|3-4|2|6|8|0|0|1|3|5|9|\n|Pascal Siakam^PF|33:40|17|6-15|2-5|3-3|1|6|7|4|1|0|2|1|16|\n|Myles Turner^C|33:06|13|5-9|1-3|2-2|1|11|12|1|3|2|3|3|11|\n|Andrew Nembhard^SG|37:04|23|7-10|5-6|4-4|0|0|0|6|0|0|0|1|21|\n|Tyrese Haliburton^PG|36:11|22|9-15|2-6|2-2|0|3|3|13|1|3|1|1|11|\n|Bennedict Mathurin|23:23|11|4-10|3-5|0-0|2|3|5|1|0|1|1|3|0|\n|Jarace Walker|08:48|2|1-2|0-0|0-0|0|0|0|1|0|0|1|2|-14|\n|T.J. McConnell|15:16|7|3-5|1-1|0-0|0|1|1|2|0|0|2|1|-6|\n|Obi Toppin|14:43|7|3-6|1-2|0-0|1|4|5|2|1|1|2|2|7|\n|Ben Sheppard|07:29|0|0-1|0-1|0-0|0|0|0|0|0|0|0|1|-8|\n|Thomas Bryant|05:42|2|1-2|0-1|0-0|0|2|2|0|0|1|1|0|-2|\n|Tony Bradley|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Johnny Furphy|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|James Johnson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Isaiah Jackson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/CLE\"></a> Cleveland Cavaliers</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Max Strus^SF|31:55|7|2-9|2-8|1-2|2|5|7|3|2|1|0|4|-6|\n|Evan Mobley^PF|35:45|20|9-13|2-5|0-0|4|6|10|2|2|0|4|3|-20|\n|Jarrett Allen^C|30:06|12|6-7|0-0|0-0|1|4|5|1|2|0|1|1|-9|\n|Sam Merrill^SG|17:49|6|2-5|2-5|0-0|1|3|4|4|0|0|0|2|-10|\n|Donovan Mitchell^PG|33:39|33|13-30|1-11|6-9|0|5|5|4|1|0|0|2|-19|\n|Ty Jerome|29:27|21|8-20|1-4|4-5|2|1|3|8|1|0|1|1|10|\n|De'Andre Hunter|30:12|11|4-8|1-2|2-2|1|3|4|1|0|0|1|1|7|\n|Dean Wade|16:04|0|0-2|0-1|0-0|0|3|3|0|0|0|0|2|-1|\n|Isaac Okoro|15:01|2|1-4|0-2|0-0|2|0|2|2|0|0|0|0|3|\n|Darius Garland|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Javonte Green|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Chuma Okeke|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Craig Porter Jr.|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Tristan Thompson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Jaylon Tyson|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-05-05T00:29:19+00:00",
            "authors": [
                {
                    "name": "ItsN0tTheB0at",
                    "url": "https://www.reddit.com/user/ItsN0tTheB0at"
                }
            ]
        },
        {
            "id": "1ke5kvz",
            "url": "/r/nba/comments/1ke5kvz/steve_ballmer_flew_over_120_clippers_fans_to/",
            "external_url": "https://streamable.com/oqal1m",
            "title": "Steve Ballmer flew over 120 Clippers fans to Denver on a charter plane this morning, also covering their tickets and transportation to Game 7. They will be on the side the Nuggets are shooting on the 2nd half, bringing \"The Wall\" to Ball Arena (video via @TomerAzarly, h/t @ramonashelburne)",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 177.778%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/oqal1m\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-05-03T23:01:03+00:00",
            "authors": [
                {
                    "name": "sewsgup",
                    "url": "https://www.reddit.com/user/sewsgup"
                }
            ]
        },
        {
            "id": "1kd4a65",
            "url": "/r/nba/comments/1kd4a65/charania_breaking_gregg_popovich_will_no_longer/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kd4a65/charania_breaking_gregg_popovich_will_no_longer/",
            "title": "[Charania] BREAKING: Gregg Popovich will no longer be Head Coach of the San Antonio Spurs and is transitioning full-time to Team President, sources told ESPN. The iconic Popovich is a Basketball Hall of Famer, the NBA’s all-time winningest coach, and led the Spurs to five championships.",
            "content_html": "<p>[Charania] BREAKING: Gregg Popovich will no longer be Head Coach of the San Antonio Spurs and is transitioning full-time to Team President, sources told ESPN. The iconic Popovich is a Basketball Hall of Famer, the NBA’s all-time winningest coach, and led the Spurs to five championships.  </p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lo76diq7n22u   / https://www.espn.com/contributor/shams-charania/c8da4fb25ff11</p>",
            "date_published": "2025-05-02T15:48:07+00:00",
            "authors": [
                {
                    "name": "mvanigan",
                    "url": "https://www.reddit.com/user/mvanigan"
                }
            ]
        },
        {
            "id": "1kcqbta",
            "url": "/r/nba/comments/1kcqbta/the_detroit_pistons_have_been_eliminated_from_the/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kcqbta/the_detroit_pistons_have_been_eliminated_from_the/",
            "title": "THE DETROIT PISTONS HAVE BEEN ELIMINATED FROM THE 2025 NBA PLAYOFFS",
            "content_html": "<p>After a controversial game 4 ending, Pistons did well to force game 6, but couldn't close game 6. Detroit Pistons are eliminated from the 2025 NBA playoffs by the New York Knicks in 6 games</p>\n<p>Fade em</p>",
            "date_published": "2025-05-02T02:28:23+00:00",
            "authors": [
                {
                    "name": "Nyhrox",
                    "url": "https://www.reddit.com/user/Nyhrox"
                }
            ]
        },
        {
            "id": "1kc0odj",
            "url": "/r/nba/comments/1kc0odj/the_los_angeles_lakers_have_been_eliminated_from/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kc0odj/the_los_angeles_lakers_have_been_eliminated_from/",
            "title": "THE LOS ANGELES LAKERS HAVE BEEN ELIMINATED FROM CHAMPIONSHIP CONTENTION",
            "content_html": "<p>They lose to Anthony Edwards and the 6 seed Timberwolves in 5 games.</p>",
            "date_published": "2025-05-01T04:53:48+00:00",
            "authors": [
                {
                    "name": "edgykitty",
                    "url": "https://www.reddit.com/user/edgykitty"
                }
            ]
        },
        {
            "id": "1kb43oc",
            "url": "/r/nba/comments/1kb43oc/giannis_and_bennedict_mathurin_go_from_hugging_to/",
            "external_url": "https://streamable.com/pmk93f",
            "title": "Giannis and Bennedict Mathurin go from hugging to shoving",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/pmk93f\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-30T01:01:00+00:00",
            "authors": [
                {
                    "name": "sewsgup",
                    "url": "https://www.reddit.com/user/sewsgup"
                }
            ]
        },
        {
            "id": "1kawopg",
            "url": "/r/nba/comments/1kawopg/ktla_lakers_star_luka_dončić_donated_the_entire/",
            "external_url": "https://www.reddit.com/r/nba/comments/1kawopg/ktla_lakers_star_luka_dončić_donated_the_entire/",
            "title": "[KTLA] Lakers star Luka Dončić donated the entire amount requested on a GoFundMe drive to restore a vandalized mural of late Hall of Famer Kobe Bryant and his daughter in downtown Los Angeles.",
            "content_html": "<p>Source: https://ktla.com/news/local-news/beloved-mural-of-kobe-bryant-daughter-gigi-vandalized-in-downtown-los-angeles/</p>\n<p>Lakers star Luka Dončić donated the entire amount requested on a GoFundMe drive to restore a vandalized mural in downtown Los Angeles that was created as a tribute to the team’s late Hall of Famer Kobe Bryant and his daughter Gianna “Gigi” Bryant.</p>\n<p>The mural located on Main Street near West 14th Street was created by artist Louie “Sloe” Motion shortly after Kobe, Gigi and seven others were killed in a helicopter crash in January 2020.</p>\n<p>Video recorded Tuesday morning showed graffiti spray-painted over most of the mural, which had shown the Hall of Fame basketball star kissing his smiling daughter on her head.</p>\n<p>It is unclear exactly when the mural was vandalized or who was responsible</p>\n<p>A GoFundMe requesting $5,000 had been started to raise funds to help restore the iconic mural.</p>\n<p>Later Tuesday morning, GoFundMe Communications Manager Alexandra White reached out to KTLA to say that Dončić had donated the full amount.</p>\n<p>“I saw your news coverage of the vandalism of the Kobe and Gianna Bryant mural in downtown LA. Reaching out to share that Laker Luka Doncic has donated the $5,000 needed to help the mural fundraiser reach its goal!!” White stated in an email.</p>",
            "date_published": "2025-04-29T19:30:59+00:00",
            "authors": [
                {
                    "name": "shreeharis",
                    "url": "https://www.reddit.com/user/shreeharis"
                }
            ]
        },
        {
            "id": "1kacq7o",
            "url": "/r/nba/comments/1kacq7o/tristan_thompson_and_kevin_love_former_teammates/",
            "external_url": "https://streamable.com/u1j36d",
            "title": "Tristan Thompson and Kevin Love, former teammates on the Cavaliers, shared a moment pre-game after Love announced yesterday that his father, Stan, had passed away",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 124.722%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/u1j36d\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-29T01:55:05+00:00",
            "authors": [
                {
                    "name": "Goosedukee",
                    "url": "https://www.reddit.com/user/Goosedukee"
                }
            ]
        },
        {
            "id": "1ka26qn",
            "url": "/r/nba/comments/1ka26qn/charania_just_in_milwaukee_bucks_star_damian/",
            "external_url": "https://www.reddit.com/r/nba/comments/1ka26qn/charania_just_in_milwaukee_bucks_star_damian/",
            "title": "[Charania] Just in: Milwaukee Bucks star Damian Lillard has been diagnosed with a torn left Achilles tendon, sources tell ESPN. MRI today revealed the severity. A devastating end to his season.",
            "content_html": "<p>[Charania] Just in: Milwaukee Bucks star Damian Lillard has been diagnosed with a torn left Achilles tendon, sources tell ESPN. MRI today revealed the severity. A devastating end to his season.  </p>\n<p>Just in: Milwaukee Bucks star Damian Lillard has been diagnosed with a torn left Achilles tendon, sources tell ESPN. MRI today revealed the severity. A devastating end to his season.  </p>\n<p>Source: https://bsky.app/profile/shamsbot.bsky.social/post/3lnve2gn3sk2s</p>",
            "date_published": "2025-04-28T18:03:47+00:00",
            "authors": [
                {
                    "name": "mvanigan",
                    "url": "https://www.reddit.com/user/mvanigan"
                }
            ]
        },
        {
            "id": "1k9cncf",
            "url": "/r/nba/comments/1k9cncf/highlight_final_possession_of_the_knicks_and/",
            "external_url": "https://streamable.com/xtdddn",
            "title": "[Highlight] Final possession of the Knicks and Pistons game. Pistons miss 2 shots and the Knicks win! Pistons are furious that no foul was called.",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/xtdddn\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-27T19:45:59+00:00",
            "authors": [
                {
                    "name": "VGstuffed",
                    "url": "https://www.reddit.com/user/VGstuffed"
                }
            ]
        },
        {
            "id": "1k8rooc",
            "url": "/r/nba/comments/1k8rooc/highlight_gordon_throws_down_jokics_miss_right_at/",
            "external_url": "https://streamable.com/zi6rkl",
            "title": "[Highlight] Gordon throws down Jokic's miss right at the buzzer for the win!",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/zi6rkl\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-27T00:45:05+00:00",
            "authors": [
                {
                    "name": "JilJungJukk",
                    "url": "https://www.reddit.com/user/JilJungJukk"
                }
            ]
        },
        {
            "id": "1k8lqan",
            "url": "/r/nba/comments/1k8lqan/highlight_ja_morant_puts_his_hand_up_because_he/",
            "external_url": "https://streamable.com/655iwt",
            "title": "[Highlight] Ja Morant puts his hand up because he didn't want to be on camera so TNT just switches the camera and angle",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 56.25%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/655iwt\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-26T19:58:46+00:00",
            "authors": [
                {
                    "name": "NokCha_",
                    "url": "https://www.reddit.com/user/NokCha_"
                }
            ]
        },
        {
            "id": "1k84mb6",
            "url": "/r/nba/comments/1k84mb6/post_game_thread_the_minnesota_timberwolves/",
            "external_url": "https://www.reddit.com/r/nba/comments/1k84mb6/post_game_thread_the_minnesota_timberwolves/",
            "title": "[Post Game Thread] The Minnesota Timberwolves defeat the Los Angeles Lakers, 116-104, to take a 2-1 series lead behind Jaden McDaniels's 30/5 and Ant's 29/8/8",
            "content_html": "<p>||\n|:-:|\n|<a href=\"/LAL\"></a> <strong>104 -  116</strong> <a href=\"/MIN\"></a>|\n|<strong>Box Scores: <a href=\"http://www.nba.com/game/LAL-vs-MIN-0042400163/box-score\">NBA</a> - <a href=\"https://sports.yahoo.com/nba/scoreboard/\">Yahoo</a></strong>|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>GAME SUMMARY</strong>|\n|<strong>West First Round - Game 3 - Series tied 1-1</strong>|\n|<strong>Location:</strong> Target Center|\n|<strong>Officials:</strong> Tony Brothers, Mark Lindsay, Gediminas Petraitis, and Andy Nagy|</p>\n<p>|<strong>Team</strong>|<strong>Q1</strong>|<strong>Q2</strong>|<strong>Q3</strong>|<strong>Q4</strong>|<strong>Total</strong>|\n|:---|:--|:--|:--|:--|:--|\n|Los Angeles Lakers|26|32|26|20|104|\n|Minnesota Timberwolves|32|22|32|30|116|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>TEAM STATS</strong>|</p>\n<p>|<strong>Team</strong>|<strong>PTS</strong>|<strong>FG</strong>|<strong>FG%</strong>|<strong>3P</strong>|<strong>3P%</strong>|<strong>FT</strong>|<strong>FT%</strong>|<strong>OREB</strong>|<strong>TREB</strong>|<strong>AST</strong>|<strong>PF</strong>|<strong>STL</strong>|<strong>TO</strong>|<strong>BLK</strong>|\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n|Los Angeles Lakers|104|37-78|47.4%|17-40|42.5%|13-20|65.0%|7|49|21|23|5|16|7|\n|Minnesota Timberwolves|116|44-91|48.4%|13-36|36.1%|15-21|71.4%|9|52|24|19|10|8|5|</p>\n<p>||\n|:-:|\n|&nbsp;|\n|<strong>PLAYER STATS</strong>|</p>\n<p>||||||||||||||||\n|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|:--|\n<strong><a href=\"/LAL\"></a> Los Angeles Lakers</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Rui Hachimura^SF|37:37|8|3-7|2-4|0-0|0|4|4|2|1|1|3|5|-19|\n|LeBron James^PF|41:09|38|13-21|5-9|7-10|3|7|10|4|2|2|1|0|-10|\n|Jaxson Hayes^C|08:42|2|1-2|0-0|0-0|1|0|1|0|0|0|0|1|-13|\n|Austin Reaves^SG|41:03|20|7-18|5-11|1-2|1|6|7|4|0|1|4|3|-16|\n|Luka Dončić^PG|39:58|17|6-16|2-8|3-4|0|7|7|8|1|1|5|3|-16|\n|Dorian Finney-Smith|28:36|8|3-6|2-4|0-0|1|0|1|2|0|0|2|3|3|\n|Gabe Vincent|15:50|5|2-3|1-2|0-0|0|1|1|1|0|0|0|1|-3|\n|Jarred Vanderbilt|12:39|3|1-1|0-0|1-2|0|5|5|0|0|1|1|5|5|\n|Jordan Goodwin|11:48|3|1-3|0-1|1-2|1|1|2|0|1|1|0|2|9|\n|Dalton Knecht|00:38|0|0-1|0-1|0-0|0|0|0|0|0|0|0|0|0|\n|Bronny James|00:38|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Shake Milton|00:38|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Alex Len|00:38|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Markieff Morris|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Maxi Kleber|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n<strong><a href=\"/MIN\"></a> Minnesota Timberwolves</strong>|<strong>MIN</strong>|<strong>PTS</strong>|<strong>FGM-A</strong>|<strong>3PM-A</strong>|<strong>FTM-A</strong>|<strong>ORB</strong>|<strong>DRB</strong>|<strong>REB</strong>|<strong>AST</strong>|<strong>STL</strong>|<strong>BLK</strong>|<strong>TO</strong>|<strong>PF</strong>|<strong>±</strong>|\n|Jaden McDaniels^SF|38:13|30|13-22|1-5|3-4|3|2|5|1|2|0|1|2|11|\n|Julius Randle^PF|40:57|22|6-13|1-4|9-10|0|5|5|4|1|0|2|2|11|\n|Rudy Gobert^C|25:23|1|0-0|0-0|1-4|1|2|3|1|2|1|1|2|3|\n|Anthony Edwards^SG|42:18|29|12-26|5-10|0-0|2|6|8|8|2|1|2|2|13|\n|Mike Conley^PG|21:01|9|4-6|1-1|0-0|1|2|3|4|1|0|0|2|6|\n|Donte DiVincenzo|30:43|10|4-13|2-8|0-0|1|4|5|4|1|3|1|4|5|\n|Naz Reid|27:27|11|4-7|2-5|1-1|1|5|6|0|0|0|0|4|10|\n|Nickeil Alexander-Walker|13:56|4|1-4|1-3|1-2|0|3|3|2|1|0|1|1|1|\n|Jaylen Clark|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Luka Garza|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Joe Ingles|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Leonard Miller|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Josh Minott|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Terrence Shannon Jr.|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|\n|Rob Dillingham|00:00|0|0-0|0-0|0-0|0|0|0|0|0|0|0|0|0|</p>",
            "date_published": "2025-04-26T04:28:50+00:00",
            "authors": [
                {
                    "name": "edgykitty",
                    "url": "https://www.reddit.com/user/edgykitty"
                }
            ]
        },
        {
            "id": "1k7m0wb",
            "url": "/r/nba/comments/1k7m0wb/reporter_when_20000_people_are_chanting_that_at/",
            "external_url": "https://streamable.com/dggnmk",
            "title": "Reporter: \"When 20,000 people are chanting that at you–\"\n\nJalen: \"Chanting what?\"\n\nReporter: \"I think you heard it”\n\nKAT: \"I didn't hear it\"\n\nJalen and KAT: \"Say it. Say it.\"\n\nReporter:\"It's a PG show\"\n\nKAT: \"This is a show?\"\n\nReporter: \"I don’t know\"\n\nKAT: \"Tryna say there's a script? That's crazy\"",
            "content_html": "<div><br></div><div style=\"width: 100%; height: 0px; position: relative; padding-bottom: 100.0%;\"><iframe class=\"streamable-embed\" src=\"https://streamable.com/o/dggnmk\" frameborder=\"0\" scrolling=\"no\" style=\"width: 100%; height: 100%; position: absolute;\" allowfullscreen></iframe></div>",
            "date_published": "2025-04-25T14:15:59+00:00",
            "authors": [
                {
                    "name": "justletmeregisteryou",
                    "url": "https://www.reddit.com/user/justletmeregisteryou"
                }
            ]
        }
    ]
}