{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nba",
    "description": "A subreddit dedicated to NBA news and discussion.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nba.json",
    "icon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "favicon": "https://styles.redditmedia.com/t5_2qo4s/styles/communityIcon_1podsfdai4301.png",
    "items": [
        {
            "id": "oo3mfh",
            "url": "/r/nba/comments/oo3mfh/oc_the_earliest_mentions_and_thoughts_of/",
            "external_url": "https://www.reddit.com/r/nba/comments/oo3mfh/oc_the_earliest_mentions_and_thoughts_of/",
            "title": "[OC] The earliest mentions and thoughts of Middleton on r/nba",
            "content_html": "<p>As a followup to <a href=\"https://www.reddit.com/r/nba/comments/onfggx/oc_the_earliest_mentions_and_thoughts_of_giannis/\">my post compiling some of the earliest takes on Giannis</a>, once again I'm back on my quest to find takes without any recency bias - this time about Middleton.</p>\n<p>As well as looking at takes from before and after the draft, I thought I'd also compile some of r/nba's thoughts on the famous Bucks/Pistons trade where Middleton was a throw-in.</p>\n<p><strong>BEFORE THE DRAFT</strong></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/tzxrh/what_sort_of_moves_should_the_bobcats_make_to/c4r5p63?utm_source=share&amp;utm_medium=web2x&amp;context=3\">The very first comment</a> including Middleton was a month before the draft, on a post about moves the Charlotte Bobcats (now, of course, known as the Hornets) needed to take to improve.</p>\n<p>If you wanted a reminder of how awful the Bobcats were, I'd give the comment a read, the now deleted account absolutely shits on them going through how terrible the entire roster is. The commenter doesn't go into much detail about Middleton, only briefly including him as a prospect to play backup SG/SF. Despite that, its the very first comment including him whatsover on r/nba so it earns a place here.</p>\n<p>The first comment actually <em>focused</em> on Middleton is from two weeks before the draft, where what I assume was a Thunder fan comments on a post asking about what player they think their team will draft: <a href=\"https://www.reddit.com/r/nba/comments/v5ix1/who_do_you_think_your_team_will_draft/c51n4e6?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"We really need someone who can come off the bench for KD who is an actual SF. Not a tweener, but a swingman. </a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/v5ix1/who_do_you_think_your_team_will_draft/c51n4e6?utm_source=share&amp;utm_medium=web2x&amp;context=3\">I'm thinking Khris Middleton from Texas A&amp;M. He appears that he would fit pretty well in this system.\"</a></p>\n<p><strong>AFTER THE DRAFT</strong></p>\n<p>The first mention of him after the draft is someone confused about <a href=\"https://www.reddit.com/r/nba/comments/vqrxl/game_thread_2012_nba_draft/c573ozl?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Why Khris Middleton with Doron Lamb, Tyshawn Taylor, and Darius Miller still on the board?\"</a></p>\n<p>In case you're wondering about the fate of those players, Doron Lamb was waived in 2014 and is playing basketball in Europe, Tyshawn Taylor was used by legendary Mavs coach Jason Kidd to get a free timeout by <a href=\"https://www.youtube.com/watch?v=vEqU7JHkfu0\">bumping into him</a> and then waived, and Darius Miller was infamously a walking TPE, although probably the best player out of the three.</p>\n<p>Some more serious draft analysis had him pegged as <a href=\"https://www.reddit.com/r/nba/comments/vsvmf/can_someone_post_this_insider_draft_grades/c57bun6?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"a smooth scorer with a great midrange game\"</a>. It's a nice read and seeing the optimism about MKG was a blast of nostalgia.</p>\n<p><strong>THE TRADE</strong></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdllz/knight_middleton_and_krastov_to_be_traded_to_the/\">The trade thread</a>.</p>\n<p>To sum up the comments in a nutshell - the name Middleton is mentioned six times and half of those are jokes about Kate Middleton.</p>\n<p>If you ever needed proof Middleton was a throw-in in the trade here it is. Pretty much all of the discussion being had is about Knight/Jennings, although there are a few takes that have aged alarmingly well.</p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdllz/knight_middleton_and_krastov_to_be_traded_to_the/cbdm1b7?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"I have a feeling this one is gonna bite the Pistons in the ass.\"</a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdllz/knight_middleton_and_krastov_to_be_traded_to_the/cbdu1l3?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"I think the steal of this trade might have been Khris Middleton. He had flashes last year as a rookie in limited minutes, and if the Bucks learned anything from losing Tobias Harris, it's gonna be to play their youngsters like John Henson and Khris very heavily to see what they are truly capable of.\"</a></p>\n<p>Funnily enough the person who made the comment, /u/noworldforeric also had <a href=\"https://www.reddit.com/r/nba/comments/1euzhs/here_is_my_first_round_2013_nba_mock_draft_rnba/ca40cgd?utm_source=share&amp;utm_medium=web2x&amp;context=3\">a great take on Giannis</a> that ended up in my last post as well, what a visionary. Wonder if we'll be seeing any other takes from him later on in this series...</p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdllz/knight_middleton_and_krastov_to_be_traded_to_the/cbdmg9i?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Middleton is gonna be dope, I wonder if Bucks will figure that out\"</a></p>\n<p>Aside from that, the thread is just discussion about the Pistons so unless you're in the mood for takes about the Pistons that have aged terribly I wouldn't recommend going through it.</p>\n<p>&#x200B;</p>\n<p><strong>Some takes around the trade that have aged well</strong></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jkqp2/is_it_possible_for_both_teams_to_win_the/cbfx4ip?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"As a Pistons fan, you should be more excited about the extra pieces in this trade than BK.</a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jkqp2/is_it_possible_for_both_teams_to_win_the/cbfyej8?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Middleton could be the best player out of this entire trade. He has a shit on of \"Arron Afflalo\" potential. He's a guy Pistons fans were very excited about. Like I've said, he could very well be the steal of this trade.\"</a></p>\n<p>Both takes seem to be from the same (now deleted) account, although no way to confirm.</p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdzo7d?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Middleton might end up being the best thing the Bucks got back and I'd hazard to guess less than 10% of r/nba knows who he is.\"</a></p>\n<p>That percentage is probably in the high nineties now.</p>\n<p>&#x200B;</p>\n<p>From a thread about the Bucks being in the prime position to tank after the trade: <a href=\"https://www.reddit.com/r/nba/comments/1jdsru/did_the_bucks_just_elevate_themselves_to_top/cbdv6gq?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Dont sleep on Middleton, they were comparing him to Jimmy Butler/Paul George/Kawhi Leonard </a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdsru/did_the_bucks_just_elevate_themselves_to_top/cbdv6gq?utm_source=share&amp;utm_medium=web2x&amp;context=3\">he can grow into something really great, hes got the tools.\"</a></p>\n<p>Also the same user - /u/aboycandream - who made the \"Middleton is gonna be dope\" comment in the trade thread.</p>\n<p>\"</p>\n<blockquote>\n<p>Pistons in 6</p>\n</blockquote>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdltxj?utm_source=share&amp;utm_medium=web2x&amp;context=3\">...years will be wishing offeason 2013 didn't happen\"</a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdn9rd?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"i was saying 6 years because we'll have plenty of time to think about the what-ifs. We (as a fan base) STILL complain about Darko and thats been about 10years and has no effect on us today. lol. Just because it has no effect in 6years doesn't mean we won't look back and wish it didn't happen.\"</a></p>\n<p>Can a Piston fan confirm?</p>\n<p>&#x200B;</p>\n<p><strong>Some takes around the trade that have aged awfully</strong></p>\n<p>The comment thread replying to the comment above has aged pretty terribly, with the two highlights being:</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdmxfc?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"This trade will have no effect on our team in 6 years, and if it does it can only be positive.\"</a></p>\n<p>and</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdovkx?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Middleton was looking good but he probably won't end up being more than a nice role player. He's somebody we can easily replace.\"</a></p>\n<p>yeah...</p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jg3w2/get_to_know_a_new_buck_brandon_knight/cbejr7m?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"I'm also not nearly as high on Middleton as this sub apparently is. I doubt he'll ever play serious minutes for any NBA team.\"</a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jdjg0/jennings_likely_to_detriot_via_sign_and_trade/cbdmcsr?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"Brandon Knight, Khris Middleton, and Slava. So basically just BK and 2 guys who won't make the Bucks roster.\"</a></p>\n<p>Funnily enough, once again both these takes are from a user that also featured in my Giannis post <a href=\"https://www.reddit.com/r/nba/comments/1fnklc/2013_rnba_mock_draft_15_picks_milwaukee_bucks/cac9lny?utm_source=share&amp;utm_medium=web2x&amp;context=3\">who predicted that he would be a huge star</a>.</p>\n<p>Honestly I'd say this is the perfect example of how much luck goes into these predictions. Someone with one of the best takes on Giannis also had terrible takes on Middleton, just because of how variable and random trying to predict the potential/ceiling of a player is.</p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jtpea/brandon_knight_and_khris_middleton_pose_in_front/cbiwype?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"I honestly don't know how Middleton made to the NBA. He was so disappointing to watch at A&amp;M. </a></p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jtpea/brandon_knight_and_khris_middleton_pose_in_front/cbiwype?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Who knows though, maybe he'll be the next Deandre Jordan.\"</a></p>\n<p>Honestly at this point I don't even remember what the consensus on Deandre Jordan was, so if someone could offer an explanation as to what they meant that would be great. Either way first part is just weird given he was on the watchlist for the Wooden Award in college and unanimous addition to the All-Big 12 team.</p>\n<p><strong>EDIT:</strong> An explanation from /u/nibbinoo8 and /u/BEE_REAL_ :</p>\n<p>Deandre Jordan also went to Texas A&amp;M and was seen as a complete disappointment, but managed to be a great player anyways, so he was suggesting that there was a chance Middleton would have a similar career path. </p>\n<p>&#x200B;</p>\n<p><a href=\"https://www.reddit.com/r/nba/comments/1jlyth/what_move_has_your_team_made_in_the_past_few/cbg7nwz?utm_source=share&amp;utm_medium=web2x&amp;context=3\">\"I loved that trade. We didn't give up any picks or expiring contracts, and Middleton and Kravstov weren't going to do much of anything. It was effectively a straight up Knight for Jennings trade, and Knight's super turnover prone. Sure, Jennings is immature, but he's still an upgrade over what we had before. It's like Joe D's brain is finally working again\"</a></p>\n<p>Well uh, he was right about Kravstov I guess?</p>\n<p><strong>NEXT UP</strong></p>\n<p>The next players I'll be doing (in order of appearance according to requests) are Jokic, Draymond, Steph, Gobert and then finally a brief compilation of meme/fan favourite players like Caruso and Tacko.</p>\n<p>Any other suggestions/feedback are welcome!</p>",
            "date_published": "2021-07-20T14:55:05+00:00",
            "authors": [
                {
                    "name": "A808Ag",
                    "url": "https://www.reddit.com/user/A808Ag",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_15_24A0ED.png"
                }
            ]
        },
        {
            "id": "oo3vsi",
            "url": "/r/nba/comments/oo3vsi/woo_much_of_the_chatter_ive_heard_the_past_couple/",
            "external_url": "https://www.reddit.com/r/nba/comments/oo3vsi/woo_much_of_the_chatter_ive_heard_the_past_couple/",
            "title": "[Woo] Much of the chatter I’ve heard the past couple weeks has suggested that the Rockets prefer Green to Evan Mobley at this spot. For what it’s worth, Green’s camp is thought to prefer Houston as a destination, rather than landing in Cleveland one pick later.",
            "content_html": "<p>Source: https://www.si.com/nba/2021/07/20/nba-mock-draft-cade-cunningham-evan-mobley-jalen-green</p>\n<blockquote>\n<p>Much of the chatter I’ve heard the past couple weeks has suggested that the Rockets prefer Green to Evan Mobley at this spot. There have been reports in recent weeks that Houston has interest in trading up with Detroit to take Cunningham, but the vast majority of speculation from other teams has centered on Green as the presumptive fit at No. 2. His ability to create his own shot gives him a chance to be a legitimate offensive fulcrum, and the Rockets are positioned to take a swing on upside. For what it’s worth, Green’s camp is thought to prefer Houston as a destination, rather than landing in Cleveland one pick later. Devin Booker’s evolution from promising scorer into a well-rounded perimeter centerpiece provides a blueprint for Green’s development, with his exceptional athleticism giving him major upside.</p>\n</blockquote>",
            "date_published": "2021-07-20T15:08:00+00:00",
            "authors": [
                {
                    "name": "nonbiasednbafan",
                    "url": "https://www.reddit.com/user/nonbiasednbafan",
                    "avatar": "https://styles.redditmedia.com/t5_3ginor/styles/profileIcon_snooe162fcdc-8737-4e6d-ba40-9927a35bad58-headshot.png"
                }
            ]
        },
        {
            "id": "oo58u9",
            "url": "/r/nba/comments/oo58u9/shannon_sharpe_on_giannis_antetokounmpo_for_a_guy/",
            "external_url": "https://streamable.com/282dh2",
            "title": "Shannon Sharpe on Giannis Antetokounmpo: “For a guy that can’t, can’t, can’t, can’t, he’s a two-time league MVP, a defensive player of the year, and he’s on the cusp of winning the title and being finals MVP. That’s a hell of an accomplishment for a guy that’s got a lot of cants.”",
            "content_html": "<p>See the linked content on <a href='https://streamable.com/282dh2'>streamable.com</a>.</p>",
            "date_published": "2021-07-20T16:15:18+00:00",
            "authors": [
                {
                    "name": "Jayveesac",
                    "url": "https://www.reddit.com/user/Jayveesac",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_17_46D160.png"
                }
            ]
        }
    ]
}