{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nyknicks",
    "description": "Reddit's home of the New York Knicks",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nyknicks.json",
    "icon": "https://styles.redditmedia.com/t5_2rur5/styles/communityIcon_0x7gbsd4rb211.png",
    "favicon": "https://styles.redditmedia.com/t5_2rur5/styles/communityIcon_0x7gbsd4rb211.png",
    "items": [
        {
            "id": "osw03q",
            "url": "/r/NYKnicks/comments/osw03q/summer_wish_list_offseason_strategy/",
            "external_url": "https://www.reddit.com/r/NYKnicks/comments/osw03q/summer_wish_list_offseason_strategy/",
            "title": "Summer wish list. Off-season strategy.",
            "content_html": "Open in: [Apollo](apollo:///r/NYKnicks/comments/osw03q/summer_wish_list_offseason_strategy/) | [Reddit](/r/NYKnicks/comments/osw03q/summer_wish_list_offseason_strategy/)<br/><p>So I’m beginning my summer/draft routine of mapping out fairy tale trades to shore up the Knicks. After a great season, I really think this summer is absolutely crucial. </p>\n<p>The Knicks are armed with the most available cap and 4 1st over the next two years. </p>\n<p>While Dame is incredible, I have a few concerns: </p>\n<p>A. Salary he makes a dick ton of money. Jul will be getting a max therefore it will complicate things going forward. \nB. Age - dame plays A LOT and is no spring chicken. While an incredible shooter he also is a cutter and relies on his athleticism. Mortgaging your future for a guy who’s on the wrong side of 30 sits poorly with me. </p>\n<p>Proposition - Fred Van Vleet - bulldog mentality, deadeye shooter and the perfect team first guy. \nHowever I can’t get salaries to work due to well the Knicks lack of controlled roster spots. However I think a trade for obi along with a few picks is more then fair value if you consider Van Vleet to be a rung below or at the Jrue Holliday level of player. (MIL overpaid because they neededw to shed Bledsoes deal.) </p>\n<p>Onwards - Buddy heild \nWhile on a bloated contract he’s another guy with a positive work ethic. A bit older but I think that’s a good thing in a thib system. Provides the much needed off ball scoring and legitimate perimeter threat. The kings look to be intent on resigning Holmes as well as trading bagley. Knicks also could use some front court depth even if it means taking a flyer on Bagley. Now I’m not sure if this is how RFA rules work but if the kings rescind their rights to Holmes and agree on a sign and trade the Knicks could pry Heild at a discount which could be a perfect fit. </p>\n<p>Otherwise resigning Rose is obviously important. Along with getting some more shooting like Norm Powell or Gary Trent. Or both. </p>\n<p>As far as the draft goes if Duarte falls to 19/21 you absolutely take that guy in a heartbeat. </p>\n<p>Right now we need to kick it into gear because a window is opening. I just don’t think going balls to the wall for a “superstar” is the proper strategy.</p>\n<p>As tempting as Dame is I feel like we’ve been down this road. Plus this would need to likely be a mid season trade in order to make salaries work which seems troublesome.</p>",
            "date_published": "2021-07-27T21:46:36+00:00",
            "authors": [
                {
                    "name": "fatrickchewing",
                    "url": "https://www.reddit.com/user/fatrickchewing",
                    "avatar": "https://www.redditstatic.com/avatars/avatar_default_03_A06A42.png"
                }
            ]
        },
        {
            "id": "0",
            "url": "https://www.reddit.com/r/nyknicks",
            "title": "r/nyknicks has been launched!",
            "content_html": "<p>This feed will be populated as posts match the given criteria.</p>"
        }
    ]
}