{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/nyknicks",
    "home_page_url": "https://jonathanlaniado.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/nyknicks.json",
    "items": [
        {
            "id": "okxpuw",
            "url": "https://i.redd.it/wgd79jisweb71.png",
            "title": "Read the last part and keep it that way.... Impression Knicks had no interest in including RJ Barrett in trades",
            "content_text": "",
            "authors": [
                "TheHomieKhan"
            ]
        },
        {
            "id": "okycx7",
            "url": "https://i.redd.it/dydq2lyi2fb71.jpg",
            "title": "If you look at the numbers, Sexton numbers during reg season is very similar to Trae Young, and he shoots a higher Fg%. Why are people so hesitant to trade for him ?",
            "content_text": "",
            "authors": [
                "harlem50"
            ]
        },
        {
            "id": "okys8c",
            "url": "https://i.redd.it/5ye5zmideeb71.jpg",
            "title": "Happy bday to Knicks legend LUUUUKE",
            "content_text": "",
            "authors": [
                "hujikolp1"
            ]
        },
        {
            "id": "okyzrn",
            "url": "https://www.reddit.com/r/NYKnicks/comments/okyzrn/ian_baeglys_article_on_a_possible_sexton_trade/",
            "title": "Ian Baegly’s article on a possible Sexton trade.",
            "content_text": "The most important info in this article was: “One other note: People in touch with the Knicks recently came away with the impression that New York had little interest in including Barrett in any trades.” ❤️❤️🤌🏽\nAlso, he said that the Cavs want a veteran on a multi-year contract in return that can help them win immediately, I really wanted this kid but it doesn’t look like it’s going to happen because we can’t offer that. \n\nEDIT: Veteran on a “multi-year contract”",
            "authors": [
                "SoulFinders"
            ]
        },
        {
            "id": "okzrf9",
            "url": "https://www.reddit.com/r/NYKnicks/comments/okzrf9/fa_target_wings/",
            "title": "FA Target Wings",
            "content_text": "To shift focus from the PG rumors around Sexton who do you think would be good FA wings we should target. Personally Id like to target someone where we can get great value for similiar to how we signed Reggie  2 years ago to a 2yr/8M contract. The Two guys Id like to target is Nicolas Batum or Otto Porter Jr. Two guys who give us size at the wing position and also othat can play the 4. Batum was playing on the vet min in LA and Porter is coming off a being injuried last season. I wouldn't mind snagging either of them on a 2 yr deal averaging 5-8M.",
            "authors": [
                "GoldenBoyRecords"
            ]
        },
        {
            "id": "ol0npu",
            "url": "https://www.basketballnews.com/stories/examining-potential-landing-spots-for-dejounte-murray",
            "title": "Dejounte Murray possibly available",
            "content_text": "",
            "authors": [
                "Immediatewhaffle"
            ]
        },
        {
            "id": "ol2cmi",
            "url": "https://empiresportsmedia.com/new-york-knicks/report-knicks-rj-barrett-untouchable-cavs-seek-veteran-for-collin-sexton/",
            "title": "Report: Knicks' RJ Barrett 'untouchable', Cavs seek veteran for Collin Sexton – Empire Sports Media",
            "content_text": "",
            "authors": [
                "score03"
            ]
        },
        {
            "id": "ol3r8m",
            "url": "https://nypost.com/2021/07/14/collin-sexton-may-embrace-knicks-trade-avery-johnson/amp/",
            "title": "Is any other team interested in Collin Sexton trade? Who are the Knicks bidding against if they pursue the point guard?",
            "content_text": "",
            "authors": [
                "whoodoezthat"
            ]
        },
        {
            "id": "ol4uuk",
            "url": "https://bleacherreport.com/articles/2945870-knicks-sleeper-prospects-to-target-in-2021-nba-draft",
            "title": "[Bleacher Report] Knicks Sleeper Prospects to Target in 2021 NBA Draft",
            "content_text": "",
            "authors": [
                "evan843"
            ]
        },
        {
            "id": "ol57gq",
            "url": "https://nypost.com/2021/07/15/kevin-knox-could-be-key-to-knicks-collin-sexton-trade/",
            "title": "Kevin Knox could be key to Knicks-Collin Sexton trade",
            "content_text": "",
            "authors": [
                "Mr_Mashup"
            ]
        },
        {
            "id": "ol65eh",
            "url": "https://www.reddit.com/r/NYKnicks/comments/ol65eh/anyone_have_a_list_of_guys_the_knicks_worked_out/",
            "title": "Anyone have a list of guys the Knicks worked out with so far",
            "content_text": "Title",
            "authors": [
                "joshuagreen38"
            ]
        },
        {
            "id": "ol6naq",
            "url": "https://youtu.be/W5gz3vIIhkw",
            "title": "With all the Sexton rumors going around, I thought it would be good to remind people that he scored 40 in a 3v5 college game.",
            "content_text": "",
            "authors": [
                "Its_Mike_Nasty"
            ]
        },
        {
            "id": "ol70ti",
            "url": "https://www.reddit.com/r/NYKnicks/comments/ol70ti/people_complaining_bout_sexton_4_assist_a_game/",
            "title": "People complaining bout Sexton 4 assist a game",
            "content_text": "Y'all do realize he was on bad team and Garland only avg 6 per game for career. I can pass you ball 50 times but if my team goes 4/50 then that's 4 assist a game. Y'all do realize Curry avg 5.8 last year so why is he bad pick up?",
            "authors": [
                "Moneybag25"
            ]
        },
        {
            "id": "ol81bl",
            "url": "https://i.redd.it/yqrz7sjtohb71.jpg",
            "title": "Immanuel Quickley",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "ol91ei",
            "url": "https://www.reddit.com/r/NYKnicks/comments/ol91ei/whats_the_bet_sexton_to_the_knicks_doesnt_happen/",
            "title": "What's the bet 'Sexton to the Knicks' doesn't happen?",
            "content_text": "All this talk and hype around the Sexton signing/trade right now...I'm willing to put money down that it doesn't happen.\n\nCleveland, media and the fans (mostly here) are going nuts on this and it's only showing increased interest in a player they (potentially) are willing to let go off.\n\nI'm guessing Sexton ends up in Miami but we could also get pleasantly surprised with the front office and some shifty moves.",
            "authors": [
                "DrEthanCanmore"
            ]
        },
        {
            "id": "olef5c",
            "url": "https://www.nba.com/stats/draft/combine-anthro/",
            "title": "If you’re interested in the draft combine stats and measurements, here’s the link",
            "content_text": "",
            "authors": [
                "AnimalMotif"
            ]
        },
        {
            "id": "olfbq0",
            "url": "https://twitter.com/alderalmo/status/1415769106775777280?s=21",
            "title": "Sharife Cooper on #Knicks radar, per @IanBegley. As of last Friday, there was no scheduled workout or interview yet with the Knicks according to a source privy of Cooper’s schedule. Let’s see how this plays out.",
            "content_text": "",
            "authors": [
                "ShMp11Nesis"
            ]
        },
        {
            "id": "olfgfc",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olfgfc/daily_discussion_thread_july_16/",
            "title": "Daily Discussion Thread - (July 16)",
            "content_text": "Daily discussion thread for Knicks fans.",
            "authors": [
                "nyknicks-automod"
            ]
        },
        {
            "id": "olhhbs",
            "url": "https://twitter.com/TrueHoop/status/1416031164100489231",
            "title": "[Henry Abbott]: Source: Blazers star Damian Lillard to request trade in the days to come.",
            "content_text": "",
            "authors": [
                "7LineArmy"
            ]
        },
        {
            "id": "olhpbz",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olhpbz/tre_mann_and_kai_jones_pick_19_and_21/",
            "title": "Tre Mann and Kai Jones (Pick 19 and 21)",
            "content_text": "Would you be happy with this haul for the Knicks?\n\n[https://twitter.com/LDCHoops/status/1415999739997347847?s=20](https://twitter.com/LDCHoops/status/1415999739997347847?s=20)",
            "authors": [
                "lilbeastx"
            ]
        },
        {
            "id": "olhvp3",
            "url": "https://twitter.com/grantafseth/status/1416038425539579910?s=21",
            "title": "Grant Afseth: Trail Blazers superstar Damian Lillard has his eyes on the New York Knicks among trade destinations in the event he were to be dealt, per a source.",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "oli60i",
            "url": "https://www.reddit.com/r/NYKnicks/comments/oli60i/go_after_colin_sexton/",
            "title": "Go after Colin Sexton?",
            "content_text": "I like this as a potential trade. We need a starting PG and Sexton will fit in NY. He’s young, fast and has shown he can shoot with a decent 3-ball at 39%. Elf doesn’t fit, DRose would be a decent back-up and IQ can fill the role of a PG/SG. Sexton won’t cost us the entire team or our young chips like RJ, who I consider untouchable. Maybe they lure him with the two first rounders and Obi, whose only going to be a back-up to Julius. If they want to throw in Elf or Burks in the mix, I’m fine with that as I think Bullock is a better defender then Alec. \n\nThe D Lil trade talk for me, is too much. Knicks trading away all of their young talent, like RJ and/or Mitch plus all of their draft capital for     a soon to be 32 year old seems like old Knicks. Go for the home run and strike out. Not saying I wouldn’t take Lilliard, he’s a superstar, but he’ll cost us part of the future and franchise.",
            "authors": [
                "DanDash34"
            ]
        },
        {
            "id": "oli8f7",
            "url": "https://www.reddit.com/r/NYKnicks/comments/oli8f7/the_truth_about_sexton/",
            "title": "The truth about Sexton",
            "content_text": "Guys, something has occurred to me in regards to our possible future floor general.\n\nI could be wrong but upon inspection, his last name starts with the word Sex.\n\nNow don’t get me wrong, I’m a fan of it as much as the next guy and I’d definitely love to have som- sorry, I’d love to have him on the team. But, at least where I live, it is illegal to trade for sex. This will change someday I’m sure but I dunno about it happening in time for opening night.\n\nSo alas, I think we’ll have to pass. It’s not worth a solicitation charge. But it’s all good, I think Brandon Jennings should be available for pretty cheap! Things are still looking up!",
            "authors": [
                "UrMumsPhatArse"
            ]
        },
        {
            "id": "olisgj",
            "url": "https://mobile.twitter.com/theathletic/status/1416046211325329413?s=21",
            "title": "[The Athletic] The Knicks are looking to package their two first-round picks to move up in the draft, possibly into the mid-lottery, sources tell @talkhoops",
            "content_text": "",
            "authors": [
                "kaptainkru"
            ]
        },
        {
            "id": "olj004",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olj004/stay_the_course/",
            "title": "Stay the course",
            "content_text": "I’m probably in the minority here, but I really don’t think we should trade for Dame. If we do, I think we’d have to give up something like 4 first round picks, Obi, IQ, and RJ. Is Dame, Randle, Mitch and and whatever free agents we can get good enough to compete for a title? \n\nUnless one of the free agents is Kawhi, the answer is no. And if we would trade for Dame with the hopes of signing a big free agent next year, why don’t we just wait? \n\nWe could avoid mortgaging our entire future and still sign 1-2 max players next offseason. To me, going into the 2022 offseason stocked with young assets, Randle, and the ability to clear space for someone like Lavine or Beal if he opts out is far more appealing than gambling everything for a chance at a 3 year title window.\n\n(Edit): If there is some way for us to get Dame w/o gutting our entire roster then ok. But that’s a massive “if”",
            "authors": [
                "jordand520"
            ]
        },
        {
            "id": "olj08h",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olj08h/kawhi_likely_miss_half_of_next_season_dame_aint/",
            "title": "Kawhi likely miss half of next season. Dame aint attracting him to NY.",
            "content_text": "Just to help pre-emptively extinguish some of the bullshit rumors...Kawhi is 30 and just had surgery to repair his knee and likely will miss half of next season..So anyone entertaining the idea of trading for Dame then Kawhi as superstar #2, can scratch that nonsense right off your list",
            "authors": [
                "rmccarthy10"
            ]
        },
        {
            "id": "olj1un",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olj1un/with_the_new_dame_news_whats_the_plan/",
            "title": "With the new dame news, what’s the plan?",
            "content_text": "assume optimum trade willingness\n\n[View Poll](https://www.reddit.com/poll/olj1un)",
            "authors": [
                "avrgm"
            ]
        },
        {
            "id": "olklnj",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olklnj/some_thoughts_in_collin_vs_3_other_choices_though/",
            "title": "Some thoughts in Collin vs 3 other choices - Though I will say my tune has not changed much",
            "content_text": "Ayo Dosunmu and Cooper are legitimate looks imo. Kyle Lowry as well.\n\nCooper has the highest ceiling in playmaking passing. Dosunmu is balanced around the midrange, inside drive, and defensive - has elements of Derrick Rose's game.\n\nLowry is an all-time NBA player in defense and playmaking, shooting - age 35 which is still workable (and Villanova blood, culture, High IQ - previous champion). Sharife Cooper still needs to add a few things to his game, and still needs to improve defensively - but is only 18-19, that is a more project route.\n\nThat being said, Colin is the crazy guy and Thibs may possibly be able to harness that craziness (he also has a little history playing against Barrett in Monteverde, in a good sense, you can put two previous enemies together), but there are risks. Sexton is also the guy that seems to like to tangle with Trae , but I'm not sure if that is in a good sense, tough to read that part - but he seems to want to be the prize fighter towards Trae, but once again, can't say if it is in a good sense.",
            "authors": [
                "dannylenwinn"
            ]
        },
        {
            "id": "olkute",
            "url": "https://twitter.com/shamscharania/status/1416077547377512449",
            "title": "More disrespect to Randle",
            "content_text": "",
            "authors": [
                "joshuagreen38"
            ]
        },
        {
            "id": "ollkk9",
            "url": "https://twitter.com/RealQuintonMayo/status/1416071601112616964?s=20",
            "title": "Damian Lillard would like to be traded to the Philadelphia 76ers or New York Knicks, sources tell me.",
            "content_text": "",
            "authors": [
                "steveshotz"
            ]
        },
        {
            "id": "olmarm",
            "url": "https://i.redd.it/9hee0auj6mb71.jpg",
            "title": "How to appropriately judge trade rumors",
            "content_text": "",
            "authors": [
                "CantShootCantDribble"
            ]
        },
        {
            "id": "olmms6",
            "url": "https://twitter.com/bleacherreport/status/1416079601021988870?s=21",
            "title": "Bleacher Report on Twitter: JaVale McGee and Kelvin Johnson will join 12-man Team USA roster for the Tokyo Olympics per @ShamsCharania",
            "content_text": "",
            "authors": [
                "DrCaptivate"
            ]
        },
        {
            "id": "oln8yg",
            "url": "/r/nba/comments/olk32n/haynes_damian_lillard_everybody_in_this/",
            "title": "Dames press conference announcement at around 4 pm ET",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "olnhf4",
            "url": "https://twitter.com/theathletic/status/1416046211325329413?s=21",
            "title": "[The Athletic] The Knicks are looking to package their two first-round picks to move up in the draft, possibly into the mid-lottery. Possibly to help facilitate a trade for Collin Sexton.",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "olnlua",
            "url": "https://twitter.com/aaronjfentress/status/1416094549277954049?s=21",
            "title": "Aaron J. Fentress: An NBA source has told The Oregonian/OregonLive that Portland Trail Blazers guard Damian Lillard has no plans to request a trade.",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "olnrs6",
            "url": "https://www.reddit.com/r/NYKnicks/comments/olnrs6/im_a_simple_knicks_fan/",
            "title": "I'm a simple Knicks Fan",
            "content_text": "I just want to watch IQ hit 3's at the garden for the next decade. Please keep him.",
            "authors": [
                "MapleMamba9"
            ]
        },
        {
            "id": "olp7lv",
            "url": "https://i.redd.it/7tp00nxuvmb71.jpg",
            "title": "Not tryna buy into the rumors but damnn he look dirty in the O&B",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "olpnjj",
            "url": "https://twitter.com/ianbegley/status/1416136702624735236?s=21",
            "title": "Ian Begley: Damian Lillard denies a report that stated he planned to request a trade from Portland 'in the days to come.' \"It's not true,\" Lillard said after Team USA practice today. \"I haven't made any firm decision on what my future will be.\"",
            "content_text": "",
            "authors": [
                "HJ2K43"
            ]
        },
        {
            "id": "olpvbb",
            "url": "https://theknickswall.com/knicks-mid-tier-free-agent-targets-round-out-up-and-up-team/",
            "title": "[Knicks Wall] KNICKS MID-TIER FREE AGENT TARGETS TO ROUND OUT UP-AND-UP TEAM",
            "content_text": "",
            "authors": [
                "evan843"
            ]
        },
        {
            "id": "olsho1",
            "url": "https://youtube.com/watch?v=8KoThX4ABzs",
            "title": "[Nu Generation Media] Top 5 Shooting Guards in 2021 NBA Draft Discussion",
            "content_text": "",
            "authors": [
                "mempitt18"
            ]
        },
        {
            "id": "oltoc3",
            "url": "https://i.redd.it/r9w97fh23ob71.jpg",
            "title": "Come on guys",
            "content_text": "",
            "authors": [
                "enrico212"
            ]
        },
        {
            "id": "olvmyi",
            "url": "https://i.redd.it/6fk7a8qipob71.jpg",
            "title": "Got the Maple Mamba jersey. Birthday drip.",
            "content_text": "",
            "authors": [
                "JedidiahTheMormon"
            ]
        },
        {
            "id": "olw2d6",
            "url": "https://i.redd.it/pxxr62fnuob71.jpg",
            "title": "Live look at NBA superstars racing to join the Knicks in 2022 free agency",
            "content_text": "",
            "authors": [
                "Rjbarrettfan"
            ]
        },
        {
            "id": "om2vyh",
            "url": "https://www.reddit.com/r/NYKnicks/comments/om2vyh/daily_discussion_thread_july_17/",
            "title": "Daily Discussion Thread - (July 17)",
            "content_text": "Daily discussion thread for Knicks fans.",
            "authors": [
                "nyknicks-automod"
            ]
        },
        {
            "id": "om5x0x",
            "url": "https://nypost.com/2021/07/17/espns-fran-fraschilla-breaks-down-knicks-collin-sexton-nba-draft-possibilities/",
            "title": "Frischilla’s Two Cents on Prospects, Knicks Fits",
            "content_text": "",
            "authors": [
                "SanctorumAeternam"
            ]
        },
        {
            "id": "om9qun",
            "url": "https://twitter.com/alderalmo/status/1416443583272562690?s=20",
            "title": "If the Knicks hold on to their picks, Usman Garuba figures to be an option. The Spanish big man is a CAA client, represented by Leon’s son, Sam Rose.",
            "content_text": "",
            "authors": [
                "ShMp11Nesis"
            ]
        },
        {
            "id": "ombi1f",
            "url": "https://www.youtube.com/watch?v=-fCeF_3SwOM&feature=youtu.be",
            "title": "20 minutes of Julius Randle three-pointers",
            "content_text": "",
            "authors": [
                "thestache23"
            ]
        },
        {
            "id": "omeasv",
            "url": "https://twitter.com/shamscharania/status/1416525083657392128?s=21",
            "title": "[Shams] Sources: Great news for potential first-round NBA pick Jared Butler of Baylor: The NBA’s fitness-to-play panel has medically cleared Butler to play in the NBA.",
            "content_text": "",
            "authors": [
                "yusufnyk"
            ]
        },
        {
            "id": "omfzuh",
            "url": "https://twitter.com/bucketsworth/status/1416424073295454209?s=19",
            "title": "Mathew Hurt @DukeMBB finished his Houston Rockets workout 75/100 3pt, at 6’10” he’s one of the top shooters in this draft",
            "content_text": "",
            "authors": [
                "DragonEevee1"
            ]
        },
        {
            "id": "omgdvg",
            "url": "https://www.reddit.com/r/NYKnicks/comments/omgdvg/no_one_has_a_clue/",
            "title": "No one has a clue",
            "content_text": "No one has a clue what we are going to do. I mean Rose is so secretive, even google doesn’t know his exact age. Says about 60 years. Haha.",
            "authors": [
                "Titaneuropa"
            ]
        },
        {
            "id": "omh2d5",
            "url": "https://www.google.com/amp/s/lonzowire.usatoday.com/2021/07/17/lonzo-ball-rumors-new-orleans-pelicans-free-agent-contract/amp/",
            "title": "Does the Lonzo or bust crowd think he’s worth 25 million annually?",
            "content_text": "",
            "authors": [
                "MyKnicka84"
            ]
        },
        {
            "id": "omncba",
            "url": "https://youtu.be/q3mX-6xtRtA",
            "title": "2021 NBA Draft prospect Nah'Shon 'Bones' Hyland film session with Mike Schmitz | Comps with IQ and Dejounte Murray",
            "content_text": "",
            "authors": [
                "AnimalMotif"
            ]
        },
        {
            "id": "omo30t",
            "url": "https://www.reddit.com/r/NYKnicks/comments/omo30t/similar_draft_replacements/",
            "title": "Similar Draft Replacements",
            "content_text": "Bullock-------------Trey Murphy( 3 and D, true SF and more athletic than Bullock) \n\nBurks---------------Chris Duarte( Can score from anywhere and not overly athletic like Burks)\n\nNoel-----------------Charles Bassey(very similar)\n\nPayton--------------You don't replace Payton, you just don't!!\n\nNot sure why I did this musta been bore but I get it priority is a PG",
            "authors": [
                "thesyndicate777"
            ]
        },
        {
            "id": "omp7sr",
            "url": "https://www.reddit.com/r/NYKnicks/comments/omp7sr/daily_discussion_thread_july_18/",
            "title": "Daily Discussion Thread - (July 18)",
            "content_text": "Daily discussion thread for Knicks fans.",
            "authors": [
                "nyknicks-automod"
            ]
        },
        {
            "id": "omqt97",
            "url": "https://www.reddit.com/r/NYKnicks/comments/omqt97/dejounte_murray_or_derrick_white/",
            "title": "Dejounte Murray or Derrick White?",
            "content_text": "What's the value of these guys? I see Daily Knicks severely underestimating their value, or is it just me? I can't see the Spurs getting so little in return.\n https://dailyknicks.com/2021/07/16/ny-knicks-trades-dejounte-murray-or-derrick-white/2/\n\n(Murray for Knox, Ntilikina +19 or White for Knox +21)\n\nWhat do you guys think of either fitting into our system? They're both locked up fairly cheaply long term (~16/17 mil a year for the next 4 I think it is) which is nice as well.",
            "authors": [
                "AlphakirA"
            ]
        },
        {
            "id": "omtu7i",
            "url": "https://theknickoftimeshow.com/the-next-steps-for-knicks-forward-obi-toppin/",
            "title": "The Next Step(s) for Knicks forward, Obi Toppin",
            "content_text": "",
            "authors": [
                "westietrueblue"
            ]
        },
        {
            "id": "omyef6",
            "url": "https://i.redd.it/kpuw5g5c41c71.jpg",
            "title": "Since Space Jam 2 came out this weekend, here are some vintage Knicks Looney Tunes tees",
            "content_text": "",
            "authors": [
                "vintageknicks"
            ]
        },
        {
            "id": "on22xc",
            "url": "https://youtu.be/xpPpraPEhZ0",
            "title": "The Game Jamal Crawford Scored 52 POINTS vs Miami Heat! I miss this guy 🥲",
            "content_text": "",
            "authors": [
                "ThFantom"
            ]
        },
        {
            "id": "on2jva",
            "url": "https://nypost.com/2021/07/18/team-usa-basketball-never-made-julius-randle-an-offer/amp/",
            "title": "Team USA never made Knicks’ Julius Randle an offer",
            "content_text": "",
            "authors": [
                "ReturnOfAKidNamedTae"
            ]
        },
        {
            "id": "on3nmp",
            "url": "https://i.redd.it/d3ahcvuek2c71.jpg",
            "title": "Draft intel from Matt Moore",
            "content_text": "",
            "authors": [
                "ramontheawesome"
            ]
        },
        {
            "id": "on40i7",
            "url": "https://www.reddit.com/r/NYKnicks/comments/on40i7/where_would_obi_be_projected_in_this_years_draft/",
            "title": "Where would Obi be projected in this year’s draft? (With only the knowledge of his pre-NBA performance)",
            "content_text": "I don’t know nearly enough about college as a lot of y’all so curious what you think. I know people have been saying this is a super deep draft so I’m wondering how high some of the guys we are looking at for this year would perform in say, last years draft",
            "authors": [
                "rogbeeznutz"
            ]
        },
        {
            "id": "ona66g",
            "url": "https://www.reddit.com/r/NYKnicks/comments/ona66g/houseknicks_loves_you/",
            "title": "House💕Knicks loves you",
            "content_text": "",
            "authors": [
                "HouseKnicks"
            ]
        },
        {
            "id": "onc5dq",
            "url": "https://i.redd.it/re92y6wym5c71.jpg",
            "title": "Everythings speculative until it comes from the don",
            "content_text": "",
            "authors": [
                "blkhwk27"
            ]
        },
        {
            "id": "oncmqe",
            "url": "https://www.reddit.com/r/NYKnicks/comments/oncmqe/daily_discussion_thread_july_19/",
            "title": "Daily Discussion Thread - (July 19)",
            "content_text": "Daily discussion thread for Knicks fans.",
            "authors": [
                "nyknicks-automod"
            ]
        },
        {
            "id": "ongczx",
            "url": "https://youtu.be/XpktlG_sjYA",
            "title": "Do You Remember the Antonio McDyess/Knicks era? How Good was he in his Prime?",
            "content_text": "",
            "authors": [
                "qhicks361"
            ]
        },
        {
            "id": "oni5a0",
            "url": "https://i.redd.it/puope83w97c71.jpg",
            "title": "Streets need these",
            "content_text": "",
            "authors": [
                "Rjbarrettfan"
            ]
        },
        {
            "id": "oni9wt",
            "url": "https://youtu.be/t7EhWQfS9bg",
            "title": "Ibou Badji - 2nd round prospect from Senegal",
            "content_text": "",
            "authors": [
                "politebearwaveshello"
            ]
        },
        {
            "id": "onjdk9",
            "url": "https://www.reddit.com/gallery/onjdk9",
            "title": "[Images from mocktrades] That's a No From Me Dawg...",
            "content_text": "",
            "authors": [
                "StewBeach"
            ]
        },
        {
            "id": "onkf4k",
            "url": "https://theknickswall.com/2021-nba-offseason-app/index.html",
            "title": "The Knicks Wall Offseason Simulator App",
            "content_text": "",
            "authors": [
                "lilleff512"
            ]
        },
        {
            "id": "onm2d9",
            "url": "https://www.reddit.com/r/NYKnicks/comments/onm2d9/spike_lee_must_be_the_most_mentally_stable_and/",
            "title": "Spike Lee must be the most mentally stable and composed man in New York",
            "content_text": "The man tortured himself through the early 2000s regular season games, went through letdown after letdown and embarrassing front office decisions, gets thrown out of Madison Square Garden for using an entrance he used for decades and still shows up on ESPN wearing his full Knicks uniform\n\nThe Army should be getting mental training from this man to escape Al Quaida torture methods or something because this is truly impressive",
            "authors": [
                "RRIYAD"
            ]
        },
        {
            "id": "onngl6",
            "url": "https://twitter.com/sny_knicks/status/1417167103493296132?s=21",
            "title": "As recently as last month, Knicks have talked internally about the possibility of holding enough cap space this summer for 2022 FA class. - Ian Begley",
            "content_text": "",
            "authors": [
                "LouisFuton"
            ]
        },
        {
            "id": "onpw8y",
            "url": "https://www.reddit.com/r/NYKnicks/comments/onpw8y/a_different_new_orleans_trade/",
            "title": "A different new Orleans trade",
            "content_text": "What about Bledsoe and the 10th for the 21st ? \n\nWhy NO does it: they want to shed Bledsoes salary and still keep a 1st rounder this way \n\nWhy NY does it :\n\n1. Top 10 lotto pick \n2. Bledsoe can become a solid 6th man and provide depth and is expiring next year",
            "authors": [
                "croman11"
            ]
        },
        {
            "id": "onr2dz",
            "url": "https://factoryofsadness-co.cdn.ampproject.org/v/s/factoryofsadness.co/2021/07/19/cavs-acceptable-collin-sexton-knicks-trade-come/amp/2/?amp_gsa=1&amp_js_v=a6&usqp=mq331AQIKAGwASCAAgM%3D#amp_tf=From%20%251%24s&aoh=16267409845131&csi=0&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Ffactoryofsadness.co%2F2021%2F07%2F19%2Fcavs-acceptable-collin-sexton-knicks-trade-come%2F2%2F",
            "title": "Ridiculous trade proposal from a Cavs fan site...",
            "content_text": "",
            "authors": [
                "Bitcoin0"
            ]
        },
        {
            "id": "onrms7",
            "url": "https://bleacherreport.com/articles/10008157-knicks-rumors-ny-considering-maintaining-cap-space-to-pursue-max-free-agent-in-2022",
            "title": "Knicks Rumors: NY Considering Maintaining Cap Space to Pursue Max Free Agent in 2022",
            "content_text": "",
            "authors": [
                "Mr_Mashup"
            ]
        },
        {
            "id": "onuop7",
            "url": "https://www.reddit.com/r/NYKnicks/comments/onuop7/how_much_of_a_project_is_bouknight/",
            "title": "How much of a project is bouknight",
            "content_text": "One thing Ik is if a rookie is good Thibs will play them he showed that with iq even tho he still had some kinda leash\n\nsame with Rj around the 2nd quarter of the season Thibs started taking Rj out in the clutch and also was only playing him about 20 mins a game \n\nbut RJ worked through and earned Thibs trust again \n\nSo one thing I wanna know is Bouknight a player that Thibs will want to keep on the floor or continuously earn his way back into the rotation",
            "authors": [
                "Electronic_Pen_5782"
            ]
        },
        {
            "id": "onvs5w",
            "url": "https://streamable.com/zg3p9l",
            "title": "Why does he even pretend to be a Knicks fan lmao",
            "content_text": "",
            "authors": [
                "IceMan_674"
            ]
        },
        {
            "id": "oo0li7",
            "url": "https://www.reddit.com/r/NYKnicks/comments/oo0li7/if_the_knicks_drafted_vrenz_would_he_be_available/",
            "title": "If the Knicks drafted Vrenz, would he be available for this upcoming season? Or is he a stash?",
            "content_text": "Has this been confirmed anywhere? Or maybe Vrenz hasn’t personally decided yet?",
            "authors": [
                "falconwolverine"
            ]
        },
        {
            "id": "oo0njk",
            "url": "https://www.reddit.com/r/NYKnicks/comments/oo0njk/daily_discussion_thread_july_20/",
            "title": "Daily Discussion Thread - (July 20)",
            "content_text": "Daily discussion thread for Knicks fans.",
            "authors": [
                "nyknicks-automod"
            ]
        },
        {
            "id": "oo190y",
            "url": "https://twitter.com/JCMacriNBA/status/1417462158422642697",
            "title": "[Macri] According to a league source, the Knicks have several notable players in for a workout today, incl. fast rising UVA wing Trey Murphy III, Florida G Tre Mann & Kentucky C Isaiah Jackson. Murphy & Jackson are on the short list for the final 2 spots in the Green Room next Thursday.",
            "content_text": "",
            "authors": [
                "dtc_brock"
            ]
        },
        {
            "id": "oo1h1n",
            "url": "https://i.redd.it/pfmk51l77dc71.jpg",
            "title": "Old and still relevant.",
            "content_text": "",
            "authors": [
                "MostMorbidOne"
            ]
        }
    ]
}