{
    "version": "https://jsonfeed.org/version/1.1",
    "title": "r/selfhosted",
    "description": "A place to share alternatives to popular online services that can be self-hosted without giving up privacy or locking you into a service you don't control.",
    "home_page_url": "https://reddit.com",
    "feed_url": "https://raw.githubusercontent.com/jonathanlaniado/feeds/master/selfhosted.json",
    "icon": "https://styles.redditmedia.com/t5_32hch/styles/communityIcon_b2t5inv46z331.png",
    "favicon": "https://styles.redditmedia.com/t5_32hch/styles/communityIcon_b2t5inv46z331.png",
    "items": [
        {
            "id": "18gz26i",
            "url": "/r/selfhosted/comments/18gz26i/immich_recap_for_2023_with_accomplished/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18gz26i/immich_recap_for_2023_with_accomplished/",
            "title": "🎆 Immich recap for 2023 with accomplished milestones and vision for the future 🎆",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18gz26i/immich_recap_for_2023_with_accomplished/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18gz26i/immich_recap_for_2023_with_accomplished/'>Reddit</a></caption><div><br></div><p>Repo URL: <a href=\"https://github.com/immich-app/immich\">https://github.com/immich-app/immich</a></p>\n<p>Website: <a href=\"https://immich.app\">https://immich.app</a></p>\n<p>&#x200B;</p>\n<p>Hi everyone, </p>\n<p>Alex from Immich here. </p>\n<p>We are entering the last few weeks of 2023, and it has been quite a year for Immich. The project has grown so much in terms of users, developers, features, maturity, and the community around it. When I started working on Immich, it was simply a challenge for myself and an opportunity to learn new technologies, crafting something fun and useful for my wife during my free time to satisfy my urge to build and create things. I never thought it would become so popular and help so many people. At the end of the day, all we have is memory. I am proud that the team and I have created something to make storing and viewing those precious memories easier without restrictions and without sacrificing our privacy. As the year closes, here’s a recap of everything the project accomplished in 2023.</p>\n<p>Milestones</p>\n<ul>\n<li>Public shared links</li>\n<li>Favorites page</li>\n<li>Immich turned 1</li>\n<li>Material Design 3 on the mobile app</li>\n<li>Auto-link LivePhotos server-side</li>\n<li>iOS background backup</li>\n<li>Explore page</li>\n<li>CLIP search</li>\n<li>Search by metadata</li>\n<li>Responsive web app</li>\n<li>Archive page</li>\n<li>Asset descriptions</li>\n<li>10,000 stars on GitHub</li>\n<li>Manage auth devices</li>\n<li>Map view</li>\n<li>Facial recognition, clustering, searching, renaming, and person management</li>\n<li>Partner sharing and unifying timeline between partners' users</li>\n<li>Custom storage label</li>\n<li>XMP sidecar reading</li>\n<li>RAW file formats</li>\n<li>Justified layout on the web</li>\n<li>Memories</li>\n<li>Multi-select via SHIFT</li>\n<li>Android Motion Photos</li>\n<li>360° Photos</li>\n<li>Album description</li>\n<li>Album performance improvements (time buckets)</li>\n<li>Video hardware transcoding</li>\n<li>Slideshow mode on the web</li>\n<li>Configuration file</li>\n<li>External libraries</li>\n<li>Trash page</li>\n<li>Custom theme</li>\n<li>Asset Stacking</li>\n<li>20,000 stars on GitHub </li>\n<li>Shared album activity and comments</li>\n<li>CLI v2</li>\n<li>Down to 5 containers (from 8)</li>\n</ul>\n<p>Fun Statistics</p>\n<ul>\n<li>We have gone from the release version `1.41.0` to `1.90.0` at the time of writing. On average, we see a release every 7 days. </li>\n<li>According to GitHub's metrics, the `immich-server` container image has been pulled almost _4 million_ times.</li>\n<li>According to mobile app store metrics, we have 22,000 installations on Android and 6700 installation units on iOS (opt-in only).</li>\n<li>Immich is making around $1200/month on average from <a href=\"https://github.com/sponsors/immich-app\">donations</a>. (Thank you all so much!)</li>\n<li>\n<p>We were guests on two podcasts:</p>\n</li>\n<li>\n<p><a href=\"https://selfhosted.show/110\">Self-hosted</a></p>\n</li>\n<li>\n<p><a href=\"https://www.theverge.com/23938533/self-hosting-local-first-software-vergecast\">The Vergecast</a> </p>\n</li>\n<li>\n<p>There are over 4,500 members on the Discord server.</p>\n</li>\n<li>We have over 22,000 stars on the main GitHub repository, gaining 15,000 stars since January 2023.</li>\n</ul>\n<p>Diving into the next year, the team will continue to build on the foundation we have laid out over the past year, implementing more advanced features for searching, organizing, and sharing between users. Bugs will continue to be squashed and conquered. “Shit Alex wrote'' code will continue to be replaced by beautiful, clean code from Jason, Zack, Boet, Daniel, Osorin, Mert, Fynn, Marty, Martin, and Jonathan. The team has my eternal gratitude for creating a welcoming environment for new contributors, helping, teaching, and learning from each other. I’ve realized that hardly a day has gone by where the team hasn’t been in communication about Immich related topics over the past year.</p>\n<p>My long-term goal is to help hone Immich into a diamond in the FOSS space, where the UI, UX, development experiences, documentation, and quality are at a high standard while remaining free for everybody to use.</p>\n<p>I hope you enjoy Immich and have a happy and peaceful holiday.</p>\n<p>&#x200B;</p>\n<p>Alex and the Immich Team</p>\n<p>Cheers! 🎆🎆</p>",
            "date_published": "2023-12-12T22:41:24+00:00",
            "authors": [
                {
                    "name": "altran1502",
                    "url": "https://www.reddit.com/user/altran1502"
                }
            ]
        },
        {
            "id": "18evofr",
            "url": "/r/selfhosted/comments/18evofr/a_word_of_caution_about_tailscale/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18evofr/a_word_of_caution_about_tailscale/",
            "title": "A word of caution about Tailscale",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18evofr/a_word_of_caution_about_tailscale/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18evofr/a_word_of_caution_about_tailscale/'>Reddit</a></caption><div><br></div><p>This probably won't be a popular opinion, but given the volume of Tailscale praising posts this sub gets, I think it's worth noting that while Tailscale is a cool service, it's very much not self-hosting and in is even against the reasons that many people choose to self-host.</p>\n<p>If you use Tailscale, you're outsourcing a piece of your network to a VC funded company. With a simple change to their TOS this company can do all sorts of things, including charging for a previously free product or monetizing whatever data that can get from you.</p>\n<p>If there's one thing that we should all already know about VC funded internet startups, it's that they can and will pull the rug from underneath you when their bottom line demands it. See: streaming services cutting content while raising costs, sites like youtube and reddit redesigning to add more and more ads, hashicorp going from open source to close source. There's countless others. </p>\n<p>In the beginning there is often a honey moon period when a company is flush from cash from VC rounds and is in a \"growth at all costs\" mentality where they essentially subsidize the cost of services for new users and often offer things like a free tier. This is where Tailscale is today. Over time they eventually shift into a profit mentality when they've shored up as much of the market as they can (which Tailscale has already done a great job of).</p>\n<p>I'm not saying don't use Tailscale, or that it's a bad service (on the contrary their product UX is incredible and you can't get better than free), just that it's praise in this subreddit feels misplaced. Relying on a software-as-a-service company for your networking feels very much against the philosophy of self hosting.</p>",
            "date_published": "2023-12-10T04:42:02+00:00",
            "authors": [
                {
                    "name": "BitterSparklingChees",
                    "url": "https://www.reddit.com/user/BitterSparklingChees"
                }
            ]
        },
        {
            "id": "18eq15e",
            "url": "/r/selfhosted/comments/18eq15e/tailscale_on_a_travel_router_game_changer/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18eq15e/tailscale_on_a_travel_router_game_changer/",
            "title": "Tailscale on a travel router: game changer",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18eq15e/tailscale_on_a_travel_router_game_changer/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18eq15e/tailscale_on_a_travel_router_game_changer/'>Reddit</a></caption><div><br></div><p>Took a business trip last week. In preparation, I picked up a GL.iNet GL-MT3000 travel router and installed Tailscale on it. I also picked up an Amazon Firestick and put Jellyfin on it. I connected the Firestick and my other devices to the router before I left. At the hotel, I plugged my router in, connected it the wifi, and all my devices were then connected. I then was able to seamlessly stream directly from my home server using jellyfin and tailscale. It was awesome.</p>",
            "date_published": "2023-12-09T23:28:12+00:00",
            "authors": [
                {
                    "name": "Jefferson-not-jackso",
                    "url": "https://www.reddit.com/user/Jefferson-not-jackso"
                }
            ]
        },
        {
            "id": "18d2yob",
            "url": "/r/selfhosted/comments/18d2yob/immich_will_have_breaking_changes_again_in_the/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18d2yob/immich_will_have_breaking_changes_again_in_the/",
            "title": "Immich will have breaking changes (again) in the next release",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18d2yob/immich_will_have_breaking_changes_again_in_the/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18d2yob/immich_will_have_breaking_changes_again_in_the/'>Reddit</a></caption><div><br></div><p>It should be fairly easy to understand. Remove the parts in the red and add the ones in the green, in the docker compose file.</p>\n<p>Do be careful when updating.</p>\n<p>https://github.com/immich-app/immich/releases/tag/v1.90.0</p>",
            "date_published": "2023-12-07T19:10:52+00:00",
            "authors": [
                {
                    "name": "Significant-Neat7754",
                    "url": "https://www.reddit.com/user/Significant-Neat7754"
                }
            ]
        },
        {
            "id": "18czdl6",
            "url": "/r/selfhosted/comments/18czdl6/winglang_new_opensource_programming_language_for/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18czdl6/winglang_new_opensource_programming_language_for/",
            "title": "Winglang: New open-source programming language for faster and simpler cloud development",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18czdl6/winglang_new_opensource_programming_language_for/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18czdl6/winglang_new_opensource_programming_language_for/'>Reddit</a></caption><div><br></div><p>Hi self-hosters 👋</p>\n<p>A group of dedicated contributors and myself are working on <a href=\"https://github.com/winglang/wing\">Winglang</a>, a new programming language that reduces complexity and speeds up cloud development by allowing developers to work at a higher level of abstraction and test their applications locally with a fully functional simulator that provides instant feedback after code changes.</p>\n<p>Wing programs can be deployed to any cloud provider by changing the app's compilation target.</p>\n<h1>Key Features</h1>\n<ul>\n<li>Instant local simulation for visualizing, debugging, and testing apps without creating cloud mocks.</li>\n<li>Cloud services and distributed computing as first-class language primitives.</li>\n<li>Compiles to JavaScript and IaC (Terraform and Cloudformation, with support for more provisioning engines on the way).</li>\n<li>Same code compiles to different clouds (AWS, GCP, Azure).</li>\n<li>Compiler generates least-privilege IAM policies (and other cloud mechanics) based on intent.</li>\n<li><a href=\"https://docs.winglang.io/blog/2023/02/17/plugins\">Compiler plugins</a> for customizing the generated infrastructure definitions.</li>\n<li>JavaScript interoperability.</li>\n<li>Supports any Terraform resource.</li>\n</ul>\n<p>Check out this short <a href=\"https://www.youtube.com/watch?v=wzqCXrsKWbo&amp;t=661s\">demo video</a> to see Winglang and its local simulation tools in action, as well as the compilation of the same code to different clouds and provisioning engines.</p>\n<h1>My Motivation</h1>\n<p>As a developer, I've always felt that creating cloud applications should be easier. The process requires mastering various layers of the cloud stack, IAM roles, networking, and numerous tools, along with finding creative ways to test and debug code. In addition, long deployment times hinder iteration cycles and take me out of my creative flow.</p>\n<p>Other development disciplines have benefited from smart compilers that handle the lower levels of the stack and reduce developers' cognitive load. With Wing, we aim to bring the same benefits to cloud development with a language that treats the entire cloud as its target computer.</p>\n<h1>How to get Involved</h1>\n<p>We'd love to hear your feedback on any aspect of the project, and we're looking for developers to join our community to help shape Winglang's future.</p>\n<p>If you find Winglang interesting, please <a href=\"https://github.com/winglang/wing\">give us a ⭐️</a> on GitHub to bring the project to the attention of more developers 🙏. Your support is greatly appreciated!</p>\n<p>More Info</p>\n<p>You can find more info, including how to get started with Wing and why we're building it as a language, in our GitHub: <a href=\"https://github.com/winglang/wing\">https://github.com/winglang/wing</a>.</p>",
            "date_published": "2023-12-07T16:29:15+00:00",
            "authors": [
                {
                    "name": "shai-ber",
                    "url": "https://www.reddit.com/user/shai-ber"
                }
            ]
        },
        {
            "id": "18c9b8q",
            "url": "/r/selfhosted/comments/18c9b8q/copilotkit_build_inapp_ai_chatbots_and_aipowered/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18c9b8q/copilotkit_build_inapp_ai_chatbots_and_aipowered/",
            "title": "CopilotKit: Build in-app AI chatbots and AI-powered <Textareas/> | Open-source, customizable and self-hostable",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18c9b8q/copilotkit_build_inapp_ai_chatbots_and_aipowered/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18c9b8q/copilotkit_build_inapp_ai_chatbots_and_aipowered/'>Reddit</a></caption><div><br></div><p>Hi self-hosters  👋</p>\n<p>I've built a library that makes it easy to integrate LLMs into any react app. We are launching on product hunt tomorrow, but wanted to give you an early look :) 🎉</p>\n<p><strong>Github:</strong></p>\n<p><a href=\"https://github.com/CopilotKit/CopilotKit\">https://github.com/CopilotKit/CopilotKit</a></p>\n<p>&#x200B;</p>\n<p><strong>CopilotKit</strong> currently has two react components: </p>\n<ol>\n<li><CopilotPortal></li>\n<li>A \"chatGPT\" inside your app that can see the app state and take actions.</li>\n<li><CopilotTexarea/></li>\n<li>A drop-in replacement for any <textarea/> with the features of Github CopilotX (autocomplete, insertions, prompting). Context aware. </li>\n</ol>\n<p>Everything is open-source and fully customizable. It is plugged in to OpenAI by default but you can literally run everything locally, including the LLM. It's built to be deeply customized and still work. </p>\n<p>https://preview.redd.it/20rrkws3mp4c1.png?width=3071&amp;format=png&amp;auto=webp&amp;s=90072ad62138ef1f251c248074ac1e7ce588f8c3</p>\n<p>Please check it out and let us know what you think. If you like it, give us a <em>star🌟</em> while you're there :) </p>\n<p>Come join our journey 🗺️</p>\n<p>---</p>\n<p><strong>Discord:</strong> </p>\n<p><a href=\"https://discord.gg/6dffbvGU3D\">https://discord.gg/6dffbvGU3D</a></p>\n<p><strong>Github</strong>: </p>\n<p><a href=\"https://github.com/CopilotKit/CopilotKit\">https://github.com/CopilotKit/CopilotKit</a></p>",
            "date_published": "2023-12-06T17:35:50+00:00",
            "authors": [
                {
                    "name": "kindly_formation71",
                    "url": "https://www.reddit.com/user/kindly_formation71"
                }
            ]
        },
        {
            "id": "18af3dz",
            "url": "/r/selfhosted/comments/18af3dz/id_rather_kill_myself_than_host_smtp_again/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18af3dz/id_rather_kill_myself_than_host_smtp_again/",
            "title": "I'd rather kill myself than host SMTP again",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18af3dz/id_rather_kill_myself_than_host_smtp_again/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18af3dz/id_rather_kill_myself_than_host_smtp_again/'>Reddit</a></caption><div><br></div><p>It's been two months since I am running a mail server. I worked on a beautiful UI like SendGrid and MailGun for more than six months. I plan to start a transactional email service.</p>\n<p>I bought a range and rented another /24 range because I didn't want to have a bad neighbour on the subnet. I even got my own ASN because jerks like UCEProtect often put big ISPs on a blacklist at the ASN level.</p>\n<p>Of course, I have got a decent experience with this. I wrote my own SMTP server, email routing, and other things such as bounce and suppression handling. In a sense, everything is fine. RDNS, DKIM, DMARC, and SPF.</p>\n<p>I know that IP needs to warm up, so that's where I started. I paid for a few services to help me warm up, and it took me about two months to do so. Okay so far. The email was delivered 100% of the time to Gmail, but not at all to Yahoo and Outlook. The delivery rate to these two companies started to get better around last week, though. Some IP addresses started getting a 100% delivery rate.</p>\n<p>Then, I started testing my service on one of my websites. Of course, 100% transactional emails with account confirmation links ONLY. It was working great. Nearly 2,000 emails, 3,000+ opens and about 2,500 clicks daily on an average.</p>\n<p>I've also subscribed to Glock Apps and MXToolbox to measure my email deliverability and monitor IPs.</p>\n<p>Just today, I received an email with all half of my active IP addresses and sending/tracking domain blacklisted by Spamhaus. They categorize it under \"spam domain\", but I looked through my server logs (yes, everything is logged) and found no evidence of spam. Only transactional and warmup emails sent. I opened a ticket with Spamhaus and refuse to unblock my IP addresses and domains.</p>\n<p>I spent 6 months and $20,000+ working on this, only to be butchered by Spamhaus. How can Spamhaus be the police, judge and the executioner?</p>",
            "date_published": "2023-12-04T07:28:13+00:00",
            "authors": [
                {
                    "name": "RedWyvv",
                    "url": "https://www.reddit.com/user/RedWyvv"
                }
            ]
        },
        {
            "id": "186ltbv",
            "url": "/r/selfhosted/comments/186ltbv/changedetectionio_your_reddit_inspired_website/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/186ltbv/changedetectionio_your_reddit_inspired_website/",
            "title": "changedetection.io - Your Reddit inspired website content monitoring tool releases 0.45.8",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/186ltbv/changedetectionio_your_reddit_inspired_website/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/186ltbv/changedetectionio_your_reddit_inspired_website/'>Reddit</a></caption><div><br></div><p>Hi all :) It's a been a while and I've been super busy, but here's another super nice release (thanks for the feedback!), support for xPath2.0/3.0 means you can use logic in your selectors (for example, give the count of the number of divs that contain certain text, and much more). UI improvements, Selectable browser (plug it into Bright Data's scraping browser!) and more, check it out! Much ❤ from the changedetection team. <a href=\"https://github.com/dgtlmoon/changedetection.io\">https://github.com/dgtlmoon/changedetection.io</a> / changedetection.io</p>\n<p><a href=\"https://preview.redd.it/ocv82wb5d93c1.png?width=1131&amp;format=png&amp;auto=webp&amp;s=b8a3344859f4fefd55587eda3d9be7575cf128cf\">Website content monitoring and notification 'overview' list of websites being watched</a></p>",
            "date_published": "2023-11-29T09:50:11+00:00",
            "authors": [
                {
                    "name": "dgtlmoon123",
                    "url": "https://www.reddit.com/user/dgtlmoon123"
                }
            ]
        },
        {
            "id": "18491e9",
            "url": "/r/selfhosted/comments/18491e9/tailscale_the_marvellous_tool_that_became/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/18491e9/tailscale_the_marvellous_tool_that_became/",
            "title": "Tailscale: the marvellous tool that became indispensable to my tech life",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/18491e9/tailscale_the_marvellous_tool_that_became/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/18491e9/tailscale_the_marvellous_tool_that_became/'>Reddit</a></caption><div><br></div><p>I can't praise Tailscale and its developers enough... I discovered this do-it-yourself VPN solution about half a year ago and boy has it improved my life... Here is what I managed to accomplish with it.</p>\n<p>I am running Tailscale on my old macbook air, henceforth referred to as my \"server\", my two firesticks, and my phones.</p>\n<p>*remotely=outside of LAN, so over internet*</p>\n<p>-I can access my SMB shares remotely from my phones with OwlFiles and from my M1 Macbook air seamlessly through Finder. All I had to do was enter a simple command on my server in Terminal to add TCP/445 to \"Services\". Tailscale then forwards incoming TCP connections on port 445 from within my tailnet to port 445 on my mac’s server. The result is that I am able to mount my 2TB share from anywhere I have internet and manage my files as though I was on my home network. I also have access to my entire media library from VLC installed on all my devices (once again, through SMB). If only I could somehow add my remote SMB shares to Kodi... But Kodi doesn't seem to allow me to type in custom IP addresses when trying to add SMB shares. Let me know in the comments if you know how to add remote SMB shares to Kodi (the ones it does not detect automatically).</p>\n<p>-Similarly, by adding a suitable HTTPS port to my server's Tailscale services, I am able to manage the Transmission torrent client installed on my server remotely through Transmission's web interface (while connected to Tailscale, of course).</p>\n<p>-I can back up to Time Machine remotely and accessing my Time Machine backups remotely as well. There are a few caveats though. On my server, I had to add a shared folder (from Settings), allow access to it via SMB and mark it as a Time Machine backup destination. The process is pretty straightforward. The trick is to add it as a backup destination THROUGH TAILSCALE by typing in the Tailscale IP of your server or the Magic-DNS domain name. Also, you will not be able to access pre-existing time machine backups through Tailscale! Only the destinations that you initially add through Tailscale. This is why I have two backup destinations on my server - one that I back up to from my LAN and one that I use over Tailscale remotely. Works like a charm!!!</p>\n<p>-I can control my server through VNC remotely and seamlessly as if I was connected to LAN. To do that, I had to add TCP/5900 to my server's Tailscale services (which is akin to opening up TCP port 5900 to incoming connections from within the tailnet). This is particularly useful when I don't have my M1 mac with me, but need to run Python code inside Spyder. I just turn on my bluetooth/trackpad combo, connect it to my S10+, jack myself into my tailnet, MultiVNC my way into my server and BAM.</p>\n<p>-MagicDNS deserves its own praiseful review. Not only did it assign a permanent, simple domain name to all my Tailscale-enabled devices, but it allowed me to configure my own DNS server for Tailscale-connected devices. I was then able to choose custom DNS servers for specific domains, which let me block FireTV updates without compromising my security (The DNS server used for that looks a little sketchy so I don’t want all of my DNS requests to go through it) and also use AdGuard DNS without breaking Doordash’s Dasher app by routing doordash-specific DNS requests to Google’s DNS and not AdGuard’s. Solid win here, as Adguard's DNS bricks the Dasher app. Let me know in the comments if you want to see my Magic-DNS configuration.</p>\n<p>-FUNNEL: By running a funnel (proxy) on my home server, I am able to access my dad's Bell Fibe TV channels through their web interface from anywhere on Earth - Bell treats my traffic as if it's coming from my home network! It will NOT work if you use the mobile app, but works flawlessly from within Samsung Internet, Safari (on mac) and Grazing 3 (on iOS). Also, it’s quite neat to browse with my Canadian IP even when I am travelling (no more annoying \"cookie consent\" notices when in the EU). I suspect Netflix users could use this sort of setup to get around password-sharing restrictions. I am also running funnels on my firesticks just in case I need more bandwidth.</p>\n<p>-SUBNETS: I am running a subnet on my home server so that I could adb into my firesticks and manage them remotely with scrcpy (update apps, install tweaks, etc). Yes, I am not a huge fan of the command line \\^\\^' . I can also access my wifi cameras remotely from my mac. The desktop app for the cheap chinese ones only allows you to manage them over LAN, but Tailscale takes care of that. Works like a charm!</p>\n<p>I am beyond pleased with everything Tailscale enables me to do. It baffles me that this technology is somehow free to use. I am extremely grateful to be a part of the Tailscale community. Thank you!!</p>\n<p>Share your ideas and questions in the comments.</p>",
            "date_published": "2023-11-26T11:48:52+00:00",
            "authors": [
                {
                    "name": "yarov3so",
                    "url": "https://www.reddit.com/user/yarov3so"
                }
            ]
        },
        {
            "id": "183p3hl",
            "url": "/r/selfhosted/comments/183p3hl/grimoire_bookmark_manager_for_the_wizards/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/183p3hl/grimoire_bookmark_manager_for_the_wizards/",
            "title": "Grimoire - Bookmark manager for the wizards 🧙",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/183p3hl/grimoire_bookmark_manager_for_the_wizards/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/183p3hl/grimoire_bookmark_manager_for_the_wizards/'>Reddit</a></caption><div><br></div><p>The time has come to unveil <em>Grimoire</em>, a bookmark manager designed specifically for everyone who is missing a little bit of magic touch when it comes to organizing their bookmarks.</p>\n<p>Its mission is simple: to help you add, process, and organize your bookmarks in a way that makes sense.</p>\n<h2>Reasoning behind the project<a href=\"https://grimoire.pro/blog/launch-time#reasoning-behind-the-project\">​</a></h2>\n<p>I've always struggled with organizing my bookmarks. Even though I tried many options, none of them really appealed to me. The built-in bookmark managers in browsers were too basic and didn't allow me to organize my bookmarks in a way that made sense to me. The most popular external bookmark managers have been too simple, too complicated, or too expensive for what they offer.</p>\n<p>What I liked the most was the idea of having a bookmark manager with a relational database I had access to. This would let me retrieve my bookmarks in any way I wanted, and I could easily add new features in the future. I've searched for a solution that would allow me to do that, but I couldn't find anything that would fit my needs.</p>\n<p>And that's how the idea of the Grimoire was born. I wanted to create a bookmark manager that would be simple to use, but also powerful enough to let me organize my bookmarks in a way that made sense to me. Moreover, I wanted to take SvelteKit and PocketBase for a spin, and this seemed like a perfect opportunity to do so.</p>\n<h2>How it looks now<a href=\"https://grimoire.pro/blog/launch-time#how-it-looks-now\">​</a></h2>\n<p>Starting with v0.1.0, Grimoire has most of the basic features you would expect from a bookmark manager:</p>\n<ul>\n<li>bookmarks:</li>\n<li>can be added, viewed, edited, and deleted</li>\n<li>can be organized into categories and tagged</li>\n<li>metadata, like title, description, HTML content, favicon, and image, is fetched from the website and stored locally</li>\n<li>can have notes added to them</li>\n<li>bookmark list:</li>\n<li>display in a grid or list view</li>\n<li>can be searched by title, description, URL, and tags</li>\n<li>filtering by category, tag, and and more</li>\n<li>sort by date added, domain, and more</li>\n<li>users:</li>\n<li>can sign up and sign in</li>\n<li>all bookmarks, categories, and tags are private to the user</li>\n<li>admin panel:</li>\n<li>is used to manage users and see their bookmark, category, and tag counts</li>\n<li>can be used to preview most of PocketBase settings</li>\n<li>other:</li>\n<li>it's dockerized, so it's easy to run it locally or deploy it to your server</li>\n<li>all the benefits of a self-hosted PocketBase installation, like scheduled backups (local and to S3), high performance, and data security</li>\n<li>dark mode, because dark wizardry requires darkness</li>\n<li>responsive design as magic should be accessible to everyone, everywhere</li>\n<li>early and experimental support for AI-powered features (more on that in the future), like automatic tag suggestions</li>\n<li>and that's just the beginning!</li>\n</ul>\n<h2>What's next<a href=\"https://grimoire.pro/blog/launch-time#whats-next\">​</a></h2>\n<p>It's still a work in progress, but I'm happy with the functionality provided so far. You can expect more useful features, like a way to import bookmarks from other services and export them to most popular file formats, public profiles, better admin panel, AI-powered features - just to name a few. For more details, check out the <a href=\"https://grimoire.pro/docs/roadmap\">roadmap</a>.</p>\n<h2>How to get it up and running<a href=\"https://grimoire.pro/blog/launch-time#how-to-get-it-up-and-running\">​</a></h2>\n<p>If you want to try it out, you can <a href=\"https://grimoire.pro/docs/getting-started/quick-start\">run it locally</a>!</p>\n<h2>Contributors are more than welcome<img alt=\"​\" src=\"https://grimoire.pro/blog/launch-time#contributors-are-more-than-welcome\" /></h2>\n<p>To make Grimoire even better, I need your help! Don't be a stranger and check out the <a href=\"https://github.com/goniszewski/grimoire/blob/main/CONTRIBUTING.md\">contributing guidelines</a> today!</p>",
            "date_published": "2023-11-25T17:43:45+00:00",
            "authors": [
                {
                    "name": "goniszewski",
                    "url": "https://www.reddit.com/user/goniszewski"
                }
            ]
        },
        {
            "id": "183g045",
            "url": "/r/selfhosted/comments/183g045/xpipe_a_reimagined_sftp_client_for_modern_server/",
            "external_url": "https://github.com/xpipe-io/xpipe",
            "title": "XPipe – A reimagined SFTP client for modern server infrastructure",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/183g045/xpipe_a_reimagined_sftp_client_for_modern_server/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/183g045/xpipe_a_reimagined_sftp_client_for_modern_server/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-25T09:21:49+00:00",
            "authors": [
                {
                    "name": "milchshakee",
                    "url": "https://www.reddit.com/user/milchshakee"
                }
            ]
        },
        {
            "id": "181hs7j",
            "url": "/r/selfhosted/comments/181hs7j/what_radicalized_you_for_me_it_was_spore/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/181hs7j/what_radicalized_you_for_me_it_was_spore/",
            "title": "What radicalized you? For me it was Spore.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/181hs7j/what_radicalized_you_for_me_it_was_spore/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/181hs7j/what_radicalized_you_for_me_it_was_spore/'>Reddit</a></caption><div><br></div><p>Some people get into self hosting just because they're interested in the mechanics of it, but many people I think got inducted by the fact that for example, Facebook or snapchat make it so difficult to save your own pictures or migrate to another service, or the possibility that Google is reading all of your emails, etc. Others may have been radicalized by a specific event, such as a service provider closing up business and therefore you lose your data.</p>\n<p>For me, it was Spore com. I loved Spore, from the time I got it for my 10th birthday to maybe the age of 16 or 17 I poured hundreds or probably thousands of hours into this game. As I got older I became less invested in the gameplay and more invested in the creative aspect of it. I designed some badass creatures and spaceships that I was really proud of. I had a whole line of Spaceships that all served different roles in my head cannon, with different races of aliens following different themes. </p>\n<p>EA/Maxis/whoever runs Spore now purged all of them from spore.com, and now they're gone. Years of my childhood essentially put into a locked box and the key thrown away. For me it was like losing a scrapbook in a fire. What right did they have? </p>\n<p>So I ask, What radicalized you?</p>",
            "date_published": "2023-11-22T19:42:41+00:00",
            "authors": [
                {
                    "name": "Livid_Bee_5150",
                    "url": "https://www.reddit.com/user/Livid_Bee_5150"
                }
            ]
        },
        {
            "id": "180maoe",
            "url": "/r/selfhosted/comments/180maoe/plex_crossed_a_line_with_your_week_in_review/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/180maoe/plex_crossed_a_line_with_your_week_in_review/",
            "title": "Plex crossed a line with \"Your week in review\" emails today.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/180maoe/plex_crossed_a_line_with_your_week_in_review/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/180maoe/plex_crossed_a_line_with_your_week_in_review/'>Reddit</a></caption><div><br></div><p>As you may have seen Plex decided it was OK today to send an email showing me what my friends have been watching. To be clear, this is Plex telling other people what I've been watching from <em>my</em> server, with <em>my</em> files, and this is not OK. It also shows me what <em>they</em> have been watching on <em>their</em> server with <em>their</em> files. <strong>This is not OK!</strong></p>\n<p>https://imgur.com/a/DYR4wlh</p>\n<p>We all knew it was a matter of time before Plex started collecting data on our libraries and sharing it with advertisers. What happened to their \"we don't know, and don't want to know, what is on your server\"?. This, for me, is proof that those fears were absolutely founded in reality. On what planet would I ever want this information to be shared with friends on family on an OPT OUT basis? </p>\n<p>It's totally unacceptable to collect this data in the first place. It's totally unacceptable to share this information with uniquely identifiable information. And it's totally unacceptable to do this without explicitly asking me if it's OK. </p>\n<p>Unfortunately there is nothing you can do about this as a server admin, because technically these are <em>Plex</em> users and their marketing email preferences are controlled on the user side in the Plex website preferences. Not on your server.</p>\n<p><strong>This is an absolutely egregious overreach.</strong></p>\n<p>Thank goodness there are alternatives available in the form of Jellyfin and Emby. I left my Plex server up after the Jellyfin January challenge we did on the Self-Hosted podcast but because of this I feel that I have no choice but to take it down for good.</p>",
            "date_published": "2023-11-21T17:25:17+00:00",
            "authors": [
                {
                    "name": "Ironicbadger",
                    "url": "https://www.reddit.com/user/Ironicbadger"
                }
            ]
        },
        {
            "id": "180fc2m",
            "url": "/r/selfhosted/comments/180fc2m/taipy_v30_turns_data_and_ai_algorithms_into_full/",
            "external_url": "https://github.com/Avaiga/taipy",
            "title": "Taipy v.3.0 - Turns Data and AI algorithms into full web applications in no time.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/180fc2m/taipy_v30_turns_data_and_ai_algorithms_into_full/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/180fc2m/taipy_v30_turns_data_and_ai_algorithms_into_full/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-21T11:59:11+00:00",
            "authors": [
                {
                    "name": "quicklyalienated76",
                    "url": "https://www.reddit.com/user/quicklyalienated76"
                }
            ]
        },
        {
            "id": "17xlmja",
            "url": "/r/selfhosted/comments/17xlmja/hello_alex_from_immich_here_ive_gotten_a_chance/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17xlmja/hello_alex_from_immich_here_ive_gotten_a_chance/",
            "title": "Hello, Alex from Immich here. I've gotten a chance to be on the podcast with Self-hosted.show and want to share the podcast with you all!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17xlmja/hello_alex_from_immich_here_ive_gotten_a_chance/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17xlmja/hello_alex_from_immich_here_ive_gotten_a_chance/'>Reddit</a></caption><div><br></div><p>Podcast link <a href=\"https://selfhosted.show/110?t=1198\">https://selfhosted.show/110?t=1198</a> </p>\n<p>Hello everybody, </p>\n<p>After the shout-out to Alex (from Self-hosted.show) from the comment section in my last post when I shared the Vergecast's episode about hardship in self-hosting, Alex and I got together, and we scheduled a session to talk about Immich this week. We talk about Immich, the team behind the application, its architecture, current features, future plans, and the sustainability aspect of the project.  I want to share the episode with you all.</p>\n<p>Have a great weekend!</p>\n<p>Alex</p>\n<p>&#x200B;</p>",
            "date_published": "2023-11-17T18:31:05+00:00",
            "authors": [
                {
                    "name": "altran1502",
                    "url": "https://www.reddit.com/user/altran1502"
                }
            ]
        },
        {
            "id": "17wyqyn",
            "url": "/r/selfhosted/comments/17wyqyn/selfhosting_got_me_a_job_offer/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17wyqyn/selfhosting_got_me_a_job_offer/",
            "title": "Selfhosting got me a job offer",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17wyqyn/selfhosting_got_me_a_job_offer/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17wyqyn/selfhosting_got_me_a_job_offer/'>Reddit</a></caption><div><br></div><p>I still barely believe it honestly. I'm a student \"freshly\" outta school with no experience, and I've been struggling finding a job for a while.</p>\n<p>I had a (first) job interview recently and while I didn't have much to offer, I seemed to somewhat impress them with my home labbing. I run Proxmox at home for my self-hosted things and got a decent amount of experience with it, and it's what they use a lot as well. It's not that common in my age group to be interested in stuff like this, apparently.</p>\n<p>Anyway, this is barely worthy of a post, but I'm really excited. I don't really know how it'll work out as I still got plenty to learn, but it's a big step forwards for me.</p>",
            "date_published": "2023-11-16T22:01:03+00:00",
            "authors": [
                {
                    "name": "Anejey",
                    "url": "https://www.reddit.com/user/Anejey"
                }
            ]
        },
        {
            "id": "17vuppd",
            "url": "/r/selfhosted/comments/17vuppd/non_self_hosted_cheap_services_you_still_pay_for/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17vuppd/non_self_hosted_cheap_services_you_still_pay_for/",
            "title": "[non self hosted] : Cheap Services You Still Pay For",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17vuppd/non_self_hosted_cheap_services_you_still_pay_for/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17vuppd/non_self_hosted_cheap_services_you_still_pay_for/'>Reddit</a></caption><div><br></div><p>My Bitwarden renewal came through this morning.   It's still $10 per year.   I was about to cancel, but I thought  what the heck at $10, I'll keep it on  out of principle and to show support.  </p>\n<p>I also have a tutanota encrypted email, which costs little more than pocket change over the year.   I hardly use it, but it's there.</p>\n<p>I wondered then, if this community had any little gems to share - services they pay for that are let's say  under $30 annually.   I think we can exclude VPS, since lots of people will probably have them already.</p>\n<p>I'm going to cross post at /r/opensource too.</p>",
            "date_published": "2023-11-15T14:23:46+00:00",
            "authors": [
                {
                    "name": "softwarebuyer2015",
                    "url": "https://www.reddit.com/user/softwarebuyer2015"
                }
            ]
        },
        {
            "id": "17v48t8",
            "url": "/r/selfhosted/comments/17v48t8/budibase_will_soon_limit_users_on_oss_self_hosted/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17v48t8/budibase_will_soon_limit_users_on_oss_self_hosted/",
            "title": "Budibase Will Soon Limit Users on OSS Self Hosted Version",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17v48t8/budibase_will_soon_limit_users_on_oss_self_hosted/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17v48t8/budibase_will_soon_limit_users_on_oss_self_hosted/'>Reddit</a></caption><div><br></div><p>Just received the email over the weekend but if your self hosting Budibase you will soon be limited to 20 users even on the open source version. This is very unfortunate for me because I was running a bunch of volunteer community projects on there and really liked how they didn't hide SSO behind a paywall. Not everyone using apps like these are companies trying to save money and having to pay $5 per user isn't feasible for volunteer projects that don't have any money to begin with.  </p>\n<p>See <a href=\"https://budibase.com/blog/updates/pricing-v3/\">https://budibase.com/blog/updates/pricing-v3/</a></p>",
            "date_published": "2023-11-14T15:09:24+00:00",
            "authors": [
                {
                    "name": "absolutesantaja",
                    "url": "https://www.reddit.com/user/absolutesantaja"
                }
            ]
        },
        {
            "id": "17tkq79",
            "url": "/r/selfhosted/comments/17tkq79/dockge_a_fancy_easytouse_selfhosted_docker/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17tkq79/dockge_a_fancy_easytouse_selfhosted_docker/",
            "title": "Dockge - a fancy, easy-to-use self-hosted docker compose.yaml stack-oriented manager",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17tkq79/dockge_a_fancy_easytouse_selfhosted_docker/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17tkq79/dockge_a_fancy_easytouse_selfhosted_docker/'>Reddit</a></caption><div><br></div><p>&#x200B;</p>\n<p>https://preview.redd.it/ra343yd71xzb1.png?width=1903&amp;format=png&amp;auto=webp&amp;s=c28993a7b5a6ebe2d09b0d08896190e8e3349e0f</p>\n<p>GitHub: <a href=\"https://github.com/louislam/dockge\">https://github.com/louislam/dockge</a></p>\n<p>This is my second self-hosted project. If you still remember me, I am the one who created Uptime Kuma, and I had posted here 2 years ago.</p>\n<p>After joining this subreddit, I somehow fell into love with this community and also started enjoying using docker-compose to manage my containers.</p>\n<p>However, I always interacted with docker-compose using the CLI only, as I couldn't find a web app that focuses on docker-compose management. Although Portainer has the ability to do that, it do not display any progress during \"docker-compose up or pull\" unfortunately, which makes me prefer to use the CLI.</p>\n<p>So this time I tried to create my own stack-oriented manager to manage my compose.yaml files.</p>\n<p>- Manage docker compose.yaml files<br />\n- Interactive compose.yaml editor<br />\n- Interactive web terminal<br />\n- The UI/UX is very similar to Uptime Kuma</p>\n<p>A short introduction video:  <a href=\"https://youtu.be/AWAlOQeNpgU?t=48\">https://youtu.be/AWAlOQeNpgU?t=48</a></p>\n<p>It is really fully focused on docker compose, so please don't expect to manage a single container.</p>\n<p>Don't forget to ⭐ the project on GitHub if you love it!</p>\n<p>A little update for Uptime Kuma:<br />\nUptime Kuma reached over 40,000 ⭐ on GitHub and over 48,000,000 pulls on Docker Hub!!! It is a big gift for me, thank you everyone! Uptime Kuma V2 is still under development, stay tuned!</p>\n<p>&#x200B;</p>",
            "date_published": "2023-11-12T13:56:25+00:00",
            "authors": [
                {
                    "name": "louislamlam",
                    "url": "https://www.reddit.com/user/louislamlam"
                }
            ]
        },
        {
            "id": "17s2ge3",
            "url": "/r/selfhosted/comments/17s2ge3/wallos_opensource_personal_subscription_tracker/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17s2ge3/wallos_opensource_personal_subscription_tracker/",
            "title": "Wallos: Open-Source Personal Subscription Tracker",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17s2ge3/wallos_opensource_personal_subscription_tracker/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17s2ge3/wallos_opensource_personal_subscription_tracker/'>Reddit</a></caption><div><br></div><p>Hi there selfhosters.</p>\n<p>I was looking for a self hosted open source subscription tracker for a while and since I could not find what I wanted, I decided to try to build it myself.<br />\nI used mobile apps like Billbot but the data would only be accessible on that device. I've also found a few web based services but would require a subscription, and the reason I wanted a subscription  tracker was to get an overview of my subscriptions and start saving money by cancelling unneeded or redundant services.<br />\nSince I am using so many open source and self hosted projects I decided to try to give something back and this is how Wallos was born.</p>\n<p>I'm not happy with the UI yet, it was my first time developing a project without a designer, but I don't hate it either.</p>\n<p>About Wallos:</p>\n<p>Wallos is an open-source, and self-hostable web application designed to empower you in managing your finances with ease. Say goodbye to complicated spreadsheets and expensive financial software – Wallos simplifies the process of tracking expenses and helps you gain better control over your financial life.   </p>\n<p><a href=\"https://preview.redd.it/clm0syryeizb1.png?width=1457&amp;format=png&amp;auto=webp&amp;s=5c66f0e67fb5611c0a3ddcfb04a91579927440fa\">Wallos Desktop Light Theme</a></p>\n<p>Features</p>\n<ul>\n<li>Subscription Management: Keep track of your recurring subscriptions and payments, ensuring you never miss a due date.</li>\n<li>Category Management: Organize your expenses into customizable categories, enabling you to gain insights into your spending habits.</li>\n<li>Multi-Currency support: Wallos supports multiple currencies, allowing you to manage your finances in the currency of your choice.</li>\n<li>Currency Conversion: Integrates with the Fixer API so you can get exchange rates and see all your subscriptions on your main currency.</li>\n<li>Data Privacy: As a self-hosted application, Wallos ensures that your financial data remains private and secure on your own server.</li>\n<li>Customization: Tailor Wallos to your needs with customizable categories, currencies, themes and other display options.</li>\n<li>Sorting Options: Allowing you to view your subscriptions from different perspectives.</li>\n<li>Logo Search: Wallos can search the web for the logo of your subscriptions if you don't have them available for upload.</li>\n<li>Mobile view: Wallos on the go.</li>\n<li>Statistics: Another perspective into your spendings.</li>\n<li>Notifcations: Get notified by email of an upcoming payment</li>\n</ul>\n<p>If you're interested in trying it:</p>\n<p>GitHub: <a href=\"https://github.com/ellite/Wallos\">https://github.com/ellite/Wallos</a><br />\nDockerHub: <a href=\"https://hub.docker.com/repository/docker/bellamy/wallos\">https://hub.docker.com/repository/docker/bellamy/wallos</a></p>\n<p>&#x200B;</p>\n<p>Help from the community is appreciated. <br />\nFeel free to open Pull requests with bug fixes and features. I'll do my best to keep an eye on those.<br />\nFeel free to open issues with bug reports or feature requests. Bug fixes will take priority.  </p>\n<p>The development cycle might not be the fastest, since I work a full time job and have a baby, but I'll do the best I can.  </p>\n<p>Thank you and hoping the tool can be useful to someone else.</p>",
            "date_published": "2023-11-10T11:57:07+00:00",
            "authors": [
                {
                    "name": "lordcracker",
                    "url": "https://www.reddit.com/user/lordcracker"
                }
            ]
        },
        {
            "id": "17r0ga5",
            "url": "/r/selfhosted/comments/17r0ga5/self_hosted_joy/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17r0ga5/self_hosted_joy/",
            "title": "Self hosted joy",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17r0ga5/self_hosted_joy/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17r0ga5/self_hosted_joy/'>Reddit</a></caption><div><br></div><p>I was trying to get into self hosted services to keep my mind active and stay engaged whilst going through a cancer diagnosis.</p>\n<p>Unfortunately it's spread to my brain and whilst there are some odds we don't know what will happen. I'm here to say if you self hoat anything self host your own joy, hopefully you're already doing it! Life is short and we all live on borrowed time.</p>\n<p>I hate the wankers that earn multiple times median earnings, most of which I've met are self entitled egotists if you scratch the surface. So I'm proud of all of you who contribute and try. It can be be weird, personal, or a huge success but you turned up and gave it a whirl!</p>\n<p>It's disgusting thinking about the profit margins tech companies feel entitled to, even though they've supported me most of the career I did get to have and all I say is that nothing replaces painstaking and exacting work and freedom isn't something to give up without adequate compensation (whatever that means to you).</p>\n<p>Power to the grass roots and power to all of you for showing up in any and all capacities just to ask how can I help you out here.</p>\n<p>❤️ safe journeys and many surprises I hope for many of your best years continue and grow.</p>",
            "date_published": "2023-11-09T00:36:54+00:00",
            "authors": [
                {
                    "name": "LostLetterbox",
                    "url": "https://www.reddit.com/user/LostLetterbox"
                }
            ]
        },
        {
            "id": "17ql9vo",
            "url": "/r/selfhosted/comments/17ql9vo/cosmos_012_huge_update_all_in_one_secure/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17ql9vo/cosmos_012_huge_update_all_in_one_secure/",
            "title": "🆕 Cosmos 0.12 - HUGE update! All in one secure Reverse-proxy, container manager with app store, integrated VPN, and authentication provider, now has a Full Monitoring suite with alerts and notifications (including presets for anti crypto miner hacks!) 📈📊",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17ql9vo/cosmos_012_huge_update_all_in_one_secure/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17ql9vo/cosmos_012_huge_update_all_in_one_secure/'>Reddit</a></caption><div><br></div><p>link: <a href=\"https://github.com/azukaar/Cosmos-Server/\">https://github.com/azukaar/Cosmos-Server/</a></p>\n<p>Hello everyone!</p>\n<p>The \"elusive\", blurred out dashboard W.I.P. screen is almost a meme at this point. But all good things come to an end, to welcome even better things! Monitoring is finally fully implemented! Along side other improvements, the 0.12 is a HUGE update to Cosmos, with sexy graphs everywhere!</p>\n<p><a href=\"https://preview.redd.it/fgx6wun1m3zb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=a89cb3202053ae653cd0fa3ddef94b6ad13bbb7d\">I added graphs everywhere! :D</a></p>\n<p>&#x200B;</p>\n<p>As a reminder, this exists alongside the existing features:</p>\n<ul>\n<li><strong>App Store</strong> 📦📱 To easily install and manage your applications, with simple installers, automatic updates and security checks</li>\n<li><strong>Customizable Homepage</strong> 🏠🖼 To access all your applications from a single place, with a beautiful and customizable UI</li>\n<li><strong>Reverse-Proxy</strong> 🔄🔗 Targeting containers, other servers, or serving static folders / SPA with <strong>automatic HTTPS</strong>, and a <strong>nice UI</strong></li>\n<li><strong>VPN</strong> 🌐🔒 To securely access your applications from anywhere, without having to open ports on your router.</li>\n<li><strong>Authentication Server</strong> 👦👩 With strong security, <strong>multi-factor authentication</strong> and multiple strategies (<strong>OpenId</strong>, forward headers, HTML)</li>\n<li><strong>Container manager</strong>      🐋🔧  To easily manage your containers and their settings, keep  them    up  to  date as well as audit their security. Includes  docker-compose     support!</li>\n<li><strong>Identity Provider</strong> 👦👩 To easily manage your users, <strong>invite your friends and family</strong>       to your applications without awkardly sharing credentials. Let  them      request a password change with an email rather than having you   unlock     their account manually!</li>\n<li><strong>SmartShield technology</strong>      🧠🛡  Automatically secure your applications without manual     adjustments  (see  below for more details). Includes anti-bot and     anti-DDOS  strategies.</li>\n</ul>\n<p>&#x200B;</p>\n<p>So what is this fully featured monitoring system? WELL, first of all it's important to note it is fully persistent. A lot of software have graphs, but they start populating only when you open the webpage, and then the data is forgotten when you close it. Cosmos has a fully persistent 24/7 highly optimizedd data gathering system, so that all graph shows data at all time.</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/oqz4j9ubm3zb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=3d511a33d99e72332264e89d2d4befdad728149c\">Graaaphs</a></p>\n<p>Why doing this? Isn't it a lot of storage? This is a good question: Monitoring is useless if it's not being looked at. And if not persistent, not only you have to be very lucky to open the webpage at the right time  to detect a problem, but also you can't have an alert system, which is the core of any good monitoring.</p>\n<p>But worry not, Cosmos has a pipeline that optimize your data in real time: the older the data, the less precise they get, in order to save your storage. It is also highly optimized in order to keep the RAM and CPU usage extremely low, even on very cheap servers. Monitoring is difficult to get right but I think you will find this will hit the spot!</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/ulh4jgufm3zb1.png?width=1920&amp;format=png&amp;auto=webp&amp;s=8b74f79b77afd73a807461a05329673ea5dd5c35\">Customizable alerts</a></p>\n<p>So how do you use this awesome tool? When designing it, I was very conscious of thinking \"how will users use it\". I did not want to just show graphs for the sake of having graphs, that is why I imagined an entire workflow, that starts in the dashboard.</p>\n<p>You see, you can zoom in and out of the graphs (you can test this in the demo: <a href=\"https://cosmos-cloud.io/cosmos-ui/\">https://cosmos-cloud.io/cosmos-ui/</a>) and when you do so, all the graph and the data in the tables are updating everywhere as you navigate. For example, highlight a peak of resources, and the right hand side table will tell you which container caused the resources peak:</p>\n<p><a href=\"https://preview.redd.it/jdy0p8vim3zb1.png?width=1599&amp;format=png&amp;auto=webp&amp;s=01f9e661a68c73635fd4312916b36fddfa55dec0\">synchronizing, but also all the other graphs are changing at the same time</a></p>\n<p>Once you have identified a potential culprit, you can click on it to get their isolated metric:</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/y74tz3anm3zb1.png?width=1369&amp;format=png&amp;auto=webp&amp;s=79f59d70cdb988dc869b054746136d157525f515\">Looks like we have a culprit!</a></p>\n<p>You might think, \"alright pretty cool\", but it's over! Now that we know \"who\" caused  the issue, we might also want to know why. For this, we want to go to the last tab: \"events\". This is an improved version of logs with advanced search  (including BSON requests). That screen will tell us what happened. That screen also is synchronized with zooming into the graphs!</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/cmeqnfuqm3zb1.png?width=1584&amp;format=png&amp;auto=webp&amp;s=50f90cad29cd4837523f13207e416b6df38329f2\">Looks like someone tried to force the shield!</a></p>\n<p>&#x200B;</p>\n<p>Alright so that's neat, but also graphs are just pretty so I added them everywhere! Home screen, URL screen, container screen...</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/cxnm52jum3zb1.png?width=1666&amp;format=png&amp;auto=webp&amp;s=25ed7ce709f697f8d95bed365c7f413d0a9e1a64\">I will let you discover the other places ;)</a></p>\n<p>&#x200B;</p>\n<p>So anything else in that already huge updates? Well we have notifications! You will get notifications for many things including certificate renewing, alerts and container updates!</p>\n<p>https://preview.redd.it/ct2lx22ym3zb1.png?width=522&amp;format=png&amp;auto=webp&amp;s=bc458b7800b8c417282ca94cee54c566142158df</p>\n<p>Here's the entire changelog, and as always, Happy hosting!</p>\n<p>- New real time persisting and optimized metrics monitoring system (RAM, CPU, Network, disk, requests, errors, etc...)<br />\n - New Dashboard with graphs for metrics, including graphs in many screens such as home, routes and servapps<br />\n - New customizable alerts system based on metrics in real time, with included preset for anti-crypto mining and anti memory leak <br />\n - New events manager (improved logs with requests and advanced search)<br />\n - New notification system<br />\n - Added Marketplace UI to edit sources, with new display of 3rd party sources<br />\n - Added a notification when updating a container, renewing certs, etc...<br />\n - Certificates now renew sooner to avoid Let's Encrypt sending emails about expiring certificates<br />\n - Added option to disable routes without deleting them<br />\n - Improved icon loading speed, and added proper placeholder<br />\n - Marketplace now fetch faster (removed the domain indirection to directly fetch from github)<br />\n - Integrated a new docker-less mode of functioning for networking<br />\n - Added a dangerous IP detector that stops sending HTTP response to IPs that are abusing various shields features<br />\n - Added CORS headers to openID endpoints<br />\n - Added a button in the servapp page to easily download the docker backup<br />\n - Added Button to force reset HTTPS cert in settings<br />\n - Added lazyloading to URL and Servapp pages images<br />\n - Fixed annoying marketplace screenshot bug (you know what I'm talking about!)<br />\n - New color slider with reset buttons<br />\n - Redirect static folder to host if possible<br />\n - New Homescreen look<br />\n - Fixed blinking modals issues<br />\n - Add AutoFocus on Token field for 2FA Authentication (thanks u/InterN0te)<br />\n - Allow Insecure TLS like self-signed certificate for SMTP server (thanks u/InterN0te)<br />\n - Improve display of icons [fixes #121]<br />\n - Refactored Mongo connection code [fixes #111]<br />\n - Forward simultaneously TCP and UDP [fixes #122]</p>",
            "date_published": "2023-11-08T13:08:37+00:00",
            "authors": [
                {
                    "name": "azukaar",
                    "url": "https://www.reddit.com/user/azukaar"
                }
            ]
        },
        {
            "id": "17pclhd",
            "url": "/r/selfhosted/comments/17pclhd/shoutout_to_linuxserverio_for_making_docker_so/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17pclhd/shoutout_to_linuxserverio_for_making_docker_so/",
            "title": "Shout-out to Linuxserver.io for making Docker so easy to use for beginners",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17pclhd/shoutout_to_linuxserverio_for_making_docker_so/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17pclhd/shoutout_to_linuxserverio_for_making_docker_so/'>Reddit</a></caption><div><br></div><p>I am not an experienced user of Docker. For me, <a href=\"https://Linuxserver.io\">Linuxserver.io</a> images on docker hub have been wonderful. They are easy to configure, well documented and easy to install. It's so heartening to see an effort being made to make Docker accessible to everyone.</p>\n<p>&#x200B;</p>\n<p>If you're a beginner like me, I would strongly recommend choosing their images when possible, simply because their documentation is so consistently simple and easy to follow.</p>\n<p>&#x200B;</p>\n<p>On a different note, this is also why I can not use paperless-ngx, which does not have a corresponding LSIO image, right now. I have reached a stage where complex installs (say that of paperless-ngx, which needs me to tweak quite a few docker files individually) seem not worth the effort in the odd event that I mess something up.</p>",
            "date_published": "2023-11-06T20:46:17+00:00",
            "authors": [
                {
                    "name": "Significant-Neat7754",
                    "url": "https://www.reddit.com/user/Significant-Neat7754"
                }
            ]
        },
        {
            "id": "17p475s",
            "url": "/r/selfhosted/comments/17p475s/my_network_setup_that_prioritizes_privacy/",
            "external_url": "https://i.redd.it/15x1ayncoqyb1.png",
            "title": "My network setup that prioritizes privacy",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17p475s/my_network_setup_that_prioritizes_privacy/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17p475s/my_network_setup_that_prioritizes_privacy/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/15x1ayncoqyb1.png\" />",
            "date_published": "2023-11-06T14:39:40+00:00",
            "authors": [
                {
                    "name": "elusiveporcupine",
                    "url": "https://www.reddit.com/user/elusiveporcupine"
                }
            ]
        },
        {
            "id": "17onhqa",
            "url": "/r/selfhosted/comments/17onhqa/librum_finally_a_modern_ebook_reader_follow_up/",
            "external_url": "https://v.redd.it/gcytfi4jtlyb1",
            "title": "Librum - Finally a modern E-Book Reader (Follow up)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17onhqa/librum_finally_a_modern_ebook_reader_follow_up/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17onhqa/librum_finally_a_modern_ebook_reader_follow_up/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-11-05T22:23:52+00:00",
            "authors": [
                {
                    "name": "Creapermann",
                    "url": "https://www.reddit.com/user/Creapermann"
                }
            ]
        },
        {
            "id": "17o6s12",
            "url": "/r/selfhosted/comments/17o6s12/my_experience_of_selfhosting_email_unpopular/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17o6s12/my_experience_of_selfhosting_email_unpopular/",
            "title": "My experience of self-hosting email (unpopular opinion)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17o6s12/my_experience_of_selfhosting_email_unpopular/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17o6s12/my_experience_of_selfhosting_email_unpopular/'>Reddit</a></caption><div><br></div><p>Considering everything I have read in this Subreddit regarding self-hosting email, I am expecting to be downvoted into the pits of hell for even daring to say this out loud, and that's okay with me because I feel it must be said for others who are searching here for answers and advice like I once was. I don't want them to be discouraged because of FUD, as they say in the crypto community. Here goes...  </p>\n<p>I am the type of person who loves to solve problems and am always up for a challenge. Since getting into the self-hosting hobby, I have continuously searched for the next fun and practical service to self-host, which I am sure is what all of us do quite regularly. For me, that next service was email. I didn't have a clue where to begin, so I began to read into it, and immediately I noticed a pattern that was clear as day and consistent across all discussion boards including this one, and that message was \"self-hosting email is not worth the trouble\". The warnings made me very curious, and I just had to try for myself to see what this fearmongering about self-hosted email was. Well, I'm here to tell you that in my experience, all the warnings and cautions were nonsense and so far non-existent. I'll tell you right off the bat that there was zero magic involved. All I did was the following:  </p>\n<p>#1. Obtained a static IP from my ISP<br />\n#2. Chose Synology MailPlus on my NAS as my mail server<br />\n#3. Purchased a domain on <a href=\"https://www.porkbun.com\">www.porkbun.com</a> <br />\n#4. Followed the instructions on <a href=\"https://youtu.be/o66UFsodUYo?si=4GDATwQJtYsY2IT2\">this video</a><br />\n#5. Made sure all firewall rules on both my router and NAS are properly configured  </p>\n<p>That's it. Simple as that. Works great for sending and receiving mail. I have run numerous tests, and it's been rock solid for about 6 months now. Never had a single email lost or end up in junk mail folders with any of the big email providers. My advice is, if you are interested in hosting your own email and are on the fence because of the FUD that has been peddled across self-hosting communities, don't buy into that cynicism. It's perfectly doable, and I didn't find a single moment of it to be frustrating, despite not being exactly the most advanced user in this field.  </p>\n<p>If this post encourages just one person to pull the trigger, I'm happy</p>",
            "date_published": "2023-11-05T07:29:30+00:00",
            "authors": [
                {
                    "name": "Illuminated_Humanoid",
                    "url": "https://www.reddit.com/user/Illuminated_Humanoid"
                }
            ]
        },
        {
            "id": "17lyd3j",
            "url": "/r/selfhosted/comments/17lyd3j/dev_symfonium_music_player_cast_the_self_hosted/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17lyd3j/dev_symfonium_music_player_cast_the_self_hosted/",
            "title": "[DEV] Symfonium: Music player & cast, the self hosted music player",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17lyd3j/dev_symfonium_music_player_cast_the_self_hosted/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17lyd3j/dev_symfonium_music_player_cast_the_self_hosted/'>Reddit</a></caption><div><br></div><p>I never officially introduced Symfonium here and if this breaks the rules please remove the post.</p>\n<p>&#x200B;</p>\n<p>So with version 6.0.0 just released Symfonium is now feature complete, to fully embrace most self hosted music scenario as it was planned to be. Took me some more time than planned :)</p>\n<p>&#x200B;</p>\n<p>So Symfonium is an advanced Android music player (Paid app with free trial) that support most self hosted music solutions to fully enjoy your music anywhere and allows aggregation of multiple servers.</p>\n<p>It currently support:</p>\n<p>- The local storage of the phone (SDCard,...)</p>\n<p>- Emby</p>\n<p>- Jellyfin</p>\n<p>- Subsonic</p>\n<p>- OpenSubsonic (A long term effort that I started to improve Subsonic clients and servers <a href=\"https://github.com/opensubsonic/open-subsonic-api\">https://github.com/opensubsonic/open-subsonic-api</a>. Already quite a few new features for some servers)</p>\n<p>- Kodi</p>\n<p>- Plex</p>\n<p>- Samba (SMB v2/v3)</p>\n<p>- WebDAV</p>\n<p>- Internet Radio</p>\n<p>&#x200B;</p>\n<p>It's an offline first solution with tons of features, like AutoEQ support, smart filters, personal mixes, transcoding, replaygain, ...</p>\n<p>But I don't want to make this post a long list of features, just wanted more people to be aware of this relatively new music player dedicated to self hosting.</p>\n<p>&#x200B;</p>\n<p>And if there's other well established music self hosting solution with a proper API do not hesitate to ask for support so I can look into it.</p>\n<p>&#x200B;</p>\n<p>Website: <a href=\"https://symfonium.app/\">https://symfonium.app/</a></p>\n<p>PlayStore: <a href=\"https://play.google.com/store/apps/details?id=app.symfonik.music.player\">https://play.google.com/store/apps/details?id=app.symfonik.music.player</a></p>",
            "date_published": "2023-11-02T07:49:43+00:00",
            "authors": [
                {
                    "name": "Tolriq",
                    "url": "https://www.reddit.com/user/Tolriq"
                }
            ]
        },
        {
            "id": "17kwvwm",
            "url": "/r/selfhosted/comments/17kwvwm/just_this_took_me_so_long_folder_mapping_and/",
            "external_url": "https://i.redd.it/qybdoblu2mxb1.jpg",
            "title": "Just this took me so long. Folder mapping and permissions.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17kwvwm/just_this_took_me_so_long_folder_mapping_and/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17kwvwm/just_this_took_me_so_long_folder_mapping_and/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.redd.it/qybdoblu2mxb1.jpg\" />",
            "date_published": "2023-10-31T22:11:49+00:00",
            "authors": [
                {
                    "name": "pennanbeach",
                    "url": "https://www.reddit.com/user/pennanbeach"
                }
            ]
        },
        {
            "id": "17k1fa7",
            "url": "/r/selfhosted/comments/17k1fa7/hello_alex_from_immich_here_we_recently_got_an/",
            "external_url": "https://www.theverge.com/23938533/self-hosting-local-first-software-vergecast",
            "title": "Hello, Alex from Immich here - We recently got an opportunity to discuss self-hosting complexity with The Vergecast (from theverge.com). It brought some good discussion on there, and I think you guys would like to hear it as well.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17k1fa7/hello_alex_from_immich_here_we_recently_got_an/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17k1fa7/hello_alex_from_immich_here_we_recently_got_an/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-30T19:27:45+00:00",
            "authors": [
                {
                    "name": "altran1502",
                    "url": "https://www.reddit.com/user/altran1502"
                }
            ]
        },
        {
            "id": "17j89rs",
            "url": "/r/selfhosted/comments/17j89rs/what_selfhosted_service_have_the_best_return_of/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17j89rs/what_selfhosted_service_have_the_best_return_of/",
            "title": "What selfhosted service have the best \"return of investment\"",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17j89rs/what_selfhosted_service_have_the_best_return_of/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17j89rs/what_selfhosted_service_have_the_best_return_of/'>Reddit</a></caption><div><br></div><p>Hi guys,</p>\n<p>What services do you think have the best return of investment? Where is it truly worth it to selfhost?</p>\n<p>Cheers</p>",
            "date_published": "2023-10-29T17:46:11+00:00",
            "authors": [
                {
                    "name": "tonydocent",
                    "url": "https://www.reddit.com/user/tonydocent"
                }
            ]
        },
        {
            "id": "17i1dns",
            "url": "/r/selfhosted/comments/17i1dns/pfsense_just_messed_with_their_userbase_again/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17i1dns/pfsense_just_messed_with_their_userbase_again/",
            "title": "pfSense just messed with their userbase again, maybe its time to stop using it?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17i1dns/pfsense_just_messed_with_their_userbase_again/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17i1dns/pfsense_just_messed_with_their_userbase_again/'>Reddit</a></caption><div><br></div><p><em>I was surprised to not see any post about this here yet, so here it is i guess.</em></p>\n<p><strong>Netgate (the company who runs pfSense) has just announced serious changes to their \"free\" so called \"Home+Lab\" license of pfSense.</strong></p>\n<p><a href=\"https://www.netgate.com/blog/addressing-changes-to-pfsense-plus-homelab\">Here is the link to their offical blog post.</a></p>\n<hr />\n<h1>Background:</h1>\n<p>Netgate have offered a free and opensource version of pfSense, called the CE (Community Edition). They also offered a version called \"pfSense Plus\" which was paid and offered a few more features but also support from Netgate, which is of course perfectly fine and very common (look at Proxmox for example).</p>\n<p>A while ago (1,5 years) they introduced \"<strong>Home+Lab</strong>\" as a product and license version in order for casual users and \"homelabbers\" to dip a toe into their commercial offerings which has more features than the CE. Basically like \"here you can use your enterprise version for free, but its a bit limited of course\". The obvious goal there is to motivate users to switch from the free CE to a paid version, again nothing wrong with that. <a href=\"https://www.portainer.io/take-3\">Portainer for example does this too</a>.</p>\n<p>Because of this, users switched from the \"always\" free CE version to the \"Home+Lab\" version, upgrading their installations and enjoying a few more features. According to Netgate, thousands of users have installed it. Great!</p>\n<hr />\n<h1>Now</h1>\n<p>But just now <a href=\"https://www.netgate.com/blog/addressing-changes-to-pfsense-plus-homelab\">Netgate have announced</a> major changes to this, out of the blue, <strong>without any prior notice</strong>. The free \"Home+Lab\" version is no longer available for download, its just gone.</p>\n<p>As a reason they cite that thirdparty sellers (on Aliexpress etc. i imagine) were downloading the \"better\" version of pfSense, aka the \"Home+Lab\" version, and installing it on their hardware appliances and then selling them. Without Netgate seeing any revenue from this. </p>\n<hr />\n<p>Please see <a href=\"https://www.netgate.com/blog/addressing-changes-to-pfsense-plus-homelab\">their blogpost</a> for all the details. But one crucial point is that anyone who is currently running their \"Home+Lab\" version, can keep running it (yay!) but they also say that <strong>future upgrades and bugfixes may require a subscription</strong>. So basically, users installed a free \"better\" version, which now doesnt exist anymore, and to continue using it with updates, they \"might\" need to pay a subscription fee. Something as crucial like a firewall appliance should be kept up to date for security, so just ignoring that is not really a option. And Netgate also state that if you have to reinstall your current \"Home+Lab\" version, they cannot provide that for free to you. And those subscriptions apparently come at a very high price. <strong>Are you willing to pay $400/year for your firewall software when youre only using it privately in your small homelab?</strong></p>\n<p>Paying for software, or any product, is not a bad thing. And companies need to make money, they need to pay employees. This should be obvious. There is no problem with that in itself. But the way this was done, telling their userbase for quite a while to try out this free version of the premium product, and then pulling the rug away underneath the feet, is just plain wrong and fucked up.</p>\n<hr />\n<p><em>\"Okay whatever, then just switch back to the actual free CE version!\"</em> Great idea, but apparently thats not so super easy.</p>\n<p><strong>Lawrence Systems</strong> have already made a excellent video summing up all these changes. I would recommend watching it to get the full picture, i can and want to only cover a bit here:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=rXI6-E1nc5M\">Addressing Licence Changes to pfSense Plus Home and Lab</a></li>\n</ul>\n<p>They also made a video about switching back from pfSense plus (aka Home+Lab?) to pfSense CE:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=kFUcmWTazGg\">How to Convert From pfsense plus 23.05 to pfsense CE 2.7</a></li>\n</ul>\n<p>Reading recent posts about this on /r/pfSense subreddit, the community seems to be quite angry about this. And it doesnt help that their subreddit is actually run by Netgate employees, so it isnt exactly a independent discussion forum there at all. For example a user tried to get feedback and support for <a href=\"https://www.reddit.com/r/homelab/comments/17hs7o2/bounty_for_pfsense_to_opnsense_conversion/\">a tool to convert pfSense configs to OPNsense configs</a>, and the moderators removed the post without further comment.</p>\n<hr />\n<p>My personal recommendation would be that this is a huge opportunity to finally switch away from pfSense, they have shown once again that they cannot be trusted. Take a look at the most obvious \"competitor\" /r/OPNsense /r/OPNsenseFirewall, they started as a fork of pfSense and have developed quite nicely.</p>\n<p>And to make it even more clear what kind of people are running Netgate (pfSense), if you havent read it yet, <a href=\"https://opnsense.org/opnsense-com/\">this is the story</a> of when users announced the fork OPNsense, how a <strong>employee of Netgate</strong> was running <code>opnsense.com</code> which was a mock website <strong>entirely made to shit on the OPNsense project and discredit them</strong>. <a href=\"http://web.archive.org/web/20160314132836/http:/www.opnsense.com/\">I encourage you to look at it and make up your own mind about it</a>. And yes, <a href=\"https://www.netgate.com/blog/author/jamie-thompson\">this employee still works for them today it seems</a>. This alone should be reason enough to <strong>never use anything by Netgate</strong>, ever, wether its a free CE or paid.</p>\n<p>Atleast right now they are still offering the free and opensource CE version. But who knows how long that will last. They might as well kill that option without prior notice in a few months or a year from now. Its better to think about switching before being forced to.</p>\n<hr />\n<p>There have also been various other issues with Netgate´s behaviour towards their users over the years, but covering them all here would be too much and offtopic, i would like to focus this post mostly on the very recent issue.</p>\n<p>If people get angry about Oracle and seemingly shutting down \"free\" VPS instances at random, then they should be angry about Netgate pulling shit like this too.</p>\n<hr />\n<h1>TL;DR</h1>\n<p><strong>Stop using pfSense (just any Netgate products), switch to something else.</strong></p>\n<p>Its not the only alternative, but /r/OPNsense /r/OPNsenseFirewall is one major example.</p>\n<hr />\n<p><em>Disclaimer: I am no pfSense expert, very far from it. If i got any of the history or current events wrong in this post, please let me know and i will immediately correct them. For me when the time came to pick a (virtualized) firewall/router appliance, i installed both pfSense and OPNsense in VMs and took a quick look. Even tho pfSense did leave a very \"enterprise-ish\" impression, it didnt feel right somehow, just odd in some way. Then looking at OPNsense, i felt immediately at home, i cant really narrow down why exactly. It simply felt much more open and friendly from the beginning. And i mean the software, at that point i had no idea what was going on between pfSense and OPNsense. All i knew was that OPNsense originated from pfSense, thats all. I tried both a tiny bit and quickly decided that i like OPNsense more, and thats what i have been using for a long time now and im very happy with it.</em></p>\n<hr />\n<p><em>None of the existing flair options seem to really fit to this, so forgive me for not having any flair. Mods feel free to overwrite any flair to this. And if a post about Jellyfins future is fitting here, then imo a post about demise of pfSense should be allowed too.</em></p>",
            "date_published": "2023-10-28T00:08:23+00:00",
            "authors": [
                {
                    "name": "thekrautboy",
                    "url": "https://www.reddit.com/user/thekrautboy"
                }
            ]
        },
        {
            "id": "17eihqh",
            "url": "/r/selfhosted/comments/17eihqh/odigos_v0182_opensource_instant_distributed/",
            "external_url": "https://github.com/keyval-dev/odigos",
            "title": "Odigos v0.1.82 - Open-source instant distributed tracing without code changes",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17eihqh/odigos_v0182_opensource_instant_distributed/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17eihqh/odigos_v0182_opensource_instant_distributed/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-23T11:50:42+00:00",
            "authors": [
                {
                    "name": "LivelyUnderdog54",
                    "url": "https://www.reddit.com/user/LivelyUnderdog54"
                }
            ]
        },
        {
            "id": "17dq3aq",
            "url": "/r/selfhosted/comments/17dq3aq/how_do_you_all_monitor_your_server_performance/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17dq3aq/how_do_you_all_monitor_your_server_performance/",
            "title": "How do you all monitor your server performance?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17dq3aq/how_do_you_all_monitor_your_server_performance/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17dq3aq/how_do_you_all_monitor_your_server_performance/'>Reddit</a></caption><div><br></div><p>As in, when I watched YouTube tutorials, I often see YouTubers have a small widget on their desktop giving them an overview of their ram usage, security level, etc. What apps do you all use to track this?</p>",
            "date_published": "2023-10-22T10:15:13+00:00",
            "authors": [
                {
                    "name": "Michaelscarn69-",
                    "url": "https://www.reddit.com/user/Michaelscarn69-"
                }
            ]
        },
        {
            "id": "17btic6",
            "url": "/r/selfhosted/comments/17btic6/debian_server_essentials_setup_configure_and/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17btic6/debian_server_essentials_setup_configure_and/",
            "title": "Debian Server Essentials: Setup, Configure, and Hardening Your System",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17btic6/debian_server_essentials_setup_configure_and/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17btic6/debian_server_essentials_setup_configure_and/'>Reddit</a></caption><div><br></div><p>I am back with another published article. </p>\n<p><a href=\"https://preview.redd.it/1npqlg1348vb1.jpg?width=1024&amp;format=pjpg&amp;auto=webp&amp;s=bbd1b0193ae6b49648e7e6863050d316a22ff025\"> Ideogram.ai: penguin in a server room covered in ice and snow, whole picture made out of green matrix style lines of code, cinematic</a></p>\n<p>Please be kind! I am a self-taught Linux user and by no means an expert. My goal with this guide is to help newcomers to Linux have an easier and more secure start.</p>\n<p>To all the experts out there, please be kind and do share your tips and observations. I am happy to keep updating the article to make the self-hosting world more secure.</p>\n<p><a href=\"https://nerdyarticles.com/debian-server-essentials-setup-configure-and-hardening-your-system/\">https://nerdyarticles.com/debian-server-essentials-setup-configure-and-hardening-your-system/</a></p>",
            "date_published": "2023-10-19T21:00:41+00:00",
            "authors": [
                {
                    "name": "KillerTic",
                    "url": "https://www.reddit.com/user/KillerTic"
                }
            ]
        },
        {
            "id": "17a21eq",
            "url": "/r/selfhosted/comments/17a21eq/did_i_screw_up_by_putting_in_my_phone_number_in/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/17a21eq/did_i_screw_up_by_putting_in_my_phone_number_in/",
            "title": "Did I screw up by putting in my phone number in when registering for a domain for my self hosted stack?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/17a21eq/did_i_screw_up_by_putting_in_my_phone_number_in/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/17a21eq/did_i_screw_up_by_putting_in_my_phone_number_in/'>Reddit</a></caption><div><br></div><p>I've purchased a few domains in my life, but it was always through Google Domains in the past. This weekend I bought a new one through Cloudflare so that I could make a nice subdomain structure for all of my self-hosted apps. That went great - I'm using Traefik and Pihole for the local DNS.</p>\n<p>But in the past two days, I've gotten 28 spam calls and a handful of text messages from companies who want to design my website, or logo, or something else. I only listened to the first few voicemails but they did mention the name of the domain I purchased.</p>\n<p>This didn't happen when I used Google Domains. Is there something I missed? I knew this information was public, but I feel like I must have screwed up somehow and it put me on a lot of spam lists.</p>\n<p>-----</p>\n<p>EDIT: It looks like my mistake was registering a .us domain, which requires this to be public. Yikes.</p>",
            "date_published": "2023-10-17T16:15:34+00:00",
            "authors": [
                {
                    "name": "dontevendrivethatfar",
                    "url": "https://www.reddit.com/user/dontevendrivethatfar"
                }
            ]
        },
        {
            "id": "179ew0y",
            "url": "/r/selfhosted/comments/179ew0y/i_created_a_library_of_fullcolor_svg_icons_of/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/179ew0y/i_created_a_library_of_fullcolor_svg_icons_of/",
            "title": "I created a library of full-color SVG icons of homelab-related software, products, and brands that I'm using in my network diagrams. It was going to be a personal project, but I thought I'd share it here 🤷🏻‍♂️",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/179ew0y/i_created_a_library_of_fullcolor_svg_icons_of/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/179ew0y/i_created_a_library_of_fullcolor_svg_icons_of/'>Reddit</a></caption><div><br></div><p>TL;DR:</p>\n<p>500+ full-color SVG icons of homelab-related software, products, and brands for use in dashboards, network diagrams, etc...</p>\n<p>https://github.com/loganmarchione/homelab-svg-assets</p>\n<p>See a preview of all icons <a href=\"https://github.com/loganmarchione/homelab-svg-assets/blob/main/ICONS.md\">here</a></p>\n<hr />\n<p>In my dashboards and network diagrams, I was using the already existing SVG icon sets (<a href=\"https://simpleicons.org/\">Simple Icons</a>, <a href=\"https://icons.getbootstrap.com/\">Bootstrap Icons</a>, <a href=\"https://fontawesome.com/icons\">Font Awesome</a>, etc...), as well as random PNG/JPG files I found online. However, I always wanted consistently-sized full-color SVGs (instead of black/monotone or random PNG/JPG files).</p>\n<p>I've gathered 500+ SVGs so far, and wanted to share them here.</p>\n<p>https://github.com/loganmarchione/homelab-svg-assets.</p>\n<p>I don't intend to replace any existing icon sets. Instead, I'm focused on homelab-related software, products, and brands ONLY.</p>\n<p>I have the following features so far:</p>\n<ul>\n<li>Consistent viewbox (48x48)</li>\n<li>Optimized with SVGO (the entire repo is ~6MB)</li>\n<li>Diagrams.net <a href=\"https://app.diagrams.net/?clibs=Uhttps%3A%2F%2Fraw.githubusercontent.com%2Floganmarchione%2Fhomelab-svg-assets%2Fmain%2Fhomelab-svg-assets.xml\">library</a> (this is the reason I created this project)</li>\n<li>CDN (via <a href=\"https://www.jsdelivr.com/package/npm/@loganmarchione/homelab-svg-assets\">jsDelivr</a>)</li>\n<li>PHP (via <a href=\"https://packagist.org/packages/loganmarchione/homelab-svg-assets\">Packagist</a>)</li>\n<li>Node (via <a href=\"https://www.npmjs.com/package/@loganmarchione/homelab-svg-assets\">NPM</a>)</li>\n<li>Hugo (via <a href=\"https://github.com/loganmarchione/homelab-svg-assets#hugo-usage\">module</a>)</li>\n</ul>\n<p>I created this for myself, but figured it might be useful here!</p>",
            "date_published": "2023-10-16T19:49:29+00:00",
            "authors": [
                {
                    "name": "lmm7425",
                    "url": "https://www.reddit.com/user/lmm7425"
                }
            ]
        },
        {
            "id": "1797d0v",
            "url": "/r/selfhosted/comments/1797d0v/clickvote_opensource_likes_upvotes_and_reviews_in/",
            "external_url": "https://github.com/clickvote/clickvote",
            "title": "Clickvote - open-source likes, upvotes, and reviews in real-time",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/1797d0v/clickvote_opensource_likes_upvotes_and_reviews_in/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/1797d0v/clickvote_opensource_likes_upvotes_and_reviews_in/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-16T14:32:19+00:00",
            "authors": [
                {
                    "name": "Alternative-Rich-578",
                    "url": "https://www.reddit.com/user/Alternative-Rich-578"
                }
            ]
        },
        {
            "id": "1790njv",
            "url": "/r/selfhosted/comments/1790njv/what_is_the_one_thing_every_selfhosted_household/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/1790njv/what_is_the_one_thing_every_selfhosted_household/",
            "title": "What is the one thing every self-hosted household should have?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/1790njv/what_is_the_one_thing_every_selfhosted_household/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/1790njv/what_is_the_one_thing_every_selfhosted_household/'>Reddit</a></caption><div><br></div><p>Let's keep it simple. I'm sure most of us are proud of Docker CPU cycles charted in Grafana via Prometheus, but I'm talking about the house as a whole.</p>\n<p>My personal favorite is turning out to be <a href=\"https://mealie.io/\">Mealie</a>. </p>\n<p>I self-host a bunch of things for my personal use, but Mealie definitely takes the cake in terms of benefitting the entire household. I like the meal planner and the ability to hit the supermarket once to get all the necessary groceries for the week (I've never been able to achieve this before). I don't think there is anything in my stack that even compares with the benefits my house gets of out Mealie.</p>\n<p>My runner up would have to be any of the <strong>self-hosted media players</strong> (Plex, Jellyfin, etc.), but we also have Netflix and a bunch of streaming services, so not that impactful. <strong>Home Assistant</strong> would also be a close runner up, but it only provides great benefits for me, not the rest of the house. I think <strong>Immich</strong> will be on this list shortly, when it matures a bit more (are we able to import existing photos yet?)</p>",
            "date_published": "2023-10-16T07:49:23+00:00",
            "authors": [
                {
                    "name": "puckpuckgo",
                    "url": "https://www.reddit.com/user/puckpuckgo"
                }
            ]
        },
        {
            "id": "1789esy",
            "url": "/r/selfhosted/comments/1789esy/its_been_a_week_since_i_fell_into_the_self/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/1789esy/its_been_a_week_since_i_fell_into_the_self/",
            "title": "It’s been a week since I fell into the self hosting rabbit hole.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/1789esy/its_been_a_week_since_i_fell_into_the_self/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/1789esy/its_been_a_week_since_i_fell_into_the_self/'>Reddit</a></caption><div><br></div><p>I always considered myself fairly tech-savvy, constantly learning and seeking help from Reddit communities when I hit roadblocks. But then, I stumbled upon \"selfhosted\" by accident while researching a different app, which led me to the world of open-source software – something I had no prior knowledge of. When I realized I had to set up a server, I was in for a surprise.</p>\n<p>A kind soul directed me to the \"selfhosted\" subreddit. Spending an entire evening there opened my eyes to a world of possibilities I never knew existed. I had no idea you could do this. The reality hit me hard – I wasn't as smart as I thought.</p>\n<p>For the next four days, I immersed myself in learning how to host my own media server. It was challenging, especially since I'm not a programmer and had zero knowledge about dockers or containers. ChatGPT became my ally, helping me understand complex concepts in simple terms.</p>\n<p>Last night, I successfully set up my media server on an old gaming laptop using Jellyfin, Sonarr, Radarr, Requestrr, Jackett, and Heimdall. I'm absolutely delighted, especially with Requestrr, which makes my life so much easier.</p>\n<p>Now, I'm eager to explore self-hosting even further by setting up a music library, ebooks, photos, videos, a password manager, and more. I've come across options like Lidarr for music and Readarr for books, but I'd love to hear your recommendations.</p>\n<p>Is there a way to use a similar server setup like Sonarr for managing music and ebooks? I've tried Openbooks and Kavita, but Openbooks was a pain to set up and Kavita seems to be a library manager without a download option. Can you recommend something that I can download and use offline on my mobile for music and ebooks please?</p>\n<p>On a special note, I want to express my heartfelt thanks to everyone who's been patient and supportive, especially those who answered challenging questions in the subreddit. You're all truly amazing, and your guidance means the world to me. A big shoutout to all of you!</p>\n<p>People like you are rare, and you deserve all the good things in life.</p>",
            "date_published": "2023-10-15T06:36:31+00:00",
            "authors": [
                {
                    "name": "Michaelscarn69-",
                    "url": "https://www.reddit.com/user/Michaelscarn69-"
                }
            ]
        },
        {
            "id": "177oy2z",
            "url": "/r/selfhosted/comments/177oy2z/today_i_learned_that_your_email_server_may_be/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/177oy2z/today_i_learned_that_your_email_server_may_be/",
            "title": "Today i learned that your email server may be doomed just because of TLD",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/177oy2z/today_i_learned_that_your_email_server_may_be/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/177oy2z/today_i_learned_that_your_email_server_may_be/'>Reddit</a></caption><div><br></div><p>If your domain gets in this list, then your emails will end up in spam folder much more often than not.</p>\n<p><a href=\"https://github.com/apache/spamassassin/blob/trunk/rulesrc/sandbox/pds/20_ntld.cf\">https://github.com/apache/spamassassin/blob/trunk/rulesrc/sandbox/pds/20_ntld.cf</a></p>\n<p>&#x200B;</p>",
            "date_published": "2023-10-14T12:55:51+00:00",
            "authors": [
                {
                    "name": "D-ff1",
                    "url": "https://www.reddit.com/user/D-ff1"
                }
            ]
        },
        {
            "id": "177h2hx",
            "url": "/r/selfhosted/comments/177h2hx/sponsorblock_client_for_all_youtube_tv_clients/",
            "external_url": "https://github.com/dmunozv04/iSponsorBlockTV",
            "title": "SponsorBlock client for all YouTube TV clients.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/177h2hx/sponsorblock_client_for_all_youtube_tv_clients/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/177h2hx/sponsorblock_client_for_all_youtube_tv_clients/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-14T04:10:16+00:00",
            "authors": [
                {
                    "name": "Cazo19",
                    "url": "https://www.reddit.com/user/Cazo19"
                }
            ]
        },
        {
            "id": "1776m7g",
            "url": "/r/selfhosted/comments/1776m7g/screenshots_of_a_docker_webui_ive_been_working_on/",
            "external_url": "https://imgur.com/a/KjMLPsz",
            "title": "Screenshots of a Docker Web-UI I've been working on",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/1776m7g/screenshots_of_a_docker_webui_ive_been_working_on/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/1776m7g/screenshots_of_a_docker_webui_ive_been_working_on/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.imgur.com/a/KjMLPsz.jpg\" />",
            "date_published": "2023-10-13T19:28:14+00:00",
            "authors": [
                {
                    "name": "lllllllillllllillll",
                    "url": "https://www.reddit.com/user/lllllllillllllillll"
                }
            ]
        },
        {
            "id": "176hqfk",
            "url": "/r/selfhosted/comments/176hqfk/there_are_jobs_where_the_company_wants_to_hear/",
            "external_url": "https://imgur.com/a/k3uTtF0",
            "title": "There are jobs where the company wants to hear about your homelab, here is one example.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/176hqfk/there_are_jobs_where_the_company_wants_to_hear/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/176hqfk/there_are_jobs_where_the_company_wants_to_hear/'>Reddit</a></caption><div><br></div><div><br></div><img src=\"https://i.imgur.com/a/k3uTtF0.jpg\" />",
            "date_published": "2023-10-12T21:17:17+00:00",
            "authors": [
                {
                    "name": "BloodyIron",
                    "url": "https://www.reddit.com/user/BloodyIron"
                }
            ]
        },
        {
            "id": "173qc6l",
            "url": "/r/selfhosted/comments/173qc6l/leantime_v24_is_out_open_source_project/",
            "external_url": "https://github.com/Leantime/leantime",
            "title": "Leantime v2.4 is out - Open source project management tool",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/173qc6l/leantime_v24_is_out_open_source_project/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/173qc6l/leantime_v24_is_out_open_source_project/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-09T12:17:20+00:00",
            "authors": [
                {
                    "name": "intheleantime",
                    "url": "https://www.reddit.com/user/intheleantime"
                }
            ]
        },
        {
            "id": "173qtly",
            "url": "/r/selfhosted/comments/173qtly/jellystat_is_for_jellyfin_what_tautuli_is_for_plex/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/173qtly/jellystat_is_for_jellyfin_what_tautuli_is_for_plex/",
            "title": "Jellystat is for Jellyfin what Tautuli is for Plex.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/173qtly/jellystat_is_for_jellyfin_what_tautuli_is_for_plex/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/173qtly/jellystat_is_for_jellyfin_what_tautuli_is_for_plex/'>Reddit</a></caption><div><br></div><p>I kept coming back to plex and was not able to completely move to Jellyfin because of Tautulli, that gives detailed stats about the Plex users watched videos.</p>\n<p>I recently came across <a href=\"https://github.com/CyferShepard/Jellystat\">Jellystat</a>. Which has all the features I used on Tautulli.</p>\n<p>If you share your Jellyfin access with your family and friends Jellystat is a must have addition.</p>",
            "date_published": "2023-10-09T12:41:17+00:00",
            "authors": [
                {
                    "name": "sevlonbhoi1",
                    "url": "https://www.reddit.com/user/sevlonbhoi1"
                }
            ]
        },
        {
            "id": "172ycag",
            "url": "/r/selfhosted/comments/172ycag/cosmos_0100_all_in_one_secure_reverseproxy/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/172ycag/cosmos_0100_all_in_one_secure_reverseproxy/",
            "title": "🆕 Cosmos 0.10.0 - All in one secure Reverse-proxy, container manager with app store and authentication provider now has its own integrated VPN! Fully managed with integration to the reverse proxy",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/172ycag/cosmos_0100_all_in_one_secure_reverseproxy/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/172ycag/cosmos_0100_all_in_one_secure_reverseproxy/'>Reddit</a></caption><div><br></div><p>Link: <a href=\"https://github.com/azukaar/cosmos-Server/\">github.com/azukaar/cosmos-Server/</a></p>\n<p>Hello everyone! It's been a while!!</p>\n<p>I was cooking something that took a long time in order to get there, but Cosmos now has its own VPN: <strong>Constellation</strong>! </p>\n<p><a href=\"https://preview.redd.it/9duklk7srysb1.png?width=1280&amp;format=png&amp;auto=webp&amp;s=718d279c6d902ab1a6efc16b86fd34f918375d56\">yes I do find this arrow funny</a></p>\n<p>&#x200B;</p>\n<p>As a reminder, this exists alongside the existing features:</p>\n<p>&#x200B;</p>\n<ul>\n<li><strong>App Store</strong> 📦📱 To easily install and manage your applications, with simple installers, automatic updates and security checks</li>\n<li><strong>Customizable Homepage</strong> 🏠🖼 To access all your applications from a single place, with a beautiful and customizable UI</li>\n<li><strong>Reverse-Proxy</strong> 🔄🔗 Targeting containers, other servers, or serving static folders / SPA with <strong>automatic HTTPS</strong>, and a <strong>nice UI</strong></li>\n<li><strong>Authentication Server</strong> 👦👩 With strong security, <strong>multi-factor authentication</strong> and multiple strategies (<strong>OpenId</strong>, forward headers, HTML)</li>\n<li><strong>Container manager</strong>    🐋🔧  To easily manage your containers and their settings, keep them   up  to  date as well as audit their security. Includes docker-compose    support!</li>\n<li><strong>Identity Provider</strong> 👦👩 To easily manage your users, <strong>invite your friends and family</strong>     to your applications without awkardly sharing credentials. Let them     request a password change with an email rather than having you unlock     their account manually!</li>\n<li><strong>SmartShield technology</strong>    🧠🛡  Automatically secure your applications without manual   adjustments  (see  below for more details). Includes anti-bot and   anti-DDOS  strategies.</li>\n</ul>\n<p>&#x200B;</p>\n<p>Let me put it straight: Constellation has been a hell of a ride to release. It has been 2 months of hard work, to ensure it is stable, secure, but also that it properly integrate with other components of Cosmos (especially the reverse proxy). This is what you get:</p>\n<p>&#x200B;</p>\n<ul>\n<li>Full mesh VPN with P2P</li>\n<li>Complete UI to manage your network and devices</li>\n<li>The UI includes letting your users manage their own devices</li>\n<li>An internal DNS with Adblock list, custom entries and  DNSSEC (think pihole + unbound)</li>\n<li>A basic client application</li>\n<li>An integration to the reverse proxy (to secure your servapps easily)</li>\n<li>Multi-server setup (to bypass CGNAT or access isolated private servers)</li>\n</ul>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/c7uwhj0fsysb1.png?width=981&amp;format=png&amp;auto=webp&amp;s=c6980dcec992a6ed9c5eac84a1678223976fe98f\">Secure your URLs in one click!</a></p>\n<p>Constellation itself is based on Nebula but build upon it, and will continue to do so. Some of the planned features for Constellation are</p>\n<ul>\n<li>Exit Nodes</li>\n<li>Internal Firewalls</li>\n<li>Probably some container interactions</li>\n</ul>\n<p>&#x200B;</p>\n<p>I am still actively working on the client applications, for now only Android and Windows are available but the other ones will follow up soon!</p>\n<h1>Why would you use Constellation rather than alternatives like Cloudflare Tunnel or Tailscale?</h1>\n<p>&#x200B;</p>\n<p>Cloudflare Tunnel is <strong>not</strong> a very good practice for security: first of all it leaves your origin server in your local network unprotected, and it also let CLoudflare see all your decrypted network. Tailscale is a better alternative, but not quite in the \"self-hosted\" philosophy as it relies on distant cloud servers. Now the closest thing you will get to what Constellation does, is something like OpenZiti. What Constellation offers you on top of it is the integration to the reverse proxy and the automatic DNS. </p>\n<p>For example, one of the big issues of VPN setups is \"how to tunnel my stuff\". You have multiple choices: Tunnel everything (but then it impact your everyday browsing). Have 2 sets of domains, or manually maintain a DNS with overwrites (both being annoying to do). Instead, Constellation automatically rewrite all your reverse proxy URLs on the fly to be tunneled through the VPN. It is also a full split tunnel so you can leave it on at all time.</p>\n<p>Why would you <strong>not</strong> choose Constellation?</p>\n<p>The three main reasons would be: The application might not be available yet for your platform, you don't want to self-host the discovery server (in case you need one, ex. for CGNAT), or you need the exit node functionality (aka. proxy all your network through the server. No ETA on this feature for now).</p>\n<p>Aside from this, few improvement to this version, here's the full changelog:</p>\n<p>&#x200B;</p>\n<ul>\n<li>Added Constellation</li>\n<li>DNS Challenge is now used for all certificates when enabled [breaking change]</li>\n<li>Rework headers for better compatibility</li>\n<li>Improve experience for non-admin users</li>\n<li>Fix bug with redirect on logout</li>\n<li>Added OverwriteHostHeader to routes to override the host header sent to the target app</li>\n<li>Added WhitelistInboundIPs to routes to  filter incoming requests based on IP per URL</li>\n</ul>\n<p>&#x200B;</p>\n<p>It's good \"to be back\" from this adventure, as I have been pretty low-profile while this was taking a lot of my time, hope you enjoy the update!</p>\n<p>Thanks!</p>",
            "date_published": "2023-10-08T12:48:16+00:00",
            "authors": [
                {
                    "name": "azukaar",
                    "url": "https://www.reddit.com/user/azukaar"
                }
            ]
        },
        {
            "id": "171rd8n",
            "url": "/r/selfhosted/comments/171rd8n/a_deep_dive_into_paperlessngx/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/171rd8n/a_deep_dive_into_paperlessngx/",
            "title": "A deep dive into Paperless-ngx",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/171rd8n/a_deep_dive_into_paperlessngx/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/171rd8n/a_deep_dive_into_paperlessngx/'>Reddit</a></caption><div><br></div><p>I am back already, with a new article I wrote about my experience with Paperless-ngx.</p>\n<p>I have been using Paperless for years and really enjoy it very much. I wanted to share with everyone how I have choosen to set it up (the article includes my docker compose and explenation of why it is done that way), as well as a review of my configuration of paperless (the tags I use, document types, ...).</p>\n<p>Also a general view of, why everyone should be going digital and start ditching their paper based solutions.</p>\n<p>The feedback on my last post was amazing. I originaly didn't want to post a new article (and on here) so quickly again, but I couldn't help myself.</p>\n<p>I really hope this article helps people out their. Might it be deciding to go digital, helping them to organise their paperless install or use my code to spin up their instance.</p>\n<p><a href=\"https://nerdyarticles.com/a-clutter-free-life-with-paperless-ngx/\">https://nerdyarticles.com/a-clutter-free-life-with-paperless-ngx/</a></p>",
            "date_published": "2023-10-06T23:36:48+00:00",
            "authors": [
                {
                    "name": "KillerTic",
                    "url": "https://www.reddit.com/user/KillerTic"
                }
            ]
        },
        {
            "id": "170owzc",
            "url": "/r/selfhosted/comments/170owzc/immich_selfhosted_photos_and_videos_backup/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/170owzc/immich_selfhosted_photos_and_videos_backup/",
            "title": "Immich - Self-hosted photos and videos backup solution from your mobile phone (AKA Google Photos replacement you have been waiting for!) - October 2023 Update - Support for external libraries, map view on mobile app, video transcoding with hardware acceleration, and more 🎉",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/170owzc/immich_selfhosted_photos_and_videos_backup/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/170owzc/immich_selfhosted_photos_and_videos_backup/'>Reddit</a></caption><div><br></div><p>Repo: <a href=\"https://github.com/immich-app/immich\">https://github.com/immich-app/immich</a></p>\n<p>Website: <a href=\"https://immich.app/\">https://immich.app/</a></p>\n<p>Hello everybody, this might be the most extended break since I started writing update progress for Immich for the past year and a half. </p>\n<p>I took a month-long vacation to visit my parents and siblings in Vietnam. It was a trip with many emotions. As I've grown older, my parents are getting older as well. Browsing photos of them just a few years back struck me again that all we will ever carry with us are memories. This realization has given me an even stronger sense of responsibility to preserve the memories in the family so that it is accessible to my family member from the past to the future generation so that the grandchild of my kid will know how lovely their great-great-grandparents were. </p>\n<p>While I was gone, the team took the development task autonomously with little of my participation. This made me very happy, as the project is now in the good hands of the contributors. My role recently has been focused on testing, QA, deployment, bug fixes, and small development tasks.</p>\n<p>I am looking forward to getting back into developing more significant features in the coming months. </p>\n<p>Within the last three months, Immich has gone from version <strong>1.71</strong> to <strong>1.81</strong> with many new features and improvements. I am happy to give you some recaps of the new features highlighted below.</p>\n<p>&#x200B;</p>\n<ul>\n<li>Support for external libraries </li>\n<li>Video hardware transcoding</li>\n<li>Manually upload photos and video on the mobile app</li>\n<li>Optimizing views on most pages on the web</li>\n<li>UI/UX improvement for facial recognition actions</li>\n<li>Slideshow mode on the web</li>\n<li>Map view on mobile app</li>\n<li>Better settings configuration</li>\n</ul>\n<h1>Support for external libraries</h1>\n<p>This feature was one of the community's first and most requested features. We had lengthy <a href=\"https://github.com/immich-app/immich/discussions/1006\">discussions</a>, some very heated because the feature was deemed as not the original goal of Immich, which served as a backup solution. Immich, since then, has evolved to be an excellent application to not only backup but also to browse and manage your memories. </p>\n<p>The community and contributors then took this feature into their own hands and implemented it. The work was completed in around 2 months with much development and testing effort from the contributors and helpful community members. I appreciate you all.</p>\n<p>You can now mount external libraries for different users to the container and have Immich scan them to display in the instance. All of Immich's goodies are accessible for photos and videos in the library. Please visit our <a href=\"https://immich.app/docs/features/libraries\">official documentation</a> for more information on how to use this feature.</p>\n<h1>Video hardware transcoding</h1>\n<p>You can now utilize hardware acceleration through supported CPUs or GPUs to transcode video faster and offload the work from hogging up the CPU. </p>\n<p><a href=\"https://preview.redd.it/bhv4e5qybfsb1.png?width=1274&amp;format=png&amp;auto=webp&amp;s=99aaf27e16d0343de344504269a9153aaa72ff05\">Hardware acceleration settings</a></p>\n<h1>Slideshow mode on the web</h1>\n<p>This is the first iteration of the slideshow mode as an effort to get my children to sit still and look through the photos instead of watching Blippi. It is now only available on the web, and I plan to add it to the mobile app.</p>\n<h1>Map view on mobile app</h1>\n<p>You can see the location of your photos and videos on the map. This is a great way to see where your memories are located and where the events were happening.</p>\n<p><a href=\"https://preview.redd.it/z57baddsbfsb1.png?width=761&amp;format=png&amp;auto=webp&amp;s=667ccb0684837f480302b63fac0c5839ebe2280e\">Map view on mobile app</a></p>\n<h1>Better settings configuration</h1>\n<p>We have moved most configurable settings from the `.env` file to the admin interface. We also add the ability to create a config file to deploy new instances automatically. This will help many automation cases and assist folks who run hosting services with Immich as an option.</p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/3rn0rfd2cfsb1.png?width=1404&amp;format=png&amp;auto=webp&amp;s=833be674fd3509e241fe2bcf7fb252c5a8422966\">Instance's settings page</a></p>\n<p>A lot of work is still planned for Immich to make it more resilient, better performance, and easier for you and the community. We hope Immich has helped you store, view, and manage your memory in an enjoyable way.</p>\n<p>I hope to work on Immich full-time one day; your donation makes a difference and will help me reach that goal quickly. </p>\n<p>&#x200B;</p>\n<p>As always, thank you for using Immich, and I hope you enjoy this update.</p>\n<p>Remember to support the project!</p>\n<p>If you find the project helpful and it helps you in some ways, you can support the project <a href=\"https://github.com/sponsors/alextran1502?frequency=one-time&amp;sponsor=alextran1502\">one time</a> or <a href=\"https://github.com/sponsors/alextran1502\">monthly</a> from GitHub Sponsors.</p>\n<p>Join our friendly <a href=\"https://discord.gg/D8JsnBEuKb\">Discord</a> for discussion and to get help!</p>\n<p>🎉 Cheer! 🎉</p>\n<p>Alex</p>\n<p>&#x200B;</p>",
            "date_published": "2023-10-05T18:10:09+00:00",
            "authors": [
                {
                    "name": "altran1502",
                    "url": "https://www.reddit.com/user/altran1502"
                }
            ]
        },
        {
            "id": "170cvag",
            "url": "/r/selfhosted/comments/170cvag/devops_course_for_selfhosters_docker_gitlab_cicd/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/170cvag/devops_course_for_selfhosters_docker_gitlab_cicd/",
            "title": "DevOps course for self-hosters (Docker, GitLab, CI/CD, Mail server, etc.)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/170cvag/devops_course_for_selfhosters_docker_gitlab_cicd/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/170cvag/devops_course_for_selfhosters_docker_gitlab_cicd/'>Reddit</a></caption><div><br></div><p>Hello everyone,</p>\n<p>I've made a DevOps course covering a lot of different technologies and applications, aimed at startups, small companies and individuals who want to self-host their infrastructure.\nTo get this out of the way - this course doesn't cover Kubernetes or similar - I'm of the opinion that for startups, small companies, and especially individuals, you probably don't need Kubernetes. Unless you have a whole DevOps team, it usually brings more problems than benefits, and unnecessary infrastructure bills buried a lot of startups before they got anywhere.</p>\n<p>As for prerequisites, you can't be a complete beginner in the world of computers. If you've never even heard of Docker, if you don't know at least something about DNS, or if you don't have any experience with Linux, this course is probably not for you. That being said, I do explain the basics too, but probably not in enough detail for a complete beginner.</p>\n<p>Here's a 100% OFF coupon if you want to check it out:</p>\n<p>https://www.udemy.com/course/real-world-devops-project-from-start-to-finish/?couponCode=FREEDEVOPS2310JMGQA</p>\n<p>Be sure to BUY the course for $0, and not sign up for Udemy's subscription plan. The Subscription plan is selected by default, but you want the BUY checkbox. If you see a price other than $0, chances are that all coupons have been used already.\nYou can try manually entering the coupon code because Udemy sometimes messes with the link.</p>\n<p>The accompanying files for the course are at https://github.com/predmijat/realworlddevopscourse</p>\n<p>I encourage you to watch \"free preview\" videos to get the sense of what will be covered, but here's the gist:</p>\n<p>The goal of the course is to create an easily deployable and reproducible server which will have \"everything\" a startup or a small company will need - VPN, mail, Git, CI/CD, messaging, hosting websites and services, sharing files, calendar, etc. It can also be useful to individuals who want to self-host all of those - I ditched Google 99.9% and other than that being a good feeling, I'm not worried that some AI bug will lock my account with no one to talk to about resolving the issue.</p>\n<p>Considering that it covers a wide variety of topics, it doesn't go in depth in any of those. Think of it as going down a highway towards the end destination, but on the way there I show you all the junctions where I think it's useful to do more research on the subject.</p>\n<p>We'll deploy services inside Docker and LXC (Linux Containers). Those will include a mail server (iRedMail), Zulip (Slack and Microsoft Teams alternative), GitLab (with GitLab Runner and CI/CD), Nextcloud (file sharing, calendar, contacts, etc.), checkmk (monitoring solution), Pi-hole (ad blocking on DNS level), Traefik with Docker and file providers (a single HTTP/S entry point with automatic routing and TLS certificates).</p>\n<p>We'll set up WireGuard, a modern and fast VPN solution for secure access to VPS' internal network, and I'll also show you how to get a wildcard TLS certificate with certbot and DNS provider.</p>\n<p>To wrap it all up, we'll write a simple Python application that will compare a list of the desired backups with the list of finished backups, and send a result to a Zulip stream. We'll write the application, do a 'git push' to GitLab which will trigger a CI/CD pipeline that will build a Docker image, push it to a private registry, and then, with the help of the GitLab runner, run it on the VPS and post a result to a Zulip stream with a webhook.</p>\n<p>When done, you'll be equipped to add additional services suited for your needs.</p>\n<p>If this doesn't appeal to you, please leave the coupon for the next guy :)</p>\n<p>I hope that you'll find it useful!</p>\n<p>Happy learning,\nPredrag</p>",
            "date_published": "2023-10-05T08:46:40+00:00",
            "authors": [
                {
                    "name": "predmijat",
                    "url": "https://www.reddit.com/user/predmijat"
                }
            ]
        },
        {
            "id": "16zwu5t",
            "url": "/r/selfhosted/comments/16zwu5t/open_source_remote_access_vpns/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16zwu5t/open_source_remote_access_vpns/",
            "title": "Open source remote access VPNs?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16zwu5t/open_source_remote_access_vpns/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16zwu5t/open_source_remote_access_vpns/'>Reddit</a></caption><div><br></div><p>I have tried many VPN solutions for remote to site access and so far have come across the following tools and the issues I faced:</p>\n<ol>\n<li>Softether: good tool, however unable to figure out how to setup cert based authentication. Also, the etherIP protocol does not have a gui client for different platforms. Each time using the cli to connect is a pain.</li>\n<li>Openvpn community version: Great tool, however needs hacks to properly resolve dns for multiple VPNs in macOS . Lacks gui in community version hence cert management is not easy.</li>\n<li>Pritunl: Doesn’t give dns resolution in the open source version.</li>\n</ol>\n<p>Any other alternatives/ideas are welcome.</p>",
            "date_published": "2023-10-04T19:53:59+00:00",
            "authors": [
                {
                    "name": "emposcamcw",
                    "url": "https://www.reddit.com/user/emposcamcw"
                }
            ]
        },
        {
            "id": "16zorli",
            "url": "/r/selfhosted/comments/16zorli/wow_this_is_pretty_petty_any_self_hosted/",
            "external_url": "https://www.reddit.com/gallery/16zkzj9",
            "title": "Wow. This is pretty petty. Any self hosted solutions for this?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16zorli/wow_this_is_pretty_petty_any_self_hosted/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16zorli/wow_this_is_pretty_petty_any_self_hosted/'>Reddit</a></caption><div><br></div>",
            "date_published": "2023-10-04T14:31:24+00:00",
            "authors": [
                {
                    "name": "jarlaxle46",
                    "url": "https://www.reddit.com/user/jarlaxle46"
                }
            ]
        },
        {
            "id": "16zjuty",
            "url": "/r/selfhosted/comments/16zjuty/2023_selfhost_user_survey_results/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16zjuty/2023_selfhost_user_survey_results/",
            "title": "2023 Self-Host User Survey Results",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16zjuty/2023_selfhost_user_survey_results/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16zjuty/2023_selfhost_user_survey_results/'>Reddit</a></caption><div><br></div><p>Hi, r/selfhosted! </p>\n<p>Thanks to all who participated in our 2023 Self-Host User Survey! Below is a link to the results, which we've visualized using <a href=\"https://www.chartjs.org/\">Chart.js</a>. </p>\n<p>Feel free to reach out with feedback on how we can improve next year's survey!</p>\n<hr />\n<p><a href=\"https://selfh.st/survey/2023-results/\">2023 Self-Host User Survey Results</a></p>",
            "date_published": "2023-10-04T10:45:28+00:00",
            "authors": [
                {
                    "name": "selfh-sted",
                    "url": "https://www.reddit.com/user/selfh-sted"
                }
            ]
        },
        {
            "id": "16z34hu",
            "url": "/r/selfhosted/comments/16z34hu/most_used_selfhosted_services_in_2023_survey/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16z34hu/most_used_selfhosted_services_in_2023_survey/",
            "title": "Most used self-hosted services in 2023? [Survey]",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16z34hu/most_used_selfhosted_services_in_2023_survey/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16z34hu/most_used_selfhosted_services_in_2023_survey/'>Reddit</a></caption><div><br></div>📣 Hey there, fellow self-hosters 🌐\n\nLast year, I asked this Reddit community about which self-hosting services you use, and the responses were incredibly insightful.\n\n🔗 [Link to my 2022 question](https://reddit.com/r/selfhosted/s/8dbz1i6WpY)\n\nNow, I'm back with an updated survey for 2023, and I'd love your input once again!📋As the [analysing part](https://selfhosted-services-2022.deployn.de/) was difficult I use a form this time (with a few more questions).\n\n[**Take the 2023 Self-Hosting Survey**](https://survey.deployn.de/self-hosted-2023/)\n\nWhether you're a seasoned self-hosting pro or just dipping your toes into the world of self-hosted services, your thoughts and experiences are invaluable.\n\nI will post the results or a link to the results here probably at the end of October. In the meantime, feel free to list your (five) favorite services you self-host and (five more) which you started using or found in year 2023 in the comments.\n\nThank you, and I can't wait to see the insights 🚀\n\n(Repost, as I was unable to edit the old one, that was type \"link\" and not \"post\")<div><br></div><div><p>📣 Hey there, fellow self-hosters 🌐</p>\n<p>Last year, I asked this Reddit community about which self-hosting services you use, and the responses were incredibly insightful.</p>\n<p>🔗 <a href=\"https://reddit.com/r/selfhosted/s/8dbz1i6WpY\">Link to my 2022 question</a></p>\n<p>Now, I'm back with an updated survey for 2023, and I'd love your input once again!📋As the <a href=\"https://selfhosted-services-2022.deployn.de/\">analysing part</a> was difficult I use a form this time (with a few more questions).</p>\n<p><a href=\"https://survey.deployn.de/self-hosted-2023/\"><strong>Take the 2023 Self-Hosting Survey</strong></a></p>\n<p>Whether you're a seasoned self-hosting pro or just dipping your toes into the world of self-hosted services, your thoughts and experiences are invaluable.</p>\n<p>I will post the results or a link to the results here probably at the end of October. In the meantime, feel free to list your (five) favorite services you self-host and (five more) which you started using or found in year 2023 in the comments.</p>\n<p>Thank you, and I can't wait to see the insights 🚀</p>\n<p>(Repost, as I was unable to edit the old one, that was type \"link\" and not \"post\")</p></div>",
            "date_published": "2023-10-03T20:52:16+00:00",
            "authors": [
                {
                    "name": "ExoWire",
                    "url": "https://www.reddit.com/user/ExoWire"
                }
            ]
        },
        {
            "id": "16ypfvt",
            "url": "/r/selfhosted/comments/16ypfvt/triggerdev_opensource_background_jobs_for_nextjs/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16ypfvt/triggerdev_opensource_background_jobs_for_nextjs/",
            "title": "Trigger.dev - Open-source background jobs for NextJS, Remix, Astro, and many more!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16ypfvt/triggerdev_opensource_background_jobs_for_nextjs/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16ypfvt/triggerdev_opensource_background_jobs_for_nextjs/'>Reddit</a></caption><div><br></div>Hi guys!\n\nLast time, our post got blocked, claiming we are not open-source.\n\nTriggerDev is 100% open-source (all the features, everything) :)\n\n&#x200B;\n\nPlease feel free to check us out here:\n\n[https://github.com/triggerdotdev/trigger.dev](https://github.com/triggerdotdev/trigger.dev)\n\n&#x200B;\n\nFor the self-hosting tutorial, visit:\n\n[https://github.com/triggerdotdev/docker](https://github.com/triggerdotdev/docker)\n\n&#x200B;\n\nHere are some use cases with things you can do with TriggerDev:\n\n[https://trigger.dev/blog/generator-unlocked-create-memes-with-chatgpt-and-nextjs](https://trigger.dev/blog/generator-unlocked-create-memes-with-chatgpt-and-nextjs)\n\n[https://tgr.dev/achieve-nextjs-mastery-build-a-sales-page-with-stripe-and-airtable](https://tgr.dev/achieve-nextjs-mastery-build-a-sales-page-with-stripe-and-airtable)<div><br></div><div><p>Hi guys!</p>\n<p>Last time, our post got blocked, claiming we are not open-source.</p>\n<p>TriggerDev is 100% open-source (all the features, everything) :)</p>\n<p>&#x200B;</p>\n<p>Please feel free to check us out here:</p>\n<p><a href=\"https://github.com/triggerdotdev/trigger.dev\">https://github.com/triggerdotdev/trigger.dev</a></p>\n<p>&#x200B;</p>\n<p>For the self-hosting tutorial, visit:</p>\n<p><a href=\"https://github.com/triggerdotdev/docker\">https://github.com/triggerdotdev/docker</a></p>\n<p>&#x200B;</p>\n<p>Here are some use cases with things you can do with TriggerDev:</p>\n<p><a href=\"https://trigger.dev/blog/generator-unlocked-create-memes-with-chatgpt-and-nextjs\">https://trigger.dev/blog/generator-unlocked-create-memes-with-chatgpt-and-nextjs</a></p>\n<p><a href=\"https://tgr.dev/achieve-nextjs-mastery-build-a-sales-page-with-stripe-and-airtable\">https://tgr.dev/achieve-nextjs-mastery-build-a-sales-page-with-stripe-and-airtable</a></p></div>",
            "date_published": "2023-10-03T11:32:05+00:00",
            "authors": [
                {
                    "name": "Alternative-Rich-578",
                    "url": "https://www.reddit.com/user/Alternative-Rich-578"
                }
            ]
        },
        {
            "id": "16ydrzx",
            "url": "/r/selfhosted/comments/16ydrzx/welcome_to_my_homelab_your_gateway_to_selfhosting/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16ydrzx/welcome_to_my_homelab_your_gateway_to_selfhosting/",
            "title": "Welcome to My Homelab: Your Gateway to Self-Hosting!",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16ydrzx/welcome_to_my_homelab_your_gateway_to_selfhosting/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16ydrzx/welcome_to_my_homelab_your_gateway_to_selfhosting/'>Reddit</a></caption><div><br></div>Hi everyone,\n\nI hope I understood the rules correctly, and this does not fall into any frowned-upon category! I have started my self-hosting journey about 4 years ago, running quite a lot at home - over 44 containers, and thoroughly enjoy what I have done and learned. On my way, I have taught three people what I have done and got them to join our little rabbit hole.\n\nNow I wanted to be able to share with more people and started my own site (based on Ghost) and today marks the first day of sharing. My first post just went live, which is \"just\" a general overview of my homelab. In the future, I will dive deeper into specific aspects of my setup in order to actually create a learning experience for others.\n\nIf you liked the article, please do let me know, and I am also very interested in knowing if there are certain aspects you want to know more about.\n\n[https://nerdyarticles.com/my-homelab-a-general-overview/](https://nerdyarticles.com/my-homelab-a-general-overview/)\n\n&#x200B;\n\n[My Homelab](https://preview.redd.it/5quoxl9kvvrb1.png?width=2272&format=png&auto=webp&s=915a9bf30484c45e5560b873e5dcd9c1fd769dc5)<div><br></div><div><p>Hi everyone,</p>\n<p>I hope I understood the rules correctly, and this does not fall into any frowned-upon category! I have started my self-hosting journey about 4 years ago, running quite a lot at home - over 44 containers, and thoroughly enjoy what I have done and learned. On my way, I have taught three people what I have done and got them to join our little rabbit hole.</p>\n<p>Now I wanted to be able to share with more people and started my own site (based on Ghost) and today marks the first day of sharing. My first post just went live, which is \"just\" a general overview of my homelab. In the future, I will dive deeper into specific aspects of my setup in order to actually create a learning experience for others.</p>\n<p>If you liked the article, please do let me know, and I am also very interested in knowing if there are certain aspects you want to know more about.</p>\n<p><a href=\"https://nerdyarticles.com/my-homelab-a-general-overview/\">https://nerdyarticles.com/my-homelab-a-general-overview/</a></p>\n<p>&#x200B;</p>\n<p><a href=\"https://preview.redd.it/5quoxl9kvvrb1.png?width=2272&amp;format=png&amp;auto=webp&amp;s=915a9bf30484c45e5560b873e5dcd9c1fd769dc5\">My Homelab</a></p></div>",
            "date_published": "2023-10-03T00:41:32+00:00",
            "authors": [
                {
                    "name": "KillerTic",
                    "url": "https://www.reddit.com/user/KillerTic"
                }
            ]
        },
        {
            "id": "16y09p7",
            "url": "/r/selfhosted/comments/16y09p7/jellyfin_call_for_developers/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16y09p7/jellyfin_call_for_developers/",
            "title": "Jellyfin call for developers",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16y09p7/jellyfin_call_for_developers/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16y09p7/jellyfin_call_for_developers/'>Reddit</a></caption><div><br></div><iframe style='min-width: min(100%, 500px); height: 100vw; border: none;' id='reddit-embed' src='https://www.redditmedia.com/r/selfhosted/comments/16y09p7?embed=true' sandbox='allow-scripts allow-same-origin allow-popups' scrolling='no'></iframe><div><br></div><div><p>https://jellyfin.org/posts/a-call-for-developers/</p></div>",
            "date_published": "2023-10-02T15:52:27+00:00",
            "authors": [
                {
                    "name": "tadzoo",
                    "url": "https://www.reddit.com/user/tadzoo"
                }
            ]
        },
        {
            "id": "16xdkzx",
            "url": "/r/selfhosted/comments/16xdkzx/a_call_for_developers_jellyfin_blog/",
            "external_url": "https://jellyfin.org/posts/a-call-for-developers",
            "title": "A Call for Developers | Jellyfin Blog",
            "content_html": "<caption>Open: <a href='https://jellyfin.org/posts/a-call-for-developers'>jellyfin.org</a> | <a href='https://reddit.com/r/selfhosted/comments/16xdkzx/a_call_for_developers_jellyfin_blog/'>Reddit</a></caption>",
            "date_published": "2023-10-01T21:32:30+00:00",
            "authors": [
                {
                    "name": "tgp1994",
                    "url": "https://www.reddit.com/user/tgp1994"
                }
            ]
        },
        {
            "id": "16wvm1h",
            "url": "/r/selfhosted/comments/16wvm1h/orb_v10_has_been_released/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16wvm1h/orb_v10_has_been_released/",
            "title": "Orb v1.0 has been released",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16wvm1h/orb_v10_has_been_released/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16wvm1h/orb_v10_has_been_released/'>Reddit</a></caption><div><br></div><div><p>Orb is a free and open source web desktop, which simulates a Windows-like desktop in a web browser. You can use it to access files on a server or a NAS in an easy and secure way.</p>\n<p>I've posted about Orb a few times in the past, but this time it's about the v1.0 release. With this release, I consider this project more or less done. That doesn't mean that there will be no more new releases, but for now I will focus more on <a href=\"https://gitlab.com/hsleisink/cauldron\">another open source project</a> that I'm working on.</p>\n<p>Orb was created to have a user friendly web interface to access my files on my server. A friend of mine runs it on a Raspberry Pi to access the files on his NAS at home while he's at work. The explorer application is therefore the most important application. It also allows you to share files or directories with other people. File viewers for PDF, Word and Excel files, text files, images, videos and ZIP files make it all more user friendly. But this wouldn't be a hobby project if I didn't some fun stuff. So, there is of course minesweeper, a DOS and C64 emulator and last but not least, Wolfenstein 3D! And yes, it's a nerd project, so it has a terminal.</p>\n<p>Download Orb from <a href=\"https://gitlab.com/hsleisink/orb/\">Gitlab</a> or give the <a href=\"https://desktop.leisink.net/\">demo account</a> a try. Have fun with it!</p>\n<p><a href=\"https://preview.redd.it/8nnlk8t0ujrb1.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=30caa3e9d311ff8d0aff00f3f4cd6b7748a032f5\">Orb screenshot</a></p></div>",
            "date_published": "2023-10-01T08:26:07+00:00",
            "authors": [
                {
                    "name": "Shendryl",
                    "url": "https://www.reddit.com/user/Shendryl"
                }
            ]
        },
        {
            "id": "16wb86m",
            "url": "/r/selfhosted/comments/16wb86m/is_immich_right_for_me/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16wb86m/is_immich_right_for_me/",
            "title": "Is Immich right for me?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16wb86m/is_immich_right_for_me/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16wb86m/is_immich_right_for_me/'>Reddit</a></caption><div><br></div><div><p>So I have a server running unraid for media automation. I have a separate share for photos that is excluded from that automation. It has about 3 tb of data which is all of my personal photos/videos for the last decade or more (which includes includes my kids entire lives). Obviously this is very important to me. I have this data backed up on an external HD that I keep at my moms house. </p>\n<p>Since I built my server a couple years ago, I mostly have been using my phone for photos and not a camera. I use google photos to back this up, my wife uses icloud. I want to implement immich and have us both move away from our respective back up solutions. I also want to pay for one 'cloud' back up solution to back up all of my configs plus our personal photos/videos (no interest in backing up my media, I don't have anything rare/hard to replace).    </p>\n<p>Is immich a good choice? Can it take and organize my existing 3 tb of data? Is there a better option than Immich plus Duplicacy for my use case?  </p>\n<p>I will add that I am pretty much a noob and can't problem solve too much on my own, my server was built almost solely by following ibracorp and spaceinvader tutorials. </p></div>",
            "date_published": "2023-09-30T16:29:19+00:00",
            "authors": [
                {
                    "name": "Kowabunga_Dude",
                    "url": "https://www.reddit.com/user/Kowabunga_Dude"
                }
            ]
        },
        {
            "id": "16vovjo",
            "url": "/r/selfhosted/comments/16vovjo/if_youre_not_using_debian_what_are_you_using_and/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16vovjo/if_youre_not_using_debian_what_are_you_using_and/",
            "title": "If you're not using Debian, what are you using and why?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16vovjo/if_youre_not_using_debian_what_are_you_using_and/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16vovjo/if_youre_not_using_debian_what_are_you_using_and/'>Reddit</a></caption><div><br></div><div><p>So a few months back I started moving some of my services to Rocky Linux since I wanted something rock-solid and stable. We all know what happened shortly thereafter with the whole Red Hat mess.</p>\n<p>Instead of moving back to Ubuntu Server, I started moving to Debian, and let me just say: Wow!</p>\n<p>Debian is significantly faster than Ubuntu Server from my experience, has less bloat, and should be just as stable as Rocky. It's been an absolute pleasure using it.</p>\n<p>So what Linux OS is everyone else using for their self-hosted services and why?</p></div>",
            "date_published": "2023-09-29T22:04:10+00:00",
            "authors": [
                {
                    "name": "cjchico",
                    "url": "https://www.reddit.com/user/cjchico"
                }
            ]
        },
        {
            "id": "16v9k1l",
            "url": "/r/selfhosted/comments/16v9k1l/this_week_in_selfhosted_29_september_2023/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16v9k1l/this_week_in_selfhosted_29_september_2023/",
            "title": "This Week in Self-Hosted (29 September 2023)",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16v9k1l/this_week_in_selfhosted_29_september_2023/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16v9k1l/this_week_in_selfhosted_29_september_2023/'>Reddit</a></caption><div><br></div><div><p>Happy Friday, r/selfhosted! Below is a link to <em>This Week in Self-Hosted</em>, a weekly newsletter recap of the latest activity in self-hosted software.</p>\n<p>This week's features include:</p>\n<ul>\n<li>A product giveaway in celebration of recent subscriber milestones</li>\n<li>The latest in self-hosted and open-source industry activity</li>\n<li>Noteworthy software updates and launches</li>\n<li>Featured content generated by the self-hosted community</li>\n<li>A spotlight on <a href=\"https://github.com/ckolderup/postmarks?ref=selfh.st\">Postmarks</a>, a Fediverse-enabled bookmark sharing platform</li>\n</ul>\n<p>As usual, feel free to reach out with questions or comments about the publication. Thanks!</p>\n<hr />\n<p><a href=\"https://selfh.st/newsletter/2023-09-29/\">This Week in Self-Hosted (29 September 2023)</a></p></div>",
            "date_published": "2023-09-29T11:53:56+00:00",
            "authors": [
                {
                    "name": "selfh-sted",
                    "url": "https://www.reddit.com/user/selfh-sted"
                }
            ]
        },
        {
            "id": "16uuy1o",
            "url": "/r/selfhosted/comments/16uuy1o/question_about_writing_a_will/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16uuy1o/question_about_writing_a_will/",
            "title": "Question about writing a will",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16uuy1o/question_about_writing_a_will/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16uuy1o/question_about_writing_a_will/'>Reddit</a></caption><div><br></div><div><p>A few years ago I came across an article about how to write a will when you maintain a homelab that provides many services for your partner and family members. There was a template (I think a md file on GitHub) that went through all kinds of things from accounts to zeroing hard drives etc. </p>\n<p>Does anyone recognize or remember this? I had meant to set that up but have forgotten until now and I can’t find it.</p></div>",
            "date_published": "2023-09-28T23:11:14+00:00",
            "authors": [
                {
                    "name": "maximusprimate",
                    "url": "https://www.reddit.com/user/maximusprimate"
                }
            ]
        },
        {
            "id": "16u2ash",
            "url": "/r/selfhosted/comments/16u2ash/why_not_use_port_80/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16u2ash/why_not_use_port_80/",
            "title": "Why not use port 80?",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16u2ash/why_not_use_port_80/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16u2ash/why_not_use_port_80/'>Reddit</a></caption><div><br></div><div><p>I have several services, (not docker) that run on funky port numbers.  8006 for proxmox,  or 8321, or 8080.  What stops me from addressing all these to port 80, so I don't have to remember the obscure port number to access?  There a security reason for this?  Or is it just trying to avoid port conflict?</p></div>",
            "date_published": "2023-09-28T01:15:47+00:00",
            "authors": [
                {
                    "name": "ZeroPointMX",
                    "url": "https://www.reddit.com/user/ZeroPointMX"
                }
            ]
        },
        {
            "id": "16u9msw",
            "url": "/r/selfhosted/comments/16u9msw/introducing_raspberry_pi_5/",
            "external_url": "https://www.raspberrypi.com/news/introducing-raspberry-pi-5/",
            "title": "Introducing: Raspberry Pi 5!",
            "content_html": "<caption>Open: <a href='https://www.raspberrypi.com/news/introducing-raspberry-pi-5/'>www.raspberrypi.com</a> | <a href='https://reddit.com/r/selfhosted/comments/16u9msw/introducing_raspberry_pi_5/'>Reddit</a></caption>",
            "date_published": "2023-09-28T07:41:57+00:00",
            "authors": [
                {
                    "name": "atika",
                    "url": "https://www.reddit.com/user/atika"
                }
            ]
        },
        {
            "id": "16tiqga",
            "url": "/r/selfhosted/comments/16tiqga/ive_created_an_opensource_search_platform_swirl/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16tiqga/ive_created_an_opensource_search_platform_swirl/",
            "title": "I've created an open-source search platform - Swirl. You can search and use AI to find the correct information quickly and easily.",
            "content_html": "<caption>Open: <a href='apollo://www.reddit.com/r/selfhosted/comments/16tiqga/ive_created_an_opensource_search_platform_swirl/'>Apollo</a> | <a href='https://reddit.com/r/selfhosted/comments/16tiqga/ive_created_an_opensource_search_platform_swirl/'>Reddit</a></caption><div><br></div><div><p>Our data is spread across multiple sources like SQL databases, Emails, Notes, Words, Office Applications, etc. And when we're searching for something, we typically don't know where. </p>\n<p>So, me and my friends came up with the id ea of a search platform, Swirl. That allows us to search multiple sources to get the information we want. And we made it open source to help people who want to add search capabilities. We're expanding it with Large Language Models to generate the answers based on the queries being asked for. </p>\n<p>It's all open source and available on GitHub:  <a href=\"https://github.com/swirlai/swirl-search\">https://github.com/swirlai/swirl-search</a></p></div>",
            "date_published": "2023-09-27T12:04:56+00:00",
            "authors": [
                {
                    "name": "search_guy",
                    "url": "https://www.reddit.com/user/search_guy"
                }
            ]
        },
        {
            "id": "16tgaha",
            "url": "/r/selfhosted/comments/16tgaha/how_do_you_protect_your_servers_what_techniques/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16tgaha/how_do_you_protect_your_servers_what_techniques/",
            "title": "How do you protect your servers? What techniques and tricks do you use?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16tgaha/how_do_you_protect_your_servers_what_techniques/'>Reddit</a></caption><div><br></div><div><p>I'm really curious to know to how the people of r/selfhosted protect their server from attacks and all the wilderness of the internet.</p>\n<p>I just recently began my journey in networking and upon the setup of my first server, I found that many attempts were being made on my SSH port (22), this was quite shocking. Like It wasn't even an hour and attacks were coming in.</p>\n<p>Then I searched and found changing the default port will reduced the automated attacks, and indeed it reduced the number of attempts.</p>\n<p>Since, I just began I don't know what are some other things, and pit falls that I need to watch for, How would I make sure my server is all well and protected weather it's mail server or something else.</p>\n<p>I have heard of some things like intrusion detection and intrusion prevention applications, do any of you use it? Well do small projects even need to use them? I think NO.</p>\n<p>Please share your experience and tales of protecting your server and if every was breached then how did you dealt with it.</p>\n<p>&#x200B;</p>\n<p>Thanks.</p></div>",
            "date_published": "2023-09-27T09:52:18+00:00",
            "authors": [
                {
                    "name": "just-ans",
                    "url": "https://www.reddit.com/user/just-ans"
                }
            ]
        },
        {
            "id": "16t7hw2",
            "url": "/r/selfhosted/comments/16t7hw2/big_shout_to_the_team_who_created_homepage_love/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16t7hw2/big_shout_to_the_team_who_created_homepage_love/",
            "title": "Big shout to the team who created HomePage: Love their work!",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16t7hw2/big_shout_to_the_team_who_created_homepage_love/'>Reddit</a></caption><div><br></div><div><p>My homepage dashboard is coming along nicely. All the apps you see are locally hosted running either on my NAS or my ubuntu server. It's so nice to see it all tied up neatly into one little bundle. I am having problems with the Mealie widget though so if anyone has that working, please reach out to me 😄</p>\n<p><a href=\"https://preview.redd.it/xu8r7l4ggpqb1.png?width=1784&amp;format=png&amp;auto=webp&amp;s=93faef48ee45c9ab3230253814bb9751658cdf2d\">My dashboard</a></p>\n<p>For more info to set this up yourself: <a href=\"https://gethomepage.dev/en/installation/\">https://gethomepage.dev</a></p></div>",
            "date_published": "2023-09-27T02:00:19+00:00",
            "authors": [
                {
                    "name": "Additional-Nerve-421",
                    "url": "https://www.reddit.com/user/Additional-Nerve-421"
                }
            ]
        },
        {
            "id": "14cqjeb",
            "url": "/r/selfhosted/comments/14cqjeb/the_subreddit_will_go_on_the_community_must_be/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/14cqjeb/the_subreddit_will_go_on_the_community_must_be/",
            "title": "The Subreddit Will Go On - The Community Must Be Put First",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/14cqjeb/the_subreddit_will_go_on_the_community_must_be/'>Reddit</a></caption><div><br></div><div><h3>Hey /r/selfhosted</h3>\n<p>The community has been split on what's next for /r/selfhosted. </p>\n<p>For every good idea on how to replace/move/handle Reddit and its community of devoted users, there are just as many people for it as there are against it. </p>\n<p>I had plans to put up a poll, but enough dissonance and fracturing has been clearly made apparent through just comments and what discussion has been had here and on the discord channel that there's only one way to move forward. </p>\n<h3>The Show Must Go On</h3>\n<p>The moderator team here is a team of <em>Reddit Moderators</em>, and that is what we will continue to be. The community was right, and we have no right as the stewards of this community to withhold its function from its users. </p>\n<p>We tried. We really, really tried, but it's time to move on and continue our efforts. </p>\n<p>For those of you who wish to move to other platforms, we wish you the best of luck! </p>\n<p>As of now, the subreddit has been re-opened and will continue to remain so for the foreseeable future. </p>\n<h3>External Communities And Resources</h3>\n<p>I will link here a series of non-Reddit communities as a starting point for those wishing to leave Reddit and find new homes. We wish you all the best!</p>\n<p><strong>The subreddit now has an official discourse instance, thanks to a generous discord user</strong></p>\n<ul>\n<li>https://forum.r-selfhosted.com</li>\n</ul>\n<p>If you know of a community that is a good fit here, please comment and I will add it here.</p>\n<ul>\n<li>The Official <a href=\"https://discord.gg/UrZKzYZfcS\">Discord Server</a></li>\n<li>The Official <a href=\"https://matrix.to/#/#selfhosted:selfhosted.chat\">Matrix Server</a></li>\n<li>Lemmy.ML <a href=\"https://lemmy.ml/c/selfhost\">SelfHosted Channel</a></li>\n<li><a href=\"https://homelabforum.com/\">Homelab Forum</a> - Curated by /u/caponate</li>\n<li>Lemmy.world <a href=\"https://lemmy.world/c/selfhosted\">Selfhosted Channel</a></li>\n<li>The Squabbles.io <a href=\"https://squabbles.io/s/selfhosted\">selfhosted community</a></li>\n<li>kbin.social <a href=\"https://kbin.social/m/selfhosted\">selfhosted community</a></li>\n</ul>\n<p>I am sorry, /r/selfhosted. We really, really did try.</p></div>",
            "date_published": "2023-06-18T17:51:21+00:00",
            "authors": [
                {
                    "name": "kmisterk",
                    "url": "https://www.reddit.com/user/kmisterk"
                }
            ]
        },
        {
            "id": "16ss2bt",
            "url": "/r/selfhosted/comments/16ss2bt/youtubers_focused_on_selfhosted_solutions/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16ss2bt/youtubers_focused_on_selfhosted_solutions/",
            "title": "YouTubers focused on self-hosted solutions",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16ss2bt/youtubers_focused_on_selfhosted_solutions/'>Reddit</a></caption><div><br></div><div><p>Does anyone have favorite YouTubers they watch for content related to self-hosted solutions? We want to find a few to partner with to promote self-hosted file-sharing products and are especially interested in who this group pays attention to.</p></div>",
            "date_published": "2023-09-26T16:06:51+00:00",
            "authors": [
                {
                    "name": "thorntech",
                    "url": "https://www.reddit.com/user/thorntech"
                }
            ]
        },
        {
            "id": "16sq2mp",
            "url": "/r/selfhosted/comments/16sq2mp/am_i_getting_a_good_deal_on_this_server/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sq2mp/am_i_getting_a_good_deal_on_this_server/",
            "title": "Am I getting a good deal on this server?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sq2mp/am_i_getting_a_good_deal_on_this_server/'>Reddit</a></caption><div><br></div><div><p>Dell PowerEdge R730XD 2x E5-2699v3 256GB @ 2133 + 24x 600GB 7.2k SAS Drives</p>\n<p>Got it for $300. Going to use it to learn proxmox and stuff. What do you guys think?</p></div>",
            "date_published": "2023-09-26T14:50:10+00:00",
            "authors": [
                {
                    "name": "Substantial-Pilot-72",
                    "url": "https://www.reddit.com/user/Substantial-Pilot-72"
                }
            ]
        },
        {
            "id": "16srawm",
            "url": "/r/selfhosted/comments/16srawm/netmakertailscale_and_nextcloud_on_unraid/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16srawm/netmakertailscale_and_nextcloud_on_unraid/",
            "title": "Netmaker/Tailscale and Nextcloud on Unraid",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16srawm/netmakertailscale_and_nextcloud_on_unraid/'>Reddit</a></caption><div><br></div><div><p>Hello everyone,</p>\n<p>I'm in need of some guidance regarding the setup of <a href=\"https://www.netmaker.io/\">Netmaker</a> or <a href=\"https://github.com/Tailscale/\">Tailscale</a> on Unraid. Initially, I was considering Cloudflare Tunnel, but it seems to come with certain limitations. While I have some knowledge about these alternatives, I wouldn't say I'm an expert.</p>\n<p>My goal is to configure them in a way that they exclusively run on the network where I have Nextcloud deployed. I'd like to maintain separation between networks. This setup is intended for my family and friends, so if there's a straightforward way to expand connections, I'd greatly appreciate the advice.</p>\n<p>I hope this all makes sense. </p></div>",
            "date_published": "2023-09-26T15:37:17+00:00",
            "authors": [
                {
                    "name": "Single_Writing_6737",
                    "url": "https://www.reddit.com/user/Single_Writing_6737"
                }
            ]
        },
        {
            "id": "16sqcmj",
            "url": "/r/selfhosted/comments/16sqcmj/which_one_is_more_like_jellyfin_but_for_photos/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sqcmj/which_one_is_more_like_jellyfin_but_for_photos/",
            "title": "which one is more like jellyfin but for photos",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sqcmj/which_one_is_more_like_jellyfin_but_for_photos/'>Reddit</a></caption><div><br></div><div><p>Hello everyone,\nI'm looking for an app that can index my photo folder, as I don't want to upload them again.\nWhich can resize my photos (to be able to see them faster, without waiting for them to load too much) and create albums without changing the main files? \nBest Regards\nShahram</p>\n<p><a href=\"https://www.reddit.com/poll/16sqcmj\">View Poll</a></p></div>",
            "date_published": "2023-09-26T15:00:43+00:00",
            "authors": [
                {
                    "name": "sh4hr4m",
                    "url": "https://www.reddit.com/user/sh4hr4m"
                }
            ]
        },
        {
            "id": "16sphv7",
            "url": "/r/selfhosted/comments/16sphv7/best_pihole_blocklists/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sphv7/best_pihole_blocklists/",
            "title": "Best Pihole blocklists?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sphv7/best_pihole_blocklists/'>Reddit</a></caption><div><br></div><div><p>I've been looking to expand my pihole blocklist, and possible add some regex filtering.</p>\n<p>Any recommendations for blocklists/regex filters that are updated pretty regularly?</p></div>",
            "date_published": "2023-09-26T14:28:18+00:00",
            "authors": [
                {
                    "name": "Boring-Wednesdays",
                    "url": "https://www.reddit.com/user/Boring-Wednesdays"
                }
            ]
        },
        {
            "id": "16sp6kx",
            "url": "/r/selfhosted/comments/16sp6kx/sending_mqtt_to_home_assistant_resolved_through/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sp6kx/sending_mqtt_to_home_assistant_resolved_through/",
            "title": "Sending MQTT to Home Assistant resolved through nginx Proxy Manager?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sp6kx/sending_mqtt_to_home_assistant_resolved_through/'>Reddit</a></caption><div><br></div><div><p>I am using nginix Proxy Manager to create user-friendly hostnames for docker containers with unusual ports. I have it setup so I can type <strong>homeassistant/</strong> into a web browser or other tool and anyone on my network can find my HA instance. For most people this is a lot easier than remembering IP addresses or FQDNs.</p>\n<p>I'm starting to test out having IoT devices publish to an MQTT broker on HA. I ran into an issue though where they couldn't connect at first - I realized that NPM provides http and https, and then has specific mappings for those ports. I need to connect <strong>mqtt://</strong> instead of <strong>http://</strong> and to point to a different port on the HA instance.</p>\n<p>I looked through the NPM UI and did not find a way to set this up. I'm sure there's a way with the CLI but wanted to check here first in case I missed something.</p></div>",
            "date_published": "2023-09-26T14:16:05+00:00",
            "authors": [
                {
                    "name": "theTrebleClef",
                    "url": "https://www.reddit.com/user/theTrebleClef"
                }
            ]
        },
        {
            "id": "16smzw1",
            "url": "/r/selfhosted/comments/16smzw1/how_much_time_do_you_put_into_your_setup_in_a_week/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16smzw1/how_much_time_do_you_put_into_your_setup_in_a_week/",
            "title": "How much time do you put into your setup in a week?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16smzw1/how_much_time_do_you_put_into_your_setup_in_a_week/'>Reddit</a></caption><div><br></div><div><p>So recently I realized i was beginning to amass a pretty hefty collection of apps and such. So I made a spreadsheet so i could ensure everything got into the dashboard app, and everything got into nginx proxy manager, and etc etc...just to make sure everything was standardized. And...the list is way bigger than I ever expected.  </p>\n<p>At this moment, my spreadsheet is 58 lines of various apps. Now that includes some hardware, like my synology, or the server ILOs..... but 58!??!  </p>\n<p>I think 34 of those are in docker. and what, 10 of them are media related. Jellyfin, all the servarr apps, then another 8 or 10 for downloaders and gluetun stacks.  </p>\n<p>So we come back to the title of the thread, how much time do you put into your setup in a given week? I work on servers all day, but it feels like I'm working on servers all night too.</p></div>",
            "date_published": "2023-09-26T12:47:49+00:00",
            "authors": [
                {
                    "name": "MyTechAccount90210",
                    "url": "https://www.reddit.com/user/MyTechAccount90210"
                }
            ]
        },
        {
            "id": "16snvt3",
            "url": "/r/selfhosted/comments/16snvt3/what_would_be_the_best_way_to_selfhost_my/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16snvt3/what_would_be_the_best_way_to_selfhost_my/",
            "title": "What would be the best way to self-host my personal finance stuff (especially transactions), and continuously pull info from my bank accounts?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16snvt3/what_would_be_the_best_way_to_selfhost_my/'>Reddit</a></caption><div><br></div><div><p>I'm really bad with money and want a good way to track all of it. I don't want to spend lot of $ on something like YNAB or Tiller, and would really prefer to have all my data offline. I want to have my transactions on my Bofa and Discover accounts continuously pulled. I did a lot of searching and there doesn't seem to be a good solution to this. Ideally I'd have an equivalent to Obsidian.md: a powerful app where all of your data is offline and in an easily readable format like text files.</p>\n<p>And something that just works where I don't have to do a lot of tinkering. I looked at Firefly and just installed a container, and was about to use the Plaid connector, but Plaid asks me lots of questions and it seems to be for businesses and not consumers. It seems like I should just suck it up and download CSVs of transactions manually and put that into Firefly III or process them in Excel.</p></div>",
            "date_published": "2023-09-26T13:23:20+00:00",
            "authors": [
                {
                    "name": "TheTwelveYearOld",
                    "url": "https://www.reddit.com/user/TheTwelveYearOld"
                }
            ]
        },
        {
            "id": "16sna66",
            "url": "/r/selfhosted/comments/16sna66/how_to_set_up_a_pop3smtp_server_to_receive_and/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sna66/how_to_set_up_a_pop3smtp_server_to_receive_and/",
            "title": "How to set up a POP3/SMTP server to receive and reply to emails?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sna66/how_to_set_up_a_pop3smtp_server_to_receive_and/'>Reddit</a></caption><div><br></div><div><p>Hello all,</p>\n<p>I would like to set up a private email server on Linux. This is for home server use. What do you recommend I use, and how should I begin? I'm highly technical, so I have no problem with scripting, programming, or Linux.</p>\n<p>Thanks!</p>\n<p>Use Case:</p>\n<ol>\n<li>Setting up a simple, secure mailing list. for my personal stuff ( not spam in any means ) </li>\n<li>Registering for mailing lists.\"</li>\n</ol></div>",
            "date_published": "2023-09-26T12:59:22+00:00",
            "authors": [
                {
                    "name": "umen",
                    "url": "https://www.reddit.com/user/umen"
                }
            ]
        },
        {
            "id": "16smww4",
            "url": "/r/selfhosted/comments/16smww4/programmatic_way_to_retrieve_api_from_arrs/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16smww4/programmatic_way_to_retrieve_api_from_arrs/",
            "title": "Programmatic way to retrieve API from *arrs?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16smww4/programmatic_way_to_retrieve_api_from_arrs/'>Reddit</a></caption><div><br></div><div><p>I have done some changes to my homelab recently and had to set up a lot of the services I was using. Other than web scraping, is there a programmatic way to get the API keys from the stack? I am decent with Python and was going to use that as my tool of choice</p></div>",
            "date_published": "2023-09-26T12:44:21+00:00",
            "authors": [
                {
                    "name": "TXAGZ16",
                    "url": "https://www.reddit.com/user/TXAGZ16"
                }
            ]
        },
        {
            "id": "16slr84",
            "url": "/r/selfhosted/comments/16slr84/backing_up_maria_db_instance_one_script_to_save/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16slr84/backing_up_maria_db_instance_one_script_to_save/",
            "title": "Backing Up Maria DB Instance - one script to save it all?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16slr84/backing_up_maria_db_instance_one_script_to_save/'>Reddit</a></caption><div><br></div><div><p>Hi folks, hope everyone is having a great week. I am looking to utilise a script to backup all the different databases housed inside my MariaDB instance . I came across Christian Lempa video of backing up linux servers (<a href=\"https://www.youtube.com/watch?v=JoA6Bezgk1c\">https://www.youtube.com/watch?v=JoA6Bezgk1c</a>) and he provides a script in his video notes, which can be found here (<a href=\"https://github.com/ChristianLempa/scripts/blob/main/db-container-backup/db-container-backup.sh\">https://github.com/ChristianLempa/scripts/blob/main/db-container-backup/db-container-backup.sh</a>). But being a noob, I want to clarify if this script is saving all my mariadb databases for the various docker containers I am running. This line ( CONTAINER=$(docker ps --format '{{.Names}}:{{.Image}}' | grep 'mysql\\|mariadb' | cut -d\":\" -f1)  to me looks like its using docker command PS to list running containers with the name mysql or mariadb. I am running multiple docker containers that have mysql databases like Wallabag, tandoor, authelia, etc. Should I list out every container that has mysql database, so this script can backup those databases too or is this script backing up mysql and therefore all my databases that are housed inside mariadb instance? Apologies for what I am sure is making me sound like I should have no business self hosting lol but I am learning as I go. Thank you for any assistance :)   </p></div>",
            "date_published": "2023-09-26T11:54:07+00:00",
            "authors": [
                {
                    "name": "aps02",
                    "url": "https://www.reddit.com/user/aps02"
                }
            ]
        },
        {
            "id": "16slh8k",
            "url": "/r/selfhosted/comments/16slh8k/web_proxy_with_search_bar/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16slh8k/web_proxy_with_search_bar/",
            "title": "Web proxy with search bar",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16slh8k/web_proxy_with_search_bar/'>Reddit</a></caption><div><br></div><div><p>Hi everyone!</p>\n<p>I'm looking for a selfhost app that would be a web proxy with a search bar like this unmaintained app https://github.com/vincentclee/glype or this one https://github.com/Athlon1600/php-proxy-app</p>\n<p>But I do not find any application still maintained if someone has an idea I'm a taker! Thanks in advance!</p>\n<p>PS: I've already tried guacamole with a remote browser but it's too slow because I'm on a raspberry and I don't want a proxy to configure on my pc either, I'd like it to be turnkey via a URL.</p></div>",
            "date_published": "2023-09-26T11:41:43+00:00",
            "authors": [
                {
                    "name": "flodes80",
                    "url": "https://www.reddit.com/user/flodes80"
                }
            ]
        },
        {
            "id": "16sk3a2",
            "url": "/r/selfhosted/comments/16sk3a2/about_jellyfin_server/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sk3a2/about_jellyfin_server/",
            "title": "About Jellyfin Server",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sk3a2/about_jellyfin_server/'>Reddit</a></caption><div><br></div><div><p>Hi everyone, I hope you're doing well. I have two jellyfin server.</p>\n<p>Server 1: installed jellyfin on docker and exposed using nginx proxy manager\nServer 2: installed jellyfin directly on ubuntu server and exposed through caddy</p>\n<p>Server 1: When I scan media files it is significantly slower and streaming also buffers time to time (takes 4-5 seconds to play)</p>\n<p>Server 2: When I scan media files it scans almost immediately the whole library and streaming is also bufferless.</p>\n<p>My question is why I'm facing lag on Server 1? Is it because jellyfin installed in docker?</p></div>",
            "date_published": "2023-09-26T10:31:47+00:00",
            "authors": [
                {
                    "name": "Kaziopu123",
                    "url": "https://www.reddit.com/user/Kaziopu123"
                }
            ]
        },
        {
            "id": "16sjqu9",
            "url": "/r/selfhosted/comments/16sjqu9/back_to_basics/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sjqu9/back_to_basics/",
            "title": "Back to basics.",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sjqu9/back_to_basics/'>Reddit</a></caption><div><br></div><div><p>I've had a proxmox server running on a retired workstation for about half a year now. Got a bit jaded recently when trying to set up some semblance of a media server (couldn't get my *arrs to play well with LXCs). I've been looking into things like Unraid and TrueNAS and finally decided to give it a go. </p>\n<p>Got rid of Proxmox and went for TrueNAS instead, and... really, really hated it. Mind you, I went for TrueNAS Core instead of Scale, and I imagine I'd enjoy the latter more, but I've only got the one data drive for now which TrueNAS Scale says is below the minimum requirements.</p>\n<p>I think the main problem was how TrueNAS handled VMs, I couldn't bloody well figure out how things worked. I've done a cert in networking where we did some generalised virtualisation and sysadmin work in VMware which is really easy to use, but when trying to spin up a simple Debian VM, i noticed there were a bunch of hacky workarounds that were required to get me going.</p>\n<p>So, what did I end up going with in the end? Back on Proxmox? Did I pay for Unraid? Well... back in the day, I had Ubuntu server running off an old laptop of mine that mostly hosted Docker containers. There were a few things it ran baremetal, but for me I really enjoyed doing everything through Docker Compose and using Webmin.</p>\n<p>I've gone back to this setup full time and I don't see myself changing any time soon. For me, this is what works. Nothing super flashy, just plain old Ubuntu and some Docker containers. I'm gonna go and set up YAMS now :) Wish me luck!</p></div>",
            "date_published": "2023-09-26T10:13:28+00:00",
            "authors": [
                {
                    "name": "monday_jay",
                    "url": "https://www.reddit.com/user/monday_jay"
                }
            ]
        },
        {
            "id": "16sjlat",
            "url": "/r/selfhosted/comments/16sjlat/exciting_news_everyone_the_highly_anticipated/",
            "external_url": "https://twitter.com/0xPolygonDex/status/1706287928249569638?s=20",
            "title": "Exciting news everyone! The highly anticipated Polygon airdrop has officially begun. You can verify your eligibility and secure your complimentary Matic tokens by visiting their website. I just claimed 900 Matic valued at $460, but your rewards may vary depending on your blockchain activity.",
            "content_html": "<caption>Open: <a href='https://twitter.com/0xPolygonDex/status/1706287928249569638?s=20'>twitter.com</a> | <a href='https://reddit.com/r/selfhosted/comments/16sjlat/exciting_news_everyone_the_highly_anticipated/'>Reddit</a></caption>",
            "date_published": "2023-09-26T10:04:58+00:00",
            "authors": [
                {
                    "name": "fittingaccommodation",
                    "url": "https://www.reddit.com/user/fittingaccommodation"
                }
            ]
        },
        {
            "id": "16scf1x",
            "url": "/r/selfhosted/comments/16scf1x/selfhosting_life_hack_for_curated_photos_eg_for/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16scf1x/selfhosting_life_hack_for_curated_photos_eg_for/",
            "title": "Self-hosting life hack for curated photos (eg, for slideshows on TV)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16scf1x/selfhosting_life_hack_for_curated_photos_eg_for/'>Reddit</a></caption><div><br></div><div><p>I've long coveted the idea of adding a Photos library to Jellyfin or Kodi so I can use my TV as an oversized digital photo frame. But I don't want it to use my full photo library. I really don't need to see all my different outtakes and angles and all the times I took 35 pics of myself trying to get one that makes me more attractive than I really am and all the images that need to be rotated. So...what to do? Curating a collection would take forever!</p>\n<p>Well, recently I realised: I already curate quite regularly in Facebook albums and posts. There will be like 50-100 best-ofs for a trip or whatever. So, I used the album download option to get a bunch of those, and hey presto, a ready-made set of pre-curated slideshows. For about an hour's work I put together a usable library of 4,200 photos. Sweet!</p></div>",
            "date_published": "2023-09-26T03:10:52+00:00",
            "authors": [
                {
                    "name": "nurseynurseygander",
                    "url": "https://www.reddit.com/user/nurseynurseygander"
                }
            ]
        },
        {
            "id": "16s6kjt",
            "url": "/r/selfhosted/comments/16s6kjt/how_to_improve_and_secure_my_small_arr_setup/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16s6kjt/how_to_improve_and_secure_my_small_arr_setup/",
            "title": "How to improve and secure my small *arr setup",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16s6kjt/how_to_improve_and_secure_my_small_arr_setup/'>Reddit</a></caption><div><br></div><div><p>I currently have Overseerr-Sonarr-Radarr-Prowlarr-Plex setup. \nI'm exposing *arr to the internet using Nginx Proxy Manager and DuckDNS and Plex using it's built in settings. \nIt works well but I'm worried about security. </p>\n<p>How can I improve this? I'm trying to do this for as cheap as possible  and preferably not paying a monthly fee. \nI don't currently own a domain but willing to buy one</p>\n<p>Any other recommendations not related to security is also welcome</p>\n<p>I'm pretty new to the self hosted life, any advice would be appreciated!</p></div>",
            "date_published": "2023-09-25T22:47:57+00:00",
            "authors": [
                {
                    "name": "Blumingo",
                    "url": "https://www.reddit.com/user/Blumingo"
                }
            ]
        },
        {
            "id": "16si64g",
            "url": "/r/selfhosted/comments/16si64g/requesting_forum_software_reviews_from_longterm/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16si64g/requesting_forum_software_reviews_from_longterm/",
            "title": "Requesting forum software reviews from long-term users",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16si64g/requesting_forum_software_reviews_from_longterm/'>Reddit</a></caption><div><br></div><div><p>Hello,</p>\n<p>I'm looking for a forum software for a university department. Well, the university-bit is only important for long-term stability and ease of maintenance aka documentation, even once the bunch of us who initiate it graduate and move out. </p>\n<p>I'm going through a few ones, and have ended up with the following feature list:</p>\n<ul>\n<li>Long Term Stability</li>\n<li>Documentation</li>\n<li>Perhaps, exportability to other platforms too</li>\n<li>Suitability for open-ended discussions - not restricted to QnA style discussions</li>\n<li>User groups/roles</li>\n<li>Post grouping: I can think of two aspects about this - one is post categories independent of the users, and another is posts that are restricted by user groups</li>\n<li>WYSIWYG editor: the editor should be easy to use for people with non-tech backgrounds</li>\n<li>Linear conversations, but an option to choose between linear vs threaded conversations would be great!</li>\n</ul>\n<p>Discourse seems fairly popular, and seems to tick all the boxes. I also came across NodeBB, and some posts from 2014-era actually mention preferring NodeBB to Discourse. I, too, am liking NodeBB, but the documentation seems poorer than Discourse, and the release cycle seems a bit mysterious.  So, if anyone is a long-term user (5ish years or more) of NodeBB, I'd be happy to hear their experience! And if you have been a long-term user of other forum softwares that ticks the above boxes, I'd be happy to hear from them too!</p>\n<p>PS: Not sure if I missed something from the flairs of this subreddit, but forum softwares seem to be in existence since ancient times yet the flairs seem to be missing them.</p></div>",
            "date_published": "2023-09-26T08:42:08+00:00",
            "authors": [
                {
                    "name": "digikar",
                    "url": "https://www.reddit.com/user/digikar"
                }
            ]
        },
        {
            "id": "16sghng",
            "url": "/r/selfhosted/comments/16sghng/notification_when_server_is_down/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16sghng/notification_when_server_is_down/",
            "title": "Notification when server is down",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16sghng/notification_when_server_is_down/'>Reddit</a></caption><div><br></div><div><p>What is the best option for me to get notified when my homeserver shuts down (due to power outages or whatever)?</p>\n<p>Obviously adding my own homeserver to Uptime Kuma wont work since I run Uptime Kuma on the host itself.</p>\n<p>Happy to read some ideas!</p></div>",
            "date_published": "2023-09-26T06:54:14+00:00",
            "authors": [
                {
                    "name": "Full_Internal_3542",
                    "url": "https://www.reddit.com/user/Full_Internal_3542"
                }
            ]
        },
        {
            "id": "16rytrz",
            "url": "/r/selfhosted/comments/16rytrz/most_interesting_stuff_you_can_selfhost/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/16rytrz/most_interesting_stuff_you_can_selfhost/",
            "title": "Most interesting stuff you can selfhost?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/16rytrz/most_interesting_stuff_you_can_selfhost/'>Reddit</a></caption><div><br></div><div><p>So, I have a VPS server - paying for it for Session Messenger Group hosting. I have a lot of ram and memory free, so I'd like to install there something interesting. Though, I am not interested in hosting websites, emails, minecraft servers or etc. Do you have in mind something interesting, that I could host? :D  </p>\n<p>UPD: first of all looking for something funny/interesting than something useful, 'cause I won't be able to give proper security for the user</p></div>",
            "date_published": "2023-09-25T17:48:10+00:00",
            "authors": [
                {
                    "name": "IVKIK55",
                    "url": "https://www.reddit.com/user/IVKIK55"
                }
            ]
        },
        {
            "id": "16iqxby",
            "url": "/r/selfhosted/comments/16iqxby/plex_is_going_to_block_servers_on_certain_hosting/",
            "external_url": "https://www.reddit.com/gallery/16iqxby",
            "title": "Plex is going to block servers on certain hosting providers?",
            "content_html": "<caption>Open: <a href='https://www.reddit.com/gallery/16iqxby'>www.reddit.com</a> | <a href='https://reddit.com/r/selfhosted/comments/16iqxby/plex_is_going_to_block_servers_on_certain_hosting/'>Reddit</a></caption>",
            "date_published": "2023-09-14T19:06:46+00:00",
            "authors": [
                {
                    "name": "Illustrious_Pack_305",
                    "url": "https://www.reddit.com/user/Illustrious_Pack_305"
                }
            ]
        },
        {
            "id": "153p8u8",
            "url": "/r/selfhosted/comments/153p8u8/psa_interserver_seems_to_be_using_bots_to_promote/",
            "external_url": "https://i.redd.it/kdof3t8hwvcb1.png",
            "title": "PSA: InterServer seems to be using bots to promote their products on r/selfhosted",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/selfhosted/comments/153p8u8/psa_interserver_seems_to_be_using_bots_to_promote/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/kdof3t8hwvcb1.png\" />",
            "date_published": "2023-07-19T08:42:39+00:00",
            "authors": [
                {
                    "name": "QazCetelic",
                    "url": "https://www.reddit.com/user/QazCetelic"
                }
            ]
        },
        {
            "id": "14pdu0m",
            "url": "/r/selfhosted/comments/14pdu0m/introducing_crackpipe_your_decentralized/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/14pdu0m/introducing_crackpipe_your_decentralized/",
            "title": "Introducing Crackpipe - your decentralized, self-hosted gaming solution!",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/14pdu0m/introducing_crackpipe_your_decentralized/'>Reddit</a></caption><div><br></div><div><p>Hey folks,</p>\n<p>our team has worked tirelessly for a year to bring you Crackpipe, the open-source, decentralized, and liberal alternative to conventional cloud-based game platforms like Steam and Origin. We're thrilled to announce that Crackpipe is now available for everyone, and we're delighted to share it with the community as an open-source project.</p>\n<p>With Crackpipe, you and your friends can enjoy playing and tracking games on a shared file server, free from the restrictions of traditional platforms. Embracing \"alternatively obtained\" games, including DRM-free titles, Crackpipe offers a flexible and open approach to gaming - think Jellyfin, but for Videogames.</p>\n<p>Take full control of your gaming experience with Crackpipe's self-hosted approach. Explore your server's game collection, securely download, launch, and play games, and monitor your playtimes and progress - all even when the server is offline. Compare stats and play states with other users on the server for added fun.</p>\n<p>Our server features include automatic indexing of games, metadata enrichment with RAWG API, multi-user authentication, configurable logging, health monitoring, full-text search, filters, sorting, pagination, and a fully documented API. Crackpipe's high configurability ensures it fits your specific needs.</p>\n<p>Join us on this journey to embrace a more open, flexible, and enjoyable gaming experience for all. Try Crackpipe today and share your contributions, feedback, bug reports, and feature requests.</p>\n<p>Link: <a href=\"https://crackpipe.de/\">crackpipe.de</a></p>\n<p>You can also check out our launch at producthunt: <a href=\"https://www.producthunt.com/posts/crackpipe\">https://www.producthunt.com/posts/crackpipe</a></p>\n<p><strong>EDIT: Hey, let's take a breath, folks! We totally get your worries about the name. As mentioned before, it started as a fun joke and wasn't meant to go public. We're genuinely sorry if it has caused any distress, and we truly understand your personal situations. Your feedback is essential to us, so</strong> <a href=\"https://discord.gg/NEdNen2dSu\">head over to our Discord</a> <strong>and suggest fresh, creative names in the #new-name channel that fit the app's concept. Soon, we'll have a public poll on our blog where you can vote for your favorite name!</strong></p></div>",
            "date_published": "2023-07-03T09:09:28+00:00",
            "authors": [
                {
                    "name": "Alfagun74",
                    "url": "https://www.reddit.com/user/Alfagun74"
                }
            ]
        },
        {
            "id": "14njea1",
            "url": "/r/selfhosted/comments/14njea1/privacy/",
            "external_url": "https://i.redd.it/rea10mdpm99b1.jpg",
            "title": "Privacy",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/selfhosted/comments/14njea1/privacy/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/rea10mdpm99b1.jpg\" />",
            "date_published": "2023-07-01T02:35:32+00:00",
            "authors": [
                {
                    "name": "boiling_point_",
                    "url": "https://www.reddit.com/user/boiling_point_"
                }
            ]
        },
        {
            "id": "145ewl6",
            "url": "/r/selfhosted/comments/145ewl6/with_reddit_sunsetting_im_looking_back_to_rss/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/145ewl6/with_reddit_sunsetting_im_looking_back_to_rss/",
            "title": "With Reddit sunsetting, I'm looking back to RSS. What are the best current tools?",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/145ewl6/with_reddit_sunsetting_im_looking_back_to_rss/'>Reddit</a></caption><div><br></div><div><p>Because the ways I access reddit are being stripped away (3rd party apps, and probably old.reddit), I've been thinking about going back to RSS.<br />\nGoogle Reader and Yahoo Pipes no longer exist, so I'm searching for tools that present RSS feeds with a good UI, and also UI tools that can be used to craft and scrape RSS feeds.<br />\nDoes anybody have suggestions?</p></div>",
            "date_published": "2023-06-09T19:49:54+00:00",
            "authors": [
                {
                    "name": "Xuis",
                    "url": "https://www.reddit.com/user/Xuis"
                }
            ]
        },
        {
            "id": "144i3tz",
            "url": "/r/selfhosted/comments/144i3tz/how_should_i_configure_these_settings_for_porn/",
            "external_url": "https://i.redd.it/lan4nnudfu4b1.jpg",
            "title": "How should I configure these settings for porn forwarding?",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/selfhosted/comments/144i3tz/how_should_i_configure_these_settings_for_porn/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/lan4nnudfu4b1.jpg\" />",
            "date_published": "2023-06-08T19:11:14+00:00",
            "authors": [
                {
                    "name": "someone5133",
                    "url": "https://www.reddit.com/user/someone5133"
                }
            ]
        },
        {
            "id": "144gc15",
            "url": "/r/selfhosted/comments/144gc15/rselfhosted_will_be_going_dark_on_june_12th_to/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/144gc15/rselfhosted_will_be_going_dark_on_june_12th_to/",
            "title": "/r/SelfHosted will be going dark on June 12th to protest the Reddit API changes that will kill 3rd party apps.",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/144gc15/rselfhosted_will_be_going_dark_on_june_12th_to/'>Reddit</a></caption><div><br></div><div><h3>Hey /r/selfhosted.</h3>\n<p>Today, we want to discuss an urgent matter that affects both the moderators and users of reddit alike. As you may or may not have heard, a recent <a href=\"https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/\"><strong>Reddit policy change</strong></a> threatens to kill many beloved third-party mobile apps (<strong><a href=\"https://www.reddit.com/r/redditisfun/comments/13wxepd/rif_dev_here_reddits_api_changes_will_likely_kill/\">Reddit is Fun</a>, <a href=\"https://www.reddit.com/r/getnarwhal/comments/13wv038/reddit_have_quoted_the_apollo_devs_a_ridiculous/jmdqtyt/\">Narwhal</a>, <a href=\"https://www.reddit.com/r/baconreader/comments/13wveb2/reddit_api_changes_and_baconreader/\">BaconReader</a></strong>, and many more), making a various features not seen in the official mobile app permanently inaccessible to users. Starting on July 1st, Reddit has unilaterally decided to impose exorbitant charges on third-party app developers for utilizing their API. This includes the developer for <a href=\"https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/\"><strong>Apollo</strong></a>, being charged <a href=\"https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/\"><strong>1.7 million dollars per month</strong></a> for API requests.</p>\n<p>On June 12th, <a href=\"https://www.reddit.com/r/ModCoord/comments/1401qw5/incomplete_and_growing_list_of_participating/\"><strong>many subreddits</strong></a> will be <a href=\"https://www.reddit.com/r/ModCoord/comments/1412ee8/what_going_dark_means_going_private_is_discouraged/\"><strong>going dark</strong></a> in protest of this policy change. Some will return after 48 hours; others will go away permanently unless the issue is adequately addressed. </p>\n<p><strong>/r/selfhosted</strong> is planning on joining these subreddits in solidarity, requesting that Reddit revisit this policy change. 3rd party applications have been the lifeblood of Reddit for the past 10+ years and should be here in the future.</p>\n<p><strong>What can you do?</strong></p>\n<ol>\n<li><strong>Complain.</strong> Message the mods of /r/reddit.com, who are the admins of the site, and comment in relevant threads on /r/reddit, such as <a href=\"https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/\">this one</a>, leave a negative review on their official iOS or Android app- and sign your username in support.</li>\n<li><strong>Spread the word.</strong> Rabble-rouse on related subreddits. Meme it up, make it spicy.</li>\n<li><strong>Boycott</strong> and spread the word to Reddit's competition! Stay off Reddit entirely from June 12th through the 13th- instead, maybe touch some grass, call your grandma, or go install that new app you've been dying to try.</li>\n<li><strong>Don't be a jerk.</strong> As upsetting as this may be, threats, profanity, and vandalism will be worse than useless in getting people on our side. Please make every effort to be as restrained, polite, reasonable, and law-abiding as possible.</li>\n</ol>\n<h3>Here are some helpful links on the topic:</h3>\n<ul>\n<li><a href=\"https://www.reddit.com/r/reddit/comments/12qwagm/an_update_regarding_reddits_api/\">The official announcement from Reddit</a></li>\n<li><a href=\"https://www.reddit.com/r/ModCoord/comments/13xh1e7/an_open_letter_on_the_state_of_affairs_regarding/\">An Open Letter from /r/ModCoord</a></li>\n<li><a href=\"https://i.redd.it/zqptto18e34b1.jpg\">A helpful infographic on the topic</a></li>\n<li><a href=\"https://www.reddit.com/r/ModCoord/wiki/index\">A list of participating subreddits</a></li>\n<li><a href=\"https://www.theverge.com/2023/6/5/23749188/reddit-subreddit-private-protest-api-changes-apollo-charges\">The Verge article on the subject</a></li>\n</ul>\n<p><strong>Additional Info for /r/selfhosted</strong></p>\n<ul>\n<li>/r/datahoarder is orchestrating a joint effort in archiving Reddit. The irony in this is not lost on me. <ul>\n<li>see /u/joeyvanbeek 's <a href=\"https://www.reddit.com/r/selfhosted/comments/144gc15/rselfhosted_will_be_going_dark_on_june_12th_to/jnfe64l/\">comment below</a></li>\n<li>Working with <a href=\"https://wiki.archiveteam.org/\">ArchiveTeam</a></li>\n</ul>\n</li>\n</ul></div>",
            "date_published": "2023-06-08T18:02:31+00:00",
            "authors": [
                {
                    "name": "kmisterk",
                    "url": "https://www.reddit.com/user/kmisterk"
                }
            ]
        },
        {
            "id": "143diuj",
            "url": "/r/selfhosted/comments/143diuj/reddit_temporarily_ban_subreddit_and_user/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/143diuj/reddit_temporarily_ban_subreddit_and_user/",
            "title": "Reddit temporarily ban subreddit and user advertising rival self-hosted platform (Lemmy)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/143diuj/reddit_temporarily_ban_subreddit_and_user/'>Reddit</a></caption><div><br></div><div><p>Reddit user <a href=\"https://www.reddit.com/u/TheArstaInventor/\">/u/TheArstaInventor</a> was recently banned from Reddit, alongside a subreddit they created <a href=\"https://www.reddit.com/r/LemmyMigration/\">r/LemmyMigration</a> which was promoting Lemmy.   </p>\n<p>Lemmy is a self-hosted social link sharing and discussion platform, offering an alternative experience to Reddit. Considering recent issues with Reddit API changes, and the impending hemorrhage to Reddit's userbase, this is a sign they're panicking.</p>\n<p>The account and subreddit have since been reinstated, but this doesn't look good for Reddit.</p>\n<p><a href=\"https://www.videogamer.com/news/reddit-ban-subreddit-user-for-alternative-platforms/\">Full Story Here</a></p></div>",
            "date_published": "2023-06-07T13:36:47+00:00",
            "authors": [
                {
                    "name": "aDogWithoutABone",
                    "url": "https://www.reddit.com/user/aDogWithoutABone"
                }
            ]
        },
        {
            "id": "140op93",
            "url": "/r/selfhosted/comments/140op93/host_your_own_community_if_reddits_api_rules_go/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/140op93/host_your_own_community_if_reddits_api_rules_go/",
            "title": "Host your own community if Reddit's API rules go into effect",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/140op93/host_your_own_community_if_reddits_api_rules_go/'>Reddit</a></caption><div><br></div><div><p>Hi everyone, with the new API limitations possibly taking effect at the end of the month, I wanted to make a post about a self-hosted Reddit alternative, <a href=\"https://lemmy.ml\">Lemmy</a>.</p>\n<p>I'm very new to their community and want to give a very honest opinion of their platform for those who may not know about it.  I'm sure some of you have already heard about it, and I've seen posts of Lemmy(ers?) posting that everyone neeeeeeds to switch immediately.  I don't want to be one of those posters.</p>\n<h2>Why would we want an alternative?</h2>\n<p>I won't go into all of the details here, as there are now dozens of posts, but essentially Reddit is killing off 3rd party apps with extremely high pricing to access their data.  To most of us who have been with Reddit for years, this is just the latest in a long line of things Reddit has changed about the site to be more appealing to Wall Street.  I don't want to argue here if the sky is falling or if people should or shouldn't be leaving Reddit, I'm simply here showing an alternative I think has promise.</p>\n<p>Links if you do want to find out more of what's happening</p>\n<p><a href=\"https://www.reddit.com/r/apolloapp/comments/13ws4w3/had_a_call_with_reddit_to_discuss_pricing_bad/\">Apollo Developer explaining how it will effect his one app</a></p>\n<p><a href=\"https://www.reddit.com/r/ModCoord/comments/13xh1e7/an_open_letter_on_the_state_of_affairs_regarding/\">Mod post on how these changes will effect their communities</a></p>\n<p><a href=\"https://www.youtube.com/watch?v=Ypwgu1BpaO0\">Hour long interview with Apollo Dev for more detail</a></p>\n<h2>What is it?</h2>\n<p>Lemmy is a \"federated\" Reddit alternative.  Meaning there is no \"center\" server, servers interconnect to bring content to users.  If you use Mastadon, it's exactly like Mastadon.  I view it like Discord, where there are many servers (they call them instances) and inside those servers are different communities.  You can belong to a memes community on one server and another server.  The difference is these communities are in a Reddit forum format, and you pick your own home screen, meaning you can subscribe to communities from other servers.</p>\n<p>Long story short, you can subscribe to as many communities (subreddits) as you want from wherever you are.</p>\n<p>The downside is that it's confusing as hell to wrap your head around, and for most users it requires explaning.  The developers know this, Mastadon had to release a special wizard to help people join, and I think Lemmy will need to do something similar.</p>\n<p>So essentially, there are communities (analogous to subreddits) that live on instances (analogous to servers).  People can sign up for any instance they want, and subscribe not only communities on that instance, but any Lemmy instance.  To me, that's pretty neat, albeit complicated.</p>\n<h4>Pros so far:</h4>\n<ul>\n<li>The community is extremely nice so far, it feels like using Reddit back in the early 2010s.  No karma farming, cat pictures are actually just pictures of cats, memes are fun, people seem genuinely happy to be there</li>\n<li>Work is being done to improve it actively, new features are on the board and work is being done consistently</li>\n<li>Federated is a cool thing, there's no corporate governance to decide what is okay or not (more in cons)</li>\n<li>It's honestly the best alternative I've seen so far</li>\n</ul>\n<h4>Cons so far:</h4>\n<ul>\n<li>As mentioned it's confusing just getting started.  This is the number 1 complaint I read about it, and it is.  Sounds like the devs hear this and are challenging themselves to get an easier onboarding process up and running.</li>\n<li>The reason for this post, second biggest complaint, missing niche communities.  I'm hoping some people here help resolve this issue</li>\n<li>Not easy to share communities.  Once created, instance owners have to do quite a bit of evangelizing.  There's join-lemmy.org where if you have an instance, an icon, and a banner image it will start showing, but beyond that you have to post about your instance in relevant existing communities that you exist, and get people to join.</li>\n<li>It's very early.  The apps are pretty bare bones, it's in it's infancy.  I think it's growing though, and  I think this will change, but there's definitely been a few bugs I've had to deal with.</li>\n<li>Alt-right/Alt-left instances.  Downside of being federated, anyone can create an instance.  There are already some fringe communities.  You do have power to block them from your instance though, but they're offputting when you first get there, it takes a bit to subscribe to communities and block out the ones that are... out there.</li>\n</ul>\n<h2>Sure, but how does SelfHosted come in?</h2>\n<p>Since Lemmy is \"federated\", these instances come from separate servers.  One thing I see about Lemmy right now is that there are a lot of \"general\" instances, each with a memes community, a movies, music, whatever, but there aren't a lot of the specific communities that brought people to Reddit.  Woodworking, Trees, Art, those niche communities we all love are missing because there is not a critical mass of people.</p>\n<p>This is where selfhosting comes in.  Those communities don't fit well on other instances because those instances are busy managing their own communities.  For example, there are several gaming communities, but there are no specific communities for specific games.  No Call of Duty, no Mass Effect, no Witcher, etc.  Someone could run an RPG specific instance and run a bunch of specific RPG communities.  Same with any other genre.</p>\n<p>This is where I see Lemmy headed, most people join the larger instances, but then bring in communities they care about.</p>\n<h2>What's it like running an instance?</h2>\n<p>Right now most communities there are very tiny, my personal instance has about 10 people on it.  That is quite different from the subreddit alternative, but I see that as a positive personally.  I'm hoping to grow my fledgling community into something neat.</p>\n<p>If the hammer falls I see a mild migration to Lemmy.  I don't think it'll be like the Digg migration, but I think there could be many users who give up on Reddit and I want them to have a stable landing place.  Communities I've come to love I want to be able to say \"Hey, I'm over here now, you're welcome to join me.\"  </p>\n<p>There are several million 3rd party app users who access Reddit through 3rd party apps.  If only 10% of them decide to switch to an alternative once they are no longer able to access Reddit, that means a couple hundred thousand people will be looking for new homes.  I think we have an opportunity to provide them.</p>\n<p>I'm coming up on character limit, so if anyone is interested - the only requirements are a domain name and a host.  Everything is dockerized, and I'm happy to share my docker compose with anyone.  I followed the guide <a href=\"https://join-lemmy.org/docs/en/administration/install_docker.html\">here</a> but there were a lot of bumps and bruises along the way.  I'm happy to share what I learned.</p>\n<p>Anyway, thanks for reading all this way.  I recognize this may not be for everyone, but if you ever wanted to run your own community, now is your chance!</p>\n<p><a href=\"https://github.com/LemmyNet/lemmy\">GitHub Project</a></p>\n<p><a href=\"https://join-lemmy.org/docs/en/administration/install_docker.html\">Installation Guide</a></p>\n<p>Edit: Lots of formatting</p></div>",
            "date_published": "2023-06-04T20:08:47+00:00",
            "authors": [
                {
                    "name": "HorseRadish98",
                    "url": "https://www.reddit.com/user/HorseRadish98"
                }
            ]
        },
        {
            "id": "13zgke9",
            "url": "/r/selfhosted/comments/13zgke9/on_june_12th_several_subreddits_are_protesting/",
            "external_url": "/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps/",
            "title": "On June 12th, several subreddits are protesting against the new Reddit API pricing and its implications for 3rd-party clients. Will /r/selfhosted join the strike?",
            "content_html": "<caption>Open: <a href='/r/Save3rdPartyApps/comments/13yh0jf/dont_let_reddit_kill_3rd_party_apps/'></a> | <a href='https://reddit.com/r/selfhosted/comments/13zgke9/on_june_12th_several_subreddits_are_protesting/'>Reddit</a></caption>",
            "date_published": "2023-06-03T15:41:10+00:00",
            "authors": [
                {
                    "name": "andreipoe",
                    "url": "https://www.reddit.com/user/andreipoe"
                }
            ]
        },
        {
            "id": "13xcm9a",
            "url": "/r/selfhosted/comments/13xcm9a/devops_course_for_selfhosters_docker_gitlab_cicd/",
            "external_url": "https://www.reddit.com/r/selfhosted/comments/13xcm9a/devops_course_for_selfhosters_docker_gitlab_cicd/",
            "title": "DevOps course for self-hosters (Docker, GitLab, CI/CD, etc.)",
            "content_html": "<caption>Open: <a href='https://reddit.com/r/selfhosted/comments/13xcm9a/devops_course_for_selfhosters_docker_gitlab_cicd/'>Reddit</a></caption><div><br></div><div><p>Hello everyone,</p>\n<p>I've made a DevOps course covering a lot of different technologies and applications, aimed at startups, small companies and individuals who want to self-host their infrastructure.\nTo get this out of the way - this course doesn't cover Kubernetes or similar - I'm of the opinion that for startups, small companies, and especially individuals, you probably don't need Kubernetes. Unless you have a whole DevOps team, it usually brings more problems than benefits, and unnecessary infrastructure bills buried a lot of startups before they got anywhere.</p>\n<p>As for prerequisites, you can't be a complete beginner in the world of computers. If you've never even heard of Docker, if you don't know at least something about DNS, or if you don't have any experience with Linux, this course is probably not for you. That being said, I do explain the basics too, but probably not in enough detail for a complete beginner.</p>\n<p>Here's a 100% OFF coupon if you want to check it out:</p>\n<p>~~https://www.udemy.com/course/real-world-devops-project-from-start-to-finish/?couponCode=FREEDEVOPS2306JEOZX~~</p>\n<p>Edit: All gone! Check back next month.</p>\n<p>Be sure to BUY the course for $0, and not sign up for Udemy's subscription plan. The Subscription plan is selected by default, but you want the BUY checkbox. If you see a price other than $0, chances are that all coupons have been used already.\nYou can try manually entering the coupon code because Udemy sometimes messes with the link.</p>\n<p>The accompanying files for the course are at https://github.com/predmijat/realworlddevopscourse</p>\n<p>I encourage you to watch \"free preview\" videos to get the sense of what will be covered, but here's the gist:</p>\n<p>The goal of the course is to create an easily deployable and reproducible server which will have \"everything\" a startup or a small company will need - VPN, mail, Git, CI/CD, messaging, hosting websites and services, sharing files, calendar, etc. It can also be useful to individuals who want to self-host all of those - I ditched Google 99.9% and other than that being a good feeling, I'm not worried that some AI bug will lock my account with no one to talk to about resolving the issue.</p>\n<p>Considering that it covers a wide variety of topics, it doesn't go in depth in any of those. Think of it as going down a highway towards the end destination, but on the way there I show you all the junctions where I think it's useful to do more research on the subject.</p>\n<p>We'll deploy services inside Docker and LXC (Linux Containers). Those will include a mail server (iRedMail), Zulip (Slack and Microsoft Teams alternative), GitLab (with GitLab Runner and CI/CD), Nextcloud (file sharing, calendar, contacts, etc.), checkmk (monitoring solution), Pi-hole (ad blocking on DNS level), Traefik with Docker and file providers (a single HTTP/S entry point with automatic routing and TLS certificates).</p>\n<p>We'll set up WireGuard, a modern and fast VPN solution for secure access to VPS' internal network, and I'll also show you how to get a wildcard TLS certificate with certbot and DNS provider.</p>\n<p>To wrap it all up, we'll write a simple Python application that will compare a list of the desired backups with the list of finished backups, and send a result to a Zulip stream. We'll write the application, do a 'git push' to GitLab which will trigger a CI/CD pipeline that will build a Docker image, push it to a private registry, and then, with the help of the GitLab runner, run it on the VPS and post a result to a Zulip stream with a webhook.</p>\n<p>When done, you'll be equipped to add additional services suited for your needs.</p>\n<p>If this doesn't appeal to you, please leave the coupon for the next guy :)</p>\n<p>I hope that you'll find it useful!</p>\n<p>Happy learning,\nPredrag</p></div>",
            "date_published": "2023-06-01T09:08:33+00:00",
            "authors": [
                {
                    "name": "predmijat",
                    "url": "https://www.reddit.com/user/predmijat"
                }
            ]
        },
        {
            "id": "13whd7w",
            "url": "/r/selfhosted/comments/13whd7w/a_quick_tui_dash_for_monitoring_traffic_and_stats/",
            "external_url": "https://i.redd.it/ba9uztjcg63b1.jpg",
            "title": "A quick TUI dash for monitoring traffic and stats from your AdGuard Home instance",
            "content_html": "<caption>Open: <a href=\"https://reddit.com/r/selfhosted/comments/13whd7w/a_quick_tui_dash_for_monitoring_traffic_and_stats/\">Reddit</a></caption><div><br></div><img src=\"https://i.redd.it/ba9uztjcg63b1.jpg\" />",
            "date_published": "2023-05-31T09:30:39+00:00",
            "authors": [
                {
                    "name": "lissy93",
                    "url": "https://www.reddit.com/user/lissy93"
                }
            ]
        }
    ]
}